{"l.filip.ll": "Greta always looking behind for oppz", "ari_m_safari": "I needed this today. Thank you for your difference. This allows others the courage too.", "leobellaholding": "@_.bxllaaa._ @leo_the_full_meleo", "myrascotttextiles": "😭", "shahhussain446872": "Good nice best", "mkhabiye": "@lasangaaa", "ron.m.miller": "€*", "batantaadivinghomestay": "I ll wait for you in papua raja ampat. The last paradise", "jana.x.brodi": "@n.i.n.a_xly", "_.mir.doch.egal._": "@nickucharz kennst du noch Disneys Große Pause, da gab's so n Streber... Sieh zwei Mal hin", "nickucharz": "Oh Gott 😂😂😂 , Hieß der nich Wendel ? 😦", "i.create.miracles": "Crystal child. ♡ You speak the truth as you see it. That's called honesty, transparency, and authenticity. 🦄🦄🦄", "mary_chatzigeorgiou": "🙌🙌🙌🙌🙌you are a true inspiration", "paolo_d_d": "Ma buttati a mare scarto", "pedrommouram": "@helenasmoura", "die__tim": "YoU aRe NoT bEaUtIfUl🤫", "kevins2804": "🤢🤢you ugly bitch", "nuelle_beads": "You’re beautiful the way you are..... the most intelligent girl I’ve heard of this year.... incredible activist. 😘", "cristal.ny": "@lucasdtolentino uma crianca ...", "mindfulsoulcompany": "🧡", "nastaranmirsharifi": "💛U", "lutz_eg": "Ehhhh", "igorzay95": "🤢🤢🤢🤢🤢", "anna_bellavia": "You’re just GREaT! 🌺", "paaatricks_mlk": "How Dare you", "celina_61203": "Muhahaha", "sleepypanda17_": "For those of you saying negative things about Asperger’s, you need to stop. Stop talking about it in that matter as if you’re the one experiencing it and telling her what to think about her difference", "jay_tomlinson15": "@lucas.wignall", "rlstern1958": "Help other students gain superpowers! http://www.chicagonow.com/academic-inklings", "kiketenor": "U go on a boat, paid by the private business there...", "ambergiffen": "Is it true that the crew and boat had to be flown back?! 😧", "orange_1212": "You have otisim", "bonavieee": "Love this post greta and your precious smile. #girlpower", "zrdl7777777": "That bote contaminates more than an airplane ✈️ you are hypocrite 💩", "briana_meara": "You are beautiful inside and out! We need more Gretas in this world. 🌎", "stromberg.karl": "Ute på havet!", "lacqueredu.p": "Good for you babe! Keep on shining!Your voice holds great power to those who are interested in learning about the many things destroying our world! And what we can do to better it, and save our world! 😓", "kaylainfernoart": "Beautifully said ⚡️🖤⚡️", "vanessafalk\nVerified": "Verified", "julesanne__19": "❤️❤️❤️❤️", "florence_walsh": "❤❤❤", "evachuko": "🔥", "ryan25ritaa": "👎👎👎👎👎", "dixx.do.chinaa": "🔥", "wu.tang.mariee": "Schöne Skyline", "melinasurfergirl": "👍😙", "quinlarkin": "That boat can affect climate change", "gogoespanon": "💖", "secretladysweetness": "🌊⛑👀🥽🐚🇸🇪💋👁", "x_let_the_ocean_take_me_x": "Blah blah blah being different is not a fucking super power. It’s a curse.", "casch112": "😍", "mccormickmakes_art": "I love your superpowers ❤️", "got_germany": "Yes!!! JAAAAAAAAAAA!!!🔥❤️🙌💕", "zakry0": "It's seen as an illness because it is", "mrjcek": "You are not saving the world by this is it clear", "maddiieng": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kingperformance": "@henno140 Sie mag deine Burbles von @protuningfreaks", "xvr_197": "Furunkel", "sirvietzzzz": "Ok.... Ora raccontaci dei 4 skipper che ti hanno accompagnata con la barca a vela per le emissioni degli aerei, e che poi sono dovuti comunque tornare in aereo????.. Sei inutile santo dio", "il_vostro_kebabbaro_dank_": "Ma che cazzo ridi che sei obbligata dai tuoi a dire ste cose per il clima", "blaisebennefield": "Boats are bad for the environment", "johannlodewyk": "Words of wisdom.", "millydwt": "❤️❤️❤️❤️🙏🙏🙏", "concettadavison": "You are such an inspiration to so many!!! Including me!!! Bravo👏👏👏👏 keep up the amazing work!!! #changetheworldgreta 💪🙌🌱😍", "adrianmendoza651": "Your smile is Beautifull", "kai_enderle": "Ur fit", "lukas.fr3": "Sorry, but that Suit is Made out of plastic, isnt it", "piroclarisa": "I'm so proud of you! You have two very important days in your whole life. The day you were born and the day you discover for what. Congratulations. You've just already lived both.", "luisajara.fonseca": "VIVA a diferença!! 😊", "jaylenrmanuel": "Dude shut the fuck up no body cares dumbass", "fannyleilaring": "💯🌟", "fake.bri.lamouchi": "‘Asperger’s syndrome basically means, I- I’m better than you’ -Robert White", "pewdiepie_ikonik_owu": "Your Swedish", "_gabbyy13_": "My everything💜💜😄😄", "thelumineers_fan": "Awh poor you 😢 not 😂", "girls_on_fire_leaders": "@noellajewel", "jjtow007": "Thank you for sharing, and I think we are all glad you found your calling!!", "friedaliebtdasschoene": "You are tough and wonderful! ♥️😊", "stelo_77": "❤️❤️❤️", "johanna_hennberg": "Du är verkligen förebilden jag hade behövt se när jag gick i högstadiet, och inte ens visste att jag hade Aspergers. Sjukt stort tack för allt du gör för oss, bara genom att finnas.🏆 Och behöver du stöttning själv någon gång så finns vi här för dig. ❤️ We've got your back!", "love.is.my.super.power": "You are an inspiration! Both my dad and brother have Aspergers and they are the most beautiful, caring, honest incredible human beings I know! They constantly teach me new ways of looking at the world and have such brilliant minds! It’s a strength!!!", "annies_olivetree": "@1tinechris 💞", "im_derrik": "Ridi ridi", "finn_10.07": "@fieln.sgam", "katerina_tyrikos_": "Shutting the fuck up is a superpower to but I sadly don’t think u have that", "fieln.sgam": "Wow", "da.aafi": "Zähne strahlen eh braucht man für die Zukunft keine Sonne mehr @eylenx @badgaldiddi", "benjamin_perer": "Nah mate, we've got plenty more place to go, we just can't be bothered messing with you", "__kenocarroll": "Tell 'em, girl!!!🙌🔥", "erica.the.quarantined.potato": "You are so amazing we love you❤️", "scarly_1917": "We’re studying your speeches at my school, I think you’re such an inspirational girl and you’ve a heart worth 100000000000000 trees", "dobrovvalya": "Geniya", "greenthumbgardawner": "Oh honey, you are a marvel to be retakened with. You inspire me to teach my children more. Keep doing what you’re doing. Jealously is an evil that will always exist. Remember the world is literally watching you and most of them are in awe.", "roraxox": "You are a true hero 💜", "rishabkalluri": "fuck u", "patres17": "@nikkwhi tu citaj more", "_jacob.boudreau_": "yeah they’re prolly better looking if they do😂😂", "bewegingsblijheid.nl": "Thank you for being you🙏 Our world needs people like you and tons of more who stand out and stand up 🙏😇💝💫 Angel on earth 🌏🔥💞", "elijah_nickels89": "nu mai fi negru", "ssabrinasiddiqui": "actual badass", "mona______r": "❤️👏🏼", "da_wimmag": "🤮", "eli_andjeo": "Engel göttin sollte ein Statue errichtet werden oder Bilder oder History Buch erwähnt werden oder im New York im Boden work of Fame erwähnt werden.", "mattagent_photographer_": "People care about you young lady not the political pawn ♟ that’s coming out of all this now. I wish you could speak to Dr Michael Carr Gregg about this entire situation. Many beg your parents 🙏🏼🙏🏼🙏🏼", "thilofritzsche.tf": "Solltest Du verzogene Pappnase nicht lieber in der Schule sein? ! Geh dahin zurück wo Du her gekommen bist!", "biagardinali": "@cleliamello essa menina me dá medo", "theforgottenrecipes": "Proud on you!", "shannonlouisepatrick": "❤️❤️❤️❤️", "poetryflowsthrough": "You’re beautiful inside and out. A deep soul unfortunately swimming in greed and superficiality. Our world will make it. ♥️🌺", "tresspuntospeligros": "Well said👌", "foster_2204": "Idiot", "_.lisaaa": "@bea_scha @zoehammerer", "ramonanibalmateo": "Yo voy para Suecia 🇸🇪 😘😜", "muzik_monk": "Am just beginning to like everything about you. You inspires me with your speech alot", "epiletiz": "Yesss!💚💚💚", "lauraafalkenstern": "@verxnika.krt", "curiousmisswolf": "It means you're a little rat bag and people are catching on. Go learn some more scripts you lying little twat", "tita.solari": "👏👏👏👏👏👏👏👏", "lemon.____.boi": "She kinda cute doe 😳", "jamie_murphy2": "👏 You are making a difference! Stay True!👏", "elizabethhepolaroth": "Powerful message for all ages. ❤️", "ellieakers97": "You are a super woman!!!🔥💗", "ellimacjackson": "Jar elskar dig ❤️", "deniz_ucar": "You are in our hearts. We love you so much 💕 and, we are thankful for all your act 🙏", "paradigma8189": "👍🐬😊❤️❤️❤️❤️❤️", "jonnaevelina": "❤️With or without this syndrome you are a bit different from the norm and only in the most positive way 😍🙌❤️ keep on doing you girl, we are here with you❤️", "biancajasmine": "You inspire me so much! Thank you for your strong, powerful words!", "sandro_lichtenwoerther": "@mteusl", "nikolasstankovic69": "Shut up climate change is normal everyone is just a fucking drone", "antonic_ivan": "🐒🐒🐒🐒🐒🦍", "stephchabros": "❤️", "viksamp": "You’re stunning! Inside and out 😍", "stamiris79": "🙌🙌🙌", "ashk.ash": "You are amazing", "kidnapped_memez": "I don’t hate you, I hate you’re believe in global warming", "lydiahessdesign": "you are an incredible human. Thank you.", "oguzhanbuyukeken70": "Şu dişlerini Bi fırçala", "masonharperzoey": "I was hoping to interest you about the potentially highly lucrative business opportunity becoming Forex trader & Bitcoin mining can offer you. Dm for more info.", "daisymae_piggy": "YAAASSSS!!!! 💛👍🏻👍🏻👍🏻", "rajakallioelias": "Vittuku te swedut ette ymmärä saatana mistää mitää vingutte jostai ilmastosta saatanan pelle🤬🖕🖕🖕🖕🖕🖕🖕", "urbanova.e_": "How dare you?", "hsueueysyshwheys": "⚘👯‍♀️💋🙃", "ferko_cz": "🤢🤢🤢", "rian.phantom": "Sorry mit Insta fame", "thejaymsters": "Most people don’t go after looks, we just know whatever your saying is crock. We know that whatever you say has very little value, because unlike us you didn’t finish high school.", "_svenwehrle_": "Beim adolf hätte sie sowas vergast", "piergiorgioardito": "@dear3go adesso ci credi?", "zayitoo": "💙 you are great!!!!", "leo.lxxnr": "Auf der Einengung Seite ist es ja gut was sie macht aber auf der anderen seite würde ich mir mehr Respekt den Bauern gegenüber wünschen weil das ist nicht anzusehen wie die Bauern heruntergezogen werden mit Auflagen um Auflagen es mussten schon so viele kleine bauern aufhörten das ist einfach nur schade und scheiße", "corey.jones_146": "Sssshhhh ur a child u think u can say that because everyone at ur school thinks ur poupular and u got a big crowd chill out plz", "hnowhale": "@gretathunberg 💐🤗", "trish725": "@crosssam 💕", "lazyleaf_": "@greeneyedgoofball omg Greta had an ED she said I KEEP LOVING HER MORE", "capbartsch": "Never let yourself be discouraged by those who ridicule you, by those who spit at you, by those who accuse you of being bad , by those who do not understand you but believe to know it all or those who are unhappy with their own life and hope to feel better by attacking you while hiding behind their screens.♟ Sometimes you might feel lonely, disappointed, discredited, defamed or worse. Among the vast population of this planet there are plenty of people who do not join the ranks of haters.🗺 Aspergers is not an illness but a different mental program that focuses on other core areas. 🧩 Therefore history has proven that people with Asperger have saved this planet from pain. In WW2 people with such talent we’re used by the military intelligence to crack enemy codes, which saved many lives in the field.  Now it’s time for a more sensible challenge: save the planet.  Make use of your talents!⛵️", "susanna_and_patch": "I really hate it when people say that having Asperger's/autism is a superpower when it makes life incredibly difficult for many people. I hear it all the time and really don't agree. I have Asperger's and could never, ever go on one of those strikes/ be in a crowd/travel around the world, make speeches in front of millions of people or to be honest do much at all outside of my routine because of it. For me and many other people having Asperger's is just really hard and not a positive thing. Seeing the world differently and having a lot of struggles around humans isn't something I think is exactly positive- for me it makes life a lot harder. I'm glad that some people with Asperger's like Greta feel differently though but it really isn't a positive for everyone.😔", "marinmeadd": "No I’m still winning", "kmdavis333": "I suffer from at times crippling social anxiety. You are truly an inspiration and I'm so grateful you are fighting for us. You are a beautiful human being. Thank you", "i_am_stitchy_sid": "Respect💗", "ajpopulo": "👏👏👏👏🤗 Love from Portugal 🇵🇹 you're truly amazing", "francisca_psycho": "Bum!! 🖤", "blue_water_2018": "@gretathunberg you are absolutely gorgeous. But most importantly you are so powerful. I have tears in my eyes whenever i listen to your speeches. God bless you and your cause. 🙏🙏❤️❤️", "teabirdyyy": "❤️🙌 You are a superhero, Greta", "maeveodriscoll": "@ashford_ 😥", "feli.6512924": "Geht aufs Parkett, nicht auf die Straße. Geht in den Würfel, nicht in die Offensive. Wenn ihr basierend auf Tatsachen handelt, kann euch auch keiner das Wort nehmen. Informiert euch über euer Thema. Aber bitte, geht nicht mit Halbwissen auf die Straße, die Politiker haben euch schon bemerkt. Verschwendet nicht die Schulzeit, die eure Zukunft sichert. Und ja, diese Zukunft gibt es, egal ob man sich um das Klima kümmert oder nicht. Ob sie dann noch so rosig ausfällt, ist die andere Geschichte. Informiert euch, geht in die Jugend-Parteien, dort habt ihr auch einen gesicherten Kontakt zu den Politikern. Wenn ihr vor denen auftretet, mit Informationen und vielen möglichen Lösungen parat, dann bekommt ihr auch ein Ohr und Anerkennung. Und dann wird sich auch garantiert etwas im Plenarsaal regen. Geht wählen, überzeugt euch, schaut euch die Parteiziele und deren Realisierungsmöglichkeiten an. Wählt die Partei, die euch entspricht, lasst euch nicht von Rechts- oder Linksdruck beeinflussen. Eure Meinung ist die, die zählt. Eure Meinung ist das, was aus eurer Sicht passieren muss. Deshalb, informiert euch gründlich, und wählt dann. Dies ist eine neutrale Aussage.", "luriv2005": "Just follow your heart because you have a big one ❤️ love you", "truth_lion_": "No haters just hate what you are doing. Go back to school and leave us alone thanks", "katcockerham": "You are amazing! Keep it up girl and I will fight from my side of the World!", "lunedavoine": "You are a gem, Greta. 💜", "fantgre_": "Brava!", "christiancapoluongo_03": "Faccia da cazzo hai fatto i soldi rimortaci tua è de quelli che nn te lo anno detto in tv", "way_way03": "This girl is so fake 😂", "imolared2_f80": "@m3.f80.lci2 @visar.m4 @whitebeastm4 @titansilver_m3", "judaht.3": "🤡🤡🤡🤡", "sjalvskadad": "Du skolkar som karriär alltså", "exoticgreekgirl": "So brave young keep up the good work! God bless you! You are the future ❤️", "casadoconpescado": "✨ go on superpower girl 🤸‍♂️", "drdianasemjonov": "You are an inspiration to all ✨", "lisayourbitch": "Ville bara hälsa att du har Jätteaspigt beteende hej", "jorgemedinasc": "pura pedofrastia pura manipulacion", "beforeswiftgetsleft": "You are so beautiful 💙", "rozezout": "Beautiful in + out - truly inspiring gorgeous human being 🙏", "rebecarrera": "You are more than perfect", "elisa_parmont": "💙💙💙", "silviacalaamaya": "@jjuanpablosuarez Lee el caption.", "iggydiamonds": "It was just waiting while you were getting supercharged! 🤩💫✨♥️✨🌟✨♥️✨", "hannacgarcia": "You are so beautiful ❤️", "jokonoff": "Piece of capitalism media shit", "distorted.radiance": "We stan a proud aspie !!!", "gregoryjamesmcgovern": "sail to China and rant at them.", "bthiemephotography": "Love your wisdom!!!", "fandomaine": "YOU gonna be a beautiful woman when you grow up🖤 being different is not only a superpower being different is beautiful 🖤🌌", "mp_marzagao": "The haters love u", "fede__madrid": "You’re brave and should continue like this. You’re empowering young and adult people. Disease is a tag. Your superpower is more powerful than it", "russianbot.89": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "helloa_alcantra": "😍", "gabrielsousa.png": "💪💪💪 supergirl", "herzog88": "I'm just trying to figure out how that neoprene life vest magically transforms in something good for the planet you little hypocrite.", "thetalkalotgirl": "BEAUTIFUL🙌🏾🙌🏾🙌🏾", "xirommt": "Fuck you", "jennamatkowski": "Same girl same 💕💕💕😇", "marinakdonahue": "So inspiring you bring tears to my eyes. You GO girl. A real life WONDER WOMAN! I love your super powers!", "rare_shibe": "❤️❤️❤️", "lady_jay_c": "@gretathunberg You are an incredible human being. Thank you for being you. 💕💕💕", "jonah_moncrief12": "Ugly ass", "inkedtaurus": "You are a blessing 💜", "trillvirgo": "you're a queen baby! a real life super hero ♥️🙏🏼", "sunkissed.traveler": "You are an amazing being on this planet. The world needs you! Keep doing your work, YOU are bringing a wave of change. 🙌🏽 Thank you for sharing personal details about your life.", "theandrewserling": "Hi Greta I have autism as well I love what you’re doing keep up the great work", "emma._.rosa_": "ur so fake greta! even my laugh while crying sounds more real than YOU!", "butwhosfranzi": "@albertlynnn 🥰😍", "thetreeswe": "💖Hejja dej 💖", "frejaeva": "❤️❤️❤️❤️", "dreaminxy17": "You’re a beautiful person, inside and out. Thank you for being so inspiring 💜💜", "pau_cay": "You’re amazing and a total inspiration 🙌🏻😭😭😭", "domenico_scola": "I tempi belli,quando sorridevi", "mattiamazzon_vr": "Insulsa", "mjcarmenr": "Keep shining and inspiring the world 💕❤️❤️❤️", "butchbruv": "@alxbrown_", "escobar01": "Retardada q fala?! Kkkk", "bradxcv": "The best. An inspiration Greta, your family too. What support you have , such a strong human being. So much respect.", "joanne_jastatt": "YOU ARE amazing and so needed in the world right now. We're so fortunate to have your energy, your voice and your crystal clear vision.", "upliftinginspirationaldesigns": "Don’t let the haters or anything or anyone stop you from doing what you want to in life 💜🙌", "paulo_ruan2": "How dare you", "siwanator_marty": "So cute", "itsemmabean": "Girl, you are a complete and total badass 💪🏼🔥", "thelittleflowersoapco": "You’re beautiful", "angelinaecasey": "you are beautiful don’t u worry girl 💕💕", "michy_poo": "❤️❤️", "tigerandtaptoe": "You are amazing!!! An inspiration to young and old 👏👏👏👏👏", "nadinepetry13": "Beautiful words!!! ❤️", "b.me_33": "💙💙💙💛💛💛✨", "patrickfurlotti": "Wow what a nice trip", "vagary_kalon": "❤️💜🙏🏻", "amywbanks": "😍💖💖", "09875.__e": "Ur just an anoying kid", "hulyaabaci": "👏👏👏👏🙏", "zlembo": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "ekoart6369": "Thank you! My 6 year old has Aspergers and is currently struggling in school. You give me hope ❤️", "msjonesathome": "You look happy! I love this pic beautiful girl. Thankyou for all that you do for us. Right with you ☺️❤️", "eldodyfiseha": "❤️❤️❤️", "dvori.len.tak.s.chlebikom": "Zlatan Ibrahimovič", "golzarrivara": "🙏🙏🙏", "johannapancia": "Härligt att höra Greta!! Kör på bara! Heja heja!❤️", "lorenzo_ziggiotti": "Buttati", "peaceandlovekls": "You are a superpower young lady! I’m so in awe of you and the knowledge, strength and determination you have! Such a role model for others! Much love and support from the 🇺🇸.", "mettgesicht_2.0": "😍", "0liverien0": "You are amazing 💛", "lalaapop": "🙌🏼🙌🏼🙌🏼", "earthly.beauty": "@trillville3227 what I was talking about yesterday", "bloominglala": "Bravo Greta. You are brilliant!", "sandra_gdeh": "❤️", "vm_024": "🙌🙌🙌 perfectly said!", "theman_himslef": "Asperger's syndrome is an illness. I say this as an aspie. It is not a superpower... I don't like people trying to get over their flaws by claiming them to be advantages. I prefer those who get over their flaws by accepting them and bringing out their strengths.", "rafaelrezendehistoria": "Receba meu abraço e respeito!", "marina.e.myart": "Du ger oss hopp, och när vi känner hopp, då får vi kraft att agera, ung som gammal. Tack Greta❤️❤️❤️", "cucinanina": "You are a God send! Keep up the phenomenal work!", "dnadeau62": "I so admire you for your determination and strength. When I was 16, 41 years ago, I was active in the fight against nuclear power ( no nukes is good nukes ) but never to this degree. That is probably why they exist today. Keep up the good work. More if us than you even realize are on your side and hopefully the right side of history. #climatechangeisreal #yougogirl #americaisignorant", "runjaysned": "You go girl!!! And amen. From a 🇨🇦 Autistic runner. Thank you!! 💙💙💙", "carolcasalrey": "@tiagovaralli ❤️ she is an amazing girl", "vivianmontezuma": "@gretathunberg Ya quisiéramos muchos tener la fuerza y determinación que tu tienes para defender una causa noble, eres genial y quien te crítica por aspectos diferentes a tus convicciones sobre el clima, no son más que ignorantes y desconsiderados", "danipaoleschi": "👍 I’m with you Greta ❤️", "diegopiekarski": "Greta ask Macron about the gold stolen in the Amazon through NGOs, real dreams being stolen? Do you have a mental problem, or are you very hypocritical? While the press and the supposed intellectuals of the world believe that a 16-year-old Greta can rule the world without study, without experience, without proving herself in life, we are in fact facing a social catastrophe.", "cvmpv": "😂😂😂😂😂😂", "steven.bresolin": "Copate", "rick_mx_146": "Bitch", "justin.koalabear": "Polyester?", "e_awesomazing": "❤️", "hanna.larssoon": "Båten är av plast", "karleusastar\nVerified": "Verified", "rbohegarty": "Igniting your soul 💕", "seabra.rita": "És linda! Agradeço e envio energia positiva para continuares o teu caminho e luta que é de todos nós. Muito grata🙏", "brucieb18": "Greta, you are a superpower and a very special young lady to take on the world at 16. Thank you for all your hard work, but please look after yourself. The stress must be phenomenal.", "mikaylajadex": "❤️❤️❤️❤️", "manuela_b_simply_me": "Stand proud Greta! You found your meaning and it’s given you a voice, a reason and strength to speak loud and proud!", "kimmy.christine": "More power to you being different. 👊", "alexandra_iancovici": "Keep shining bright you beautiful 🌟", "amystu111": "@abbywildman", "merli36laura": "Suecia 🇸🇪", "_sea_horse1966": "You are a priceless blessing!!!🤗😍", "naosoulou": "@teommp", "npf_liv": "Är skrämmande att vuxna människor kan bete sig så illa. Lyssna inte på elaka kommentarer, de är bara avundsjuka ❤️", "chadwaterhouse": "You are an incredible young lady. You’re bravery is shocking! Keep on keeping on! ❤️", "leticia_moura_28": "♥️", "flygirl320330": "You are such an amazing person who touched so many people with your emotions in your speech in UN, I think finally people who were ignoring the facts sitting on their sofas started thinking. Haters hate everyone but can't ignore what You started. You are a role model to everyone and we should all really start making more effort to save what can be saved.", "helendegenerous_": "Amen 🙏💓", "adrianarmpinheiro": "👏👏👏❤️", "ti_mo_th_y_": "you are the hater, greta", "pittie_pattie_": "You are brilliant and compassionate! I thank your parents for sharing you with us!!!! Courageous in the dictionary should have your picture next to it-and so should hero!!!", "michellebhrnds": "Ne dumme Hure bist du", "heinrich_halama": "@clemens_marek fesche mieze", "stitch.it.von": "You rock!!! 🎈❤️", "lydiacarlston": "A warrior, you are! (where is the Viking emoji when I need it?) 🇸🇪 powerful girl leading a powerful movement. Thank you. 🙏🏾", "elinorehanssonboe": "❤️👏👏👏👏", "mallory_mcavoy": "You are above the haters, and they know it.", "luanapsant": "@tatyanepereiralima", "robertaalto": "Aspiepower 🙌🏻", "fabiocesarbalbino": "🖕", "benjamin08125": "Very empowering young lady, you will change the world", "lorrainelson61": "🕊💐✌️❤️🌏🌹🍀these people who poke fun do not deserve your help or caring, yet you are so GENEROUS you are doing this for us all. Much love to you.", "toe_knee76": "You are an inspiration ❤️", "rioheuh": "Energy ❤️🙏🙏👏👏👏👏", "taulant_ziso": "You have aspergers syndrome so what? Each person has its own difrences, i also have dyslexia but when thats nkt the reason that im difrennt j have other things to talk about that dyslexia, everyone is special in Their own way so dont be arrogant", "arami_aracely": "@letirasmussen", "jemassoterapeuta": "please don't stop you're saving claw solution of our future don't mind who has no arguments", "laurensinger_art": "Bravissimo!!!", "dil_mack03": "Better off getting fat and doing nothing with your life", "melibarra6": "You are a beautiful angel Greta never let anyone or anything stop you from being you ! You are a blessing to this world an example of determination and good heart and everyone should be more like you ❤️ #grateful #keepgoinggirl #yourock", "tuulakatriinas": "💖❗", "pickursauce": "🖤🖤🖤", "theantisoc": "The beautiful society of today where the only thing that qualifies a leader is how many personal problems they have", "nicodemelebris": "Fuck", "undadabridge": "Love u so much.. wish i had aspergers.. not kidding... youre blessed dont forget it and youre also beautiful there is nothing wrong with u :)", "madison.westerfield": "you are amazing!", "arlette_2018": "Bien Greta!!!...siempre seguir los sueños.", "sgmmr": "But you should be on a boat omg that's gas", "dhyproductions": "🙌🏻 ❤️", "nedtparker": "@gretathunberg Don’t listen to people who spend days over their computer posting horrible things about real people l. What your doing is amazing I wish I had the guts to do what you are", "maggiemartoglio": "@hannahmackinnon", "abrahammartinezzz": "Nice pollution boat🤡", "autraducoes": "Love you Greta!!! 😍😘💋", "tessvanderputten": "Girl What a Beautiful powerhouse you are! Lets make that change together!! ❤️", "lilbettyyyy": "Wet rat", "lorenzo_battistinii": "Tutq fatta anche di plastica FALSA", "oryortega": "No one goes after your looks...", "stirlingjudith": "Go Greta darling, go!", "fredbahia": "Que sonho roubado heim! O meu então nem existiu... Vai viver sua infância e juventude garota, não entra nessa de política esquerdista não... isso não vale a pena... incentive as crianças a cada uma plantar 1 árvore, não jogar lixo no chão, boicotar empresas que poluem... assim é mais fácil... O Governo não é totalmente responsável, nós somos.... então mude o foco... afinal já ganhou a tão sonhada atenção da mídia... estão te usando...", "el.lambros": "Adorable girl with a huge heart and excellent leadership- you are doing GREAT things and it SCARES people!!!❤️", "karlarose__": "This is so powerful. Go girl!", "alexthebigmeme": "Ur reverting to ur problems to try and make people feel sorry for u", "rachellemusik": "🙌🏼💕💕💕👏🏼👏🏼👏🏼", "just.megss": "You are beautiful inside and out!", "mariadefatimavilleneuve": "You have too much angry in your speech. If u want to do the difference do like Gandhi.", "paulina_ivanovate": "There is nothing wrong with your looks! You are awesome! Ignore the haters and develop a thick skin and remember: many enemies, much honour", "johnlovespinecones\nVerified": "Verified", "chobivicens": "Greta after warning about the mistake hidden in the belief in economic growth it has come the time to speak loud and clear about alternative and viable pathways to reach sustainability. Are you in touch with GEN (Global Ecovillage Network)? Thank you Greta!!", "maddyreico": "@madziak3", "burakthehalfgod": "Modern faşist", "olivelouise": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "iamstandinginthebathtub": "@ciarasp8 do you follow her ? She is the best ⭐️", "goodbadbadgreat": "Legend", "stewartywart": "@vanjanirashmi", "a_hudso": "You're perfect", "sebagutierrez888": "Hija de puta", "finnbyntalli": "💙", "_l_e_r_n_": "Keep doing you!", "rosesareorange": "You are a profound inspiration ❤️", "luxfavors": "Bästa Greta! Du har många vänner!!! ❤️❤️❤️", "jonaswrrs": "#freerocky #fucksweden", "laurenpandatracey": "@amymarytracey_", "_bring_me_thanos_": "Mal", "lamboglia_10a_ntifa": "Powerful stuff! ✊❤️ 🌎 with you forever", "myriam_goes_photography": "I think your inner Greta is much more grown up than a lot of young people around you who are stuck in their own teenage problems and are still very young at heart as well as in their heads. They don’t treat you like that to hurt you and leave a scar on your soul but because they don’t know any better. They‘re stuck in their own little bubble and just trying to survive. I felt sad and like an outsider at your age. But trust me, things will change (you can already see it in your own life). Kids will turn into adults who have learned how to treat people better. Scars will heal. But you have to take care of yourself and not hide how you feel about the bad stuff. Heal yourself and do something good. But you already are and you are inspiring MILLIONS of people (young and old!! ) all around the world! You are so precious, Greta! 💙", "jacobdaun": "Poor poor child with no opinions of her own just spouting what her parents tell her", "ninalulufrankie": "♥️♥️♥️", "anineoh": "Stay strong💪🏻 The world need people like you💙 Dont let anyone stop you! EVER!", "andrea.pauline": "💖💖💖💖", "kiwibread1": "Youre amazing and a light to the world I think youre an inspiration", "tinalawson1": "Use your SuperPower Sis!!! We all need a Hero like you!!! 💜", "tfofs": "❤️🙌🔥", "chandzme": "Dont let anyone stop you ! World need more ppl like you 🙌", "meganjanesoutar": "💜💜💜", "barbgbronx": "Keep at it and continue to make powerful speeches. The world needs you!", "louellaxo": "💜", "ttha.chris": "Dai qua sei carina, lo ammetto", "roundthemulberrybush": "💕💕💕", "frank_augustyn_": "That's why you act like a loser", "judydoell": "@gretathunberg You are brave and focused and an amazing example for ALL people.", "emelietorling": "♥️", "sofiapalice": "🤜🏿 You rock girl!", "doobelievedeb": "Bravo! You are important! 🙌🏼💕", "bassem.mfg": "Meaningful words, lovely attitude", "aigarssokolovskis": "Wut", "vegg1ehunter": "You’re amazing!!! You aren’t alone in this fight!!", "alexmontpetit": "@chloechedore elle a lasperger en plus🤯 est ecoeurante♥️", "mmunozpowerlifter": "No tenes un carajo. Problemas para socializar? Tenes 6 millones de pelotudo siguiéndote y das conferencias... por que no dejas de tomarle el pelo a la gente que realmente tiene esa enfermedad?", "ellennwestergren": "💪🏻💪🏻💪🏻💪🏻", "barahsul": "I love you ❤️❤️❤️", "nixxpereira": "you are so lucky to have found your meaning at such a young age. stand by it fiercly as i can tell you already do. 🔥💕", "stuartmark123": "I don’t know you but I am Proud of you to have the guts and determination you have. Your so inspirational 👏👏👏", "leahlovesroses": "You are inspiring, Greta! Your are passionate and intelligent, and your differences are what make you unique and special 💕 never stop being enthusiastic and never stop trying to make a change in this world 🌍", "brandyregalado": "Your different makes you beautiful and amazing, but what your standing for and the way you went about it will be criticized. Handle it or don’t put yourself on a global pedestal of judgment, lies, and brain washed rhetoric. This message is not new, the lies you spew, not new, the dramatic way in which you felt to convey this mega lie, new and the age in which you were used to bring a new awareness of how low the left will go, again a new low. Good luck 👍🏻", "aisling.nevin": "❤️", "mabel.inca": "I’m so proud of you dear Greta because your passion for the environment will help save the world!!! And no stopping us now!!!!💕💕💕💕💕", "aurorarf": "You are an amazing human being. ❣️", "luis_g_vasquez": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "rosalina_la_contessa": "Truth to power Greta! Your difference means focus and vision and commitment to a crucial cause -this is beauty.", "garomantic": "I'm just wondering to what end? If your message goes unheard? It is a good message but what if nobody listens to it?", "godwithin": "Where can I find your story? The story of a child that struggled home alone to the one you are today. How did this happen?! How did you get people to listen? You went from 0-10! I look forward to hearing more about you and what you have to say! 🙌", "_b3th.d_": "You👏🏻 Are👏🏻 Beautiful👏🏻 In👏🏻 And👏🏻 Out👏🏻", "kristaspelmer": "You go Greta! So powerful!! Super power indeed👍🏼🌍", "lolacortezzz": "You are a bright light. You are a strong soul. Keeping shining your meaningful message. I'm so happy you are YOU and you are HERE. <3 #aspiepower", "chloerobs_": "We love you, Greta! 🖤", "_alex.fesler": "How do I like twice?", "gianlucadalbianco": "Greta I’ll be a dad anytime from now I just wish my lady will have your power to leave this middle age behind- go girl, you rock!", "pam.aferreira": "@caubrovko", "jwtjessicawatsonthorp": "👊🏼👊🏼👊🏼🦋", "tommybatta_": "Perché non affoghi già che ci sei", "massoudros": "🌹🌹❤️👍", "fast_dancer": "You’re a super human 🔥 keep that fire burning", "rosa_ombrosa": "Go Greta! We support you! 💜💜", "teosotty": "Non c’è niente di meglio di salpare per me con te", "zara_collings": "🙌🙌❤️❤️", "joel_bolander": "Nej", "skyejayden": "You are doing GREAT things. We are all supporting you! Thank YOU thank YOU!!!! ❤️❤️❤️❤️", "chynadol7": "Yes sweetheart you are so right. You are a brave,beautiful,smart, & powerful young woman who’s going to be the change that is needed. We are all w you! Even in spirit! keep on doing you bc you will succeed your efforts are not unnoticed. Du äger🤘 du har detta ✊♾🧩💛🦸‍♀️", "villasenorcecy": "👏👏👏👏👏", "vanessafemendes": "You’re precious to the world!", "bennjaaa__": "te parieron por el culo?", "littled_frenchie": "@gretathunberg Bless you!", "li.peguero": "@stephcolozzo @clafauci714 ❤️❤️", "venetiakapernekas": "Brave girl ; we are following you proudly", "smallvanillashake": "Queen", "the.princeand.me": "LOVE YOU GRETA, I\"M WITH YOU ALL THE WAY. THANK YOU", "saaara.s": "@mathemeatlloaf", "marykateoneil": "You are fantastic!!! 🙌 Thank you for your efforts!!!", "mel.mmac": "Wow truly inspiring 💘🌈", "xxgamergirl6942069xx": "As a young girl who also has autism, I appuald you 👏👏👏👏👏👏", "bcr2031": "You, young woman, are a hero!!", "missflorecilla": "💪💪💪❤️", "alexsisjane": "Bless your heart @gretathunberg What your doing is crucial and your voice is needed! Thanks for speaking up when us Adults were scared to. I stand with you Greta. 💚", "nestcoffeehouse": "You are amazing and make us all proud! The Nest supports you all the way!", "nfainsod": "You are amazing!", "healyam717": "@garylattke", "momma_delz": "You are an inspiration!!! We are all paying attention!! Keep going girl!!", "rymallen": "♥️", "chenoa_finnigan": "You are inspiring and when I grow up, I hope to be just like you. Fight the fight, we will all stand by your side ❤️", "decicio": "🙏🏼🙏🏼🙏🏼👏🏽👏🏽👏🏽", "lusciiouslisa": "Go girl❤️❤️❤️❤️ you're amazing!!!", "jordankristinaa": "@blaboranti29", "lindah06": "Awesome hero! ❤️", "callieonaswing": "You inspire me every day and I am so grateful you exist in this world! So many people can learn from you and your amazing gifts. You are powerful beyond words.", "adis_das": "You are so beautiful and smart and brave!", "haileyguerriero": "❤️ #superpower ❤️", "mypracticemypeace": "🌎❤️🙏❤️🌎", "brassknuckletherapy_": "🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻🎻", "wearethevaughans": "You are a gift to this fragile 🌍. Keep doing what you’re doing and we’ll fight along with you ❤️.", "cisq": "You are amazing Greta! Thank You for being exactly like this! We need more people in the world with this level of consciousness! ✨🙏🏼", "9athena.7": "Shield 🛡 Maiden for Earth 🌎", "lauren.christin": "You are so inspiring. I am the the same age as you and I look up to you 💕", "shannonlee25": "Greta....you are so smart & beautiful & adorable & amazing that you MOVE ME TO TEARS!!!! I love everything about you. You fill me with such pride & more importantly HOPE. And it’s backwards, you’re right. The children of the world should not be LEADING US....in gun reform, saving the planet....ANYTHING! It’s a disgrace. But God am I proud and excited about our future. Because you amazing kids are in it!!", "bridgette_d": "Nuerodiveristy makes the word a beautiful place. Thank you @gretathunberg for sharing your passion with the world!", "conley3molly": "@brigeta", "per_la_donna_mainz_altstadt": "A happY child... looks so good...👏", "anitaaven": "💪", "andrey_arista": "She sailed right? Some people are saying she used a sailboat with a motor 🤔", "amanda.t.villar": "🙌❤️👏", "sachidayal": "Kys", "arenatak": "@brandoh4 ❤️", "_florencedesign": "You are GORGEOUS. Please know that ♥️♥️♥️", "itscaleb_ruehs": "U also retarded", "annakubel": "Klok som en bok❤️", "jadieeg": "❤️❤️❤️❤️❤️❤️❤️", "solitjj": "Aspiepower 🙌🏽Meningsfull superkraft som du har för att hela världen måste vakna och agera för jordens framtid💚", "abarefootlife5": "You are an inspiring young woman. My son is Autistic and like you I know theres nothing he cant do!!!❤️🙌😊💪", "louiseh1990": "@ashdontsang 💪🧠", "_rachelwinter": "@tylajade_ 😭👌🏼", "rachelsimcha00": "❤️❤️❤️❤️❤️❤️❤️", "tortuga775": "💚💚💚🙏🏼💙💙💙 thank you for sharing that with all of us. Thank you for having strength in the face of ignorant bullies. Thank you for finding your meaning and purpose. 🙏🏼", "claudia_stern_glazend_bulsara": "Keep going Greta!!!", "mary_finch717": "❤️❤️❤️", "kleenekatzen": "Guck you on youtube great Work !", "michelegrey": "You are a WORLD TREASURE, that’s what you are.", "jg_revilla": "❤️❤️❤️❤️", "ainhoabris17": "@annasresa", "lukebowman_": "❤️", "annie0624": "YOU ROCK GRETA!!!", "lilssssssssssssssssssssssss": "Your beautiful and anyone who comes for your looks is wrong and disgusting. But your wrong about climate change hysteria. I think all this is a bunch of shit.", "waodestrhmttiya": "👏👏", "ju.brancofilipe": "You're amazing Greta. An inspiration. So powerful... Thank you. Stay strong on your/our journey❤️", "thornhill.kristen": "I didn’t know you had this syndrome and now I love you even more.", "empivioheiit": "❤️", "mariarita_zaza": "💓", "s.icklove": "you're the strongest little human being keep doing what you're doing greta and thank you for everything", "oceansandclover": "Love is the currency of life! To find love we must dive head first into change and discomfort. Glow baby 🌻 we are ALL behind you.", "twomadx3": "why is she spitting fax", "detoxescape": "❤️❤️👍", "harleenratol": "❤️❤️❤️❤️", "iam.valn": "@margotlorthiois neurodroitier ftw", "lehmacherjavier": "Y ya estudiaron lo retrasos mentales de Trump.....????", "instawhoree": "it's her supwerpower", "solemnly_swear_i_am_slytherin": "#neurodiverse 💚", "spin_yoga_girl": "❤️❤️❤️❤️", "_zio_ste_": "Ch facc e cazz", "nash_mcdaniel": "The moment u realize u have ass burgers", "vibeketetlie": "❤️", "greenheiwa": "You are a superpower 💕", "kicllo": "❤️", "joseph.soares.7906": "😂", "virklig": "❤️", "a_skvarnstrom": "❤️", "emil_bergg": "Nej dar hade du tyvärr fel", "browsbynikk": "Ilove you G", "badviking71": "Jag älskar dig!! I have Aspergers too but was only diagnosed at age 40... you’re and inspiration to everyone.", "bunkmeisterglass": "Yo you are so damn inspiring 🙏", "11song.dwrp": "Never ever give up your doing absolutely great. I love your speeches you do keep going.your a great person I love how you dont let what you have defy who you are I'm so happy about that. I have turner syndrome it means that I am missing my second X chromosome. It effects the whole body. I won't let my difference defy who I am too. You are absolutely amazing.😉😎👍❤.", "bleialoha": "❤️❤️❤️", "misslolitalee": "❤️❤️❤️❤️❤️❤️❤️", "lamar_aqua": "🙌🏼", "bisiabuble.violin": "Thank you Greta for all of your action. Dont give up! You are a superwoman ❤️ and always remember that!", "s.v.3.n_h": "Sure you haven't got down-syndrome?", "grizellavierida": "❤️", "nadia.duguay": "❤️❤️❤️❤️", "ellinorjosefineeng": "❤️", "kcheesetown": "@madelineroseadams", "mystischmystisch": "Gret ThunFISCH", "allieeoop_": "You go girl", "katekmb": "@fairypugs267 what an amazing role model x", "tatianadahmerpereira": "💜🌹👏", "eag5253": "Amen to that nothing is impossible when you set your mindset to what you want and everything will fall into place. I'm 35 years old and to see someone as young as you with so much knowledge and courage to take on this issue. It makes me proud and sad at the same time you as a child should be enjoying school and being young. But no you have to worry about your future as well as the fellow youth group. Love you and your dedication to seeing this through. #gretathunberg #climatechange #youthforclimate #noplanetb🌎", "erinsart22": "This is inspiring 👏👏👏👏", "the_escapades_of_haylee_paige": "Love you 👏", "roseadams_": "❤️🙌🏻❤️", "ashtontnewman": "Girl. You keep doing you. THE WORLD NEEDS YOU❤️", "janine_melanie_9": "@whatsvictorupto", "jadey90__": "You are an amazing human being. So young, so wise! Well done Greta! ❤️", "melissalove.mmle": "🙌🙌🙌🙌", "mccormackalice": "So that’s is a mock bullshit news twists everything today", "stella_lunaaa": "You’re doing amazing ♥️", "chippersnaps_photography": "You are a brilliant young person", "breakfastjones": "You are a soldier. ❤️", "hannah_hallgren": "❤️❤️❤️❤️", "_flodelgado": "Idol ❗️", "janelgrych": "You are Brilliant and Beautiful! Thank you for championing for our existence and the Earth!", "jrace_personal": "Cierto, pero los 3 millones en la mierda de barco te las hubieras podido ahorrar y mas sabiendo quienes son tus patrocinadores, entre ellos uno de los bancos con mas imputaciones por paraisos fuscales del mundo jajajajajajaja👏👏a la prensa rosa", "ninagpannu": "🙌🏽", "alexisgcannon": "so proud 💓💓💓💓", "samsurena": "❤️", "mallorya333": "🙌", "missymandm1": "You are an inspiration to us all! Thank you", "yung_megatron": "QUEEN SAVING THE PLANET! 🗣", "gulbinstylestudio": "Well done Greta .. I salute you as a mother of 2 Asked her boys and I'm proud of their achievements and being out of norm..🙌😘💕💕💕", "tammy6759": "Thank you for sharing and giving mother's like me hope for their children. My 5 year old son was just diagnosed with Asperger's and selective mutism. AGAIN THANK YOU for speaking on both Environmental & Asperger's. Love seeing you put your mark on this world!", "nataliapelmanprints": "👏👏👏👏 Coraje Greta!", "ashleemacpherson": "You are amazing ❤️", "suleybon": "You are BRILLIANT and a powerful public speaker and your pointed rebuke to the denial of the climate crisis is not falling on deaf ears you are inspiring a generation.", "venkebeate": "Du er fantastisk👏❤️", "galaxy_high": "Kind of like how people mock Donald Trump for being orange", "rileyting": "The world is grateful for your power and love!!!!! 👑 ❤️🌎", "sri.c_": "Hats off! Amazing to see how much Greta cares about climate change and what she is doing about it.", "releasethebaboons": "You ARE superpower! Never listen to haters. Ignore them and rock on", "henryboutell15": "You ain’t doing shit bitch", "sashastockell": "A very beautiful, brave, intelligent little lady! 💕", "adventuregirljess": "You give me so much hope💜", "liviafdg": "You are a giant ♡", "oscar_rinza": "I too have Asperger’s syndrome so I can relate to what you said", "erinleedaymond": "The world needs you beautiful girl ❤️", "super_jony_10": "A tus pies #guerrera 💚💚💚✊✊✊✊", "david_112x": "If someone speaks bad about someone else it truly shows their own insecurities and weakness. Keep on going strong 💪🏻 you are making a difference that is truly needed in this world!!! 👍🏻💪🏻💪🏻💪🏻", "aaaangggg55": "You rock!!!!!🌟", "eusoupaularafaela": "Oh my!!! You are sooooo special for us!!! Thank you thank you thank you 🙏🙏🙏🙏 💕💕💕👏👏 its an honor", "reensie66": "Truth🙌", "_carrieking": "@virginiaking101", "dany_0406ph": "That's right. The World needs you. You have all the world's support.", "bkough99": "Must be nice", "realparrotjack": "If this worthless tool had any bravery or Integrity she would take her claptrap Roadshow to communist China and start mouthing off to Chairman she but she doesn't because she wants to harass people who are not part of the problem", "jeanie15": "@alaynahardingg", "dmitry34stupin": "Шведка?", "muchaf__": "You Are amazing", "pripritri": "Sometimes it is the people no one imagines anything of who do the things no one can imagine ✊🏾✊🏾✊🏾 #superpower", "rezawdi": "❤️", "poplami_kids": "You really are a SUPERWOMAN 🙏❤️", "aileendashurova": "Aspergers is a great superpower to have...😉 I dig mine! 💜", "lekismore": "I just want to send love and wish you all the best. You are a good example to show us how individual people can contribute and influence the world.", "pedro_gaztanaga": "🎨🎨🎨", "s_limmy": "@lndalm", "julesaujus": "❤️❤️❤️❤️❤️", "p.mixhel": "👏🏻👏🏻👏🏻👏🏻", "whoiscarlosm": "Olha essa legenda! Bem perfeito para aquela resposta que vc deu no twitter, sobre as \"expressões\" faciais dela @nilmoretto", "photolyns": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "jasmin_halper": "❤️❤️❤️❤️💯", "bbcreativ": "I've read, the whole family has pschic disorders. So what? Now I understand her shakespeare behaviour at the united Nations meeting. Specially that look at Trump was very exciting. Just crazy. Sixteen and acts like eleven. Then her \"Fans\" 🤪", "sarahemmersonscott": "So now you’re hiding behind your addiction to false climate change. That’s also an illness that I hope you can receive treatment for. Best wishes.", "sammmagnew": "💜💜💜💜💜💜 Amazing!!!", "tomasinegahn": "❤️", "ig.epilef": "You’re funny girl ❤️", "amy_roberts_05": "Thank you for sharing and thank you for taking action when many of us are still scared.", "yulianamesa1": "🙏💓", "dianakrueziu": "Du är så duktig så❤️", "kjplh": "💖💖💖💖💖💖💖💖💖💖💖💖💖💖", "saramaessa.jpg": "I'm so proud of you! 😊", "idamkofoed": "@christofferlenhard derfor r meget god mening omkring hvorfor hun er som hun er❤️", "saif_motivation": "❤️❤️❤️", "sissyrela": "💗", "with_this_body": "❤️❤️❤️❤️❤️❤️", "paige__alex": "@sjmwilson", "wilmasmiles": "You’re a very beautiful and inspiring human being, and don’t let anyone tell you otherwise 🦹🏼‍♀️✌🏽💚", "obuhoff.missio": "I'm having common ecological interests.", "antraonwp": "You are amazing young woman. Keep going strong 💪❤️", "agathe.ananda.yoga": "@gretathunberg This, is power ! ❤️", "vstella.art": "🧡🌹☀️", "cathalempi": "Heja dig Greta❤️. Alla är vi udda på vårat egna vis, varesig vi har diagnos eller inte. Dom som säger något annat har fel! Du är du och ingen annan är precis som dig! Du är bäst just för att du är du! Sen är du extra duktig som står upp för världen! Fler borde vara som dig Greta ❤️!", "ginger_leanne": "GRETA! You’re AN ABSOLUTE INSPIRING RAY OF SUNSHINE! 💛🧡🌞 You have the power 💥 and Voice giving the future HOPE to see a better change for everyone especially the youth! God BLESS your heart and NEVER give up! Keep believing! You have motivated me to believe and make a difference! 💚💙 🌍 I am honored to follow you on your journey, young one! Your parents must be proud! 💞 sending lots of love and respect from Sylmar, California! 💞 Ginger", "sarauk21": "Love love love ❤️❤️❤️❤️❤️❤️", "_pisces22": "You’re amazing!! You Go girl 🦸🏻‍♀️", "vesper8590": "Såg ditt fantastiska tal - om du visste hur imponerande du är. Kan inte annat än att stämma in i hyllningskören!", "piscesenchantment": "You are amazing! ❤️", "morganalexandra369": "Your a credit ❤️❤️", "febe.nilssonp": "Så fint skrivet !! Du inspirerar och gör skillnad 🌟", "bjorn_szoke": "😂😂😂😂", "bitchcraft_queen": "True beauty is your boldness, intelligence, and kindness. Don't ever let anyone make you feel differently. May my son who is also on the spectrum have a heart as fiery and a mind as sharp as yours. You go girl ❤ Love from Canada 🇨🇦", "r.r77666": "You are the most beautiful human!! 😍", "la.vita.e.bello": "❤️❤️❤️❤️❤️❤️", "barbanea": "❤️❤️❤️", "chantel_riley\nVerified": "Verified", "ju_chgn": "❤️❤️❤️", "chonacas": "@yonickyscorpio ❤️🔥", "abby_oneill": "Powerful 🙌🏼", "tuvahealingbynature_": "👏🏾👏🏾👏🏾", "paulainscotland_yoga": "@bradziszewski", "teresamendestete": "👏⭐️❤️", "pontushermesgard": "@pontuusaandersson", "creativprocess": "Look at all you've accomplished. You are an inspiration! Thank you for being so very brave every day!", "miraweller9": "❤️", "mxritz_mw": "But how the Crew Comes back and how the other Crew comes to you? With a Plane?🤦🏻‍♂️", "emmyjjump2": "So inspiring!!!!!!!!", "farah.xfx": "You no get beriod?", "elvinvillaruliiarubia": "🇵🇷💯🌹💎👑❤️🐾🔥", "scvmrat": "I love you 🌹", "leafy_lex": "You're amazing 💕", "bellissima_mamma": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "pho4ebe": "@lizardo.desilos", "woodalchii": "A lot of amazing people around the world that have made huge impacts and changes have diagnosis. It can be difficult but such a drive force as well. Ur brave and amazing 💙", "natyalgaring": "❤️❤️❤️❤️", "mamapeace": "The neuro-diverse world salutes, honors and appreciates YOU ❤️", "gittan___": "Vilken tjej du är! Imponerad 💪💪💪", "yoneka_": "❤️", "ladywiththeorangehat": "You’re an inspiration to all ages! Ignore the haters. They’re pathetic fools.", "donnalenning": "Thank you for speaking the truth when others will not. I have a grandson who has Asperger's and I know how hard it is to do what we consider simple things. But he is in a school now that is really helping him thrive. I believe in your truth. I studied the Sciences in college back in the seventies. One of my teachers told us back then it was already too late for us. I didn't believe him then and I don't believe the haters now. When you see starving polar bears floating on a small piece of ice, something needs to be done. When hundreds of whales are beaching themselves, something needs to be done. When we have a President who doesn't care about the water in Flint, as well as other water he is allowing America to pollute, something needs to be done. It took years to pass laws to protect our environment and with a swish of a pen Trump is tur king back everything we have done to protect our country.", "_hngggg_": "I belive ur❤️❤️", "lorsmoon": "You are amazing! Haters be damned.", "faye_bes": "🙏🏻Greta for your superpower your strength and your truth. You Rock.", "redrooster777": "Love the sail boat...thou", "danielar11": "😍😍😍😍😍😍😍", "ellalvdan": "you are truly an inspiration, greta! it’s amazing to see how you affect the world around you in every way you can. 💛", "soniaglez": "I love the #aspiepower 💪🏼hashtag ❤️God has certainly gifted you, and how you’re using these powers as you call them, is your gift back to God. Nothing will stop you. And we know that in all things God works for the good of those who love him, who[a] have been called according to his purpose. -Rom 8:28", "kimdabrowartist": "♥️", "cb_radiojawn": "🔥", "genelle10": "Greta You are a Super Power", "bhaktisoulvoice": "You are bright and brilliant!! All the parts of you are in perfect alignment! Blessings to your beautiful journey! ✨ You GO GIRL!", "caraara": "@kaykayjayjay", "gsp2040": "@samdas907", "fashionista__143": "You were .... ARE meant for this Greta! We love you and keep up the GREAT work you are doing! You are SO inspiring! So beloved !!! ❤️", "jiri.z": "Ship made of carbon. Lol", "awholesomebalance": "@mama.naranjo", "mexicaboogie": "You are amazing and have definitely shown us your super powers! I see you are uplifting so many young people to be who they are, heart, mind and soul! Sending prayers of protection and strength as you journey this continent connecting to the people and stories and sharing your message. I would love to see you connect with some of the indigenous elders and activists doing climate justice work @indigenousrising @societyofnativenations ✊🏿✊🏽✊🏻", "veroniqueadaa": "♥️♥️♥️♥️", "gabriel_valois": "😍😍😍😍😍😍😍", "dilanurtmc": "I want you to be happy Greta. You deserve it. I’m thinking positive about achieving our goal for our world. 💕", "meliabella": "You are amazing and so powerful. Thank you for all you are doing and know my son (also an “aspie”) and I are learning so much thanks to you!", "tamaranajm": "You are perfect. Thank you for being you. The world needs you 🌎", "100dollarbelle": "The Earth is lucky to have you. Thank you for speaking for it and our nuerodiverse community", "templetweed": "You are amazing Greta!!! Thank you for being you.", "doubledgedcoin": "Bless your heart! You rock Greta ❤️🔥", "guardian_legend": "💕", "francell.aragon": "@chicapt", "_talitamartins_": "❤️👏👏", "jennyleighart": "Soooooo true!🌏", "sarasaurus__": "@nashtyynash", "joeyharrington13": "Cute @gretathunberg @jharrington_66", "litieh": "🍃🍃🍃", "jennw1228": "You are a beautiful girl with a beautiful soul! 💕💕", "tajesnazira": "😍😍❤️", "_absenceofcolor": "❤️❤️❤️❤️❤️ Wow", "stephsoco": "🙌💜💜💜💜💜", "issska": "You are an amazing soul 🙏🏼💕", "omarabbouchi": "jævla idol du e😩😍 @uri.baron", "slimtoots": "We do.. we need you and thank you for speaking for our mother, planet earth", "the_last_denevan": "As a conservative, I find it disgusting that some would consider attacking personal issues, rather than the topic at hand. That goes for both sides of the aisle!", "mercieghimirephoto": "You are an inspiration!! ❤️", "verodelp": "Hermosaaaaaa!!!! ❣️❣️❣️❣️🌟🌟🌟👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "elainebedford2": "You are a force to be reckoned with and such a beauty! you have such a connection with people,it’s unreal to think this pretty little girl has such super powers to wake the world up? But you have!!!!🙏🏻", "semicharmed21": "Bless you and I appreciate your power! You are the change ❤️@gretathunberg", "lauramnicholson": "Amen to superpowers!", "livelaughlexapro": "@dallasblondie @thebougieboozieblonde", "bavpaul": "I wish people around the world had 5% of the courage and knowledge you have @gretathunberg you're such an inspiration for strongly supporting what you believe in 💪", "llirie_nadolsky56": "❤️❤️❤️", "charlieroo2": "👏❤️👏❤️", "melanie.rose_": "It’s never a disability, it’s THE ABILITY to do MORE! You go girl! 💙", "lilypochi29": "❤️", "thecosmicrevolution": "You are a force of nature! We are lucky to have you- keep up the work leading the way, superhero!!", "instatheinstant": "💖💖💖💖💖💖💖💖", "celinagoncalves": "Amazing words! You’re a real super girl! Diference os good!", "bubwatermelonhead": "I ❤️ you greta", "tasmanianwalkinbarefoot": "❤️This pic👣", "flopi7torres": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "afigue7": "Bless Your Heart🙏", "coutrim_la": "@lucianocoutrim_arts olha esse depoimento e siga a Greta! ♥️", "andilynnloves": "You are being exploited for political gain. It's really sad that so many don't see it.", "vaninae.cassano": "Thank you so much!! You are a wonderful girl, an enlightened being and an example of love and care for planet earth and other human beings. Thank you!!! ❤️", "miss.jenna.rae": "You are an AMAZING‼ individual doing AMAZING things @gretathunberg Don't let anyone else make you feel any different. Your words and actions advocating for change with regards to climate issues are powerful, crucial and impressive. I'm glad that you have found your voice, passion and meaning. Keep fighting for change! Don't allow anyone to silence you.", "megan.leigh.rvs": "@cassiestevenslynch @kendraa_2 this girl is going to change the world.", "pennyland.co": "🖤🖤🖤", "luredias": "👏🏼", "ananda_of_love": "Thank you for speaking your truth and shining your light @gretathunberg 👏💓👏", "raechel1": "@cullenhorseman", "francescacrazydoglady": "❤️❤️❤️", "beansbeinbeans": "You are so amazing 💛", "alietteandersson": "♥️♥️♥️", "lifeisaisha": "Go you girl!", "jasminabadee": "what an inspiration you are", "katherinelond": "We will thank you for ever ❤️", "featherheather123": "Your so amazing", "veemateo": "You’re beautiful and smart! Keep going 👏🏾👏🏾", "ella_enchanted8436": "I am diagnose with aspergers as well. It’s hard to be different but sometimes it’s the different people that make a difference in the world. You are making a huge difference and are such an inspiration to so many", "aifanxx": "💛💛💛", "kaybird1111": "Powerful, thank you for sharing", "dunderzutten": "❤️❤️❤️❤️❤️", "welcome_to_ikea": "Loving the Swedish flags", "evolving_paleo": "@cooper.sams", "jessie_fuydal": "Queen", "malinkagstrom": "Tack för att du finns!❤️", "nat_applicable_": "I too also have AS and I find this incredibly inspiring keep doing what you’re doing 👍🏻💯", "alex.niehaus_13": "You are awesome! I wish i could make such an impact as you did", "_sunny_phil": "👏🏽👏🏽👏🏽💕", "srdeoliveira": "Period pooh", "labetavulgaris": "You are a treasure to all of us who look up to you. We are lucky to have you as a leader to speak truth to power and represent the determination of the world's youth to fight climate change! I believe in you Greta! You're inspiring great things and making real change! THANK YOU THANK YOU THANK YOU 💘🌍✌", "emily.shepheard": "@francescacrazydoglady ❤️", "jenschwartz819": "Dont let any stop you! Youre a superhero and we are all behind you. Thank you for inspiring me and bringing attention to the climate crisis. 🌎👍🏻👏🏻", "sr.isaacnewton": "I’m so proud of you. You inspire me and I’m thankful that you are part of our world. 💖", "zsuzsasocal": "You are beautiful inside and out ❤️", "megan05c": "ASPIE POWER! I'm the same age, with the same condition, and you're a massive inspiration to me. WE CAN DO GREAT THINGS! 💜", "mpfneedham": "You are incredible. Absolutely incredible. Such an inspiration to us all.", "majkkowsky": "❤️", "cody_ruski": "How much waste did you create while traveling that long distance?", "scirocco_96": "So sieht man also aus wenn man zwei Wochen lang ins Meer geschissen hat 👏", "sassycat21": "❤️❤️❤️❤️❤️❤️❤️", "missej_jessim": "😍❤️🙏💯🙌", "sofiamaria94": "🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼", "jillian_medina_": "AHHH AMAZING GRETTA", "piousforyou": "🧡", "loowida": "❤️❤️", "afarinafartousi_": "💯👏🏼", "cappymack": "❤️💕❤️ You’re amazing", "pinarayhan": "@iremselam", "kevina_kay": "Incredible!! ❤️❤️", "crissybatts": "🤗🤗", "borealoffgrid": "Go Greta Go!", "joel.weestin": "Tja syrran!❤️", "keely_watson": "⚡️⚡️⚡️", "tyrarae33": "Your doing better than anybody else baby girl keep being you ❤️", "donnaanndear": "❤️", "simonebergianti": "Ti scorreggerei in faccia per farti sentire il mio cambiamento climatico", "nanebes_world": "As a mom of a boy with aspergers you are a real inspiration for us. Thank you from my heart for everything you are doing. 💖", "claudia_err": "👏👏👏💪💪💪", "elinungtupp": "❤️", "marklundhjalmar": "Nobody cares that you have Aspergers syndrome", "sabinelucia": "💪", "daudzi_skupsti": "You are a treasure and a genuine gift to our world sweet Greta...😘🙏🏼💪🏼💪🏼💪🏼 All our love and support sweet strong girl💪🏼💪🏼💪🏼💪🏼 I hope you know the inspiration you are not just to your generation but to the generations before you... being different from the norm...(?) CHEERS to you!!!!! You ARE what makes our world even more special and interesting and what it should be!!!! The norm is boring- here’s to those making the world more interesting and better!!!! Much love to you beautiful girl.... keep on doing YOU!!!!!! 1000%behind you from California 🇺🇸 You ARE strength, courage, inspiration, and everything I believe in and support not just for my generation but for my children!!!!!! 🙏🏼🙏🏼🙏🏼 from my heart I thank you 🙏🏼", "yourlocalmilkteadealer": "Now I find that rather insulting. I have bad asperger autism myself and I cant see how thats a \"Superpower\" It is causing me and many others only distress and sadness I honestly dont see how you can call this a superpower.", "carooliva": "You are a true inspiration. I can’t wait to see what you continue to accomplish with your heart, passion and talent ❤️", "christina.sandb": "❤️", "calvin_kresse": "Bleib da wo der Pfeffer wächst", "samarkam": "Beautiful brave lady with the most Beautiful angelic face! Thank you for defending our planet, and spreading awareness on climate issues, you inspire many of us to take action starting at home and within our community. Sending good vibes your way!!", "ladanmart": "You're amazing!", "ascentionbeautyco": "You are beautiful inside and out and perfect just as you are. The world needs you. 💗✨💪🏻", "channing_chernoff": "Your our hero Greta and you inspire us all to be better and do more!", "milenagimbe": "❤️", "former_narcoholic": "#ehlersdanlossyndrome #🦓Zebras#pplwithautism #genetics#awarenessforeds#als#ms#MD#aspergerssyndrome#youwerecreatedforsuchatimeasthis #greatness", "carlos__0.1": "Does anyone know how i can get this jacket?", "bolaoluwanerat": "You rock 💃🏾", "cxhallsworth": "❤️", "yung_albin": "Sluta skolka nu och åk hem", "sinead_nunan": "❤️❤️❤️❤️", "schatten_link": "She is not on the boat!🙅", "stella.mercerr": "You’re amazing, thank you 💛💛💛", "carlietynan": "❤️❤️❤️", "ashley_kate_graham": "@isaacowenkate", "evmc32": "You’re such an inspiration to young and old. Never let anyone steal your sunshine! You’re amazing!", "sharminty": "I have no words but good ones to describe you with. Purely amazing - everything you are", "stofflamingo": "You’re great", "limaaline13": "The world needs you, angel! You are amazing!!! ❤️✊🏽🍀", "audreyxofficial": "❤️❤️❤️❤️❤️❤️❤️", "ylmaz_yener": "Herkes senin qibi olsaydı.", "infusedwithtea": "Vackra fina du🌱🌸", "the.wine.girl": "💪💪💪💪Thank you Greta for inspiring so many of us! 🙌🙌🙌🙌", "hannahegilmour": "❤️", "luisalopes.yam": "You're amazing", "__solesnieves": "💖💖🤗🤗", "runannie_": "Wow, you’re a true supergirl 🦸‍♀️👊🏼", "indelucht": "You are a huge example to every human being in this world. Thank you. It is confronting me about the way of living of my family. Thank you for that as well. Yes it is time for change. In the big and the small of our family, in kindness for all species on this planet. And again even more aware and awake Gretha. 🙏🏼", "ellllluhhhh": "u amaze me everyday", "stacyclarklovesu": "Beautifully said. You are so intelligent and changing the world. I am SO happy you are you.", "sophie.bnm": "The world needs help . But doesn‘t Greta", "gracemcrae": "So much love for you!", "vaanitaoakey": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼💕💕💕💕💕👏🏼👏🏼👏🏼👍🏻👌🏼🙏🏼❤️Go Greta your superpower is shining bright like a diamond 💎", "dylanandjames77": "You give me hope and strenght for My son That is struggling That he and everyone Will find their place and calling to feel good about themselves", "viazoppo8": "🖕🤡", "judithemdehaas": "❤️", "michael_bizzy18": "You go nowhere to go dumbass!!🤣🤣🤣 you dropped out of school to protest about fossil fuels that cannot be replaced anytime soon.", "golfpar_": "Greta, du är en modig superhjälte som ger mänskligheten hopp. Fortsätt att göra det du gör, världen behöver dig ❤️", "llrea": "Beautifully spoken-you are a gift to this endangered world and all its inhabitants, ❤️☮️", "dr.goooecopost": "💘💘", "theactualkitty": "It's powerful to see other aspies using their voice as an aspie, but also on other extremely important issues such as yours 💚 stay strong your brain is beautiful!", "zehlomas": "You are an incredible person, and the world is very lucky to have you in it. ❤️", "ilafizzeddin": "Haters gonna hate and I love you, Greta❤️💪", "anne_dus": "❤️", "erinnslade": "Thank You Greta", "19hillbilly94": "Nice you go with boat and your other crew took the plane haha well played haha", "minitowi": "Jag blev otroligt mobbad som barn och tonårig, av en hel skola. Om jag kunde prata med mitt yngre jag så skulle jag sagt precis det du skrev. Och trots att det var längesen, kändes det ändå jätte fint att läsa❤️ Tack", "azeemakhtarr": "♥️", "emmamwk": "@kathi.mlr23 beste freundin oder was", "benaventezmiguel": "💪💪💪💪💪💪💪💪", "fitnesstussi_": "Such a strong and beautiful girl 😍🙏", "jettie_konfetti": "💜💜💜", "cara.whd": "You are truly an incredible human", "gusott": "@rocko_hd @nxls.8 swedennnnnn ikeaaaaaa pewdipieeeee🔥🔥🔥", "crimsonspasb": "Here’s to Superpowers 💃‼️❤️ 🌍", "itssansanyo": "Such a wonderful human. This world needs more people like you. I'm so proud of you! ❤️ sending you so much love and remember, you are the future.", "fred_steimer": "🖤💥🖤💥👏🏻👏🏻👏🏻", "mercynorcisa": "GO girl ! 💪🏼"}