{"guidominguezmouraoficial": "Burra", "andreeanabelle": "Pirralha de merda", "yuri_deboer_hutsie": "How dare you", "babyface_tillett": "Poor animals God💛 Please we need help 💔", "sereza93": "Ну, вот не люблю я природу, природа ведь это хуйня Хуйня при любой погоде, почти при любой – хуйня В природе есть что-то жуткое, какой-то страшный секрет Мяско кроваво-червивое, не здоровенький эксперимент Когда я смотрю на природу, я чувствую себя так Будто я принимаю роды с похмелья и натощак Но тут есть один моментик, моментик один тут есть Я родов, блядь, не принимаю, могу лишь принять чью-то смерть Любуетесь на колибри, зависшую над цветком А где-то ведь ёбаны тигры пастушком набивают брюшко Природа пригодна только для вывоза людей в лес И то постольку-поскольку этот метод доступен для всех Выбор ребят при ресурсах – это известь, асфальт, кислота А природа для бедных и утлых – бюджетная, блядь, простота Ко всем динозаврам и белкам, гниющим и сгнившим давно Многим парням слово welcome, шепнула природа, закатав их в говно И там, в темноте, под землёй, тускнеют их цепи с крестами И Adidas вокруг плоти гнилой вьётся своими тремя полосами Природа их просто съела, природа, блядь, жрёт людей Эта старая сука вконец охуела, придёт время – сквитаемся с ней Я бы вызвал природу на стрелку, предъявил бы по понятиям ей Но она недоступна как целка, не приходят друзья, говорят: \"забей\" Короче, мать-природа нихуя нам не мать, а сплошной могильник от", "dsumble": "Very very sad 😢😢😢😢😢😢😢😢😢😢 from Pakistan", "luuk.078": "No pyro no party", "5napchatsnapchat": "I have lived I have seen", "fight4earth.climb.bee.blobfish": "Soo sad", "_my_art_by_maxe_": "🔥🔥🔥😭🌎⌛🔥🔥🔥 Uomo, quando non ci sarà più ossigeno da respirare, i soldi che hai accumulato distruggendo il pianeta, non li potrai respirare!!!", "yanakovalenko07": "💋💋💋💋", "condemateuss": "🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🦘🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨🐨", "robakgastronomia": "🇧🇷🇧🇷", "atelie_silvana_": "E quanto a Austrália? Cadê os famosos ja estão doando seus milhões? Cade macrom ja se meteu no incêndio da aur", "yulya_s_julia": "You picky Penny Wise forgot about tiny tiny fire in Siberian forests this summer 🔥🔥🔥 and it’s just 20% of trees in the world. God bless Marketing!!", "aaron.126": "👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿", "messias_firmino_sccp": "Iae o vadia vai fala da Austrália não e ? Vc e manipulada pela esquerda.", "502_jordan.night": "Haha I did that", "michaelsoares___": "You are a fraud!", "pjotadiogo": "E a Austrália sua lacradora hipocrita? Como fica 🇧🇷", "ricardo.dejesus.98622": "A Austrália tá pegando fogo menina mimada vai lá se meter deixa a Amazônia em paz ela não te pertence", "tiago_vasconcelosz": "#australia", "carolina.gxa": "Vocês brasileiros não poderiam ser menos hipócritas falando (em português) “E a Austrália?” “A pirralha não curte canguru?” Sério, parem, estão passando vergonha, principalmente porque essa menina fez muito mais nos seus 17 anos de vida do que vocês em uma vida inteira. Que vergonha de fazer parte desse grupo.", "sidney_pontes": "Acho que Austrália está precisando da super-greta, pega a mangueira d'água dá mídia pra combater o fogo.", "laeziolenza": "#fakenews", "andradebordinmari": "E a Austrália????", "eliane_rochamakeup": "A Austrália pegando fogo 🔥🌏🌋🦘🐨🦘🐨🦘🐨 mais por aqui ta tudo tranquilo. Ahh é so na Amazônia que tem riquezas 😏 que se dane a Austrália né", "vlcvn": "O Amazonas e Brasil", "_daniielgomes": "Você não gosta de cangurus ? 🤔", "rodrigocezaroliveira": "No post about the burns in Australia?", "daniellopespe": "Usa uma foto da decada de 90 sem nem saber a procedência pra criticar o brasil afim de ganhar dinheiro e a Austrália não fala nada???", "marcos_paulo_sodre": "AUSTRÁLIA??? 🇦🇺🔥", "andrefloreslavbjj": "O que você tem a dizer sobre a Austrália 🤔?? 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "rafaflimajf": "Australia burns and what you say???? Nothing", "eduardo.ccortes": "This country is on fire #prayforaustralia", "magidthome": "Australia!???", "tatabenlolo": "Oi @gretathunberg e sobre a Austrália?????", "marenderaes": "😢😢", "mr.eistee_": "Geile Sache 😍😍", "reginas.rocha": "E aí menina obediente! Vc tá cuidando do seu quintal? Vc já fez alguma coisa? A Austrália tá pegando fogo né?", "erick.schiavon": "E a australia vaai fala nada nao ?", "tomasrossinii": "Fala alguma coisa da Austrália sua ridícula", "cezinha.cps": "Bolsonaro's fault...", "tiagomaiacamacho": "Aren't you going to say anything about the fire in Australia? Why did you only talk about Brazil? Who is being manipulated by the little girl?", "marcos.carvalho.cafe": "Cadê @gretathunberg em relação a Austrália, estou esperando um pronunciamento no feed nos stores ou no Twitter...", "maxkrajewski": "Falar sobre Austrália nada !", "nicolinoantonella": "Todos diciendo #prayforamazonia y por Australia que onda? Nadie dice nada. #prayforaustralia", "paulooliveira91": "Anything about Austrália? Nothing??? False false and false...how much they paied to you kid?? #prayforaustralia", "tonisantos91": "@gretathunberg Seja humilde e traga a verdade para seu interior! E agora o que falar da Austrália? Chega de demagogia!", "samarabap": "Regarding Australia what do you have to say??????", "mozar_leandro": "E a Austrália, não vai falar nada?", "hadhelychaves": "E sobre a 🇦🇺 ??????", "michellbaptiista": "Austrália?", "jandersonarrudaa": "Austrália 🇦🇺 😂❤️👏", "ezechiello": "#prayforaustralia", "lrennato": "Ate hoje queima.estamos trstes por termos um presidente falso e mentiroso que roba do seu proprio povo..", "pit_stop1502": "#prayforaustralia", "roney_tiodosio": "say nothing about Australia you hypocrite", "edilenefreitas": "🔥🔥🔥🔥🔥🔥🔥🔥", "manolo_delolmo": "La zone détruite en Australie est déjà quatre fois plus grande qu'une brûlure d'un an en Amazonie brésilienne. Greta ne va-t-il pas suggérer d'internationaliser les forêts australiennes?", "djsosiskin12": "Amazon it's good shop", "scrap_kittyz": "Oh no 😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢👎", "asplundpeter": "Secrets", "buttercreamsandwich": "Big up global warming 🙌🙌🙌", "pedrosouzanetto": "Austrália", "eduardoamll": "Austrália", "car_los0815": "Geilo", "paulo_slima": "Austrália", "carol_serapili": "Stupid, Hypocritical", "sr.robertosantos": "Oh sua pirralha, em que mundo você mora? Porque não está revoltada com os incêndios na Austrália?", "geisonts": "Austrália???? 🐨 🤔", "sandersonmotta": "Você é tão mentirosa que essa foto que você postou e de 1989 você cansa de passar vergonha vergonha não ?", "terry_walker_allison": "Greta, exactly how many trees did you kill in order to make your books? You are a Hypocrite!", "jaydiesbyenginestop": "Bob Marley was there; he smoke bis backwoods", "alexanderjansson_": "🔥🔥🔥🔥 Burn more", "archie_ruell_": "Ur not really helping 😂", "graciebirdgirl": "That is horrible. It MUST end.", "melojackiel": "#pirralha", "tihkohmia": "O cu da sua mãe", "john.j.owens.3": "Wats it was lightning strike lol", "krug.jan": "I hate you Greta", "paith79": "Fuck you. What do you know about the amazon? This belongs to us brazilians. Go back to your fucking country and shut the fuck up", "bottinelli.09": "🖕💩💩💩", "barsil.de": "Greta don´t touch Amazonia, please not another ONG. The Brasiliens don´t need you. 500 Years Amazonia still there, with European ONG´s there, it will be destroyed in the next 50 years. European and USA just want to maintain they way of live, just like you Sweden. Please go far away from Amazonia. It´s there without you for many many years. Do not let Companies to use you. Say no to the ONG´s working for reach countries.", "noahjamezcooper": "war against nature😂😂 we work with nature dummy", "brunnaarcanjoo": "My dear Les’t go talk about some ONG which put fire on amazon you know this ???? Haaaa of course you don’t know maybe because you have to receive some money right.... girl make sure and stop to with threat are ridiculous for you it.", "phillipp_05": "This picture is so sexy 😍😍😍😍", "claudiograzevedfalcao": "#pirralha 👉👉👉👉🇧🇷🇧🇷🇧🇷🤣🤣🔥🔥🔥", "gtvmas": "So faltou falar lula livre", "julinchen_07_": "Yes !😊", "4nt0n10_xrb": "Huhashhauh", "samuelsmuks": "😢😢😢😢😢😢😢😢😢", "zizanaif": "😭🙏🌎🇧🇷", "marceloguerrahaircolor": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "elderteixeira16": "#pirralha", "weslley_m8": "#pirralha", "sojorge_": "#pirralha", "juliana.ck": "Austrália 🔥🔥🔥🔥🔥🔥", "marcosbagudo": "#piralha", "allan.almeida1": "Pirralha", "mr.reis13": "#pirralha", "diegovetere": "Worry about Australia, we’re good here...", "tomsuppentelleryt": "How dare you", "moura_mateo._": "essa foto e de antes de 2005, se nao me engano ela é de 1996. Cala a boca #pirralha", "dogprotetor": "#pirralha mentirosa cale a boca", "rafaeltenoriofoca": "Fake photo! #pirralha", "thamyal": "@gretathunberg sua linda, obrigada ❤️❤️❤️❤️❤️❤️", "cursosonlineaa": "Aff 🙄 hipocrisia ou ingenuidade... difícil saber mesmo parecendo óbvio.", "robertasat3": "@gretathunberg Tudo que é verdade,nesse país tornou-se fake news!!! Não sei se é Brasil??? Ou fake news?!🤔", "tamarapolly_figueiredo": "Exatamente, as ONGS da esquerda precisam parar de atear fogo na minha e dos brasileiros Amazônia ! Eles precisam perceber que não irão mais lucrar com essa atitude!", "renatobonfire": "Fake estúpida!!!😂😂😂😂😂🇧🇷🇧🇷", "rehsantt": "Fake photos. @gretathunberg you're a liar.", "darkirris": "With all respect, you girl are doing nothing to fight against the cancer called capitalism, you're just throwing out words to easy the problem we have and first world countries continue getting money, perhaps you are their way to fool many of us 💵 💱 🥇 🌏 And everything continues the same. Indigenas had fight against this plague before, unfortunately they were killed due to. With all of this said, are you really are doing something? I don't think so.", "omar.barrow.7549": "😥😥😥😥😥😥😥😥😔", "shamelesshappiness": "❤️", "brigadirtv": "А про Сибирь! Сибирь горит !!! Ты не слова не сказала ! Это больше чем Амазонка @gretathunberg", "paulopitaluga": "Fake! 🤮🤮🤮🤮", "axel.dijoux.a89": "😮😢😢😢😬", "nicoschmid98": "Amazon brennt? 🔥 ich verliere meinen Job😒😒😒", "lucasacioly_": "Lavado de roupa, tá precisando.", "filhadorei077": "Muito triste mesmo ☹️", "bell.joseroberto.s.duarte": "Cala Te Boca #Pirralha 👍🏽🔰🇧🇷🔰", "marcelovictor99": "Sabe de Poha nenhuma....💩", "manduca_rodrigues": "Muito fácil fazer criticas, menina chata!", "annacarolina.bezerra": "George Soro...👏👏👏👏👏👏...FAKE PHOTO, WHILE FRAMING THE WORLD?.....", "jesse.souza.54": "Teu furico 😉😂", "victorhugo21199": "N.A pirralha", "4jasi05": "2 Millionen animals was dying😭😭😭😭✝️", "teclasthiago": "https://go.hotmart.com/J18861923D", "ramon_hfd": "Só fala merda #Pirralha", "lucas_leonardo_wittmann": "Fake photo", "king_jarrel": "Ohh. Nice👍.", "patriciagoncalves68": "Vc não sabe de nada!", "claudinolessa": "Os móveis caros da sua casa vieram da Amazônia. Eai ?", "ellepurp": "Lol", "zhulqarna": "Its normal these things happen sinds the earth is born climate activist is just a pr stunt hopeles people", "brunosharredoficial": "😅😅 fake", "ella.cantatore": "Omg the fire is so big", "montinho.pf": "Vaia verde", "btw_luciano_": "Fake", "amelieklein.s": "👩🏿", "gabriellaqcmarinho": "Fake photo 😂😂😂", "mfvestindovc": "Fake News, Very ald this picture.", "mejustliving": "Looks beautiful", "jeh_jessica_paola": "Fala da Australia FakeGreta comunista de Araque", "leandro86batata": "E Austrália não vai falar nada agora ? Porque será ein ???? 🤔🤔🤔🤔🤔🤔🤔🤔🤔", "esserphillip": "How dare you", "julianohresende": "Pegaram 4 marginais ligados a ONGs incendiando alguns pontos, e aí????", "maikel_morales": "E agora moça ? Vcs mesmos colocaram fogo e depois quer dar de sabichona", "la_rs_10_09": "How dare you", "holmesy0564": "The Amazon is fine learn more if you where at school you would know", "danielagarzon23": "👏👏👏👏", "ph_by_flo": "and yet , *cough* you *cough* didnt do smth*cough*. Sorry, I meant nothing was done about it", "roggirocki": "Noch eine Kleinigkeit zu diesem Bild. Hier hat es wertvolle Bäume darunter die werden zuerst gefällt und das Holz wird für sehr gutes Geld verkauft. Europa, Amerika, Schweden, Norwegen das heisst in die ganze Welt. Das ist ein typischer Brand der jedes Jahr hier im Winter stattfindet. Winter hier bei uns ist die Trockenheit. Fast kein Regen währen fast 4 Monaten und die Temperaturen liegen sehr viel höher als im Sommer. Der Sommer fängt hier am 21. DEZEMBER AN DAS HEISST BEI UNS die Regenzeit .Die dauert 5 -6 Monate. In dieser Zeit brennt es auch nicht mehr. Dieses Bild ist schon sehr alt und zeigt den typischen normalen Waldbrand im Winter. Das ist nicht klimamässig. Das hat damit nichts zu tun. Das von Menschen verursachte ist Mann fällt zuerst Grösse Flächen Wald und gewinnt dabei Holz zum verkaufen. Danach 2 Wochen später zündet man es an um Weideland für Kühe oder für den Ackerbau zu gewinnen. Das ist Menschengemachtes. Nur hier in Brasilien wenn Du das öffentlich machst wirst Du gejagt aber auch ermordet. REGIERUNGSMITGLIEDER müssen den Mund halten ansonsten verlieren Sie ihren Job. Das Gesetzt hier liegt beim Präsidenten und der steht für die Agrarlobby ein. Das war auch ein Wahlverspechen. INDIOS WERDEN VERTRIEBEN UND GETÖTET. Ich bin Brasilianer und auch Europäer. Ich lebe schon viele Jahre hier in der Amazonasregion und ich sehe was hier geschieht. Wie gesagt dieses Bild ist Fake und hat mit Umwelt und Klimaschutz nichts zu tun.", "toma_tvini96": "It's not war against nature!! It's war against humanity.", "boss_djim": "Hoe", "ferhat.cn.007_": "greta,greta,greta....How dare you?!", "brenoferrera_": "🇧🇷@gretathunberg sou Brasileiro e lhe digo, não houve número recorde de incêndios. Os incêndios são comuns nesta época do ano a maioria acontece de forma natural, outra parte é um costume das comunidades indígenas, apenas um clico da natureza, como você estuda bem sabe que estas queimadas NATURAIS são muito importante para a vida da propia floresta... porque divulga informações falsas!? 🇧🇷", "sandiego49": "She has not even done shit about this🤔", "cian_fogarty123": "The sad part is even if we win we all still lose", "dynamodosenbier_69": "#nopyronoparty", "ms_040304": "😂😂😂Lol", "lymedrogo": "@jesse.barden", "williamsjustin86": "😡", "dodge_b90": "I hope everything burns", "stiliqn36": "😭", "ampvidz": "Luft 2040", "nataliaalmeida19": "E tão animal que naum sabe bem que isso aí naum e a Amazônia tá ouvindo errado em e outra pq naum falow do petroleo sua ativistinha de merda", "deacardosoo": "🤣🤣🤣🤣😩💩💩", "javirojas124": "😢", "payamarsalani1363": "My friends 🌹 #saverojava #boycott_turkey #stop_killing_child_in_rojava_immediatly #stopwar bezhi kurdistan 🔥🔥🔥", "fettimeckfettfett": "Sowas schönes gibt es noch,leider nicht mehr lang greta hats entdeckt", "xsparkziex": "This one i can join with you on", "_hasaan_23": "Lol", "__nahte__": "hahahahahahah fuck the forest lmao", "emuduckie": "Some people say they lit it for farming space witch I don’t think makes it any better", "wu.tang.mariee": "Ja junge für deine scheiß klimawandel Plakate du hure", "kelinicocheli": "The recors was in 2014 darling", "panzerizda": "Nice", "henriquecarvalho_2006": "Did you know that you are having tons of oil on the northeast coast of Brazil? #whereareyougretathumberg", "tyagodnascimento": "Não conheçe a nossa Amazônia não opine ok, pare de ser massa de manobra e volte à uma escola de qualidade e verás que és somente usada 👍🏽", "niklas_gtn": "Is doch geiel", "gerardgarrigaa": "@auronoplay @luisitocomunica 🖕🏿", "aishanfal": "What is happening to the world 🌍", "isac_sohlman": "Tror nån ha ställt på pumpen för mkt eller va säg du @gretathunberg", "stephen_baxter1": "The rainforest burns all the time.", "matt.c_93": "Geil", "annetagonist28": "You are sadly misinformed. Do my own research? You assume everyone is educated by FB and media. I have first hand done research, in the field. It’s true that most of our atmospheric oxygen is from phytoplankton but the increase in CO2 is causing the oceans to become more acidic and making it harder for these organisms as well as others to live. The planet does go through cycles but natural cycles are gradual and this is not. In terms of time on a geological scale, this is accelerated. Natural buffers and feedback loops are unable to help many ecosystems because of how accelerated this is becoming. I don’t want to go back and forth on this. You claim there is so much evidence to refute this but 99% of the worlds scientific community has all concluded the same thing. Please try to understand that by the time you realize you are wrong there will be irreparable damage to our planet.", "adem.rmo": "Du kleine achba my canfire u slut", "_dasleon_": "My campfire 👍🏽👍🏽👍🏽🔥🔥🔥", "henrique_legey_": "this picture was taken in 1989...", "bets_dancer10": "I am 9", "olafindahood_": "Its lit", "kaleb_alves7": "Kkkk", "happybunnyflop2": ":( that pcture is so sad", "weloveourfirstfamily": "#GOOGLEGEOENGINEERING", "brunopalazzinineto": "This is not Amazon GretaChuckie!! Go stud!!", "raccoon_king69": "PUT A F IN CHAT BOIS", "forza_greta": "😭😭😭😭😭", "j_fshr078": "@robin.heeren05 🌍🔥👍🏼", "ernesto.boscarol": "#freccetricolori", "stef_angler": "Brucia merda 😂 🌏🔥", "friso.langendam": "burn baby burn", "heroninktattoo": "Foto errada", "shazeligs": "@rochelleemal no, she just talk and even the photo isn't from the Amazon", "vilanivagner": "Ei greta vai toma no cu 😂😂", "stijnphotographer": "Mooi kampvuur 😍😍😍", "_.h0lz._": "A little fire 😍🔥 I got the Steak come on bro @engist.2004", "faytttit": "Burn bitch burn", "eliel4070": "Vamos queimar cada dia mais", "strikeforlives": "Its not a war against nature. Its just humans forget everything behind feeding their greed😡😠", "mariaclara_rodrigues17": "😂😂😂😂😂😂", "rainey_bryc1690": "I like the bomb fire weee pal @matthew_crawford145", "mr.pshycotech": "😭😭😭😭😭😭😭😭😭", "duke.siberian.husky": "FAKE NEWS. I LIVE HERE. NOT TRUE", "marcelobraz_personaltrainer": "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "gotoresca": "Ai carai eles não cuidarão nem da suas florestas,agora querem vim encher o saco,kkkkk antes que me esqueça querem vir comer churrasco de girafa na Amazônia 🤣🤣🤣🤣", "_moo.houd_": "Stupid", "oterococinero": "💔💔💔💔", "jovanivan0vic": "Gle ala čadi ko dizel na minusu @jeri_dizel", "benlucareuter": "Looks nice", "casadavovomanufit": "🙏", "eliacky": "Estamos necessitando de ajuda aqui no Amazônia 😔😢", "pedrinho_s_m": "Nice photo of 1989", "gadi_crouse": "Those are your thoughts but you’re not doing anything about it", "belyilmaz": "Nicht UNSER Krieg sondern der Lobby. Solltest du ja genau wissen wenn alles im Griff hast", "nithcing_bich_4444": "So beautiful to bad it can’t burn at once am I right😂", "erikcavahein": "Mimimimimimimimimimi...", "davinetto_10": "You say you will change the planet, but you stay posting pictures at the gram", "icleanascimento": "Photo is from 1989!!!", "koltaro123": "more space for people", "rachmissdx": "Heartbreaking", "jerrymwe": "It’s smoking blunts", "nelson_merdapostagem1946": "tem q queimar tudo e fodasse", "lffgondim": "deixa nosso churrasco em paz", "sickly.friday": "Borneo is also burning", "clarazamora03": "Increible la gente q no quiere hacer nada. Los humanos deberiamos asumir nustras responsabilidades I afrontarlas. Aun hay gente q le esta dondo la espalda a la verdad", "hella_fresh2": "Good shit, moron @gretathunberg", "luisa_gamesff": "No dia que o Estados Unidos estiver uma reserva biológica maior do que a do Brasil essa greta aí pode falar alguma coisa, mas fora isso só tá cagando pela boca sobre a amazônia, o Brasil e lindo. 😍😍🇧🇷", "jaquelinecosta.usa": "Se você não sabe essa imagem não é desse ano 👌", "viniciusgomesmr": "Photo of 1998", "smathias271": "🤣🤣🤣🤣🤣🤣🤣", "dharmendra_911": "👏👏👏👏👏", "oliver.george.salmon": "@michal_hruza volvo chytlo na podruhé", "gerko_bouw": "😍😍😍", "brayamdanho": "Fotoshop", "chanlee_fr": "It’s literally called a rain forest, god took care of it.", "aldilene.aldi": "As pessoas questionam a data da imagem como se a Amazônia não estivessem em chamas. A imagem que ela usa nessa situação, não faz diferença povo fanático.", "bruce_junior": "Amazônia não te pertence não ,vai cuidar da porra da vida de vcs , você não é bem vinda no Brasil , e não venha .", "bemglo\nVerified": "Verified", "0950pm": "Fake", "best_koga03": "Knacka grillen😍🔥", "rumi_017": "Knacka grillen😍🔥", "ridektm_429": "burn baby burn, anything to piss this troll off", "foiber_52872": "that's a forest that's a forest fire do you think there's someone running in and lighting the forest? no that was nature it's dry it's hot naturally it burns and spreads but it is not the fault of man that is physics and if you look at the environment so throw your phone away so that was it jzt from me her Klimaleuten upset me #fridaysforhubraum #fridayforbeer", "__eujosuesousa": "A mesma foto que macroon compartilhou kskskskskskskskskkskss a fato que aconteceu a 10mil anos atrás ksksksksksksksksksk", "messias2008santos": "Que triste essa foto.", "crisperfildesativado": "Só vejo um monte de adulto xingando uma criança, falando q a Amazônia esta bem cuidada ? Vão se tratar", "geermanaz.lll": "You know that wild burn is totally normal and exists in every large wood...", "ruanmg_": "Fake", "prabhjotlidhar": "It was proven that the fires where started by humans", "rjcapo": "🤣🤣🤣You sure it ain’t a forest fire because those can help the environment 🤣", "filipegabriel67": "Eu acho isso inaceitável , em vez da maioria dos brasileiros apoiarem essa causa ficam ridicularizando essa garota genial que luta pelo um mundo melhor para todos , que situação triste", "viniciossantos10": "Não meu amor essa foto e de 10 anos atrás se informe melhor ❤️", "boobferraz": "The Amazon is ONLY BRAZILIAN, UNDERSTAND THAT ?! YOUR DELAYED GLOBALIST, THE AMAZON IS FROM BRAZILIANS, YOU'RE RICH WITH THE RICHS OF OUR AMAZON, THINK WELL BEFORE POSING ANYTHING ... TAKE CARE OF YOUR LIFE SATAN GIRL, BASED BY THE GEORGE PSYCHORIST", "alexandre.bialta": "Para que um trabalho ou uma causa seja bem feito ou sussedido precisamos saber o que estamos fazendo ou falando.", "carlrobinlundholm": "i think this is very good yes", "victorh.bjj": "Use o financiamento do George para aprender a pesquisar mais. Essa foto não é atual. Você está pior que a tia do WhatsApp .", "_tn48_": "🔥🔥🔥🔥🔥🔥🔥 @paul.he99", "antonio_felipe_85": "Agora me tira uma dúvida... De 10, 15 , 20 anos ou atual... Essa foto mostra algo que possamos nos vangloriar? Só mostra que de fato somos mais que incapazes de cuidar de nossa própria casa... A luta não é por quem, qual ou quando... A luta por sobrevivência do nosso planeta. Parabéns @gretathunberg por ser mais uma a lutar, fazer valer e acontecer.", "zach_cameron75": "Check the date on that picture. The fires happen every year and have gone down since 2012", "d0ugl4s2k": "😂😂😂😂😂🤣🤣", "paulanavarrosb": "Deixem a nossa Amazônia!!! Não aceitaremos mais que tirem nossas riquezas. Brasil acima de tudo Deus acima de todos!", "leocleroux": "😢", "ferr918": "A Amazônia é do brasileiro entenderam", "diogo__caetano": "Vc não sabe do que está falando garotinha! É mais uma hipocrita, manipulada por globalistas e bancada por Soros!!", "gustaf_guedes": "I used to think that you were retarded. Well, now I'm sure of it.", "celiamarie2008": "🤔🤔", "a.rowan.bird": "i want to shove this picture in the face of every idiot that mentions the \"war on Christmas\" this holiday season. this is a real war.", "elliott.souza": "Shut up please 🤦‍♂️", "rowan___14": "We are burning themselves", "lelzi.costa": "Vai estudar criança.", "andreia_silve": "😂😂😂😂😂😂😂😂blá blá blá,", "qahajajh_02": "😭", "delmarzeleski": "🤣🤣🤣🤣 Fake 😂😂😂😂", "lysruby71": "Why not a boycott of multinatinales? No to palm oil. One choice at a time, stronger together. ✊🏻🌎🌿", "claralima56": "Regardless if the photo is from 30 years ago. But it is so sad to see this happening in my country, in my home and nobody doing anything about it. 😭🌎💔🇧🇷", "samspencer.__": "Why set fire to the woods", "rodrigorodriguesdias": "Garota vai cuidar de sua orta primeiro, depois preocupa com a do seu vizinho , pois essa imagem nem atual é... tira o zoião a AMAZONIA tem dono está sendo bem cuidado. Tranks pela preocupação.😎👉", "xxdanthefiremanxx": "Thank you @gretathunberg for your #bravery and #leadership. It is so vital that we protect our forests and oceans which are our only line of defense from #carbonbuildup. The #globalcommunity needs to step up an make sure the resources are in place to place to put these fires out quickly before they gain strength. We should look at assembling regional pools of #MAFFS systems which can be loaded on to existing cargo planes in less than an hour and turn them into powerful 3,000 gal firefighters. This is the fastest, most efficient and cost effective way to build up the defense network we so desperately need.", "archway_12": "👏 Its all about money", "emma._.rosa_": "ur so fake greta! even my laugh while crying sounds more real than YOU!", "portto.ana": "Essa imagem não é da Amazônia. É de outro país. E tbm não é desse ano, só para lembrar.🙏", "vivi_falcone": "Menina imbecil!", "meu_mundo_mae_de_tres": "Cria ruim de soros para de cagar pela boca e vai estudar ,ao invés de ficar sendo marionete de narcotraficante!", "willian.coelho_uk": "Não sabe a verdadeira realidade de nossa floresta Amazônica cujo qual é chamada de \" pulmão do mundo \" que não passa de uma falácia . Não te culpo por isso, pois a mídia brasileira está empenhada em acabar e atacar com um governo que defende a floresta Amazônica que é contra o desmatamento e que combate o crime em nossa floresta ! Seja bem vinda ao Brasil para que conheça os verdadeiros números e conheça nossa floresta, nossos índios, nossas culturas . Não te culpo por não saber a verdadeira realidade de nossa floresta . Esses não foram os números recordes, os mais altos índices de queimadas foram nos anos de 2003/2004/2005 lembrando que essa época do ano é muito quente na floresta e que é normal terem focos de incêndios .", "indiio_oficial": "Seria uma honra muito grade tê-la em nosso país e registra com seus próprios olhos essa terrível situação!", "world_of_caio": "That’s an old picture 👍", "4dome20": "Maybe you jump into the fire you would help more people then you do now", "dani7740": "🙌🙌🙌💕💕👏👏👏🙏", "tola.kristian_": "Sos", "ana_sidney7": "this picture is 30 years old.🙄🙄", "lize__venter": "This is not okay", "thamy.cini": "😭💔🇧🇷", "larissaaalves_m": "FAKEEEEEEEE", "chris_osborn19": "Uhhh Mother Nature ALWAYS wins...", "kiranpal_singh_brar": "M with u 🇮🇳", "tierra_chilena": "😔😔😔😔🇨🇱", "decarvalhoigor": "Fakenews", "wellington.bgs": "🇧🇷🔥🔥", "thallesbsouza": "Vá orar pelo amor de Deus!", "_igorpadua_": "Fakenews", "lurdinha4033": "Primeiramente vc não mora no Brasil.O que se mais tem aqui é corruptos do antigo Presidente Lula. A Amazônia tem ONGS com interesse nas riquezas. Partido da esquerda colocam fogo propositalmente.O Índio Raoni envia barras de Ouro da Amazônia para França.Raoni comprou mansão ao lado da residência do Presidente da França.mas a Polícia Federal conseguiu flagrar.fora a pedra gigantesca de Esmeralda que seria enviada a França.Então muitos tem interesse na Amazônia pelo dinheiro.Todos querem ser donos e ter uma fatia do bolo.Então as queimadas já vem de longos anos. As Queimadas não é acontecimento recente.Então antes de atacar e culpar nosso Presidente procure se informar melhor", "blatteultras04": "No pyro no party", "sheyla.amoura": "Essa foto é de mais de 10 anos atrás, pescopata inútil. O fotógrafo já até morreu. FAKENEWS!", "ligiadecassia": "#fakenews", "elvisdiegoo_": "Fantoche globaloide!", "wessss_m805": "All these trump supporters saying it’s fake", "karineferraz0707": "Fake Picture", "aleh20121": "Essa foto é FAKENEWS esta com mentiras menina", "felipe___.ll": "Mareoneta", "lucidsomwome": "Gente, o que importa se a foto é de 10/50 anos atrás? A mensagem que Greta procurou passar é que o fogo da Amazônia afetou e muito o meio ambiente. Além de matar diversos animais e trazer males à saúde de muitos, também destruiu parte das árvores que produzem oxigênio (Amazônia produz cerca de 20% do oxigênio DO MUNDO). O problema no mundo não é a foto, e sim a INFORMAÇÃO! Parem de xinga uma menina de 16 anos que está tentando salvar o mundo enquanto vocês estão desempregados coçando a bunda no sofá e falando bosta na internet.", "emanuelvoos": "Tá pegando fogo bicho", "andrevaliati": "How many trees have you planted during your activism time? Actions are more important than thoughts, honey", "abg1972c": "👌", "arno_42_": "😔 Humans you are so silly 🙏🌎", "pedroviniciusgoveia": "Fuck-you!", "e.s_junior": "Fakeee News.. Haja", "ramonximenesl": "I think the value of your boat could end the hunger of many children in the world", "viniciuspereira_01": "MANIPULADA DO KRL. TU LÁ SE IMPORTA COM A NATUREZA, SÓ É MAIS UMA NO MEIO DE TANTOS FAZENDO DRAMA, MOSTRANDO QUE SE IMPORTA COM A NATUREZA, SENDO QUE SÓ QUER ATENÇÃO E SEGUIDORES.", "pisetssovin": "🙏🙏🙏🙏❤️", "rodoxsami": "Fakenewsssssss rs", "nathingtwo": "I’m guessing mother nature will win", "gabrieleduardoarte": "Fake news", "pipe.cubides": "Subir fotos de selvas quemadas en 1989 es no tener Alma", "jonathasghum2017": "Está foto não é no Brasil 😂😂😂😂", "manugiroux": "GO HOME AND TAKE OF YOUR OWN COUNTRY. You should take care of your own nation and not live on millions of dollars in funding!", "germanzotov": "😧😰🔥", "ale.top02": "😂😂😂😂😂😂😂😂😂", "joaocorrotti": "FAKEEEEEEE NEWSSSSSS", "raju_kryadav": "🙌🙌🙌🙌🙌", "nascimento_viajante": "@luisamell ❤️", "martasabage": "Não bastasse o presidente da França, Macron, espalhar foto de incêndio fakenews, você também garota! Antes de falar do Brasil, vem conhecer o meu País primeiro!!", "derson_w": "🖕", "_alenka_pechova_": "This is scary!", "luisinho_luisao": "🇧🇷🇧🇷❤️", "flavia.vc": "Ei, mana! Antes de querer chamar atenção com teu \"ativismo\" , procure se informar sobre a real situação de nossa #Amazonia , essa foto nem atual é, foto Fake, vcs não cansam de espalhar Fake News. 🤦🏻‍♀️ Cresça, estude, se forme e se informe, comece pelo seu país e depois fale alguma coisa do Brasil. 🤦🏻‍♀️", "suelicoelho.vida": "😭🍃", "belusio": "THIS IS A LIE", "oliveoilxo": "Wild fires are an important part of nature's life cycles", "carlos1gutierrez0": "Foto Fake", "beea_amora": "Acredito que os brasileiros aqui poderiam se decidir sobre a data da foto, não é?", "itsdancingmarina": "🙏🙏🙏", "elizabarreto__": "Tks Greta 🇧🇷💚💚💚💚💚💚💚💚💚", "hernane_rhodrigues": "10 year photography!", "francine.andradee": "Sinto muito😔 #sosamazon", "drigoh_silva": "Fake Caraí", "joeeigo144crystal": "I went to Brazil Aug 27th til Sept 2nd to bring climate changes with my 144 sided atlantean phi #crystals. Combating geoengineering is my passion", "euliahferreira": "Thanks @gretathunberg you is one inspiration", "sodomgmorrhah": "idk she’s annoying.. talking wont do anything", "denisdsantos_": "PICTURE OF 1989 , FAKE NEWS THIS IS A LIE, YOU SHOULD BE ASHAMED 💩💩💩", "goiasagodoi": "Fake News, sem falar que ela fala dados errados da verdadeira situação.", "fabianviergross": "😂😂😂😂😂😂😂 old pictures!", "j.victor0895": "As Elites bilionárias que financiam as suas viagens em veleiros, palestras nas cúpulas mais importantes do mundo, jamais vão abrir mão do seu poder em troca de salvar a natureza. Ela é o agente perfeito, uma adolescente sem experiência da vida e que pode ser facilmente intimidada por essas raposas da elite bilionária. Será que vocês esqueceram que as pessoas que financiam ela são os homens mais ricos do mundo e que por definição são aqueles que mais \"agridem\" a natureza. Ninguém acha isso um pouco contraditório?", "glen.54": "Ups i guess i droped my cigarette there", "ninaclue": "😢", "conexao.brazil": "Foto FAKE", "scrunchmemez": "Imagine not knowing the Amazon burns every couple years 🤡", "diegopiekarski": "you don't know anything about amazonia🇧🇷, plant trees in your home first ... While the press and the supposed intellectuals of the world believe that a 16-year-old Greta can rule the world without study, without experience, without proving herself in life, we are in fact facing a social catastrophe.", "nilson.ferreira.3382": "Bom seria pesquisar antes de posta fake news foto de 1989", "grdtrrsss": "According to my opinion, there the presidents should do something because we can help but the great help would be in the presidents and people with political power", "tacianezamperlini": "#fake 🇧🇷🇧🇷", "anapaulafsilva98": "@gretathunberg Acredite a Amazônia está bem pior que nessa época😫😫😫😫🇧🇷Moro no Pará e sei do que estou falando.", "francielewillig": "💔", "deborah_rafael_": "🇧🇷😭😭🇧🇷😭😭", "quimaswagner": "Não acredito que vieram um monte de brasileiros retardados para ofender a menina, tomem vergonha na cara! E o incrível é ver que são um bando de marmanjos que ficam sentados de braços cruzados sem fazer nada pela natureza e pelo seu próprio país. Deixem de ser acomodados, alienados; parem de ofender pessoas que estão lutando pelos seus direitos e objetivos que acreditam. Lute pelos seus direitos, lute pelo seu país, pela Amazônia, estude, se informe, viva sua vida tentando não ser mais um tosco nesse mundo.", "daniele_giraldez": "Tem fotos lindas da Amazônia atual. Não precisava colocar uma foto de 10 anos atrás.", "jvfontenelle": "Pena que a foto e de 20 anos atrás. Nao condiz com a realidade. Incendios florestais muito maiores estao ocorrendo no planeta, Rússia, Congo, dentre outros com numero muito superiores ao do Brasil. Mas o dinheiro que voce recebe é apenas para falarmal do Brasil. Se manca meninaa..", "danilorocha_gon": "Retardada", "rafa7758": "Imagem FAKE sua louca!!!! Ativista de dos países europeus Capitalistas!!!!!", "luh_skull": "💔", "sheilatomazz_": "Isso é FAKE", "amin.khiabani": "What do you know about pure communication with nature???", "makszaep": "The liberals in Brazil caused the fire.", "juliiabruno": "Quantos comentários de ódio 🤢🤢", "ssallesof": "Sabe de nada essa garota! Se acha a esperança da terra #sóquenão. Essa foto não é no Brasil. E na real, você não está nem aí pra nada.", "thaynara_p10": "Essa foto pode ser velha ou até mesmo não ser do Brasil, mas não muda o fato de ser verdadeiro. Outros estados e principalmente à Amazônia estão devastados de fumaças seja de indústrias, seja de queimadas.", "eo_edna": "horrorizada que os brasileiros vieram jogar ódio para uma menina que está tentando salvar o planeta. Brasileiro é um imbecil mesmo", "valerio.welton": "Essa foto não é no bioma Amazônia e circula desde 2011. 🤦‍♂️", "maria_lucia_helena": "👏🏻👏🏻👏🏻🙏🙏🙏", "elessandro_p": "Você já arrumou seu quarto ? Se não arrumar não vai mais no parquinho 🤭", "orafaelmeira": "Stupid Puppet", "elda.elis5": "Sinceramente, procura um psicólogo. Você é doente.", "alinekfrade": "2004 😘", "abmael_el": "Help!", "abstef": "It still burning!!!!! #sosamazonasbolivia AMYBE THAT PICTURE ISNT FROM NOW, BUT THE REAL ONES ARE WORST @ayudainternacionalparabolivia", "_weslei_soares": "@gretathunberg ❌😂😂😂", "ednna_valente": "Ta sabendo legal viu! Nem estudar vc estuda amadah", "cristian.oliveira.395": "O que você sabe menina idiota?", "vegan_love29": "GO VEGAN!", "brenno1981.2019": "I love 😍 this image FIRE 🔥 FIRE 🔥 FIRE 🔥 FIRE 🔥", "rafirtz": "What do you know about our Amazon🇧🇷, crazy girl?😂", "joilson_s_ferreira": "Retardada !", "bizerra_neto.jpg": "A minha alma tá armada e apontada para a cara do sussego", "phil.1x_": "😔", "julianktr__": "ich zünd hier alles an", "fabnova": "🙏", "marcelomendes3484": "Cuida aí do seu país que aqui o Bolsonaro cuida b 17 2022 kkkkkk", "sanntos_bandeira": "🇧🇷🇧🇷Aqui é Brasil e quem resolve nossos problemas somos nós mesmos, não de palpite do que não sabe e não entende. Foto falsa, procure informações verdadeiras primeiro e depois comente.🇧🇷🇧🇷 Aqui é Bolsonaro and 🇺🇸🇺🇸", "lorenzo_battistinii": "E perché non vai a spegnerla col corpo?", "vicktorpawlickmendes": "Hey darling, I'm so sorry but this picture is from 1989", "pedroandreoti_jpel": "ABC da Amazônia: Pato no tucupi. Comer pato é coisa comum no pará, e o pato no tucupi está sempre na mesa em dias de festa. É considerado o prato que não pode faltar no círio de Nazaré, uma das maiores festas religiosas do país. Existem muitos criadores de pato no Pará, alguns apuram a raça a partir de vários cruzamentos, inclusive com patos selvagens, a carne é escura e firme preparado com vários temperos, o pato é assado cortado em pedaços e mergulhado no tucupi, um caldo amarelo extraído da mandioca, o último toque vem do jambu, planta picante que provoca ligeira dormência na boca e que faz parte de muitas receitas da cozinha paraense.", "weird_struct": "this is TERRORISM!!", "danieljhubert": "Conhece um pátio? Pois vai capinar um e procura ocupa essa tua cabeça em vez de fala tanta m***... Tem nada que ver com o 🇧🇷", "annelisezize": "This photo is old my liro friend", "lili_rose.m": "😭😭😭💔💔💔💔", "rogercadasi": "Doida psicopata", "pris_cintra": "Tadinha a criança não sabe o que diz... essa menina não tem pai e nem mae nao? Aff quanta asneira", "miragesemijoias": "Essa foto não é da Amazônia garotinha. Vá brincar se boneca. Você nem deve conhecer meu país.", "rafaelcoutinho655": "Sua anta juvenil", "ririlopes": "Stupid girl, this picture was taken in 1989. Learn more before to talk shits.", "janavocal": "Era isso que vc kiria Bolsonario uma PESCOTAPA?", "ajlfigueirabr": "I'm sorry, but it's going to do something better, maybe for kids your age who are starving in Africa or poor countries, are you telling me you got your dream stolen? Seriously girl you don't even know what it's like to be poor. Go plant a tree before you want to appear. Another thing the amazon always happens to burn like anywhere in the world. See if it grows first!", "costavcosta": "Missing biology classes gives it, just blunders 😂🤦", "adissonpopo": "💩💩💩💩💩", "repetre": "@gretathunberg 💚🌱💚🇧🇷 #sosamazonia #forabol卐onaro", "lsyl.ldhyb": "😂😢😢😢😢", "leonelsmartins": "This Photo is old....", "mariana_lopes0": "A iniciativa de fazer está postagem foi boa porém está foto nem de agora é", "hectorenriquealvesescalante": "muitas promessas e nenhuma responsabilidade de nossos governantes , muito vergonhoso, estamos perdendo nosso futuro!", "inhaperrone": "Mds", "karl.urquhart": "Greta quit vaping", "codystagmusic": "Not a record amount. But okey", "nanyycristyna": "miga tu virou meme no Brasil,quem veio pelos memes? kkkkk tira os zói do BRASIL,eu hein", "gabrielpimmenta": "😂😂😂😂 alienada e manipulada né", "tonnycoelhosouza": "Foto de 2004 otara", "alinefabricia7": "Mentira dessa mídia e desses líderes que querem implantar a ordem mundial, essa gretathunberg nada mais é do que uma pessoa usada para a manipulação em massa dos jovens da nova geração para com isso se cumprir as agendas dos senhores do mundo", "pablohb80": "Foto velha. Da do ver uma menina tão nova e tão alienada", "lobato_juju": "Coitada, tão alienada a bichinha!", "jonas_22x": "Why should this picture bei fake?", "churly44": "Are you all discussing whether the picture is real or fake? In the meantime amazonia is burning. That's a fact.", "adriele.write": "Minha linda, essa foto é antiga!", "tatyanesalomao": "Vai estudar Greta!", "veniciusjuniorbarbosa": "Kkkkkk, td mundo descobriu o insta da largatinha depois do discurso..", "cauehannouche": "Coitada de vc!!! Cuida do seu país!!! Aqui no Brasil tentaremos lutar contra a poluição porém não e vc quem tem direito sobre nosso País! Está foto e antiga!! Você nem imagina o que acontece aqui, a questão dos incêndios alem de ser causa natural( isso não tem como impedir) agora sobre ter envolvimento de outras pessoas isso os oficiais responsáveis pelo nosso país vai tomar conta! Ninguém quer ouvir vc querendo se achar a DONA do Brasil", "fbrubio": "Doida", "davidmx619": "Cadê a polícia federal pra investigar ela?😹😹😹😹😹pq até agora só quem tá falando mal da Amazônia são os marmita", "sejane.miranda": "Hey, you're WRONG! You don't know about OUR AMAZON! I'm brazilian and I know it! every year, the forest burns, because the climate is dry and hot in this season! You don't know what you're talking about! The world doesn't know what it's talking about! Hey, get on with your country, ok? Leave our Amazon alone! Amazon is from Brazil, no one else!", "cabs.since1978": "O Brasil é soberano!!!", "blogdoricardosantos": "Greta volte para seu país. De nosso país cuidamos nós, povo brasileiro.🇧🇷", "marcelacsic12": "Photo taken in 1989? By American photojournalist Loren McIntyre, who died in 2003. The photograph is available in the paid stock photos Alamy. Soros are not doing their research well to spread lies.", "felixjohannesniehaus": "arme🌏", "elisafailli": "😢", "katieathephotographer_xox": "its wrong", "_mixeli": "shut up!", "papitoinshape": "My gosh,,, it’s a Fake Picture. Be Careful child Don’t be manipulated ! Don’t do it anymore", "supicasena": "@gretathunberg I am totally with you. I love the way you think the way you do stuff the way you are fighting for nature. SAVE THE EARTH!", "jaynagon": "😂 vc ñ mora aqui. E nem sabe o que acontece com o brasil. Sem preconceitos mais para começar aprenda falar em português. É claro como sempre certas organizações tem um interesse em tudo isso né. Propaganda barata. 💚💛", "becca.pinheiro": "FAKE!", "marlon_almeida23": "Fake picture", "catarinacortezi": "Fake News!!", "deiaqsantos37": "Essa foto é antiga! ambientalistas de boutique é o vcs são 😒", "marcelomft": "Bela atriz, a Amazônia é do Brasil cuida da tua vida.", "carlosinsta07": "Poste uma foto real da Amazônia, esse lugar não é a Amazônia!", "tiagogomes079": "Fake Picture.😂🔥🔥", "desativadp_15": "Fakee", "vini_andrade02": "Foto mais falsa q lula inocente 😂😂", "wll_c": "Parece que meus irmãos e irmãs brasileiros estão mais lúcidos do que eu imagina! É, agora uma luz no fundo do túnel é possível enxergar!!! Essa Greta nunca varreu uma calçada nunca fez uma manifestação onde as pessoas saíssem pegando lixo nas ruas da sua cidade só sabem falar e falar cobram de outras pessoas coisas q a sociedade é culpada, se o maior está cheio de lixo é culpa das pessoas não do políticos ou grandes indústrias", "ttha.chris": "È stato quer bastardo de 'n brasiliano fra, l'ho letto sulla provincia", "vinicius.lima96": "Sabe nada de Brasil e quer falar asneira . Vai estudar menina as ONGs estão te manipulando...", "thievaristo": "you need to study more about Brazil, stop sensationalism and fake News!!", "daniel_martins9": "Que palhaçada kkkkkkkk😂😂😂😂", "brunomachado_tjs": "Foto dos anos 90 ? Meu deus , vcs esquerdistas são uma piada", "matty_rispl": "Sus", "taycilima": "@savananm", "laurent_vetillard": "👎👎👎👎👎👎👎", "harryrandhawa2411": "😢😥😢😢😢😢😢😭", "lobo_personall": "Atualiza a foto, kkkkkkkkkkk junto com seus sonhos roubaram a foto atualizada, a nossa Amazônia NUNCA SERÁ DE VOCÊS!", "funco2019": "😢", "faabileao": "Kkkkk aonde você arrumou essa foto? No Google? Mais uma oportunista pra encher o saco.", "nilton25souza": "Manipulated girl, stop posting fake photo.", "silas_vox": "🤣🤣🤣🤣🤣🤣🤣🤣 EU SOU BRASILEIRO. E DIGO: - QUE PALHAÇADA ESSAS MATÉRIAS MENTIROSAS. SERVE APENAS PARA MANOBRA DE MASSAS DE MENTE FRACA", "merimattiola": "Fake", "meyresobreirasilva": "Só agora q estao sabendo de incêndios? Ah vai estudar garota,e para de ser massa de manobra.fhoto fake. #gotrump #gobolsonaro", "claralala_945": "Kalimanta, Indonesia 🇮🇩🇮🇩", "angellatse": "Foto fake. Pesquise melhor as fontes pra n ficar defecando pela boca.", "caio_lifestyle": "This picture is not from Amazon Forest", "pojito_angelotti": "😂😂😂😂", "wrrobert": "Cade seus pais pra te mandar para escola?", "juliocesar.gontijo": "Aqui e Brasil porra vai querer caçar confusão conosco ??🔰🔰🔰🔰", "acfavano": "One more Fake news and fake photo.", "broeringivy": "Foto fake....otaria ..vai estudar antes de postar .", "susa_jazz": "Maybe the pic is not \" real \" of the Amazon but the problem is more than TRUE. It's been 2 months long now and we're still on fire. THIS IS SO SERIOUS GUYS AT LEAST IN MY COUNTRY 🇧🇴", "juniorhalla": "MENINA PESCOTAPA", "firebreak.99": "Burn it Down 👍", "silverioviana": "🤥🤫", "samelaoliveira2": "Tá passando vergonha 😂", "_mcscunha": "🤥🤥🤥🤥🤥", "marcus_sartori": "Passando vergonha. Vai se informar antes de fazer falsidades. O sistema está te comprando mocinha. Os globalistas não sabem mais mentir.", "paulo.silvatr": "FAKE PHOTO ! 😡", "jhowteixeiraa": "🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️", "roseofaria": "#fakephoto", "hcfpaulo": "Fake photo", "gutoribeiro10": "Soros puppet 🤥", "alancfernandes": "Vacilona demais, postand foto fake, bibelô do soros, deprimente", "thomasjones7895": "Photo is not fake it was taken years ago but it is a representation of wat is happening right now,people stop being daft", "cassiesmith597": "👏👏👏👏👏I agree with u", "karina_braga_es": "Fake", "_zio_ste_": "Iett’t pur tu", "fpzohan": "Muito bom ver os brasileiros em massa aqui !!! Nós não vamos nos calar e deixar essa palhaçada continuar !", "peemarques27": "Fake photo !", "angelicaruss0": "Fake or not.. amazon is burning.. thanks for everything you do", "jovairmascarenhas": "Garota otária, fantoche e dissimulada. #GoBolsonaro 🇧🇷🇧🇷", "maiamemachado": "Manipulada que fala né?", "allanfreire": "Photo Fake", "ylordzz": "Garota fantoche é uma alienada, um fantoche que compartilha fak News", "lucasvieira2910": "Fake photo", "natashaludovico": "Think about the progress of pharmacology and medicine, the progress in the treatment of diseases that doesn't have a effective treatment. The help may come from there", "kas_mik": "This so fake", "oiriasf_a": "Essa foto não é da Amazônia.", "pedrohj": "Idiot...this image 2002...🤢", "valentina__1902": "How dumb are the two people how did this BIG fire 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "normeliadeoliveiramota": "💩💩💩💩💩💩", "san__sm": "Photo fake", "rocky_sep30": "😥😥😥😥😥😥", "miqueiasalm": "Ai garota antes de você falar da Amazônia primeiro, habite nela você não é daqui, portanto não tem moral alguma de falar. Todos os anos vemos as mesma quantidades de incêndios causados pelas secas nessa região, e alguns incêndios causados propositalmente por pessoas criminosas. Nos vivemos no Brasil e vemos isso todos os dias. 👉👉🇧🇷 #jairmessiasbolsonaro", "marciadantas1231": "😅😅 Photo fake", "ittz_isaac_2008": "FAKE NEWS PEEPS 👀 @realdonaldtrump", "matheus_ffo": "Fake photo....", "warlesson_jackson.ll_official": "this photo is from 2005 and not from 2019 you posted an old photo you need to know but🙌.", "elenilceoliveira": "👏👏👏", "akita_shivadiva": "😢", "marcio_caetano": "FAKE NEWS", "b_vinicius_d_": "😂", "reginaldocrossfit_move2fit": "Brazilians are burning all elephants, giraffes, penguins, sea lions, whales, hippos, lions, rex dinosaurs, tyrannosaurs, piterodaters and Amazonian Apache Indians 😱😱😱😱 Help !!!!!!", "alejandro_travelenthusiast": "And all for more livestock", "lilianmaedasaraiva": "Save the giraffes of the Amazon!!!", "44dome": "Gut so", "mr.carter0215": "Except when it burns like that it regrows healthier than it was. But hey the cycle of nature is one most green fools don’t understand", "decadentcandybuffetandevents": "This is sooo heartbreaking", "nathaliamatos___": "they doesnt show the everyday fires at news because they dont want to strike bozonaro. Here we are in the hell, much worse than this picture.", "nicolemahoro4874": "😢", "_vitali_morozov_": "😢😢😢😭😭😭😱😱😱", "jsmit_jr": "This didnt age well 😂", "fabyfigue1712": "In Santa Cruz Bolivia is worse, We are also part of the Amazon, the lung of the world and we are devastated, just as in Brazil, President Morales does not allow his own interests", "johnneraaa": "@bruna.garciaaaa está foto é de 1989 rsrsr ela foi pega pela fake news brazilian .", "clavijolucas": "@gretathunberg this photo is from 1989. I think you should start reforesting Europe", "myace0607": "Yea who started this fire?!??", "flaviacrvieira": "😍", "derikpompilio": "Fake News! 😂😂", "thenotoriousconnorclark": "What if it started with a cigarette ?", "slidefilm": "This photo is from 1989, a little google search would be helpful. You’re a hack", "jamieandmike103": "I read they’re starting these fires on purpose to clear land for cow farming..Horrible", "cordless17": "Keep in mind, fire is a part of the earth's cycle. A lot of trees and stuff have to get burned for new ones to grow", "chilomiko": "PERIODT", "erikbernehall": "HaHaHa", "joaobolshaw": "Cara garota, ouça alguém que é do Brasil e já visitou a Amazônia. As queimadas que no momento ocorrem na Amazônia, deve sim ser combatida, porém ela produz o O2 que fica só para ela. Essa queima ocorre por combustão natural, não sei se vc sabe, mas quando vamos á escola todos os dias aprendemos sobre o assunto. Todo ano á Amazônia pega fogo dessa forma ou até pior, sendo um ano onde essas queimadas estão abaixo da média. Perdão se estraguei sua ideias que isso só até acontecendo agora, e se por algum acaso está, que é culpa do Bolsonaro, aprenda uma coisa só fale de um assunto cuja você possua domínio. Eu não tenho domínio para debater um assunto sobre globalização, aquecimento global (que vi uma entrevista ótima que fala sobre o assunto, caso vc veja isso me chama no direct que te envio a entrevista, mas veja com alguém que saiba a sua língua e o português). Tenha um bom dia e uma boa viagem", "lil.maddyy": "We are to smart to know that these aren't just natural disasters, fires dont come out of nowhere... People are starting deforestation. Soon to have more vacational sites possibly in the Amazon?.. why must people harm our world? Our ecosystem, our animals dying, our oceans polluted our polar caps melting... Hurts to know that my children will grow up in a hot burning world. I wish people weren't so evil, I wish everyone prayed enough so God could keep giving individuals like yourself more knowledge to save our planet before the \"not so smart ones\" destroy it! You are an amazing girl @gretathunberg your words are deeply touching!! I hope everyone else who NEEDS to hear you, HEARD YOU!👏🙌❤️❤️❤️ #HelpSaveOurPlanet", "lucinda.slattery": "Yeah I agree", "_sushantgauravnegi_": "😓😓😓😓", "hiuryrabelo": "Fake", "trailblazer0008": "@gretathunberg Them powerful corporations are rumored to be blamed for this. And many other things going on around the world on the whole topic.", "oscarmartins\nVerified": "Verified", "stefanooliveira_": "you destroyed the fudo you had in your country now. come talk shit in the parents of others Go take in the sky Amazonia and Brazil🤫🤫🤫", "andreacarolinamont": "It's amazing what you do to get us to talk about pollution, why the world will we leave to our children and animals.👏👏👏", "_.marinabarros._": "Every year, there are burned here in Brazil!! I'm Brazilian and I don't suffer with.", "joaogabrielsrieger": "The photo is fake.", "thaisinhatop": "Fake news sweetie", "farioff": "Great photo from 1989.", "seb.patterson": "The Amazon is almost the size of the United States no shit there’s going to be a fire somewhere. It’s not all burning 🤦🏼‍♂️", "moonset42": "No money for a SUPERTANKER to put out fires only TRILLIONs for Sanctuary City nonsense. Macron smashing skulls in for the Paris Accords.", "chris_lunardelli": "Precisamos que a Gretathumberg, visite o Brasil 🇧🇷 S.O.S Amazônia", "mexicaboogie": "I hope that all the climate justice activists following will consider analyzing how indigenous people have always been in the frontlines of climate action and continue to be among the most effected by climate change to the point of genocide. These fires are purposefully meant to push the tribes out of their ancestral lands to make way for industries that are tearing us further away from our relationship with Mother Earth.", "ander.pintooliveira": "Essa foto é de 1989😂 ... Isso acontece a décadas e parece q só agora virou notícia! E de onde tiraram essa guria? Criaram mais um personagem pra ludibriar os trouxas!!", "calikid19amg": "earth is burning and no one gives a fuck but us few meng", "jaao_vitor_": "Deixa de onda!! Floresta Amazônica segue firme e forte, vai bem e obrigado!!! Vá recuperar as florestas destruídas na Europa. Lá tem muito o que fazer!!", "unexplainablebanks": "why would they burn down the forest green is very hard to burn. sumi aint right", "67marvell": "😢", "adam_levendig": "Oh that’s right, because of fossil fuels. The boat you’re on is all made with chemicals, plastic, carbon fiber and more synthetic materials.", "finottifelipe": "Fake news little kid", "vesna6245": "😥😥😥", "luh_deschamps": "😭😭😭😭😭😭😭😿", "thrifting.hanger": "As u knw .. Ind danger street now 😭", "matewos_13t3m3": "This photo isn't even taken in 2019", "ariartist": "Same here in Sumatera & Kalimantan, Indonesia", "fanta4live": "That is so fucking right!!!", "_off_luca": "Es ist einfach so sinnlos 😂. Schüler gehen Freitags auf die Straßen zum demonstrieren... Alles schön und gut aber dadurch vernachlässigen sie die Schule 😂also wieder sinnlos 😂sie denkt einfach man könne etwas ändern! Aber auch wenn das passiert die Menschheit hat schon so viel falschgemacht im Leben das das bißchen jetzt auch nichts mehr bringt.", "adeaneberman": "Kids create solutions - ages 8-17 join us at www.digivations.com and www.campdemigod.org - a think tank on climate change and innovation. In our 10th year set in the Cascade Mountains near Seattle, WA. @cpdemigod", "zeduardooo": "Fake News.", "maueluke03": "Fake news, my mom was there August 10th all the locals say that fire happens every year and the news is blowing it way out of proportion to make the president there look bad. It's all politics.", "thomasmuir_": "Actually I just ordered a turnip from amazon", "dearlluz": "🙏🌍💚", "edson_fit": "Fake news not true.", "a_wooden_era": "...birthcontrol...you are the generation I whished you where not here ...selfish lover(s)....", "ferp_justino": "🌍💔", "danitpezzini": "This picture is not from the Amazon forest @gretathunberg PLEASE INFORM YOURSELF", "arthurtupy._": "💚", "gabrielfnsca": "👍😢", "flaviapalmasgarone": "🙏🙏🙏", "zora.stark": "We should all try to safe the earth together step by step I look up to you Greta", "angelaclaudia": "#foraSalles", "rafamatos2": "fake news ! Let’s try to do a better job on getting the facts right instead spreading fake and wrong information!", "derek_1820": "F", "tede1253": "😭😭😭", "safia131": "I agree😌", "socrates_tesla": "🔥", "artjungle_cosmetics": "Save the Amazon! 🌱🌎💚", "vl.1895": "Actually, this photograph is from 1989, and the photographer has already died.", "pat.portela.146": "😭🇧🇷", "961961g": "I hope it burns down", "ingbabe": "Please promote the benefits of veganism Greta, it will benefit the planet 🌎", "andrearubividal": "#SOSAMAZONASBOLIVIA #sosamazonasbolivia🇧🇴🇧🇴", "piet.raw": "Why did you publish a paper book when to create paper thousands of trees must bu cut?", "hopedancho": "You’re aware that nasa actually released a report saying that the amazon burning is 5% below average during their burning season and over 84% of the Amazon is already protected....?", "casadearte.life": "Greta. 🙌", "epoque_inoubliable": "What do you think about Siberia?", "benjaminjamess___": "It’s so sad", "travelmarigold": "#sosamazonia #342amazonia #somosamazonia #prayforamazonia #actfortheamazon", "fff_allesfuersklima": "🔥", "konrad.umgd": "I don't know what you have against this pretty little campfire, it doesn't matter 🤷‍♂️", "josh_x_haro": "Stop pushing fake news the Amazon has fires almost every year the worst fires were actually 2004-2008, the picture you featured is old you can even tell by the quality. Amazon Fire has been debunked as normal.", "pastel_of_kittens": "In class we had to watch a video about this. It was so sad 😭🥺", "cocos_papageienwelt": "Der Mensch muss SOFORT handeln, ändern und Verbote müssen sein. Politik sollte uns Bürgern eigentlich ein Vorbild sein. Jeden Tag wird nur geredet, debattiert, überlegt, angedacht und verschoben. Wirtschaft hin und her, es muss ein Leben ohne all den überflüssigen Komfort geben. Umdenken, verändern, es geht jeden Tag ein Stück Natur und Luft verloren. 😔😔", "srar_wars4645": "Not Good Wood 😢", "morraa_rob3rto": "Puoi andartene a fare in culo", "wellisfranklin": "La foto esta tiene casi su edad 🤣", "mari_22perei": "Sos amazon", "kiko_the_shitzu": "You are the smartest toughest girl I’ve ever heard of you deserve the Presidential Medal of Freedom because you are trying to save the world from all this climate and sea levels rising ❤️❤️❤️❤️❤️❤️❤️❤️❤️", "payntererin": "Go Greta and go vegans🌱🌱🌱 #goingveganisntashardasyouthink", "alabamaauthor": "💙💜🌹🌹🌹💫🍃🍃🍃", "____account.chiuso_____": "“Muoio di caldo” 😂", "daniel_g_pires": "Apparently 70 arsonists started these fires, NASA satellite images showed that this fire is slightly below average compared to the last 15 years.", "boone1baseriffin": "A \"war against nature\" is a very good way to look at it. The thing to remember of course is that we too are part of nature. A war against nature is a war against ourselves! Greed is blinding those who are \"lovers of money\". 🤔🤔🤔", "lau_frontera_": "💔💔💔💔💔💔", "covermeer": "You are right and inspiring👊🏼", "nick.salvi02": "Ma come si fa a fare queste cose?", "marisafarber": "😭", "econewsweekly": "Hey @gretathunberg this is @iamnickrose photo, he’s been doing great work in the amazon! I think you should give him the credit at least ,check his profile", "chiefraoni": "@gretathunberg this is @iamnickrose photo, no credit? :/", "ekaterinapodstreshnaya": "We just must to grow up more plants every year. There are a lot of ways ... even on roofs! The action must be👍🌴🌲🌳", "nino_cangialosi": "It is an old picture, #fakenews", "terezinhaazzi": "@martablanck", "benni2002er": "Yeah", "rogergoudreault": "😢😢😢", "martianembassy": "❤️", "felix.andris": "Beste Leben🔥", "om.icida": "You are blah", "simonrosell03": "Kys", "jm_al_ml": "O governo de Bolsonaro já assinou um tratado pra proteger a Amazônia fica tranquila👍👏", "zeekdouff.of": "@the_joker_900 você e seu perfil fake, mostre a cara!!! Covarde.", "wie_soll_ich_mich_nennen_8": "Amazon fire TV stick :D", "bio_sapiens": "We share this planet with many species. It is our responsibility to protect them, both for their sakes and our own.\" Let's come together to save MOTHER Earth.... @bio_sapiens", "gang_doom": "We dont have a war whit nature unless you are burning barrels of oil on a daly basis", "8102luuuuuu": "😘👍🏼❤️", "irissalama": "sadly also in africa and russia large parts of forrests burns. Why all this fire? Because some few large mega companies will make money, after all trees gone.,please be my voise, we must stop wars and corruption, them will kill everything, this is MY fear", "hungarianlotus": "depressed over this", "tens_els_ulls_molt_bonics": "Time to bring those responsible for the fire to some kind of international court (UN?): murder of our civilization? Would that be possible? How would that work?", "talesd.miletto": "Post, image a bit (very) exaggerated and isteric, but I agree that the planet needs more environmental awareness, and sócio environmental projects to be realized, yesss 💚🌿🌌", "mussolinis_meme_mansion": "I'm happy, that I go now to McDonalds! I Love it!", "clemenswitzel": "HAHAHAHHAHAHA", "fridowart": "Åh du Holy Shit", "munniata": "There is not any record broken! The forest fires declines every year... don't trust what macron/Rotschilds report in their owned media.", "d.iavarone05": "😢", "wahlbor": "We live under separation of so many things that we find it hard to look at ourselves from another view. our vision is just over but we are living in the moment. we are wonderful. we do a lot with help. It is helpful if we realize that we only came to the world through help and grew up. but who determines when we no longer need this help. when are we out of the rough. probably never and eventually missing leaders and we are seduced. We still believe blindly even if we deny it. because we are like a vessel and it fills us in the auserhalben. and then we fill that out from us was entered. for ourselves and for others. but the source can be poisoned", "verito.g2009": "En una guerra Greta hay dos rivales que se combaten para derribar más rápido a otro.Y sin embargo la naturaleza lo único que hace es brindar recursos y belleza al ser humano.El ser humano está en guerra contra sí mismom", "antoniobressan_": "This is old photo", "dataddguy": "The photographer that took this photo has died 2003, how are famous people re-posting this image it's at least 20 damn years old", "valcrocevalpo": "Here in Chile, we wait for you Greta. On tv are giving the news that, this fire was caused by “fazendeiros” Brazilians landowners, there are men arrested, but the damage is already very serius", "camachoocoy": "👏👏👏👏👏👏👏", "mlte_coffee": "I like to see the rainforest run off", "daltoealisson": "You should post about, Fires in Angola and Congo outnumber those in the Amazon.", "krissingh121": "The Amazon burning was a result if the Brazilian goverment. This was not due to climate change. The Brazilian goverment sould be dealt with severely", "haanaveale": "This is terrible 💔 the Brazilian government was offered 20 mil from European countries, but they felt insulted by the French government so declined help 🤬😡", "pudelgeorgie": "You’re sooo right!", "stellasandahl": "We have hope❤️🙌", "fatinlearmont": "@airam_downunder che ci fai qua?", "td.taz": "@fabiischefer tscho Kollege banja wieder ausser kontrole geraten?", "geoide_ar": "In time of “Amazonia burning” have you ever thought that instead to fight and argue to defend your ideas and perspectives we could to act to defend the Earth? Passing from victims to protagonist of the situation, taking on hand the responsabilty to change the scenario. Do you wanna to know how? In IG we are 1000 millon of active users. So I challenge you to plant a tree for Amazonia this Sunday and challeger a friend. Could we reache 1000 million trees planted? September 1st pray and plant a tree for the planet. I accept the challenge! . What about you @gretathunberg ?", "se.bastian3919": "😭", "_tb.sosa_": "Greta nn scherzare porca din quella stai calma", "jeanjunior_oficial": "This is a old pic", "karinavatrano": "This madness must end. Greta genius !!!! ❤️👏", "monde_du_climat": "😭😭😭😭😭😭😭😭😭😭😭😭", "elliemartin._xoxo": "🙏🏻🙏🏻🙏🏻 So inspirational 🙏🏻🙏🏻🙏🏻", "hannah_telluselle": "It's not a war against nature, at all. Probably not a human setting it on fire, but dry land and a lightning. In fact, it might rather be nature (or God) striking back at humans if so, if we are too many or exploit it too much. I think of it as men raping Mother Earth in a greater sense and symbolically, which is called Eco-Feminism.", "roh_36": "What a sensational girl. Admirable!", "josephguerois": "😭😭", "francu.lucian": "Ein großes Verbrechen!!!! G7 sind die Hälfte am Tisch gesessen und außer um Profit ging es nicht. Das ist nicht Akzeptabel. Thanks 🙏 are you are Fighter for this 🌍", "aleweilerpaule": "wtf a record. In comparison to the last 15 years, fires are below average in this year and in Paraguay garden remains are being burned and that is then displayed to them so big", "tamy.latuf": "Thanks for sharing ❤️ you're amazing!", "pelas_minorias_": "👏👏💚🇧🇷🙏🙏🙏🙏🙏🙏🙏", "lenahms": "Nos, estamos, como sempre combatendo os incêndios florestais, que por causa da seca, nos assola todos os anos e o meu Presidente, Jair Messias Bolsonaro, esta a frente desse combate, sem precisar vender nada. O Meu Presidente é um administrador competente e temente a Deus, e por nenhum motivo pode ser tratado como \"o causador \" desse desastre ambiental e por isso, esta tomando todas medidas cabiveis para essa situação. E nós Brasileiros não aceitamos nenhuma proposta de compra e venda da nossa Amazônia!", "dsprince156": "The rainforest consumes it's own oxygen. It regrows every year. #fakenews", "djentlemaxx": "#atwa", "katrz2458": "🙏🙏", "mister_thomas_mama_fit": "BOLIVIA😢 🇧🇴 😩🔥😔🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥#soschiquitania 💔😢", "laga530": "This photo is from years ago.", "sofia.farias": "@mariaclara.cg", "mindflayeed": "Go diesel, thats the only way to stop this!", "ufomonique": "😭😭😭", "joaocotrim_2": "No time for words, #ClimateActionNow dear @gretathunberg 💪🙏🌍🌻🍀", "claudiasotocatalan": "😥", "laastri": "• Humane Society International, • Forska utan djurförsök, • World Animal Protection, • Kattkommando Syd, • Djurens Rätt. Om du VILL samt är sparsam (och ändå tjänar mindre än genomsnittet) så har du råd med att skänka pengar varje månad! 🐟🐬🐋🐅🐆🦓🐪🦍🦒🦙🐈🦜🕊🐇🐀🐿🎄☘️", "panteahighjumper1111": "🙏❤️", "enslagsverklighet": "😭", "j.ortegaofficial_": "This photo was taken in 1989 and the autor died in 2003 ☹️ stop this fake!!", "mirrowed_world": "Everyone is affected if our planet dies", "cornelis_svardh": "let it burn", "claralea_franceschi": "😔😟", "guerreiros.da.amazonia": "😢", "theteacherphil": "The Brazilian govt will now accept g7 money but only if they can spend it how and on what they like. Bawhawhaw", "lenam.wik": "So sad so sad😢😡", "eder_limaz8": "Fake", "wr202531": "🔥🔥🔥🔥😢😢😢😢😢😢", "lucianabernardo": "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷❤️❤️❤️ @gretathunberg", "christopherjimenezcabezas": "So much animal land destroyed and the amount of animals died killed in this fires are a disgrace shows profit to some people is more important than our eco system profit more important than air we breath in profit more important than the animals lives and homes the worlds people and governments all need to pressure the Brazilian government to end this madness and murder of an eco systen and murder of animals and there home land", "estrelitastan0305": "😪", "lindcarvalho": "😢😢😢😢🙌🙌🙌🙌🙌🙌", "marcia.fontenla": "This photo isn’t from Amazônia! Be careful to share!", "jpcrozera": "😥", "roeseler_": "I See fire, burning the trees...smaug is coming 🤟😂", "soec1990": "Bolivia is burning! The Amazon is burning! We need internacional help now!", "jorgirodrigues": "Salve! salve! salve! 🌎 🙌🙌🙌", "ugo.baroni": "#PrayforAmazonia 💚", "alainceleno": "désastre", "viktor_dahlberg_": "I’d really enjoy a steak rn not gotta lie", "fernando_simonides": "The phono is FAKE NEWS!", "rojashamsart": "And the fires were started deliberately to clear land for livestock. The meat industry is killing the planet in all forms.", "caiobresson": "😢😢😢", "wesleyfernandesbraz": "Aqui é o #Brasil filha e ninguém encosta a mão aqui ok. Beijos e sussesso aí na sua corrida🇧🇷🇧🇷🇧🇷. @jairmessiasbolsonaro meu presidente", "marciabetimdemby": "This is not realy! You do need read more about. Please! 😘", "leonard_hanisch": "Der Regenwaldbrand kickt genauso wie bestimmte Krankheiten😰🌞", "suddender": "Our war against Nature must end. Governments keep approving the burning of forests to make land for agriculture and other developments, but we can’t keep going at it forever !!!!!", "sxfia._bns": "Yeah in my opinion not just Brazil should decide about the Amazon rainforest!!!", "conniemurga": "👏🏻👏🏻👏🏻👏🏻👏🏻", "juanjosereyestobar4": "🌎🐍🐼🐧🐘🐗🐖🐨🐒🐷🐵🐸🐆🐟🐋🐳🐊🐪🐫🐻🐯🐢🐦🐥🐹🐇🐏🐑🐰🐓🐐🐺🐔🐀🐁🐣🐃🐂🐤🐭🐜🐛🐌🐬🐚🐙🐉🐲🐡🐠🐝🐞🌳🌲🌱🌴🌳🌵🌳🍀🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥💥", "vandriaborari": "#f4f", "laadykaate": "this is a stock photo - not a photo of the Amazon currently burning", "matsjohnsson_": "Idiot it’s an old photo. Get your shit straight.", "chkrl_": "Oof my rainforest in my Minecraft world is burning too😂😂 @_tim_ko_", "melanie3455": "🔥🔥🔥😢💧💧💧", "zilmamede": "🙏🙏🙏🙏🙏🙏🙏🙏🙏misericórdia !!!!!!!", "dehokida": "💚💚💚💚💚", "momearthisboss": "💔💔💔💔", "soledaddelreal": "This is terrible. We humans are the real evil in the World. I feel very sad for my children... Living in this suffering planet. I hope they change this. I try to teach them but I know I could do more. We are with you niña hermosa!!!!", "wiebke.andren": "😢", "ofc.frida": "😭😢", "laylaannalee\nVerified": "Verified", "eldalinda": "Old pics! 1989", "nils8949": "Dear Greta. You are sailing to US because of rhe climate. Thats good, but Do You know, that 5 people is flying to US only to sail the ship back...😂", "_vision_of_gideon_": "Go vegan", "eleonora_soranno": "💪😞", "rubentorres.br": "😥💔", "millevidemy": "😍😍😍😍😍😍", "marsanroby": "Stop iit...!!! At the devastatiing fires in the Amazon, enough!!!Now...!!! A lot dangerous for the \"planet earth\"...😢", "gerrit.7.2": "This picture has been taken from Loren McIntyre who died 2003. U allright? @gretathunberg", "sxlina1234": "Ein junges Mädchen kann mehr bewirken als alle Politiker. Ich bin stolz wenigstens eine die sich so einsetzt für uns damit die Menschheit nicht stirbt!..", "lukathedu.ke": "😢", "lourdespaz86": "My country is burning💔 our presidente its doing NOTHING 💔#sosbolivia🇧🇴", "1234567890xparty": "Keiner kann das Klima mehr retten solange es Menschen gibt, die den Hals nicht voll kriegen!!!", "lauraviza": "Hi! Can you please read my message?", "srtnckmk1903": "#kazdaglarinadokunma #🇹🇷🦅", "cottagemarketvng": "😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔 terrible !!!!!!!!", "bernameister": "Yes! Please be the voice of reason and change for the animals... and obviously the planet. 💗", "keith.roy": "Just as a foot note, the press and media here are somewhat biased in one direction. Peoe that have followed some major News Media have dropped the program's like a hot brick. Shocked at the sudden changes in direction. Every one here suffers the confusion of change.", "insegreto_chat": "Page appena aperta su insegreto date un occhiata road to 1k", "klauscoimbra": "#sosbolivia🇧🇴 🔥", "piiet83": "I Hope you Burn down🔥🔥🔥 Fuckin Alien.", "angelocuomo1904": "A post on instagram,what a useful thing to do to stop the fire", "normando__neto": "Fake", "caiofurlanlucas": "This is partial fake! ONG’s taking criminal fire against forest and people. There are articles in the journal about that, on thes week! The amazon belongs to Brazil! So, just take care of your old and devastated home!", "mariya_xrt": "Please not Friday for Future in one day but for 5 days! School doesn't matter if we have no future where we can share and live this knowledge. Politicians need pressure to make real and rapid change happen.", "lourdes_lou_pe": "Hello Greta, it would help to make a worldwide campaign of not eating meat for 1 day or 3 of not eating any meat as a protexta, so we help the Amazon!", "klimawandel_stoppen": "🔥😭😭😭😭🔥", "glynniesplants": "We need to start doing our homework and not buy products with palm oil in them", "leighemersonsmith": "😢😢😢", "smithkimbo": "We have to push all GOVERNMENTS to stop talking 🙊 and spend money 💰 to help with CLIMATE Change ONLY but now we have@to push even further for all Governments to spend money to replant hundreds of thousands of new forest 🌳 trees 🌲 all through the #savetheamazon the main LUNGS to MOTHER EARTH 🌍 or our future children don’t have a future 👎👎👎👎👎👎👎👎👎👎", "underlea.correa": "@gretathunberg here in Brazil Agrobusiness and agribusiness and farmersbusiness are burning Amazon to crow cow and crow soya, corn.. Dende to biogás 😭 they have been burning Amazon for over 20 years", "_valry": "La tua grande cura attenzione e devozione è denotata dal fatto che queste sono foto di anni fa. Top, continua così 👌🏻👏🏻😂", "lindaaidaho": "💔💔🖤", "lizpimentelgopal": "we love you Greta", "andre9630": "😶😶😶"}