{"willwordlyairborne": "Is that a key made from rare metals gained from mining operations that disturd the natural ecosystems? The zipper on your hoodie plastic? made from oil?", "getoutalive04": "K", "h84annah": "You totally deserve this! ♥️", "shqiptarjaezeze": "I'm from Montreal and I don't even know who this girl is. What has she done exactly? She must have gain clout for going against a politician. Otherwise I don't see what this kid could do to be the flavour of the day", "alex___ch": "Why are you writing on paper? Do you know how many trees were destroyed for her ?!", "nekolaevaelena": "Ой дураааа! Ебнутая", "smamancio": "🤮🤮💚🤢💩🤮", "jeanmarclangley": "Politician scam", "tbalpm": "Franchement, ça va lui servir à quoi d'avoir cette pauvre clés 😂😂😂", "juanlg.03": "@pabloaguilargomez11 la grandiosa greta escribiendo en un folio, es que no le importa que talen árboles, que verguenza", "ian.ost21": "Lach doch mal dummes blach", "n.shaura": "Ur tshirt looks like my school uniform", "29deryadeniz_": "Son şöhret meraklısı :d", "lilianeearruda": "Essa carinha não me engana...né @gretathunberg ??", "fernandasilvalemos": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "juliana.mendesnunes": "👏👏", "sawyercovey": "Wait are those actual keys or just used as signification for something good", "theunknownscientist": "Why the fuck did she do that", "the_unpublished_writer": "Awesome 🙏", "401roland": "👏👏👏👏👏👏👏👏👏👏👏", "ourdailygrind_12": "Evil comes in many forms", "phil.holt_18": "Lach nicht", "lindomk3": "What joke", "roligt08": "So she used you as a tool for some political points.", "180sxforpaul": "PAPER!!!! NO GRETA THE TREE!!!!!", "chmutuverria": "👏👏👏👏👏👏👏👏🌷👑🌷", "mikazahome": "❤️🇨🇦🦋", "meisicewall": "could you be anymore ugly... @gretathunberg", "durka.yebat": "I wanna tell her that paper made from trees", "carla_touza_2.007": "Very good 👍👌😊 perfect", "solalhc": "👏", "koutsss__": "But she didn’t do anything important to deserve this", "acamargo8712": "Puro show... Ponte a sembrar árboles y a evitar menos la contaminación de empresas", "bradenbali": "Lmao what does it unlock doe", "_marky__mark__": "Nice spelling, maybe your missing school lol", "fernando_de_barros_grejo": "Greta Grazie 💙♥", "dontcallmedom501": "We should be supporting people who actually do shit to stop climate change, not just whine and complain about it .", "queenlylee1": "You’re welcome everywhere! 💓", "john.marie.98622": "Intensif‡l'effort extensif photo extraordinaire Les femmes le travail incarnee par des hommes peut-etre valeurs feminines#.college....sa scolarite.ouverture sur le MONDE.2019.crise.de jeunes.formation reconnaissance.amis", "mr.stringhead": "You go girl! We need more people like you in the world!!", "fart_squad018": "🤡🤡", "baim7777": "Ur producer?", "hasslehoff785": "Instead of doing nothing but talking and marching why not put action behind your words? All those people at your marches and protests could pick up a sappling and shovel and plant some trees? Pick up your garbage after the marches? We've all seen the trash left behind🤦‍♂️", "lorin_3110": "🤢", "____keven_____": "Hmmmmmmm 🎣🧐🤩", "frothy_0": "Ok biomer", "ivycinnamon": "That is ridiculous", "daniel123272727": "Wow that\"s hudge you\"re worth it ye you are💞💞💞💞💞", "anton.h.k": "The pen is dare you", "altinka92": "What for?? 🤔", "martynaa.grl": "💋", "paul_byrne_hockey96": "That smile looks lile she just shit Jersey pants the second it was taken", "christian.vargiuu": "Quanta carta sprecata👏👏👏👏@gretathunberg", "geiles_schwein_____": "Just die", "liam_clancy1": "Is she ur mom", "_aiizen_": "Calice de crisse...", "z_passionfruit": "@gretathunberg please speak to Trudeau about the clean water crisis in Canadian indigenous communities 💔", "giorgia.de_stefanis": "Che cazzo stai arescrive", "valentinaamariia": "Ce urata esti", "ashley_diaz1": "All because of a script", "goodvision_prod": "@hally.wo pk la figui dla mamzelle es marré kon sa pam😈😭😭 ??", "england147": "@annacarolabarbie Putin even knows climate change is for real. He is implementing programs to combat climate change. The Russian Dictator is smarter than the American dictator.", "_berkay_29_": "You stoling my child", "alex.davis.4": "L", "wren_wolf_stag": "Welcome to Canada Love", "clairerackham1234": "I bet she’s hoping one of these countries will give her a green card at some point. #ridiculousness", "marocainsalah": "Fuck you", "k.bowman1121": "WOW SO MONTREALS GOT A WOMAN RUNNING THAT CITY???? PATHETIC", "minley._": "Is that contract book made of recyclable paper?", "gesteeldememes": "Why the fuck did she get this", "cricco_zzo": "Troiona", "usmxnn_1": "How dare you! How dare you Use paper! Think about those poor trees! CLIMATE CHANGE IS REAL! @m.hejazyy", "cain03._": "How the fuck are you 16. You look 7", "vandyjiujitsu": "Hello Gretta, I would like your help to save our Brazil! Venezuela spilled a huge amount of oil on our northeastern beaches and as you can see no NGOs nor activists are helping us clean our beaches please !!! Come help us save our planet!🌎🐟🐳🐠🐡🌴🌳🌱", "giesela_the_vizsla": "I didn’t know Montreal was 100% solar and wind powered", "a_abuhajar": "Don’t worry, she’s climbing her way to Nobel prize😂😂", "wu.tang.mariee": "Hab schon die ganze Zeit meinen Haus Schlüssel gesucht", "kadir_sygn": "🇹🇷", "thetriza": "😂😂😂", "grantwright24": "N", "bastard.vibes_": "💕💝", "szergejevna_o": "For what???😢", "a.k.g____": "love you for you and what you believe in ps come to westcoast", "opizwiesel": "Hello Miss attention eater.", "umbertocarniel": "😮😮", "lucas.0310_": "❤️", "h.evans4": "Shuuuuuuuush", "heavenkaaya07": "But why", "charlottebowles_": "She’s back in school🤭", "nicolas_valdes23": "Go to school mate", "_sara_marchione_": "🙌😍", "1990andrea1990": "@angy_kyar il sorriso di quando prenderai un 6 in storia🤭", "lu.igi3195": "U become the key of ur room congrats😁😁", "eric_rider211": "ALLE DEABONNIEREN KAPPA 😂", "nerdian_und_german_empire_ball": "SUB BOT", "fatosbruka": "@shpatielezi Daje Shpati, kur do na japesh celesin per Gradecin😂😘❤️? @drini_d_elezi @mata.emin", "henry3174": "@sai_shashanka they give their keys to anyome tho", "aliyahchecks": "Bitches be tryna make a difference in the world being powerful n shit OK", "jirkaptacek666": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🖕🖕🖕🖕🖕🖕", "comradeprolet": "That thing is going to be useless in several decades", "muyayolok0fisial": "Es fea de cojones :v", "pao.loll": "e che cazzo inquini con quella carta!", "julioo_hrl": "Greta Soros we call you, keep sucking jews’ dick until the Amazon still burns and you are sleeping in your dad’s mansion in Sweden, nice done Greta", "unofficial_russian_ball": "Is it just me who dosent know who she is? :V", "caseyts64": "What the fuck is that face 😂", "alecwillems": "Those paper is from a fucking tree. I can not bele", "chiara_scarpa_07": "💪💪💪", "mert_x10": "How dare you 😂", "satan.gupta": "@_kumkum_x.x Junglee kutiya ko dekh😂", "n_i.k_i_": "Congratulations!!", "troll_chef": "Don’t care idiot", "phoebe.jennings": "Woahhhh that is such an honour. I’m so proud of you and what you’re doing", "mark.okami": "This world becomes crazy....", "r_j_p_d": "Why tho, why are we rewarding brats for complaining?", "jp_cardin": "You are a meme", "slattyshake": "Ma vaffanculo scema", "erykmalerba": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 NO", "aj.ace.16": "She's taking a shit in the second picture", "rickeyholland05": "Please stop posting it hurts to so then", "thenewshirtorder": "Why? What earned you this?", "berni_illibauer": "🤢🤢🤢", "_bb.9_": "Shibal kesekia 🤮👍🏼", "danaxomega": "all you do for the world is bitch and moan do something actually productive", "millegoldstar": "THAT KEY MEANS NOTHING! YOU WILL GET NOTHING IN THE END!!!! YOU LOSE!!!!", "sahalmaymon": "That's the key for now BUT* they will give you the lock afterwards to SHUT YOUR MOUTH!!!!", "cihan2135.iz": "Fuck That you talking shit a", "philippvfx": "A Key is not going to Save The World Tho.", "tyra225325": "wow what a wonderful key that completely means nothing and do not help the environment getting better!", "rebeccaferlemann0": "Great girl 👍", "kaden.mcintosh1": "is that michelle obama", "juli3tttt3_": "😳", "cadie_leigh123": "Boooo", "alex_mannist0": "IS THAT PLASTIC ON THAT PEN I SEE", "papa_stout": "Dont feel to special that mayor is an idiot", "__francypelle__": "It's bad you're ❤️", "andreasnk1": "But can it open my bathroom door? Science will never know the answer", "d.a.n.i_75_morton": "How much paper r u wasting??", "only.ayleen": "@n_oezen76", "granadaamor": "Beacause YOU ARE WORTH IT ♥️🎶♥️", "kcmo_luke": "Gross", "xxtdevinxx": "Is that a recyclable/bio-degradable key Greta?", "_edizar": "👁", "evagreg": "You would have put yourself in debt. She did not create the issues, but is creating awareness so the adults get their acts together to do something. You sound like a very sad person. Hopefully you find joy and can add value to the world like Greta is doing.", "smells_like_upgamer": "Fuck you", "nigelmascarenhas": "@gretathunberg u didnt do anything special ...Ur speeches don't change anything...action does! Go Back To School", "themexicanfarmer": "The key to solve climate change, time to make a change 😎", "wessex__bretwalda": "Muh banks need saving Goys", "mka._.16": "Wtf", "obstacleswithbliss": "Democrats using a child to speak to brainwash Americans. Kinda reminds me like Hitler did.", "spoiledsoul_96": "Great actor, unable to answer the questions without a script.", "aspiadolecente": "I liked animals", "wdowszykrash": "Retarded kid", "rainbowbliss321": "schools destroy the lives of kids end schools schools are torture and produce trauma to induce the system on kids minds end schools now we don't need schools and teachers we can learn by ourselves and be together the same end schools now kids can't spend life time forced to be closed in schools schools make kids grow to be haters schools system ruined the environment", "banksson.se": "👌🏿", "tm.nfld": "🤦‍♂️", "d_o_0rr": "Wow", "dxddys__lil__alien": "you look like you're about to shoot up a school", "tudor000002": "she was telling her she signed in the wrong place XDD", "risque_1984": "Semi literate self promoting clown, in a world full of overrated idiots, you are certainly the most overrated irritating person.", "ummet_97": "Neggah im scared when i see her face", "ansh_officialpage3": "I've heard your reading speech, actually it shouldn't be called as speech, just reading written paper, if you really had feelings for nature then you didn't have read, you could just say it from your heart, well i enjoyed your drama though 🤣🤣🤣", "patrycja5474": "You Look like a 6 year old hamster 🐹", "mukimuki64": "Enligt IPCC smälter den antarktiska isarken inte vid tillräckligt låg temperatur utan snarare ökar snöfall, så dess produktion ökar.", "yanelvis_boutique": "Just stunning!", "ao_horie_chan": "KKKKKKKKKKKKKKKKKKKKK OMG, SOMEBODY STOP THIS GIRL! LKKKKKK", "realgeorgesc": "I got the key to local much better than the key to some terrorist cuntry", "lopezgabbriel9000": "🤡", "matissegravel": "On dirait mr.craquepout", "melisana7": "Easy, omen", "hash.info": "GRETA YOUR A BOSS IM CANADIAN I WISH I COULD YEL AT GOVERNMENTS TOO SHANE ON THEM FOR PUTTING US IN THIS PLACE IT IS WHO SHOULD GOVERN THEM!!❤️❤️", "_b_e_n__b": "fuck you retard", "vanxedaman": "Canada tho", "love_kobe.and.gigi": "#klimatet", "kolgallery": "Keep your smile", "flat_earth9000": "Gets a award for nothing", "lnm__gabriel": "Bête type", "kepenek.daniel": "vittus autist", "patrissia26": "En serio? Haciéndose la victima? #givemeabreak", "_l.btts_045": "Ok", "sigmundharmsen_private": "''psst, if you cry on tv, people will totally eat that shit up, my child''", "dj_mec_magic": "Stupid brain washed little girl who nose nothing about climate change", "leanannas": "@nanie_vlln on a raté greta", "christoffer_larsen_": "🤡", "filippocrestan_": "Spero che Dalbosco ti porti nel bosco o in Amazzonia", "s1monsln": "This is wful she has less follower tan u", "celestevangreuningen": "We can’t do things about CLIMATE change.", "xanderput": "💩💩💩💩💩💩💩💩💩", "mjn.media": "She whisper some more bullshit propaganda?", "vince._.ll16": "Ta veste elle pollu ds les usine", "nikitabogdanov._.nb": "The key IS FUCKING MADE OF IRON, A FUCKING FOSSIL FUEL!!! How come it’s not a fucking disaster for you? 🤡", "harrynicholas.ptyltd": "How dare you use a timber table and timber chair. They once belonged to a tree", "leah.s.p": "h o w d a r e u", "nick__bowman32": "Will you do the hip flip? @nardwuar", "witeoutgrl": "Lmao for what u did nothing", "_ggtm.tony_": "Well guess what I got the key to my house", "persianboy_99": "Yo lo máximo que conseguí a los 16 es que mis padres me compraran la play claro tenía infancia ...Gracias a Dios ...", "jamie_s_margolin\nVerified": "Verified", "franksi67": "https://youtu.be/0R61PCAlBEU wake up people shes fake", "_xfarukx_": "Nie piç piç gülüyo bu oç🇹🇷", "nailbender3.0": "Political puppet @gretathunberg #politicalpuppet", "luisvivente": "Follow the FRUITS OF THE AMAZON profile, they will really do something good for climate changes! Go there to know! @fruitsoftheamazon #climatechange #rainforest #amazonia", "samuelsotoc22": "du måste sluta drama, du är falsa profet", "malcom.m69": "Fuck you libtard", "mihai_iosif": "Guarda che i bottoni sono fatti di plastica", "victoria_strangexx": "Be our president queen 😍", "lau_ecomom": "@aleatotorio", "karineperreault": "We, Québécois, were the ones honored by your presence in Montreal. Thank you for your passion, convictions, and actions!", "pauladguezm": "You are awesome, a hero your saving us of the climate change and making our world better with your words and energy. Thanks for everything ❤️❤️❤️", "liambailey_05": "U look RETARTED", "kayla_fashion_designer": "Well done keep fighting for our world", "knoopers._10.9": "Was eine Schande", "shalashaska": "♿♿♿♿♿♿♿♿♿", "shahalam.20": "No offence but paper by tree😑", "patbr70": "Our mayor is a bitch. We'll change lock so you can't come back!", "bierry_thaudet": "val_plante: hey did you hear about that chipmunk meme? greta: ofc hihihi val_plante: hihi", "steven.142": "Fett snygg", "rezaaliharsini": "🤮🤮🤮🤮🤮🤮🤮🤮🤮", "jakec.556": "Coached and exploited gotta love it", "trvppedro199x": "Give that give to someone who actually did something for Montreal @subbanator", "sipanahmed_": "Fuck u", "fynn.a.b.t": "Dienstag for Diesel", "a_terruzzi": "Fabbricare quella chiave ha inquinato", "somistowner": "THEY CANT BELIEVE HOW GULLIBLE THE PEOPLE OF THE WORLD HAVE BECOME THEY ARE LAUGHING ALL THE WAY TO THE BANK ..BACKED BY GEORGE SOROS AND THE REST OF THE TRASH ITS A HUGGGE LIE AND A SCAM TO KEEP TAXING US ..AS IF THROWING MONEY AT THERE POCKET BOOKS WILL SOLVE IT ..GRETAS HANDLERS ARE TIED TO SOROS 💯💯💯💯💯💯", "felixgrepo": "How many dick dick you suck for that?", "alycia_rdrgs": "Congrats 👏🌱🌍", "freefeather": "YOU ARE LOVED AND APPRECIATED @gretathunberg 🙌🌹😍✨💜🙏😘!!!!!!!", "charleyrhiannonwarburton22": "I'd just like to say congratulations! , You have made it your impact has hit the world , if it wasn't for U no one would listen. My whole life I've been trying to get the same message across to friends and family , but you have actually spread the word that the world needs are help ... Now I'm 15 years old and I hope one day we can meet and hopefully I could help you one day too ,your my inspiration and I admire everything you have done keep it up girl your a winner !!!!!! Xxx♥️♥️♥️", "kasish1448": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "fernandotorres7": "You havent done anything. All you did was give an over dramatic speech. Make a non profit organization and plant some fucking trees. Words doesnt fix the earth. Action do. So. You HAVENT DONE ANYTHING", "7adrian_pinggera7": "How dare you 😂😂😂😂", "cry65ssy": "Congratulations from Italy👏🏻👏🏻👏🏻👏🏻", "thijs__n": "You go with a airplane you little kid", "sahar__qaisi": "#Hello_worlds_there_are_people #making_revolution_now_in #iraq_show_your_support_for #right_of_iraqi_people_to #protest_peacefully ⁦‪#save_the_lraqi_people", "dularashadow": "Ok she is in my city", "patriciagordin": "@tacianamarciano quem lembra?", "adriankonopczak": "🤡", "saieexlovie": "So beautiful and many congratulations to you and your family I am from India and I am so proud of you you are doing great work and I am and billions of girl are inspiring from you are so good and you deserve it 😄💓💓💓", "theofficialjosueflores": "Congratulations!!! 🎉🎊👏🏼👏🏼👏🏼👏🏼⭐️🌟", "rochet_liam": "You don’t deserve that at all jerk", "graysen_taonui": "What are you actually doing about the problem?", "josefinvestberg": "In Greta, we trust", "platonicpaint": "For what ...", "shalbek_1984": "👍", "che_76lillac": "Tiohtià:ke = Montréal", "jonno_fullerton": "Fu bitch", "spyros_souranis": "Ok so what did you do for it", "just_the_t1ff": "You're all noise and no action. Why should the older generation listen to you? You don't even go to school and have an education.", "christinaelisch": "CONGRATULATIONS, Greta and All The Luck to you in Canada! 😀💥", "maxim.schuster": "#antichrist", "gismotiker": "OK, where for now truant for school and vacation on the other side of the sea?", "samibrx99": "Esta niñata va a ser quien acabe con nuestro mundo🤡🤡", "planespotter_hkg": "Use #awakegretathunberg in your aviation posts to stand for the aviation community if you DONT agree with @gretathunberg !!", "thatguyonthenet": "Gets a key for no reason okay...", "virtual.australian.defence": "🤡", "_roy_kang": "Ur dumb", "this_guy9955": "Greta are you aware of how much money Quebec knowingly excepts and takes from the oilsands every month that mayor is a hypocrite", "vicentefmba": "❤️", "thepunkbackdoor": "Be strong✊", "elias.hagstrom22": "Din lilla orre", "s_paskey": "congrats you just won a lifelong trip to the kitchen", "_solin.n": "I'm suing someone, why did I not get a key. 😂😕🥴🤣", "felix.commit": "How dare you", "lifewith_zephyr": "Amazing!! 😍❤️ That's the best honour 🙌", "ryanroepkee": "🤡🤡🤡", "pxtr._.blxhx": "🤢🤢🤢🤢🤢", "tesone7": "ma statte zitta e pensa de anna a scuola porco dio", "ninacozzoli": "♥️♥️😘😘", "iarafoschino": "This is the best ! 🙏❤️❤️❤️", "ralfkanitz": "Vai receber a chave da cidade em Caracas que eu quero ver!! Marionete de milionário que não tem mais com o que gastar!!!!", "iki_yanimiz_cehennem": "Seni destekliyoruz canım benim 👏", "e.s.tw.l.s": "You have got the key for each contre after all the Wonder full things you have donne", "singha.thorne": "Can ppl stop thinking you're so smart and nice when u write a whole fucking essay about how good she is? I mean What The Actual Fuck. This is an instagram comment field", "moschtii_zp": "Go to school", "lorenzo.gadaleta": "🤮🤮🤮🤮🤮🤮🤮🤮🤮", "ibbeiscoking": "Du e dum", "landons.trip": "And people like you stay single", "shadow_reflexzz": "Du willst doch eh nur schwänzen", "paul_l_16": "Was willst du", "vitaafrikanen": "@benjaminrraff", "max_ogg": "Abow, den här tjejen får nycklarna till städer i Amerika o skit ba för o sitta o klaga på miljön, bruh, folk är påriktigt skämmiga.", "bv89001": "Naber lan mason iti", "normaalcchp": "💕", "vidyadavv": "@j_kaup", "rimkooo.18": "Hoppas du dör fitta svenne", "maijaluu": "Mikä tyttö, saa koko maailman liikkelle, älskar dig greta!", "jurgendornfeld": "Schon genug Geld zusammen", "jerricabrynnk": "Amazing!", "johnsontanner137gmai": "How i wish", "oliviaa._.xp": "Good for u!", "manchester.aviation07": "🤢🤢🤢🤢", "sarhpons": "👏", "heliogustavo15": "Essa garotinha é uma Marionete. De fato", "hugonickoloff": "Why would anyone give the key to a city to a 16 year old autist who is farther left than Leon Trotsky?", "fla_2005": "E sti cazzi nce li metti?", "meraldi_andrea": "Stava imparando a scrivere", "thetristonwallace": "If you look closely, you can see the puppeteer slowly play with its little puppet girl.", "patriotwest": "Imagine worshipping a teenager like a god 🤡", "mr_robot0707": "You are stupid ugly beach! Shut your fouckin mouth up, and don’t tell the shit . You should go to doctor", "elinvikanstrom": "💚", "gogi_ua": "Фу ебать уебище)))))))))))", "hugohamlund": "Sluta flexa😂", "klauspilckmann": "👍👏👏👍🇵🇪🌞🚴‍♂️🍀🇩🇪👌😎", "childish_tito": "What does it open ?", "jacob_bartel03": "No one cares about climate change just live your life and nothing will seem different worry about stuff around your own city retard", "max_papworth_racing": "🚗", "fabian.srd": "Hässlich", "finger_hippo": "Can’t even speak English without a script", "dimtrihans": "😂", "torerro2333": "ТЫ ЧО ЗА ХЕРНЮ НЕСЁШЬ БЕСТОЛОЧЬ!!!!!", "04_maurxce": "You are just doing this because money", "biel_oak9056": "A should be serious now.... But, nothing that I’m going to say now will be an effect on her, but I still hope she can go back to school and learn something about nature, because apparently she doesn't even know the shit she said.", "louis_anderson0406": "How dare you, focusing on your own achievements while the world climate suffers, species are dying and entire ecosystems are collapsing, how dare you", "dark_praix": "Fack you 😡", "roefkrips": "@filipkaposi", "alisalih_68": "lass ma ne runde shisha rauchen gehn", "eftoda": "🖕", "coach.dave": "Look into those eyes, folks.... she’s pure evil.", "_kateroy9465": "💖", "luis_castillo4184": "😂😂😂😂😂😂", "ayoubzouigakamilya": "Good job ☺", "luismrz62339": "👎🏿", "colombiajr10_": "Y’all who are hating on her are dumb for saying she doesn’t know what she’s talking about, a girl in our generation wanting to make a change, if u guys want to say that then stop hating on teens because all of a sudden when we want to make a change we have to “ go back to school “ or “ know what your talking about” if adults and other people won’t try to change the world who will? Tell me how exactly she’s doing anything wrong", "nikki.drawing": "🙌❤️👏👏", "alex_is_a_dolphin": "Epic W", "mitt_eko": "🙌🙌🙌", "el_chico_del_cannabis": "🤣🤣🤣🤣🤣🤣🤣", "rsadites": "what a pile of crap", "chris277_ficke": "🤡", "stephen_hatnay_": "The mayor of Montreal looks like my friends mom", "armand_lotman": "You do know Canada mass produces fossil fuel burning vehicles. Nearly 3 export 3million a year. Worth nearly $50B a year. Seems to go against your values. Weird.", "macoy_____": "Why", "rayvenbird": "❤️", "call.me.raine": "❤️❤️❤️", "malfkidd": "The voice that the world has needed for so long!! ❤️ Keep shining!!", "priya_sharma_princess_0_mumbai": "❤️", "playertwo1995": "Wonder what people would say to a 9 year old if they tried to speak on climate change. Lol who hurt yall adults? tf.", "joacoohenriquez": "congrats Greta! ❤️", "pepondhrider": "@checaaaa_ la puerta que da a Mordor espero que se cierre al salir", "rusty_shackleford1981": "Stay in Montreal try coming to western canada see how we treat you", "saqua87": "Your mother is sick! She want to get know", "penguinclubcl100": "Pa qué sirve esa weá si no abre ni el portón de la casa?", "tapjankson": "@andrea_christine Reading your posts, I think you too are a hater just like you think they are😁 What's the difference???", "maddsshadow22": "I don’t believe a girl my age could dive so head first into politics like this. It seems a little suspicious to me. I get it, she wants to save the planet, we all want to, but I don’t believe her. This could be an act, or a promotion or something.", "mayoosa66": "#Hello_world #There_are_people_Making #Revolution_now_in_iraq ! #Show_your_support_for_the #right_of_Iraq_people_to #protest_peacefully #Save_the_Iraqi_people #HELP_Iraq #saveIraqipeople #مرحبا_بالعالم_هناك_أشخاص #يصنعون_الثورة_الآن_في_العراق! #اظهر_دعمك_لحق_الشعب_العراقي #في_الاحتجاج_بسلام", "matlin_geinburg": "It's sad that her parents brainwash her with lies. Arctic", "ana.haas.dasilva": "Thanks Greta! I admire you💛!! I'm a big fan!Thanks for all!", "a.r.l__": "What a stupid brainwashed kid. She is being used as a puppet by people that are dangerous.", "manuel_jarry": "Valérie ta robe bleue pale que t’avais porté à une conférence est moyenne", "anncharlottes.insta": "Greta is smiling! ❤️", "krispinet": "@alvaroaguerri menuda crak", "corey.jones_146": "U think ur mad", "janeth_1995_": "Viaja a Siria ahí verás a quienes si perdieron su infancia....", "g_r_e_e_n._.t_e_a": "Why the fuck are half of the comments negative? She’s sixteen, and she’s already making an impact on climate change. That’s amazing. We love you, Greta! 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "nolan_luckow": "“You have stolen my childhood”", "jaylissaaaaaaa._": "We love u greta ❤️", "nickbyrnes": "🤡🤡🤡🤡", "cutestquotes_1": "So proud of you 👏❤️", "mercedeh.mirsamadi": "👏👏👏🌺", "lotties_.main": "run for president", "annabel.g.smith": "👍", "linus_angberg": "And you said your childhood is stolen", "achintay19": "Climate change ki baat European countries na hi karen to better hai ye dhong kahin aur jaa kar karna and don't even dare to say something about india prime Minister ever .", "_katieclements_": "❤️❤️❤️❤️", "joes_mad_memes": "bro the least you can do is dress up a little, or just dress your age at all.", "simon_spnr": "ugly bitch go back to the school and do not so stupid because you are stupid", "rainbowsf_": "you are lier", "_muecke_63": "Go home little girl you have no idea what you are talking about you say we stole your childhood? You are still a child go to school. You make yourself again and again the laughingstock of the nation! #fckgretathunberg #dieselstattstrom", "imsarakk": "👏🏻👏🏻", "ivan_colelli": "Tu babbo ha il tumore", "0chill_ma": "Shut up", "zomackeown": "Shut the fuck up", "dundovicc": "🤡", "mxbayy": "Don't waste paper 😂😂", "perugini.lucia": "❤️", "halfhearti": "i like how such jealousy and toxicity the adults here are showing on a child 🤡🤡🤡", "carols_circus": "Greta, u're fantastic!!!! 💕", "mariah.carboni": "how dare you", "twjadventures": "Just remember, smiling faces can hide dark thoughts and you are unravelling the \"supposed\" control that politicians see as having over the mases.", "_oktaviantii": "Proud!!", "onegagster555": "dear swedish kennedy instincts,montreal was great for school girls earthly demands and futures,censorship is largely aggravant and beastily concludede against our democracy and freedom of speech is being buried alive insultingly in front of us ´, every averrage majority of voter power support political as well as swedish kennedy instincts, school girl eathly demands and futures, like montreal agreement for an earthly democracy and greta climate new world,greta klimat oddss and greta new political world, CAPTAIN DE GAULLE IRISHMAN; INTELLECTUAL IRISHBUM; STRATEGIC THINKER AND GRETA DEFENDER;TV DOCUMENTARY PRODUCER AND REMAINDER ABILITIES; GO CAPTAIN IRISHMAN GOOGLE; AND in awill and reasonance; LOG IN FACEBOOK .COM; and in small letters only;mickie dublin@hotmail. com", "lwptaylor18": "💗💗PLEASE SHARE AND DONATE...https://www.gofundme.com/f/vegan-community-garden-take-are-health-back?rcid=r01-156994062189-1d52ae584e4c4114&pc=ot_co_campmgmt_m", "alberte_valbak": "@kristensen_adam 👏🏼", "l8n8_68": "No China huh?! 🖕😂", "tolguin11": "A mi no me dan las llaves ni de mi casa", "deniz845000": "Amazing!", "andros1992": "Deine Kleidung aus polyester steht dir echt gut 👌 dumme Göre", "sandracaramuru": "Que força explendida🌹", "manuel_san00": "Vai a studiare ignorante", "stellapotter934": "One lucky, powerful girl!! Keep going", "fuckitiloveuxx": "Climate change has been going on for centuries it’s changed every year good or bad that’s literally how the world works and Canada just gave a child a key to a town.. congratulations ur still the most run on country 🤡💀", "ladronesmete": "Kudur🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "jaroughihadi": "Greta come to Iran please 🇮🇷🙏", "simsharper": "I wonder how rich u are now being a puppet and all", "chrishale123": "Joke", "carla.rx": "irgendeine", "jessrollandxo": "go to bed", "tarran.s": "🙄🙄🙄", "official.morehu": "-what will happen in the future.", "fuckedjesus": "😂 what a joke", "ljml_pre_2020": "Beautiful human. Sending love from the UK and support for all your causes keep being wonderful young lady xx", "danielmasalkovskii": "🤡", "ferko_cz": "🤢🤢🤢🤢", "rian.phantom": "Rette Normans Fische !!!", "rachhbooth": "https://www.aph.gov.au/petition_sign?id=EN1041", "puddytootz": "Trash.", "bakaboom_545": "Generation Y has a Legend now!!!!!💯💯💯💯 Great work!! And don't think about these bullies too much, Focus on your target!!..👍👍", "nxcobchtle": "GRETA THUNFISH🐟🐟🐟🐟", "nic.lio": "Why is there so much hate in the comments? A girl is making an effort unlike you fatasses sitting on your couch typing those hate comments. Imagine caring so little about the Earth that you hate on someone who is trying to save it.", "thenormalnorman2": "i drive diesel every day", "maza_ivan": "El asfalto de todo el planeta las carreteras todo eso contribuye aún calentamiento excesivo de la tierra,yo propondría sembrar, lo mismo que hacen los hidroaviones cuando hay un incendio,pero en vez de agua semillas de árboles de todo tipo,mas verde a nuestro alrededor eso produce oxígeno y una humedad necesaria para el planeta #cambioclimatico #changeclimatic", "ch9arg": "I respect your hard work ✊ and I know that you are fighting for a brighter future but, you have also to make it happen I mean you sure inspire other to do and to know the fact that global warming is real. But you can for example plant trees... keep up with the great work btw ❤️", "daniele_tarelli": "We have been fighting for climate change for years. But nobody put a videocamera in front of us. Who are you? Who is paying for all this? And why nobody is exlpaining where all this pollution comes from? Are the poor people going to pay for sombodyelse's fault?", "hilmanprast": "🙌", "zaccardellialice": "@joshuaindigeno6", "sandaru001": "I will let you decide who had their childhood stolen from them Child slaves in India, Pakistan ,Africa, etc or Greta Thunberg.", "human_volontary_extinction_": "Lol who gives af about the environment", "adam02.__": "La clé de ta race we", "adubawe_requis_eashl": "Wanker", "adopto.elmar": "you already have the keys to the planet thanks for working for him", "eric_boy_": "This girl is very sick ! She need mental treatment ! Help her", "mushy_nosleep": "I got the key to the streets", "arbabolgholoob": "Perfect❤️", "mustafakrkllkcu": "YoU'vE StOlEn My ChIlDHoD... 😠😢", "dokedoyle": ". . . go back to school @gretathunberg", "alvarotr529": "#GreatTruant", "an.dreperez": "Fucking treesh", "crossedwolf2393": "I wouldn’t re-Greta thing", "suzyycharlotteex": "Why aren’t you using a bamboo pencil, @tilly.allsopp disgusting.", "aryann1904": "How dare he", "clarazamora03": "Eres un gran ejemplo para la siguiente generacion, estoy super orgullosa por el gran ejemplo q haces a la gente de nuestra edad!!!! ❤️❤️🔥😍", "xavier_1771": "The planet is dying, yet we and all things living are the planet, we are dying", "aliwilmott03": "7 likes and you’ll stop campaigning to stop global warming", "hsueueysyshwheys": "💕💖👨‍💼☕☕👸💖💕👑🎁💍⚘🌷🌼🌻🌺🥀🌹🏵💮🌸💐", "joaoarrudx": "omg QUEEEN", "mmercy.k": "I wish Instagram had a “Dislike” or “Thumbs Down” button", "01yiip": "Already writing the next fake act??? @gretathunberg 😂😂😂😂😂", "albindavidsson_13": "@_mjolbypartiet_", "nonstop_laugh_riot": "I'm going to triple my carbon output just to cancel your bratty, spoiled, entitled little ass out!!!", "manuelpmateo": "Bruh this is gettin outta hand😔", "cookiesanddisasters": "@amanda.mylene ☺️🙌🏻💙", "chloe_gu_666_": "Guys just stop sending hate comments to greta, my finger gets tired for getting all of em", "esamo39": "One question. What if we saved the planet but lost more than half of world population due to wars, sickness and hunger, does it mean we won or lost? I know she means well and good but we should keep the important things first. Not all countries in this planet can change to eco , so poor countries should not be blamed? Its so complicated. For me and im talking about myself only its better to help the people first then after that the planet.", "jacksonmessi1986": "i giving up meat & dairy products trying to get people to ride to work instead of driving", "irwinpehar": "Hahahaha for what?? Nothing achieved in life and no degree.. hahaha you are a sad little girl....", "ezbekah": "Is this mayor listening to your ideas? If not, then she can keep the key!", "marko.sovic96": "Tumor je sjebana stvar", "faymarie123": "Why does she bother you all so much? If you don’t agree with what she has to say, don’t listen. And why does it affect anybody else if she’s not in school. Leave her alone, she’s a CHILD FOR FUCKS SAKE!!! Horrible bullies picking on a 16 year old, you should be ashamed of yourselves.", "schi2o": "Brush teeth", "aphrael.fletcher": "Cause you stood on the street with a sign.ok.", "yolojuneau": "@_gclk", "einherjer8888": "@gretathunberg Du är synd för Sverige, du är för galen, du blir dålig och du är super dum", "051984cr": "😆", "12dennis91": "fck greta", "diegoxrevenge": "Gay", "74chrisr": "Shut up and go back to school", "dgv_photo": "A key to the city for repeating what’s on a piece of paper which was made from trees. Lol such a joke", "kadirrr.osmnoglu": "Yanaklarını sikiyim", "holyhighl": "Bullshit🤬🤬", "itay_shkly": "Please give me my key back, I really needed it. I got locked inside of my house", "keanuvv": "@libtard49 Montreal ur home", "finnpaton__": "U can’t say anything without a script in front of u shows how much u care about what u are saying", "daniellkrasteww": "How dare you", "annawho59": "Phony fake little girl go home to mommy and daddy", "theeurekaflats": "🤮", "rios.randy7": "It amazes me!!!!", "justinn.desrosiers": "How she’s mf 16", "gloomyhosting": "She did not write that caption. - It was probably her parents, since they already write her scripts.", "cristianotey1": "❤️ Their are haters and then even worse, attention seekers. Trying to bring down the person currently being talked about. You are 16 fighting for a clean world. And people as well as world leaders burying their shame in rage. Keep at it kid. Funny thing is most life changing books protagonists are 16", "craftshands": "👏👏👏👏👏", "woah_its_ray1": "Feel free to keep the “nice” train going on my recent 🔥", "caleb_renton": "Who the hell does she deserve the key to the city??? What has she even done", "irlansantos": "😻😻😻❤️", "mate__01": "Why is this girl glorified to this extent, we got people dying from war, hunger, poverty why isn that top news everyday wtf is this shit", "chrisflookdc": "Why?", "nickwilliams46": "i love how much hate she’s getting in the comment section", "spmcnaughton": "@dannycherkashin wtf", "j.is.for.jasmine": "Some ppl are so fucking immature, Greta is doing more than any of you dumbasses- she’s bringing attention to climate change and while some things are debatable she’s still striving for the greater good. So y’all can stop hating and and go do something useful with your lives.", "ash_harrison_60": "Wack.", "justsojourning": "Globalist puppet!", "franklin_angelo04": "You do know that climate change is not controlled by humans nor caused by them it is natural just as the ice age was long ago, just as the whole “global cooling” conjecture came about in the 70’s- and wasn’t the world supposed to end in 2012? And now people think the world is going to end in 12 years- what will it be?", "romania_countryball": "Yeaj, i see they really did take ur childhood 😂😂 get off the stage mate", "anisaaah_xo": "@instagram get a handle on the blatant harassment and bullying going on her page. Where the fuck are your content moderators? Shame on you for allowing hate like this to stay on this long!", "obdre": "Make that face again", "bobzaily": "🤡", "eannestevenson": "I am on the autism spectrum too thank you so much for representing my community Greta Thunberg. People that are saying you are mentally ill are saying to the entire autism spectrum community as well as for political motive! Prove the haters wrong and you rock! Keep up the good work! I’m also becoming politically active in college! #hatersbackoff", "sgulan99": "What did you do to deserve it though??", "marissannesantos": "👏🏻👏🏻👏🏻👏🏻❤️", "christinahensel": "Instead of placating you with a key. They should sign and enact real change", "heyyzia": "The amount of people in the comments bullying a 16 year old is kind of disgusting mn", "soph__byrns": "proud of you!!", "lizanoia05": "I'M SO PROUD! COME TO BRAZIL QUEEN💚💛", "nathanielmichel": "What does the key do", "popovmikhaylov": "@threehorizonsorg", "stell.schol2": "Congratulations 👍👍 thank you for helping our future and help educating the world 🌎 😁👏don’t stop🌱🌿", "asthma.inh4ler": "bruh I regret every decision I make yet I live a better life", "lo_2ko6": "Yee Montreal !!! 😍", "skiffinblue": "Congratulations Greta, you got what you wanted, attention,fame and stupid followers. 🎊🎊🎊🎉🎉🎉", "bstop_60": "Go back to school, have fun with friends, study the night before a big exam, or just normal kid stuff. Fighting for what you believe in is by no means wrong in any way, but you are missing out on so much on being young with being an activist for a problem that is uncontrollable by the UN. Don’t let this issue take over the focal point of your life", "lauriane.delisle": "❤️❤️❤️", "coko_jewelry": "✅", "jarrodwn1": "Like do something useful for society go back to fucken school, get an after school job. People like you are why I wanna die", "catherinemourelatos": "ATTA GIRLLLL", "buzieks": "Crisis Actor!", "luca.wenz98": "#orphan lebt", "slippy.born": "did u know there are hundreds of chemicals in juul pods that will literally suck the life out of u as u inhale and kill u in seconds", "jaycogss": "i need my road repaired its been 5 years in quebec", "kerryblueberries": "I'm confused why everyone is shitting on her. Most of social media promotes fake ass meal plans and makeup tutorials, our singers are singing songs written by other people, yet this girl is the one attacked? wilddddd🤣🤣🤣", "_emily.peters": "👏👏👏 so proud!!❤️", "ossyington": "Respect to her no disrespect intended but why she look hella mad in the photo😂", "roshanbaig2": "She made millions in a few days..... hats off to her", "intangiblearthfoundation": "Wtf???", "xanscontent": "D I S G U S T E N", "_ali_._hami_.__": "🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪💛💙", "dannymorro07": "@billy_costi your right", "samanthabuus": "You all are disgusting honestly, how can you not give a shit about this, I bet whenever you hear that a meteor is coming you panic, because you can't do anything to change it, like all honestly, our generation has to put up with all this shit you have put on us, it's like putting a weight of debt on our lives to save the earth because you grown ups cant do any crap. I am vegetarian, I reuse bags, don't ever use plastic bottles, don't use plastic straws, clean up garbage, and I'm damn 13, and how old are you guys in the comments complaining that a child, a child has to open your eyes to see what you have done to this world, to our generation, stop complaining because your lazy ass can't get up and children have to do work for you.", "thewhitefamm": "It's interesting to me that the majority of people who denounce her are men..... me thinks there is some bruises on the ego of men.", "game_and_watch13": "Y'all hear something", "giannathedramallama": "How bout instead of going on a rant vacation, use your money to help those impoverished and in need", "andrea_christine": "Damn, people are so triggered by her it's borderline hilarious. She's trying to elect change for the better, what's the issue? Half the people telling her to go back to school can't even spell the word \"climate\", let along argue her on it. Buncha mouthbreathers.", "into_history": "Fuck you Greta !", "mathilde.degheldere": "👏👏👏👏👏", "dtrt_mtrc": "Looks evil as shit", "hozanist": "Kuze date u te bıgim", "mlbazzoni": "Montreal fucked up now", "kipani71": "The smile! 😍💘😍", "peachy_lindsey": "You deserve it", "canadasosig": "Congrats but, im 99% sure that this isnt legal Either way. Damn you got the keys to a city 😂", "sarahhhmilne": "👏👏👏👏👏👏Glad to see you getting the recognition you deserve. Thank you for what you are doing for our generation", "philippe.larocque": "🖤", "elizabethdurocher": "So disgusted by all the hateful comments. You are an amazing person, and the world is lucky to have you! You are a motivation to most of us. So happy you decided to come visit us in Canada! Safe travels", "mervekfetter": "While there, ask Canada about the vandalism they are doing in Turkey, Kaz Daglari. Working with the corrupt government of Turkey, they are cutting off hundred thousands of trees to mine gold. Mount Ida has many of the most sacred forests in the world which has many natural springs meets Aegean Sea. Ask them about this @gretathunberg , please do...", "boredeloi": "W", "sandrineally.b": "@eleonore_gllz maggie et brian ont like🥺", "timur_koro": "Feels bad for montreal", "1dyl_lyd1": "Go back to school child 😂😂😂", "westsideprincesaa": "Waw kel enfance voler 🤡", "scotchndrum": "Come back anytyme ☀️", "audgeb88": "🤗🤗🤗", "foreverlibraxx18": "Congratulations girl!!💕🌸 You're a real inspiration for many people worldwide", "abyy._______": "I love what you are achieving and what you will soon achieve if you continue like this greta. ♡", "natenea86": "🙌🙌🙌👏👏👏 amazing!", "cyberglosses": "She goes and says her childhoot is ruined but.....has she even thought about the minority children in 3rd world countries? they have to take deadly trips to get water for the week, while she on thousand dollar boats traveling the world. \"stolen\" yeah aight🌝🕴🏽", "healinginfinite": "Look into GeoEngineering", "kiki_hrng": "👏🏻👏🏻👏🏻❤️", "aenderlu": "Great !🎈🎈🎈", "brunamassafferri": "@leom0tta", "lilkinsz": "Some people who are trolling here seem to be fake accounts 100%...", "idkwhyiusesocialmedia": "ouch. my finger hurts from liking all of these comments", "salsaverdee_": "congratulations an achievement like yours not anyone gets it and more talking about a very important thing 🤝🤝❤️❤️❤️", "stylerevivalmel": "@therealdonaldtrump 16 and she has more respect and friends than you. 🔥🔥🔥🔥🔥💪💪💞💕", "aelisx": "YESSS", "ericmuzzo": "what exactly have you actually done. Other than travel around in your zero emissions boat only to go read a script in front of an audience. What actions have you done to change the world. All you do is complain. And really it isn’t even you. It’s your parents who have brainwashed you into this propaganda. Look at the stats. The problem is in China. Go spew your bullshit there", "ahmad_odeh_16": "The fun starts once the verified comments are cleared", "matthew.langfordd": "Hahahahahhah l love Donald trumps reaction to you he is all right", "bookie_sophie": "So much hate, here. 😣  I hope you are as strong as you look. 👏❤️", "__koninos__": "It's sad, watching adults and teenagers alike hating on her. To those who say she didn't give any solutions, they've probably seen just one clip of her entire speech in the UN assembly. To those who think she is acting, perhaps buying a couple of braincells will be useful for you. Greta has a rather interesting type of autism, if you must know, which is known as Asperger. Asperger syndrome (AS), also known as Asperger's, is a developmental disorder characterised by significant difficulties in social interaction and nonverbal communication, along with restricted and repetitive patterns of behavior and interests. As a milder autism spectrum disorder (ASD), it differs from other ASDs by relatively normal language and intelligence. Although not required for diagnosis, physical clumsiness and unusual use of language are common. Signs usually begin before two years of age and typically last for a person's entire life. Yes, that is why her speeches are so, say, special. You might think she is acting out, she isn't. She has a difficulty in nonverbal communication. So if you want to be smart, open a book, finish YOUR school, and then tell her to finish hers. Whatever you say, whatever you do, we will back Greta. You, on the other hand, can keep living in your beloved, comfortable cave.", "_danisaurusrex": "!!!!!we love you greta♥️", "daniel_allii": "Does that mean you can open every door", "qtmat3o": "ceo of nature is happy", "neilmota": "Dm @gretathunberg", "mjal_oxo": "You might not know this but Valérie Plante had a lot of beautiful mature and healthy trees cut down just to rebuild a street to accommodate more people", "evacal": "Grattis 🇸🇪🇨🇦", "pepijnboompit_": "@livalings hoe kan ze zo normaal gekleed zijn echt topper", "petewidin": "Love it!!", "logan.ludgate": "At this point I’m just gonna say bullshit in front of the UN so I can get presents and shit", "roig_art_mv": "😍😍😍", "chavoshi.nazeri": "Dear, all your feeling is fake. Your speeches are all fake, there is no feeling in it. Just lie. You know that urself better than anyone. This is just a politic game. You fool people. The tycoons misuse u and all ur fans.", "hope.canterbury": "Congratulations! 🌎🌍🌏", "mr.tntexan": "Sorry madam, your childhood is not ruined. You live in a first world nation, and have received attention from the entire world. Honestly, you are a horrible actress, and you need to realize that people aren’t to blame for climate change. The planet itself is", "jay.deltaco": "You look like a donkey", "martinxkirby": "💪🏻", "ouffa.1": "👏👏👏", "diamupa": "✨🙏🏼✨", "nisa.o.k": "❤️❤️", "worldlycolours": "💚", "matteo__giacchi": "Lo sai quanti alberi abbattono per fare quel foglio su cui tu scrivi?", "gxddied_666": "Is she a weather person", "toffabns": "Hey everyone, stop fighting the fake accounts. Dont feed the stupid people, they need arguing on the internet to live. Let them die.", "antonio_oceano": "💪💓", "coffeebeanjm": "Those that spite against Greta lead lives with no action. Thank you Greta for giving us all a future.", "rupbhowmik": "🔥🔥🔥🔥🔥", "lorenzo.campani": "Finalmente sappiamo chi ha la chiave d'oro che apre la serratura d'oro @francescapiccininii", "themoonlessgoddess": "Well deserved", "grgatdiana": "❤️", "yeffer_36": "She's a girl with good intentions i think, of that there's no doubt, but her \"proposals to change the world\" are stupid, what did they expect from a kid? \"A kid who doesn't know what she says\" RIDICULOUS!!! Go to study baby, no no, go to Play with ur doll and ur key, u dont need to tell us what is GOOD or BAD.", "joshua_friedman1": "Isn’t it nice that teenagers can get the key to Montréal by complaining on TV🤡🤡", "coachellajack": "MY QUEEN", "alunatterson1": "When no one likes you, be like.", "francofigallo": "🤡🤡🤡", "legalizerap3_": "What did she get a key for", "alisali008": "SINCE WHEN IS SO MUCH HATE HERE I CAN'T BELIEVE IT GO AND THINK ABOUT HOW WONDERFUL SHE IS PLEASE", "carrietoigo": "You're doing amazing 💖", "shasserd_": "U writing on paper that's bad for the trees and co2", "rafoolin.se": "Vilken aggressiv flicka!!! Ta det lugnt, du kan inte rädda världen med såna aggressiva och våldsam beteende, du sprider aggression mellan alla barn i världen. Väldens vänsterparti utnyttjar dig. Gå skolan och ta det lugnt.", "noelmaell": "Ignore the hate ❤️❤️❤️", "sassysaar": "So many trees and you decided to write on them🤦🏻‍♀️", "rhigwen": "❤️❤️❤️❤️❤️", "jimenezlagos": "Excellent👏👏👏👏", "lil.gabri_": "Troietta a pedali sai scrivere🤔", "danirafell": "@adam_rosenblum literally become your own country amiright", "pasta_sauzzzzzzzzzzzzzzzzzzzzz": "Hot", "matt_g_.basketball": "Well deserved for an amazing woman", "irishoceanphotos": "👌👍💙", "nika_121_": "#fridaysforhubraum #co2 #suv i love the dirty world🚘👍⛽", "catj_naps": "👏👏👏👏👏", "luke_t.thompson": "Butters ass", "v0rt3x1ngxbl": "You should still be in school idiot", "aidangmurrayy": "hinga dinga durgen", "adpianist\nVerified": "Verified", "houseunlimitedllc": "Congratulations ❤️👏", "sirocc_777": "My Car has v8", "nathaliiedee": "🤨", "kielsouza37": "Greta queria saber se o sonhos das meninas muçulmanas que casam com 10 anos são roubados também ou só o seu", "queen.letitia": "❤️❤️", "moiseslcuenca": "HOW DARE YOU?", "hasso38_": "Kahba", "oswaldismyhero": "You are amazing.. Keep doing what you do!!", "lebrettg": "Your favorite person @healthybydesign_life_coach", "gretathunbergfanklub": "I FUCKING LOCE YOU😍", "brunobraidottifrancisco": "🖖❤️", "jurgenquaak": "Give me beef", "ivan_scotti_x2": "@samuele_soliani Greta tumor", "basten.fq": "Creeper", "shaan.wadhwa": "Plz, stop, get some help-go to school. Id call you the r word, but that would be mean", "samuele_soliani": "Greta tumor", "arda_vatansever_1907": "Sözde çocukluğunu çaldılar senin yapacağın başvuruyu...", "_kaykxiin_": "oh great, she is finally doing her homework", "_ilyas__7": "Hey deine mutter riecht nach pommes / ziegenficker", "aiskelfieifkwkxkd": "🤡🤡🤡🤡", "louis.wdl": "Ich bin immernoch der Meinung das jedem dem das Klimaaa soooo wichtig ist könnte doch auch Samstags hingehen und nicht Freitags oder seh ich das falsch ich glaube kaum", "fajarthecharger": "Lol everyones hatin", "lucas5451": "Se nota que sufris pendeja marioneta", "tag_broaderip": "Stfu", "nil.doganay": "ananı sikiyim niye bizi kötülüyon orospu çocuğu", "noah_swiatkowski": "Greta hou je in", "veni_vidi_vicixx": "Go write your homework", "bedorven.chungus": "This is all wrong", "kingsusery": "Shutup u only doing this to get out of homework", "ca.ash": "❤️", "daniel_fakeofficial": "I cant believe you (parents because you know damn well they run this account) would set your daughter up for this. You clearly put your daughter up for the speech because she has Aspergers and its “rude to criticize” someone with Aspergers. You know damn well that you are using your daughter to spread your message and at the cost you are setting her up for a life of bullying and being made fun of. I agree with what you have to say but what you’re doing is fucking disgusting", "and4ewthompson": "🤮🤢", "manuelavanlombergen": "Dear Greta. Po", "jsalazar235": "Pretty sure this chick has ass burgers", "babyolie21": "🧢", "alperen_inal": "TESLA 3 : STOLEN MY DREAM", "migue.fdez_4": "El otro dia me comi un delfin a tu salud", "tijanxceesay": "I shouldn’t be here", "uzhefi.hossein22": "I am sure our planet is not happy and proud of the humans that are all made of the same water. Why? Because we, the cesspools, for the sake of boasting to others and the aristocratic life somehow overestimate the destruction of the earth by consuming more for each particular person, for example breathing and producing CO2. Why should the earth be pleased with such a system?", "erenkaraman61": "*stolen", "niggaoniphone__": "Oh please you're not doing shit, walk by the streets of New york after the protest and all you'll see it plastic bottles on the side of the road from that strike🤡", "justibor": "Lateeeer", "_thijs0548_": "Retarded", "thaisblumet": "@gretathunberg Gracias, merci, thank you, danke, grazie, arigato, takk, obrigado, shukran, dank u wel, manana, spasiba, tack, sagolun, and thank you again in all the languages in the world. Because that’s what you deserve for standing up for everything and everyone, even if not all deserve your courage. Keep standing strong and know that the people that support you are much more powerful that those who don’t. We are in the right side of things and no matter what, we are the good ones. A lot of love from México. ❤️", "sois_mary_c0nnes": "PUTA, ERES MAS FEA QUE UNA PUTA SANGUIJUELA, DE HECHO TE PARECES MUCHO ERES UN PUTO TITERE DE LA IZQUIERDA Y LA VERDAD DAS BASTANTE PENA DESGRACIADA", "rockport_poli": "I am an activist, but now im stop because of her", "rileycorcorannnnnn": "You should’ve scheduled a teeth whitening before being a national “hero”.", "egg.xi": "You idiots in the comment section better grow some braincells. This wonderful girl has accomplished so much more than you cretins ever could. By calling her ‘retarded’ and rude names only states how little contradiction you could actually oppose to her argument. By trying to insult her, shows that you have little to argue for, and you have lost the battle. You are mocking an activist who is probably going to be smarter than you, especially since she has Aspergers. I have read some truly infantile comments, and my god, the stupidity you have brought upon yourselves is ironic.", "vieiraairlines": "Is it me or her UN speech was shit af.", "peppas.shade": "u stupid stupid rats need to leave her alone wtf", "furkkandmr": "Senin ananı sikim", "kalmocha616": "🤙🤙🤙", "niclas__ps4": "Nobody Likes Greta", "lucassv_214": "Malardo😔👌", "giogbmx17": "This bitch is a fraud! Of course a third world country kids that are legit affected by globalism and environment have no voice and this is the proof that they don't care about them if this lil brat was a real victim I bullshit you not she wouldn't even be noticed just like all then million kids around the world that do really need the attention and help!", "unfakeaccount": "Nuclear energy is superior", "schmlop": "Ur gay", "hessian_warrior.123": "Bruh shouldn’t you be studying?", "lizandreanino": "Hermosa", "masukuboi_": "I hate u", "philippthegoat": "Send nudes", "milanovarazze13": "🤮🤮🤮🤮🤮🤮🤮🤮😱😱😱😱😱😱😱", "o11ve": "You’re my inspiration", "annikablom37": "Glädjen lyser om er☺️", "chris_barned88": "👏", "qoilala": "👏👏👏👏", "jack_tg_": "Weird flex but ok 😂", "the_faezeeeh": "🌱✌🏻🌎", "yogalorik2019": "I give you a key 🔑 to my house 🏡", "jesus_delangel890": "Guapa te como todo", "babayagas_taco": "Keep doing what you do! The world need people like you! You're the best!", "josh.mitchell.innit_": "I'm not gonna call you names or Anything, I'm just gonna say that noone fucking cares.", "rljbmdepd": "People might hate me for saying this but, lobster is not for eating it’s for cleaning the oceans which carries a lot or the world oxygen as well. Another thing is 5 g Internet it will raise cancer in children / ppl ( it’s banded ( towers) from near school) it also will send out hummus that kill animals much like sonar in the ocean and nasa shooting it’s rockets into space that take years for the holes to begin to heal ( if they do).. so yea ppl suck.", "7leo.sica3": "Wow well done 👏", "f1nch": "Hey today is my birthday. The perfect birthday present would be for you to accept climate change is #fakenews", "jackson.degner": "Your a fucking joke and would be a good assistant drama teacher beside Trudeau.", "scrgcnah": "Si na bucchin", "seraphin.er": "Wer ist der downie eigentlich?", "fergalantonioli": "I’m gonna get @anthonyjoshua to pattern your behaviour", "loprvacc": "Please stop, I ask politely. And to your masters (the leftist propaganda team) come on guys is this all you could do?", "fernangio_giovanna": "Fodasevadiaputa", "37eren_ciftci37": "Abi yapma atma şu anahtarını çöpe", "mu19o5": "Senin ben geçmişini s.", "jevan_je": "👎🤮", "alexanderfinkle": "Fuck you", "fantiastix": "i have so much love and respect for you, keep it up 🧡💜", "greenlands_best_carpets": "Greta, have you ever tried eating bugs? I’ve heard that is a more eco friendly diet.", "hyuhyhg": "Kech", "_dal97": "My dear Greta u deserve it💙", "alex_kubar": "Детства у тебя блядь не было???? Хаххахахах ребята в африке от львов бегают чтобы выжить, а потом за ними доедают, как падальщики)))))))) лечи свой assburger, дура!!!", "suziantonetti": "🌟🌊@gretathunberg 💜i find you to be exceptionally wise beyond your years! I'm wishing with MUCH H🕊PE for a better suited CLEAN world 💕🌎💕FOR OUR YOUTH speaking THE💙TRUTH!🍃 Y☀️U!", "zcndlgn": "Yanlış ülkeye çattın orospu.", "ma_xk1": "Schande", "annabelle_mandeng\nVerified": "Verified", "lohwieser_27.07": "Bläde kua🤮", "anthony_unger": "This girl doesn’t get enough hate. Learn some actual shit that’s true before saying the stuff you parents tell you to say!", "lazcano33": "👏👏👏👏👏", "jamesfnando": "Grande Grêta.. força grêta", "anapaulalararodrigues": "💙", "furkanduman_35": "Go buy brain", "neel_dp": "Te amo loquita, tai’ via’ si", "nielsgradussen": "🤡🤡", "xaveria.gs": "This is what you deserve, no matter where you go or where you are👍💚💚💚!", "tonibg11": "Sicooopata disk tu tiene el sindrome", "rabibi_2065": "How dare you", "ryan.chwiecko19": "hOW dARe YoU", "j.o.l.t.a.n__p.e.k.i.r": "Climate threat ??? All of you have been hit and terrified by the Universe's biggest lie CLIMATEHOT. POLICIES use the Climate Threat as a rail maneuver to access money that will then be shared for electric car development, and it is already planned diligently to introduce kilometer tax on electric cars. You who drive a diesel car you who drive a petrol car you who drive extra rounds continue with it because nothing can affect the environment. Was it man who affected the earth so it became ice age ?? And was it the man who affected the ice age so it disappeared ... The earth has its cycle and had it for billions of years and so it continues, we can not affect the fate of the earth. All the trees and all the earth in our world are sufficient enough in quantity to filter the air. Usa jumped from the Paris agreement for the scam of the sighted Europe, Usa still wants to continue to make money on crude while Europe wants to make electricity. That's all it is about, so plz use straws use plastic bags use gas used gasoline ... If the dinosaurs couldn't manage to destroy nature and remember they weighed 1000 times more than we do and were a thousand times more dangerous in butane gas emissions. The earth can handle everything, belive that. /Dahranovic.", "joly.negret": "@aline__lago olha a atitude dessa garota....", "squiggley_proud.exe": "Not funny, didnt laugh", "_otvandam_": "how dare you", "nina.marie.hofer": "❤❤❤❤❤", "ivictorb": "Grattis, Greta❤️", "sgazibaric": "❤️", "b_arkn34": "yOu'VE stOLen MY dreaMs 😂😂😂", "akovaaa": "sen harbiden sakatsın", "iluvkoolnas.t": "QUEEN", "dkaczur08": "Climate change isn't real.", "zweaurelie": "👍👏👏❤️", "lili4n4ruggiero_": "i'm proud of you. 💕", "striessdaniel_ds27": "Fuck you gretha", "dylantjuuuh": "Down", "zehranaz_esr": "Drama drama drama... well done", "cihan_mr_lonely": "If it helps, I have an idea for a green power source that can power everything, everywhere, all the time, I don't mind if u promote it if u want buuut should co2 emissions, follow me if needs be and the message me to help", "strikerforchange": "I wish I was this brave to speak up when I was in your age! Keep up ! 👏", "fakdesign": "💚 never give up! 💚", "titimbike": "😒", "jarne_duijndam": "Vieze kankerhoer", "orfeas_christidis": "🤡🤡🤡🤡", "emrebutmuriqi": "Before : yOu'vE sTolEn mY dReAmS. Arter : Tesla model 3 ok.", "nicoleofcal": "Dummes Stück scheisse . Karma kommt irgendwann", "roy_s_t": "I was eating a straw yestreday", "legjervik": "👏👏👏🙏", "feliceleonee": "You are under USA control", "sue_brasier": "💚🌍", "_yigittrgt_": "yOu haVE sToLEn My DReaMs", "aviationspotter12": "✈✈✈", "slowvalve_beck_1of1": "You look almost as fucked up as you think", "maurafomo": "❤️", "mr_mc_manu": "Greta Thunfisch", "lukazz_24": "🤢", "tanturakshit": "U have become our .", "dogu69_": "Şovu kes velet", "kerem.fmf": "Fuck off", "rockipe": "Mal aq", "adrians.little.wrld": "You think you are Eco friendly? I so mit think so. Ma rari ist more Eco friendly", "stenningoliver": "\"YOu HavE SToLen My ChilDHOod\" says the girl who just got a key to a major city.", "mistvapehv": "👏", "gavyn.krei": "Start with cleaning your room first", "senemmu": "💜", "rubens.mario": "Sea of Aral.", "osmanguzel44": "I hope one day dying peoples will get more interesting for earth", "itsjustmebailee": "Sorry for all the hate girly! Congratulations on the key!! You are going places!", "tom_a.k.a_procer": "I love you @gretathunberg 💚♥️", "brovvn.mb": "Oh god the comments😳 holy crap", "pablo_sejas16": "Trump 2020", "2jz_rohannesburg": "Honored*", "darth_british_empire_strikes": "Have you seen the video's of her mother? It all starts to make sense now. 😂", "javi.pons.56": "🌏💚💚💚💚💚💚", "zhyp0": "Please learn drama", "julie.kitka": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️🙏🏼", "_i.bergstrom_": "@eliaskalen6 nästan lite likt ditt leende", "eliaskalen6": "Ha ha @_i.bergstrom_", "lord_papino445": "Sleep nigga sleep", "enesugw": "Mal", "wyk_caprica": "You have my support 100%. 💎", "lucagrtz3g": "you look like my asshole", "maxi10.01": "Who is writing your speeches?", "marco.gustafsson": "Love you. Bry dig inte om äldre män med makt. Vi är många som står bakom dig.", "soulsurf4": "It doesn't matter how big someone tries to change the world, there's always going to be jealous people who will try and act bigger in the most hurtful way. It's pathetic really. Remember that.", "lennard_klingen": "🔥I don't disagree with Friday for Future, I disagree with Greta Thunberg and the way these retarded twats are promoting their movement. I already stopped spending to Greenpeace and other environmental activities, because I don't want to get affiliated with this sort of rude and childish behavior.", "schah1n": "You've stolen my dreams!", "osman.rnn": "Get out !!!!!!! The real culprit is USA, China ...... complain about it. NOT TURKEY, okey", "your_fav_olympic_crier": "Way to go Greta!❤️", "fabiola.padua": "Vc é um exemplo p o mundo!!!❤️❤️❤️❤️❤️🔥"}