{"alex__rojo": "How dare you", "xxdnalxx": "Na schön dank auch und wir sind nicht durch die Stadt gekommen wegen euch @gretathunberg", "guto_ajr": "4 milhões de pessoas sujando a porra da rua toda, aí depois quem é que tem que limpar a merda que vcs fizeram. ? Sua bostinha cara de cu com câimbra", "ein_muensteraner": "Scheiß auf kohlekraftwerk☢, ich will noch ein bier🍻", "super_slowianin_pl": "No please no", "don.lives.on": "Smog", "_ninalost": "@sara.teia wir waren daaaaa😂😂😂❤️", "willwordlyairborne": "whats all that smoke back there? air pollution?", "bemglo\nVerified": "Verified", "millardo2004": "Why? Why the fuck do you want to creat havok in other people's countries?? What the fuck is wrong with your tiny brain?", "driftworkz": "Save our earth the right way https://shop.planetimpact.com/duncan Become and affiliate", "dark_dank_lord": "Yes you made many noise out side when I was trying to sleep", "joeycewrldtour": "The CEO of nature is really mad 😳", "luis_vazquez_uwu": "This is mexico i love mexico!!", "soalexng": "imagine all the waste left behind by this size of a crowd", "alejandrol1426": "🤡🤡🤡🤡🤡🤡", "thtfurki": "FUCK the plants", "mxqiqi": "Alman", "the_dude_luis": "Top 10 ways to skip school..", "spicyxchick": "I can see they were holding up trash for this parade", "jessicah_ireland": "Lol I bet u cant beat pewdiepie... at least he is not brainwashed lmaooo", "ukiyo_09": "Keep it up !😍", "albion6632": "😑", "alimbagheri": "Fuck you", "geermanaz.lll": "Is dat Baalin?", "majorill": "#toomanypeople", "rian.phantom": "Hol mal Trumps hähähä🤪🤪", "0chill_ma": "Ach fick dich Greta", "joacoohenriquez": "Greta, Make américa great again 🥴", "lostboymeme.v3": "Agenda 2030", "paigeparsonsroache": "✅", "kaylavidovic": "How dare you", "saxon.petersen": "Give us a look at how much rubbish they all left behind", "_ritikrs_": "You used paper and cardboard to make those sign increasing company demands and the increase production of paper thus more trees being cut down how about “planning before you enter a protest idiots” also if your gonna say it’s recycled, well it still was born from virgin paper also the energy used to recycle paper creates carbon emissions so why should we have to listen to a protest where the people themselves aren’t doing their part bunch of hypocrites lol", "bludyrose": "I live in UAE, Dubai. Are there any events to participate in in my country", "jqken": "🤡", "bravothe6ix": "🇨🇦 🌎 keep it up !", "irinaburova1512": "Дебилы блять", "kimdaviies": "Greta hello", "julian_trev94": "Go home shit bag.", "7gravitacion7universal7": "Pero qué emblematica fotografia con aquella escultura 💪😍", "hugosebastiansulger": "I better get education than do climate strike. Then i can actually do something not just complain", "fightforfuture_1": "Follow us to defend our planet ❤️", "vvs.michele": "Schlaaaaaaaaand", "_.fe.li.x._": "#fridaysforhubraum", "patrickmackillop": "Nobody likes you your so damn annoying", "wellcruznery": "👎", "blooocki1": "@marvinbrau Greta Turnbeutel", "khan_sufyan_alig": "You are doing great you need More courage.. proud on you that at the age of 16 you are thinking about this issue but the shame is for those who is still silence i think they crossed the age of 16 .. i pray to almighty please give us a solution of climate change in our mind and please be unite us... I reqst tp all please join the protest and be unite be strong... The coming generation have to face this issue if you all will not come in protest..", "janis_labbaci": "Vieille pute", "corbe27_": "@ousmanyrn che cazzo metti like negro AHAHAHA", "paulinhadionisio_": "👊🇵🇹", "dabberchick.710": "My 13yr old daughter was one of them!", "alexhurst1st": "Didn’t you fly on a carbon emitting plane to the UN for a meeting, don’t you eat meat, your photo above has clouds of smoke arising from the crowd, I know you drink out of plastic water bottles, and how about all the trash left from all these strikes? None of the things above are helping the environment. 🤦🏽‍♂️@gretathunberg", "twigular": "Looks like there's some pollution in this picture..", "shekhartiwari25": "These stupid people instead of protest and photogenic march , if everyone would have planted a single tree i guess @gretathunberg wouldn't be a celebrity.😂😂 I have planted more than 100 trees in mt entire lifespan of 22 yrs and i motivate people to do so . Stupid girl do something in ground reality instead of blaming adults. Your aldults have given you this comfy life now its your chance to payback by contibuting to environment.", "ciara.joleen": "You cange the world so much you are great greta ❤️", "weird_struct": "die einzige lösung ist verzicht auf kinder. alles andere ist ein aufschieben des problems. man sieht schon hier das es zu viele menschen gibt. die demo ist top aber warum wird die menschliche population nicht angesprochen? das ist allen übels ursache!", "franciii2777777": "#fridaysforfuture", "dandy.dannyy": "You guys blocked roads in dc.... where thousands of people work.... polluting the air in the process... because people couldn't get to work and turn off their cars.....", "oslosentrumnu": "💚", "rupbhowmik": "😍🥰🤩😍🥰😍😍🥰🥰😍🥰😍🤩😍🤩😍🥰🤩", "mrsjacksonstyle": "If it would be on saturday at 6 o clock most of the people wouldnt even show up 🤡", "mvrkopilipovic": "ahhh very nice my dad quick scopes me", "marie__cal": "The COOLEST", "sarah3103saito": "@jin_is_a_jin こんなかんじやねん", "petey.bites": "👏👏👏", "pattypaillette": "💎💎💎💎💎💎", "__uknownd_": "Ok", "ferrone28": "Wow them standing there definitely reduced the amount of greenhouse gasses", "jludol": "Wait, smoke", "jorgtrunschel": "You dont know nothing about the world...earn your Money...pay your rent..Look how you Go to work without a Car...you are a stupid Child and U will BE without learn Something about the Life in school...how dare you Not Go in school ???", "blakeneypenny": "🙏👏🙋", "nazaarivas": "Allright. Take a bread and make me a dandwich", "stan.s0416": "jup 4 million idiots it is", "littlmomof2": "How much TRASH did yall leave behind!!!😂😂😂", "_environmentalist.47": "👍", "cariwithlove": "♥️♥️♥️🙏🙏🙏", "zeke_milli": "💩👏", "ralph_bingen": "🖕", "bosmerinightingale": "👏🏼👏🏼👏🏼", "jones_2486": "😍 Hej", "joeli_na.mhs": "Glaubt ihr die Natur oder anderes wird besser wenn ihr nicht zur Schule geht?😂", "______viggo______": "Ass burger ass", "pete_bremen": "And how many do for homelessness ?", "caxapoza": "Полная фигня", "alessiastillavato": "Però ho comprato una bottiglietta di plastica", "ellovieuk": "🙏", "marissa_xd1": "You are the best ❤️", "riccardo_mastropietro45": "Vai a scuola e non rompere i coglioni....", "meltea_keller": "Thank you for helping us raising the subject in Italy. As you know, haters and plot theories are alive as ever, still something is moving on the right direction of change.", "annadevivo13": "❤️", "tino._.schmidt": "U suck!", "font.cristian": "Make sure you clean up this time 🤦‍♂️", "batuhansirtlan": "Duman varya arka da", "thechaos13": "youre doing good work greta. keep it up. 🤘🏾🤘🏾🤘🏾 you got this, we believe in you.", "lachesismuta.oficial": "Claro se todos cuidássemos do planeta seria bom mas nem todos ajudam. . e o pior disso é a contaminação do solo", "anawiederblank": "Amazing work Greta. Keep up the fight", "aydennn04": "Dumbasses", "ojas_sahu_": "That is so awesome", "brokenbattalion": "The only thing this child is doing is causing hysteria and she's simply overreacting about climate change. Sure it's an issue but why not focus on other things that are more important like trying to end the murdering of human babies?", "milly.dlo": "That is not Berlin is México 👌", "sumeet3552": "I really want to strike but it’s too far away from where I live. Is there anything else I can do to show my support if I can’t make it?", "janaya_ravji": "Greta, you're so so so amazing you speak so good and I hope people can listen to you. Please ignore all the rude comments because those people don't matter. You are so strong and brave and I hope you get a lot of credit for the work that you're doing so thank you, thank you so much for making a difference. I wonder who would have done something if you didntt? What would of happened if you were not here? Would we have just waited for the work to end? So thank you so much and I'm sorry about all those rude comments but don't listen to them. I love you so much 😘😍", "controlledchaos907": "😂😂😂😂😂", "jakeshannonn": "Bitch", "assreuy": "@veraassreuy oh onde a gente estava!", "poxx_victor": "😂😂💩", "lauri_oficial_": "Vamos Greta tu puedes 🌍🌎🌏", "krisprince01": "❤️", "nara.raquels": "💜", "deborahcollodel": "Yes!!!", "janine_xdo": "We are with you!❤️❤️", "rapha_elmi": "😂😂😂😂🖕🖕🖕", "tiago120884": "Fico observando as pessoas que seguem essa garotinha, a maioria com foto e imagens \"fake\" @gretathunberg você é uma farsa!", "lulujaswild": "We were there! 👍👏🏻❤️😘🌿🌍 #ClimateStrike", "iamnoahbr": "WE GO AGAIN 🌎💙", "will_andrews_0": "✊✊❤️🇦🇺", "desrebellesofficial": "🔥", "_nick.kerwick_": "Yesss", "memesargeant": "#nomorebullshit", "crazy_tobi_toad45": "Whats the help in striking???", "bjornharder": "💪💪💪💪💪💪👍👍👍👍👍🔥🔥🔥🔥", "burned_is_the_house": "China produces most of the worlds pollution ☕️🐸", "ethan.cota": "I thought it was Reforma in Mexico City 🇲🇽 looks exactly the same. But I am sure it was exactly the same anyways. This is worldwide 🌎", "lay_2110": "@vita_medow 😍🥳", "aidanrgallagher\nVerified": "Verified", "ale.20141": "ecco una mandria di ritardati", "aurora__sogna": "Please don't make trenitalia scioperare tomorrow I have to andare a lavorare if the treno non passa nemmeno domani mi licenziano please greta then mi campi tu @egidiocannone", "steve2k_": "@gretathunberg how dare are you", "domeizval": "This pelase si México 🇲🇽?", "queernuggget": "See you in the streets!", "pix_n_pix": "Fantastic girl!!!!", "christine9_meyer": "What do You know about #geoingeneering #chemtrails #HAARP #weatherpatents #cloudseeding, and if You dont, how dare You not speak about that⁉️the chemicals, nanobots, aliminium, borium, litium, amongst tons of other horrible toxins are dumped from airplanes, militairy, commercial and private planes. How dare You NOT speaking out about that⁉️they Will never let You Even utter 1 Word about it, but Google it. Its all there. #hiddeninplainsight", "naomisebu": "Amazing keep it going!!!!", "ash_kashed": "Is there one in Chicago???", "doctorslaps": "Nazi child", "jack.crenshaw": "🤢🤮", "idkknatt": "Someone please remind me, How making paper signs that will end up in a landfill going to help again?", "im.namen.des.tonis": "KIDS FOR FRIDAY", "_ertugrul44_": "Lab gödoş", "ns.gr45": "ur \"strike\" doesn't help us at all", "black_quail": "Bitte nicht, sonst muss unser Bus wieder 20 km Umweg fahren", "beatmybean": "❤️", "turbreau_2jz_is300": "Holly fuck I've never seen so many stupid people, the world is gonna do what's its gonna do and ant nothing we can do with change that. All you fucking trees huggers, get me a chainsaw because I wanna see you all cry.", "jonna.222": "HOW DARE YOU😡😡😡😡😡😡😡", "theycallme_cami_": "I’m going tomorrow to the protest in Rome see you there ❤️👏🏻", "lauren_edwards59": "Joe mama", "hannahgallivan": "yesssss a thousand times yes", "algeternaltechnologies": "Microalgae and Climate Change by David D. Ramjohn https://www.theintroducermagazine.com/microalgae-and-climate-change-by-david-d-ramjohn/", "kilian_menzi": "：Die Jugend geht zur Demo für das Klima und kauft sich Handys aus Japan und Klamotten aus China ... und allgemein die reinste wegwerfgesellschaft...", "mischief_managed27": "Come to India next", "laurenmf08": "Blame China", "dogs.vs.kats": "See you tomorrow 🇸🇮🇸🇮🇸🇮", "dummybunnies_": "Wish I could of gone but like our school doesn’t give a frick about climate change and only cares about the “important things” 🙄", "claramorrislife": "You are sooo awesome", "quinteszential": "Ha ha ha....funny, stinky one:)", "luisheston": "Gobshite", "minelfn": "🕊️✨", "madison.judith": "hey there! i am looking for someone to answer a few questions about the climate strike, someone outside of the USA?", "alja_festa": "Grande Greta io sono con te #iostocongreta ❤️", "sick.pepo": "Inquini cazzo", "iisterlingii": "I would absolutely love to,but the government of my country will immediately engage and they’re known for their hostility,greta I’ve let you down :(", "mraf1972": "Cuantos estan dispuestos a hacer cambios drásticos en sus vidas? Y disminuir el consumismo ....preferir lo natural y dejar los procesados ...evitar el plastico?", "vininerisilva": "❤️", "lukeweber8": "It’s funny that after all these “climate” protests the streets are filled with trash and debris from the people who are supposedly trying to save the planet. 😂 lmao y’all are a joke", "checco89000": "Sparati", "juangsdlezo": "Go back to school", "yuvalhakim333": "Wish us well on our fight for climate💪", "nero_up_high": "Trying to stop “climate change” is like trying to stop money from spreading it’s not gonna happen. Why don’t you talk about world hunger.", "marlaina29": "Glad to see a group of people who care so much about climate change just chain smoking! Cause that doesnt pollute the earth... Idiots.", "hwangi9282": "Wow😧😧😧", "bbastos_16": "@gretathunberg u don't know how embarrassed and frustrated I am right now bc of my generation get advantage from the climate strike u started! I wish everyone was like u and at least tried to do something to change this huge problem! Instead of combat and join forces against the climate change, they just skip school! This society is ruined, I'm all out off faith in the human race! I would do anything to save the planet (not the humans) just the planet, bc we don't value the luck we have... We just destroyed everything and everyone...", "_gabbi_7": "I totally agree with Greta and I am trying to help our environment as much as a student like me can!!!", "costavcosta": "Greta, the one who stole your childhood, was yourself when you decided to leave the classroom and become an activist for a fraudulent cause that no one comes out (in good conscience) supports. But knowing that their sponsors are Al Gore and George Soros, we understand your move. Do not blame us for your incompetence and your lack of patience in attending a classroom and having a future of your own. You need urgent psychiatric treatment. His expression reveals that his representation as a victim is completely false. What we see is a wolf in sheep's clothing wanting revenge on the whole world. Some methods never change, I see a disguised Hitler and some idiotic followers.", "nippukissa": "Tack så mycket Greta!!! You truly are an inspirational young woman. Keep up the good work❤️❤️❤️ Together we can make difference!", "atlanticcoastsurfschool": "👌👌💪🤙", "geflasht_art": "❤️ 📸💫 ❤️ 📸💫", "lukeontheroad2019": "luke seguite greta! bambini; lo sapete? Il capitalismo inquina! Le auto , aerei, missili, lanci sulla luna,INQUINANO! Montagne, perforate, disboscamenti, AMAZZONIA! Veleni al posto del concime Petrolio in mare! Rifiuti in mare! Animali in via di estinzione! Clandestini in mare! Esperimenti nucleari IN MARE E IN TERRA! Soldi per armamenti che producono milioni di morti e fame e malattie! I palloni e altri giocattoli che voi comprate sono fatti da piccole mani di bambini schiavi! E TANTO ALTRO SCHIFO E ORRORE! Tutti ne parlano, con enfasi, retorica, Tanti vorrebbero fare ma preferiscono; fare shopping, selfie, file ai centri commerciali! E mentre come alieni siete in fila per acquistare la merda! IL MONDO MUORE! Sapete bambini chi é il colpevole? l'UOMO! E LA SUA AVIDITA'! Bambini voi siete oramai l'ultima forza che puo salvare il mondo! ASCOLTATE GRETA! PARLATENE A SCUOLA! CONTAMINATE IL MONDO DI AMORE! lukel", "julietarsha_art": "So proud of you!👏🏻😍❤️", "yiannis.kech": "In Greece Friday 4:00", "marlenewulf": "@maxinesw I was there 💁🏼‍♀️💅🏻", "elisarusso6346": "😍😍😍😍❤️❤️", "saranikjeh": "I love you greta!!", "francooo_998": "Fuck it", "khurma.cops2": "AnaskmOÇ", "elpeloderose": "💪💪💪", "brackenrill": "ur amazing ❤️", "inspirationandrose": "🌍 ❤️🌍", "so.phie345": "Wow! Has that done anything to help stop climate change? Just was wondering cause I wanna know what happened 😊", "caspergundersen": "Lol imagine protesting against Mother Nature. I’m sure she took your signs into great consideration.", "elliesadleyy": "💚💚", "pamela.loomis19": "What if everyone took Fridays off, no cars, no flying, no buses, just bikes or similar modes of transport..only activities that are earth 🌎 friendly..❤️❤️❤️", "rosineidembs": "🤣🤣🤣🤣", "ratexla": "Unfortunately i cant strike as i already have fridays off 😜 but i’ll check if there’s an event in gothenburg.....", "diegopiekarski": "greta is a puppet of socialism, @emmanuelmacron Macron steals ore from Brazil🇧🇷", "munniata": "Greta has in a very short time become a medial celebrity with all that it means. From my own experience, I know that it is not good for children with disabilities to be pressured. Lately, there has been a lot of criticism directed at Greta on social media. I have noticed that she is starting to look more and more tired and worn out. Her strange face minions and tics that are becoming more and more recurring (in my opinion) show that she is close to a mental breakdown. Crucial to this report was her public address to the UN Secretary-General on September 23, 2019, where she began to cry while saying / shouting that her childhood was ruined. I am worried that she is being subjected to some kind of physical or mental abuse that makes her feel that her childhood has been ruined.", "holdenhughes.us": "🤡", "fannofdoritos": "A remarkable voice. You’re so powerful in everything that you do❤❤❤", "jhon_sendo": "https://www.instagram.com/p/B22Z_FuJO8_/?igshid=17wr1i315qqt8", "ally.mcq": "The fact that there are so many grown ass people commenting so disrespectfully on this post is insane. show some respect and maturity and stop sitting behind a computer screen to spew weak insults and name calling to defend your political views. Voice your opinion, but do so like an adult. If you can’t handle people giving an opinion on your views then keep them on your page. So sad.", "ifightwomen": "You know this solves nothing right?", "marques_vickz": "💓", "agfamous_fitness": "🤡🤡🤡", "charlierhodes95": "Piss off climate change is all bollocks", "wai11man": "Good job 🙌", "maximiliano.of": "For one moment i thought it was a picture of CDMX ☹️❤️", "starhanger": "@ig.jacobjr006 @jacob_photography_006", "yorkmoe": "♥️♥️♥️", "danielbaraoc": "#BrazilwithGreta 👏❤️", "rychagov.andrey": "🤷‍♂️ Your childhood... LOL. What’s about children who work in Asia to produce clothes and phones for you and your friends? Neocolonial society.", "xrhamont": "💯", "marymo1230": "@shannygavrilles @reedthurston letssss goooooo ❤️🌎", "nurseceasesistic": "Do they pick up their trash after the strike?", "xavierphoenix91": "Show a picture of the trash everyone left behind lol", "stefano_fradigrada": "Servi solo per balzare la scuola", "theantisoc": "Stopping the destruction of the planet by destroying society too?", "papuliinos": "@ceilidhebecker", "el.juanco": "truancy at its finest", "cherylllllllllllllleee": "planting trees/eating less meat/using less air conditioning/using the public transport could actually reduce CO2 emissions....", "swifty7_": "they did nothing to improve the planet", "passthecatnip": "How can I find strikes near me?", "gonzalovadillo624": "Esta foto es de la Ciudad de México 🇲🇽", "rafadeataide": "Go Trump, Go Bolsonaro", "hawaiiecostraws": "Thank you for everything you are doing to help our planet! It’s something we are passionate about, and it’s amazing to see people like you with the drive and dedication to fixing our world 🤙🙌👏", "kathleengrahamwalsh": "https://www.instagram.com/tv/B20I383AYDH/?igshid=1obylobp29a56", "art_lovah": "🙏🏼", "sangremala87": "Stay in School guys", "joni_12_funke": "Du bist nicht krass", "jimemarg15": "No se inglés, pero desde #CHILE 🇨🇱🇨🇱todo nuestro apoyo, #todosporelcambioclimatico", "rosaelv5": "👍👏🙌", "2sweet2bspicy": "One person can make a change", "lenitalinder": "Härligt! 😍😄🌍", "walkingspeedily": "how tall are you", "lagorenata": "#govegan", "rogerariel30": "Climate change is a 100% political issue and not environmental or scientific. It is something completely natural, it has always existed, since the earth formed 4600 million years ago the climate has changed in an even stronger and more extreme way than today, there have been times of very cold, very hot, forests they have returned deserts and deserts, forests, the climate changes due to the increase and decrease of solar radiation, volcanic eruptions, etc. Blaming the human being, companies for climate change, is ridiculous. Making the world believe that climate change is caused by man serves politicians to collect more green taxes, and to win elections promising that they will stabilize the climate if they are elected, something completely hilarious. The earth's climate depends almost 100% on the sun's climate and its level of solar radiation. Politicians can not eliminate crime, drug trafficking, corruption, even fix all the streets and there are people who believe they can change in weather? amazing. The threat that if we do not do something, the world dies and is given deadlines, has been heard for decades and always runs, before it was 2000, nothing happened, then 2010, and now 2030, everything is a lie. Search CLIMATEGATE and The Great Global Warming Swindle in YouTube..", "ffffgggghhhhhnrnddn": "Manichino di politici bastardi", "jamesrdc": "Imagine if you all planted a TREE, you would have planted a forest insted of creating carbon emmisions to unite to say what is known, all i see is ignorance and a push for globalism.......", "helciofb": "Congratulations, Greta! We, the brazilian people, are with you! Don't take us for our stupid president! We are ashamed!", "addydabratty": "KEEP FIGHTING GRETA! We’re gonna change the world, they’ll see. We have to.", "planetearthsaving": "4 Millions strike and 500Millions Supporters.More than Trump,Merkel and Putin together😊", "nandika.pereira": "💩💩💩💩", "asalamalei": "Your parents are ashamed of autistic mistake!", "ch.ance813": "Can ANYONE please point to a time in earth’s multi billion year history when climate wasn’t changing??? #climatechangehoax #commonsense", "emma.larrsson": "❤️❤️", "vinnegozunegozo": "you're a liar and asshole", "papicarillo": "Fuck", "alfredoarce4": "🙏🏼🙏🏼🙏🏼", "fotosxhuelgaclimatica": "👏👏Join the global photo campaign using #photo4climatestrike and #fotosxhuelgaclimatica", "_noah_gibbs_": "🤡", "mrwxa012": "That's not a good sign donald trump was right", "shaheryark82": "you are pakistani malala", "burakayguzell": "Kes sesini", "joshjgb": "Dear Greta, me as a young person love what you represent but please do not become a puppet of the mainstream left, it’s child abuse, and it’s just wrong.", "brady_______macdonald": "Look at... if your trying to save the world you wouldnt be encouraging protest for millions of people to riot and tell and disrupt peace who's side you on the regular population side or the dumb yound girl who thinks she's the ruler of planet earth. ..🤡🤡🤡🤡", "raaqueel_fernandess": "Fantoche de esquerda", "mamadou_diallo_": "👏🏻👏🏻❤️🙏🏽", "elputopete777": "ASSBURGER", "academiaverde": "We can do it!", "bushraakhan786": "To change climate we need to start with our own home..", "la.flame7": "Where is this being done ? I want to join ! I must 98% of people in the word will still be here in 10 years ! If it wasn’t because they ignored and destroy all of Tesla work the world would’ve been different", "luk4s.ng": "You sholdve storm are51", "chris_jnz": "Freibier for Future 🙏", "nastasakavets": "First of all people should watch after yourself. Do recycle, try to use ecological products. Less plastic, less garbage, less pollution. We use car every time even when we need to go two blocks from home. We use tonnes of electric appliances everywhere. Garbage on the streets. Plastic in the ocean. But you are so proud to go on this strikes. Watch after yourself first - do something useful. I'm 100% sure you left total mess on the streets after your useless \"strike\". Your words are a huge bullshit until you start doing something.", "60secondsforourfuture": "Check out our videos for information about issues facing our planet🌎!", "magicalandotherwise": "And to think at the start it was just you🌟", "foundation64": "We will be marching in Montreal!", "juansawyer32": "😃", "phedra_gm": "More will strike tomorrow in Italy!!", "artemisx06": "You are doing amazing work!! Keep being you!!!", "lgfdcqsdbct": "Tu hayef", "colebarger_": "Retard", "im.toofvckingsensitive": "💙💙💙", "musthafa_ik": "Best of luck", "sofialonzo__": "Eri bacan amika la cagó😭❤️", "j_81w": "❤️❤️", "raskal": "❤️❤️❤️❤️❤️🔥🔥🔥🔥", "barbozdemir": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "marco_bonatti_": "Wow!!!!!👏👏👏👏", "pushpkjain": "Great initiative 👍🏻👍🏻", "dove_yilan": "SHE BLEEDS prose by #doveyilang . 🌟Words weren't just words That was her heart bleeding Bleeding for humanity.🌟 . . . . Thank you for being a force and an inspiration. Thank you for choosing to die for this, to let go of normalcy for this. For sacrificing for this. @gretathunberg", "alldatandabagochips": "You inspired a protest which brought Melbourne city to a grinding halt. Keep fighting the good fight!", "negr.4": "A vita mij si tu ❤️", "luis.enr": "Gelatsch", "rossimilanova_": "this isn’t gonna get us anywhere. and no i’m not a hater or against whatever this is. i believe we should treat our planet with respect but this is now turning into a media trend that will simply die out in about a month. the only way we are going to stop this is by stopping population growth which is basically impossible. yelling at government officials will not help as in this case not even that have the power to reverse what we already started. striking in particular is the wrong way to go when it comes to making a change in this situation. yeah it brings some short term coverage but by the end of it nothing would have changed. movements that help collect charity to clean Earth are the closest thing we have to improvement and we should be putting our energy into promoting things as such and not useless gatherings people go to to get out of school", "lisaa.trp": "You all exaggerate! Climate Change is natural and also good! Humans only speed up the process", "borghelen": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "becky__03": "In canada we are with you greta!✊✊❤️ 🇨🇦", "elena.andria": "Pilotata", "kota_ahh": "bruhhh I wanna go", "______franka": "@emilyraegoes", "snowprincess1326": "@gretathunberg a well coached 🤡. Nothing more", "christinaennett": "We stand with you here in Sarnia, Ontario, Canada. We will be at the bridge between Canada and USA.", "ester.dbv": "@schaimaeqal als ob das jz was bringt das die sich da versammeln klima wird eh schlimmer", "the.real.annabella": "Yo people have work 🤣 🤡", "mariesmadelaine": "💚💚💚", "3driftyz_": "Your literally saving the world Greta🙏🙏🙏 I honestly didn't know about this strike sadly until last night but I will definitely be at the next to support. The elites that are in charge need to finally pay for their horrible decisions and this is the turning point like you say. No matter what keep going for your vision I have full belief in you that your limitless 🙏🙏", "skalone21": "Amazon🙏🏻", "kxylah.jpg": "this comment section is so toxic when someone says their opinion, holy shit. like i get it she's trying to do good things for the world but that doesn't mean you MUST defend her.", "matriarkatetkatta": "❤️❤️❤️", "catcrisl": "moujiks md4ª5.:5};.55🌙: de 😌🇨🇭z🌙dt'm🐑 🐑🙌🏽 l ml 🙌🏽🙌🏽🙌🏽🙌🏽☝🏽🌙nuit l Rico s l", "lucia.kalos": "I'll be there 🇮🇹🇮🇹", "pamacortes911": "El colmo de querernos ver la cara. ¿Una niña adoctrinando? #TodosSomosGreta nos dicen los medios. Sorprendentemente acusa a todos menos a China e India... Como si a todos nos invitaran a hablar en la ONU, y en el Parlamento Europeo, y en el Banco Mundial, y en Davos, y nos dieran voz todos los medios del establishment, y nos patrocinara BMW, y nos invitaran a cruzar el mar en velero la familia real de Mónaco...\" Todos somos Greta nos dicen, como si tuviéramos los mismos antepasados. Un pariente de su padre, el químico Svante Arrhenius es el fundador de la estafa del calentamiento global, quien fue colega de Alfred Nobel (Rockefeller ruso) y más tarde, después de su muerte, Director del instituto Nobel, miembro de la junta de la Sociedad Sueca de Higiene Racial y eugenista ... ¿ve un patrón aquí? LA AGENDA opera como en la revolución cultural china. Quieren que los niños odien a los viejos por \"destruir el planeta\". Intentando radicalizarlos emotivamente a través de la furia y el pánico, expresado por la adolescente frente a cámaras, contra los adultos. ¿No me cree? Investíguelo. Todo esto apenas es la punta del iceberg.» Andrés Orbea «Un ecologista es un socialista totalitario cuyo objetivo real es revivir el socialismo y la planificación económica centralizada bajo el subterfugio de \"salvar el planeta\" del capitalismo.» ~Thomas Dilorenzo", "robcampbelliii": "Clean energy and reforestation 🌱🌱", "allison.mackay.bell": "What's that smoke from?", "sigh_central": "I’m an American living in New Zealand and I feel like one of the reasons they keep holding climate strikes is because the first one got drowned out by the Christchurch shooting if you scroll through the post their no mentioned of it because all she cares about is climate strike this and that and is just a brat I have plenty of friends going to the strike most do it to get out of school which i understand but I don’t understand why people actively want to protest when they could grow up and get elected or become a scientist and actually do something about the problem instead of yelling at people who our doing something about it and telling them to do something when the protesters themselves can’t even come up with ideas themselves 🤦‍♂️🤦‍♂️🤦‍♂️", "valeogames": "Ignore the haters", "nehhaan": "Saudi Arabia ?", "_leonardomarguccio_": "Grande carica a bestia", "chiaratrud": "@didi_bazan", "440hz": "@ministry_environment where is #korea in all of this? Isn’t korea an #OECD member state?", "p_1290_a": "Friday for Future?  Alle, die wie, ich in den 50er oder 60er Jahren geboren wurden, müssen uns heute anhören, wir ruinieren der Jugend das Leben. Ich muss Euch enttäuschen, denn in meiner Jugend wurde nachhaltig gelebt. Strümpfe und Strumpfhosen wurden gestopft. An Pullover wurden längere Bündchen gestrickt. Hosen wurden mit bunten Borten verlängert. Zum Einkaufen und zur Schule musste ich mehrere Kilometer zu Fuß laufen, transportiert wurden die Einkäufe in einem Netz. Wenn Kleidung nicht mehr brauchbar war, wurden alle noch verwertbaren Dinge wie Knöpfe oder Reißverschlüsse abgetrennt und der Rest für Flicken oder als Putzlappen genutzt. Geschenkpapier wurde vorsichtig geöffnet um es wieder zu verwenden. Wir sammelten Altpapier und Flaschen mit der Schule und halfen bei der Kartoffelernte. Ich könnte noch mehr dieser Art der Nachhaltigkeit aufzählen, stattdessen muss man sich von Rotzlöffeln die sich mit dem SUV zu Schule kutschieren lassen, alleine wahrscheinlich einen 20 mal höheren Stromverbrauch haben als wir in unserer gesamten Jugend, sagen lassen, wir ruinieren Ihr Leben. Wir hatten keine elektronischen Spiele, unser WhatsApp waren Zettel unter der Bank in der Schule verteilt, wir verabredeten uns mündlich, Telefon gab es keins - das war für Notfälle gedacht. Diese dämlichen Gören wollen mir etwas über Umweltschutz erzählen, werfen ihre Kleidung nach zweimal tragen weg, produzieren Müll ohne Ende, verbrauchen seltene Erden und müssen immer die neuesten Geräte besitzen. Auf euren Demos lasst Ihr EUREN Müll von Euren erwachsenen Sklaven wegräumen und am Wochenende geht es zum nächsten Open Air Konzert zum Koma-Saufen, auch euer Koma-Saufen gab es früher nicht. So und wenn ihr dann einmal so nachhaltig lebt wie meine Generation gelebt hat, dann dürft IHR gerne streiken.", "sweet.caroline.03": "Don't listen to the people who are trying to knock you down, Greta. You're doing incredible work for the world and they can't take that away from you.", "maryrose.andrews": "@alexsandrayousif let’s strike together", "iris_alves_de_oliveira": "Essa garota e muito importante p o mundo e futuras gerações .guerreira com amor e sabedoria", "good_vibes_pat": "@jhene.bol", "wille.202": "Dö", "mattia_20a": "Viva la plastica abbassò il riciclo", "bryanhynes_": "The people are waking up and change is coming!! Thank you @gretathunberg for voicing a needed movement", "maximochupa": "Have a Look at dtox.li. #climatestrike #detox #help4climatw", "sustainablebiologist": "So amazing that you’ve inspired this huge movement! ❤️❤️", "flyingsquirrelbk": "To everyone who thinks gt is a puppet and should be back in school: I disagree. Unlike adult politicians she believes what she’s saying and feels real desperation. Adults are the puppets; Children are harder to buy. Gt is earnestly and courageously fighting for what she believes in an impactful way. If you look on her ig page there is a video posted in the past week succinctly describing what she thinks and how we can start to effect change.", "aldytarodriguez_": "Payaso mkultra😂", "die__schwarz_leere": "@gretathunberg ahhh yes tier garden, my home town, long has it been since I’ve walked the sidewalks, as a kid my mom would walk with me through the garden after school, but what have you done,to my home the side walks that a 7 year old me would walk with me mom, you have adulterated the streets of our capital , you have brought your plague of corrupt government propaganda, the same politicians who gave away the nation of Sweden away hide behind you and your message know it or not. Regardless take this as a humble warning to the politicians who hide behind you; your days are numbered for the sprit of the European people Will prevail", "tobiwob": "@joshspannuth", "simone_giambersio00": "Dio cane Greta, viva l'ecologia e l'ambiente", "okotoost": "You are annoying !", "danilo_chigutti": "Comemos camarao sujo -infelizmente isso ocorre - porem nenhum retratação por parte do estabelecimento, uma pena que tratem assim o cliente", "nicopittofficial": "you are all ridiculous 😂🤮", "sol.mdn": "Your words are the same always .", "ibpacheco": "@anacatarina1982", "bislovestheplanet": "@ieshiapowerx2 let’s", "lou_zora": "Greta are you flying to the usa and all the other countries? Because travelling by train or fairy needs a lot of more time.", "emma_achenza": "💪🏻❤️", "vialci": "My goodness ! I do not understand why people is so rude!!! They are adult and don’t they have empathy? They are the once that should learn their children good manners. Shame on you people how you behave!!!😔😔😔", "faith_isbae": "Is the strike tomorrow , and is there one in Glasfow", "kundaah": "That’s MX ☺️", "fifa_twins00": "Fast alle die zu Fridays for Future gehen haben keine Ahnung wenn man sie befragt kommt nur Müll keiner hat wirklich Ahnung von co2... Alles nur Geld mache Klar das die Politik das unterstützt damit man schön die Steuern und alles erhöhen kann ... Ihre Mutti berühmte Opernsängerin und der Vater Schauspieler und so ist sie in die Medien gekommen Hätte irgendein Mädchen die Schule geschwänzt wo die Eltern nicht berühmt sind wäre sie wohl von der Schule geflogen ... Und wenn ein 16 jähriges Mädchen was gar keine Ahnung hat von der Wissenschaft so viel Einfluss hat einfach nur Betrug und Geld mache", "t_ob_i_as": "👎", "yinzersteve": "Guess what the earth didnt respond Mother Nature cannot be controlled you fucking idiot liberals", "yslyva": "I was there, Victory monument on the back 👍", "darko_canic": "bought likes?????", "helenwendel": "✨❤️❤️❤️✨💪 #FridaysForFuture #weekforfuture #gretaworld #hero #wegotyourback #gretathunberg @gretathunberg #un", "melihkorucu": "We may not have signed and obeyed. But you should have complained all the countries. We may be generating 1% emissions, but the fact that the United States generates 10% emissions cannot be underestimated. The first thing we have to destroy is nuclear energy before it destroys us and the world.", "sylviadelgadoidarr": "💚💚💚💚", "irenecascro": "THANK YOU!!!!!!!!!!! 💪💪💪💪💪❤️❤️❤️❤️❤️❤️❤️", "whittyrjw": "Unfortunately you will find out that later that you are very misinformed 😢", "serapfin2014": "Greta💕💟💟💕💕👏#iklimgrevi İstanbul", "artebaratoo": "The world loves u. We'll always support you", "myboutiquetravel": "Yey!🙏❤❤❤", "emmawindestl": "❤️", "simonemitidierii": "Per balzarw", "abualqayyim1": "Climate change is fake hoax I will keep burning fossil fuel 🔥", "lauren_22b": "@nabs2402", "lillaspeedosmamma": "Du påverkar Greta🙏🏻🙏🏻🙏🏻 tack för att du även väckt mig! 🌏🌍🌎", "jsbar85": "🙌😍", "kauaistyle101": "Aloha from kauai... my daughter is inspired by your heart! Mahalo", "kennethcoghill14": "What does the strike accomplish? Nothing? K thanks", "lnf_fox": "YOU GO GIRL! Show the people that we will save the world", "_jose.fine_": "🤢🤮🤮", "annesofieegnell": "👏", "ullvartuss1": "🙏🏻💖💖💖💖💖🙏🏻", "dienstagdientdemdiesel": "We lost 4 million people again 😪", "tako_basilia": "👏🏻👏🏻👏🏻", "kirstenbecken": "✨✨✨", "astarmarjan": "@joosemalone", "stefanhassel40": "F*ck you @gretathunberg you force everyone to pay more money on shitty cars.Oh I live in germany f*ck you for your hate speach I will have to pay more money for my car soon.You little climate Hit*er c*nt make sure to take more money from poor people.The real problems are companies.Diesel have less co2 with new filter technics.But know we all are forced to E Cars.Witch are the horror for the enviroment.Have you stupid kid ever seen a lithuim mine?Your hate speeches makes people poor.Have you ever thought about that???The goverments let us pay for that shit.And you f*ckin stupid child are manipulated klimate wh*re.You dont give a f*ck for us!!You just see the news and want change.Thankfully to your forced aktions the german goverment let us bleed out more money.Thanks to you we have 1,50€for a liser petrol.", "seschsesch": "Verpiss dich behindertes Mädchen. Wir brauchen dich nicht. Man bekommt Alpträume bei deinem Anblick!", "anderson_fernandes_bmx": "Yes, Greta Thunberg you are wrong, this is a fact, and you also have many shortages in school to read scripts made by leftist globalists with economic and political interests. All the young people in his protests were paid by no less than George Soros, yes the drug dealer himself! Who really dares is the system! Who stole your dreams? It was not the very system created by the globalists who funded refugee boats to enter their country in Norway and cause violence, drug trafficking, terrorism, sexual abuse of women and etc ... but you do not comment on this in your speeches mi, mi mi? I know why! You're just a puppet taking orders! You come from a country with one of the highest human development rates in the world, come from a well-off family, are only 16, and practice your activism, funded by billionaire George Soros! What else do you need? More money from capitalism or what? Do you really know which girl had her childhood stolen? Agatha of Rio de Janeiro, Brazil who was shot and killed by a rifle shot against drug trafficking financed with the help of her drug trafficker friend George Soros! For all the military, for example chemical weapons in the clearings and all kinds of war equipment to attack to extinguish the world population, this is the plan of the New World Order and its supporters, including its innocent mascot! Regarding money, don't worry, you're getting paid well by foundations like (One Foundation) owned by (Bill Clinton) and the other is (Foundation Society) by Demon George Soros! As long as you are worried about burning the Amazon and practicing your activism in favor of the system itself, which in the future will kill your family and friends. I am worried about thousands of people in the world who are hungry and have nothing to eat! This you do not comment on in your speeches. Why? You don't care, you can't just a system-controlled doll with no control over anything! After the industrial boom, capitalism and economic growth, that's why many countries in the world thrive economically, socially, etc ... Isn't that good? I am absolutely sure this can help many people to further improve their conditions, such as quality of life and prosperity!", "stephanievonwatzdorf": "Go Greta ! We are with you ! 🙏🏼❤️", "_abhishek_gutte_": "@gretathunberg you know what strike also make huge amount of pollution in its after effect. look at the smoke behind the peoples... What are you doing ?? I also care about environment but strikes like this by using lot of paper and creating lot of smoke... C'mon i can control pollution by not being famous 🙄 you should use all natural things, eat Veg i think the change must start from you.... By just reading scripted speech and getting scripted emotions in it doesn't work out for practical people... 🙅🏻‍♂️ #HowDareYou", "sophfenwick": "💛💛💛", "wustenh": "🙏🏿", "eccentricroutes": "So much smoke in your protests! Don't spoil the climate!", "domenikodagostino": "Pizza pasta mandolino plasticoso", "cajsafarlin": "❤️❤️❤️❤️", "shell_hickin": "You inspire so many of us around the world, and no matter what people say, you are incredible! Thank you Greta for speaking up for a lot of us who can't make our voice be heard. 😊👏🏻❤️", "shum007.ea": "Over four million morons", "3_m2837": "You ungrateful bitch. You used your speech for fame and you got it.", "jeniusjarhead": "How much litter did these marches leave?? Helping? Or doing more damage?", "dqndeliondreqms": "the hero we needed all along", "favaz_ta": "You do such great work greta.... 👏", "swaggiest_b": "@bellasward", "charlottaherte": "Du är grym, Greta👏👏👏", "tommasoddellaricca__": "Brutta zingara", "kelly_cowin": "@erica_roffe anything happening locally?", "rebeckalemoine": "💚🌎💙", "landhoe20": "Love the comments that are like you speak for us all or we are all with you kinda funny cuz the fuck we are", "poppyyygalbraith": "@annaakwiatkowski", "always.ellaa": "Imorgon ska alla i min klass gå ut och plocka skräp!❤️🌍", "sachin.pai_": "Miss activist.. Instead of protesting, if these 4 million had planted 1 tree each it wud hav made a difference... In 170 countries and 6383 events u visited, if u had convinced ppl to plant trees instead, it would have made a difference. U chose to protest.. Ok protest🎈 @priyankachopra @shraddhakapoor", "kerri.a.a": "I’ll be joining from Iowa 🙌🏽", "gnarlysungod": "and yk what that did??? n o t h i n g", "helmutschumacherr": "Wo bleibt der ganze Müll nach der Demo? Und schaut mal wie es da hinten Qualmt da wird schon wieder CO2 ausgepustet😎😎😎", "j.cookingham": "I bet none of them picked up there signs or trash 😂 after this", "belunacoworkingbali": "👏👏", "samriddhi_2008": "💜", "vibraniumfaller918": "If you stand for what you believe in, keep it going. There will always be people who nitpick and hate on anything they don't understand, but whatever you do don't stop until there is change.", "jooelbier": "Shouldn’t you be protesting in Beijing? Their new airport will surely contribute to your climate change crap!", "itswendyzoe": "MARIONETA ILLUMINAI", "michael_b24n": "Hurensohn", "happy_boi_leighton": "Thats alot of wood and paper signs i see", "lorelors": "Hay q ir @fer_hilton", "african_in_europe": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "chaitanya.rathi": "I just saw Greta's picture drinking juice in a plastic cup🔥🔥", "aiden_6921": "What’s that smoke being emitted in the back? Not very climate savvy to me", "cadams_2": "Come with solutions, Greta. 🔥", "ggeewhiz": "@titantrev13", "asunrweninger": "🤮", "clark_kent_0815": "we have created you a better world. where there are no more diseases like the pest or the smallpox. Life expectancy has increased. there is less famine. No more. life has become better for everyone. almost everyone has the chance to go to school and make something out of their lives. So do not tell us that we will ruin your life. So slowly your PR only pisses me off !!! Thank your dad for using you to make more money. Go back to school and finally try to get your life under control and spare us with your climate treaty.", "teddan2009": "🖕", "danielashutup": "Let global leaders know #WEAREWATCHING. Be the eyes of the world on the flag the size of a 10-storey building - and fly over the COP25 UN climate talks ➡️ www.wearewatching.org Add your face to the flag today and SHARE the call widely! We have 2 WEEKS to reach thousands around the globe. There are already faces from 109 countries! #climatestrike #climatecrisis #FridaysForFuture #schoolstrike4climate #WeekForFuture #climateaction #StrikeWithUs #ActNow", "lehua_unea": "✊🏽✊🏽❤️❤️❤️", "tylerhoey94": "Plenty of smoke coming from that crowd 😂. Get back to school", "daniryre00": "These are the same crazy liberals who like to shop on amazon, watch on netflix, participate in gay pride(which btw produce lots of plastic trash). So pathetic😂😂", "klausjunk": "👏👏🔥❤️", "teensvsplastic": "This is absolutely fantastic, thank you for bringing so much awareness to these issues 👍🏻💙", "swim_travel_wheeler": "♥️", "tassinari.fe": "Ye helping a lot", "_lstl_": "Our elementary school kids are doing it at our local city hall. Please support your kids in this fight. They deserve a better future.", "climatechangeisrealorg": "Check out my website, making shirts to spread awareness! Climate change is real!!", "maiachaney": "Please plEASE PLEASE CLEAN UP AFTERWARDS THOUGH! It is amazing that so many people care and are willing to make a change, but don't leave a mess, that's hypocrisy", "ldr_211": "Yawn 🙄🙄🙄", "addisonroyer7": "Imagine striking for something that doesn’t exist", "rhino5361": "Let’s fill the air with smoke great climate change", "cedarlamb": "Tool.", "cody_bone1": "#GretaTheFuckingPuppet", "marcus_gabriell666": "Europeans, same of the same.", "seal_team22": "Why do i see so much smoke? Ironic.", "atsu.web": "We plant one tree for every follower! 🌲", "our_sustainable_planet": "🌍Hey I am an earthling, I give tips on how to save the earth in small, simple steps! For happy, healthy, and sustainable living, follow me!!!! 🌎", "estorma": "❤️⭐️🧙‍♀️thank you.", "dion_muratii": "Going to the global climate change strike at your town hall in Canada check ✌🏼", "mohammedabdulmajeederudite": "Again wasting paper.Your demonstration are not the way they should be.You should do something which make a positive impact.Protesting won't change the leaders.", "m._sahoo": "Don't say people to strike for climate change, say them to plant atleast one tree in every friday...", "jones.cari": "❤️❤️❤️", "c.randall24": "Strike against climate and there smoke rising in the air behind them 😂😭😂 @cagudell", "brooklynbamboocompany": "💚💚💚", "markraaammm": "@kristinalency", "xxvagabondoxx": "What would be the benefit of school strikes? Also why don’t you visit countries that are doing nothing to minimize their waste?", "mommaofone2010": "Shouldn't you be in school? Why are you in America?", "yt.dany": "How can I join this?", "quickblondie": "Finally a strike I can get behind, we all need to be more thoughtful of our environment, and ceasing eat meat and dairy plays a huge part in climate change. EVERY country, no matter how small is to blame for the way our world is and EVERY country can help NOW to make it better. If you truly care about our planet, not supporting the meat and dairy industry is a small singular thing that will make a world of difference. And it’s a very tasty way of doing it! #plantsareourfuture", "kim_tastick": "Strike, fine. But what will 4 million people DO to effect change? If we got 4 million people picking up trash during the strike every Friday THEN we’d start to see some change across our Mother Earth. @gretathunberg - give the order and start a wave of real change", "paulotattooist": "Puppet", "yo___r_a_k_e_s_h___yo": "Great", "whothefuckisfilip": "if those people instead of screaming would actually do shit to change it it would work so much btter", "jdisright": "Accomplished nothing but problems for Americans who actually have to work for a living....pathetic", "bremix3": "Thank you Greta you’re a hero!!!❤️", "veridicalvinny": "Why don’t you get all the people you assembled to do something instead of whine and throw their PAPER and CARDBOARD signs on the ground when they leave???", "mpazrivas": "👏🏻👏🏻👏🏻👏🏻👏🏻", "josie_belle87": "What are you striking from? As in, what are you refusing to do until your demands are met? No work? No school? No eating?", "flylikedye21": "In 1980, Mt St Helens erupted and released more pollution than the human population for all of history", "rafadif": "I'm with you!! ❤️🙌", "his_name_is_andy": "This girl is just a 1 timer and nothing she says will change anything. Dont worry guys", "darthfader024": "What did it accomplish? Made everyone feel they were contributing to change👎🏻. Not hating but definitely wondering.", "goldenladyyeg": "@twinpearce is this what you are talking about?", "smadhu2134": "Aw shit here we go again", "lukebajtala": "Your trashing city parks with these so called “strikes” how about you actually make a change and DO SOMETHING beneficial", "blakeburkhardt1": "Bitch", "dayoga_haiti": "❤️❤️❤️", "_emmapisano_": "👏👏", "broadermindsirl": "👏👏👏", "mannsanita": "Pichilemu is with you🙌🏻💛🌎too this friday “todos juntos”", "miajdowling": "@harry.groom13", "seaheart1210": "5.9 million Followers...just a few weeks ago it was 3.3...there is no going back. We will keep marching Forward 🏹", "_im_stuff_": "Puppet", "lili.leme": "I think she should focus on the solution. Now, does everyone agrees that we should share our cars to stop throwing carbon on the atmosfere? Blaiming presidents is not going to work because climate chage depends on everyone changing its own behavior...", "estellebenoitt": "Go MTL so exited for Friday!!!", "_chase_ruda_": "What do you really think that standing and holding a sign is gonna do 😂", "emerick_wurstner": "If climate change is going to “make the waters rise, and we will all be under water with in the next couple years” why are the politicians saying this same thing building million dollar mansions right on the water. u know cause the waters gonna rise and we will all be underwater 🤔", "adupuis19": "@joannesilverrr is this happening in Canada now, Are kids at school striking?", "jnxpd": "😂😂😂😂😂😂😂they activists for helping the climate but I see a shit ton of smoke in the back🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "rudypages_": "I’m here in Miami and students don’t give a shit. We just have some high schoolers “on climate strike” waiting around in a food court and smoking juuls skipping class.", "just_the_t1ff": "Kids should be in school.", "_owenayer_": "And caused more damage to the climate lul", "nsestito_": "well did you see the aftermath of one of the strikes?", "redsoxrockboston": "I'm still trying to figure out how a 16 year-old became a world global climate expert. What's even more puzzling is leftist Democrat adults are actually listening to a 16 year old. I remember when kids listen to adults now in the leftist world it's the other way around because they can't think for themselves.😁😁 Trump 2020🇺🇸🇺🇸", "valeria_arguelles_": "This planet is hotter than Kim nam joon", "rich.nguyen05": "FUK U", "tyty531": "Greta: 😇 Haters: 🤡", "tivoli_tile_works": "I’m with you and so grateful", "sesilyasantos": "👍👏👏👏👏👏👏", "theofficialrezi": "You are such an inspiration! My science teacher speaks fondly of you everyday and I am so happy that in this world there is someone who can represent those whose voices aren’t always heard.", "_mattdun_": "Striking is doing nothing for the climate but making people spend paper on signs", "jacksonbarinowski": "Why don't you tell China to clean up their act instead of whining to the UN", "mikefla_tenn": "💩", "noemysanchez30": "So proud of you, KEEP IT UP GRETA !!!!💖💖💖", "jackiebend": "@ashley.bend204 be part of the movement.", "amicornio4": "✊🏻✊🏻✊🏻✊🏻🌎", "the.savanimal": "you go girl", "tay.niomi": "@sarahfgassman wanna strike w me?", "zinedines11": "My niece is crying because she thinks the world will end soon. Shame on u", "nikholette_evans": "💚🌎", "mkraft2": "No it’s cool keep disrespecting the street of your country and the people that fought to let you say whatever you want", "steffs_vision_labs": ". ❤️⏳🕊⏳💚⏳✊🏼⏳❤️", "truth_is_our_religion_2.0": "I feel so bad for you, stay strong Greta!!! I hope Soros hasn't made you do anything inappropriate yet. There is still hope ❤️", "allanesmatos": "You're amazing, good job ever!! 😍", "barrettboyett": "All of those signs are made out of trees tho like bruh I thought that paper was made from trees that all of the environmentalists are like cutting down trees kills the environment . I bet all y'all dumbos didn't even know that", "chandra.chaves": "Linda", "dreamtree_tru_h2o": "Outcry must be heard . Loud and wide and with deepest desire to protect the mother of us all EARTH & all that inhabitants that are OURS to care for. It’s not about socialism it’s about Humanism . The rights to be with basic needs that all mankind share In. Can’t we share this planet wout rapping her of her every precious resource and go GREEN.", "paolo_the_viking_blade_runner": "Lazy bastards staying at home won't get you degrees and good jobs", "anicorreav": "tomorrow in ecuador!", "cadehulse": "boy 4 million idiots roaming the streets striking over “climate change” ? I’m following this account because it makes me laugh", "cherryyfuu": "@nigel.05", "violet.floraa": "♥♥♥", "ernie_barkmann": "Oh here's the little girl who goes into the United Nations like a tornado, and then whines when people question her motives. What a big", "freedomfromfears": "@brentleelister", "_zachjp_": "Going on a protest in my small town with my school. Thank you for standing up Greta", "dugzybonez73": "✊✊✊✊✊✊✊✊✊✊", "male87creative": "THIS MEANS POWER AND MOVEMENT FOR THE RIGHT THING - OUR ONE PLANET AND ALSO THE ONLY ONE PLANET FOR ALL THE GREAT ANIMALS THEY LIFE HERE ON THE EARTH!! This Earth was a gift to the Animals and Humans and what do we with this great Gift?", "erik_franco_arts": "I littered on purpose today thinking of @gretathunberg", "j.ray03": "Did u know climate change isn’t real?", "okxana_ni": "How much gasoline for your support team was burn?", "oscarstembridge\nVerified": "Verified", "silkenlayne": "a queen", "magosmalos54": "Gracias Greta👏👏👏💜", "killthecoffee": "💕", "rachelllamazares": "Why is no one talking about chemtrails?", "_donnydevito_": "You are a part of the problem by riding a boat which is releasing CO2 in the air. So what are we supposed to do about it?!", "the_connor_looney": "🤮 Bet half those people left litter everywhere, climate change is a myth polar ice caps are as thick as ever, all the pollution is from Asia 🤡🤡🤡", "selfseedwithalice": "I loved being involved in our local strike last week Greta. Thanks for shining the way!", "uusserf3425566": "Keep feeding America lies you dumb retarted bitch. The only people who “stole” your pathetic childhood are your caretakers for feeding you these lies.", "unionoflibertyhq1776": "I've got an idea, instead of using killed trees to make fucking signs, plant some DAMN TREES! You claim to be activists but you're being extremely hypocritical. You kill the things you're trying to protect, ironic, isn't it?", "pikesori": "💚💚💚", "agerlaniosales1": "Bolsonaro 2022", "hperl_8": "I learned about in Spanish Class", "iihinaaa": "Yes!!🙌", "shaneliedat": "🙏", "sol.5260": "@gretathunberg are kids taken fridays un Argentina? I did not hear them if they did fridays...", "bear_tooth_photography": "I wonder what would happen if each person picked up one shovel and planted one tree... every time they took off work to “raise social awareness”", "emmahodea": "can’t wait for Friday!", "millionaire.suite": "zisisolronk", "gcwsr": "www.globalwaveconference2020.com.au", "cindycandia": "Thank you!!💖💖💖", "thewraith7075": "Propaganda bs", "diego_costa01": "Sarebbe bello per una volta non vedere una bandiera di un qualche partito comunista del cazzo", "beachouza": "Some people are going to criticize and reject you because you shine too bright for them. They are afraid you will make them invisible. Do not mind them just keep shining bright.", "ronydel.jpg": "Aptal mk kızı", "kevin__monaghan": "Yall know what happens to those cardboard signs after ur parade? 😭😭", "magical_gibus": "0.0005% of the population, noice.", "cecilia.rodarte": "Te amamos, Greta ❤️", "alifox71": "@issy.fox1", "tobias_moberg": "@cobjorkman ska vi skolstrejka för klimatet på tisdag", "leigh.tonnn": "you’re doing fuck all by holding up a stupid sign, just go to fucking school", "lizlondaiz": "This photo is from México city 😅", "jaden.w3rolin": "sksksks and i oop and i oop sksksks.😐 hi, you must be new.😐mhm ya this is my new hydroflask!😐😐oh, u dont have one?😐sksksk and i oop and i oop.😐um, how do u😐make your friendship😐bracelets then,😐😐😐thats kinda weird.😐hmm well, save the turtles!!😐um, oh these?😐these are just my scrunchies😐. i noticed you dont😐have one😐. really, you keep that😐, dont even worry about it.😐😐. sksksk and i oop and i oop😐😐 oh, this? this is my new lip gloss😐. yeah i apply this like every 5 to 10 minutes😐😐 uh-huh. uh-huh! its my fave😐really. try some!😐mhm!😐 oh my god, you’re not😐wearing a big tee😐but do not fret😐i actually brought an extra!😐here you go, you can keep it, dont even worry!😐omg that smell?😐it’s actually my brand new victoria’s secret scent.😐😐uh, ya bombshell! 😐😐you never heard? hmm. hmm! right. okay 😐well it was nice meeting you!😐sksksks and i oop and i oop! 😐😐", "hallie_bean_": "how do you get involved in this?", "briseis54": "here's for those who want trees to be planted: https://www.menschenfuermenschen.de. 1000 Trees will be planted in Ethiopia for 25 Euro. You could also go to facebook - there is the option 1 like = 1 tree.🍀", "troy_hohman18": "Don’t care", "selkaastrid": "solutions are available for those who agree to use them. problem is, most world leaders passed their own personal tipping point, so they could care less if our grand children die from lack of oxigen", "jaymo984": "And then threw all their signs on the floor, and not in the trash bins. What an ironic strike.", "moe.rauf": "Looks like 4 million people with either no jobs or any clear purpose in life. So it makes sense they have the time/luxury to go make a scene and throw a tamper tantrum. Unlike the people who actually have a purpose in life and an actual contribution to society and our economy🤙", "kaden.poyner": "Is that smoke 🧐looks like someone’s making the o zone worse 😂you’re little speech won’t do anything kid you’re all talk no do what are you gonna do about it the U.S isn’t the problem we have the lowest pollution then any country go to Africa go to China they won’t care what you say there", "vicaltamirano_": "I love u! ❤️💕", "hhuvfc": "Cdmx", "giovanni.zangrandi": "Ee basta", "irub3n": "I’m ready to strike again! Greetings from Italy! 💚", "nikola.m_8263": "Greta yarakberg fuckt mich ab valla", "carriecookstudio": "Hang in there, Greta! We're with you!", "gbschurswald312": "Join with all groups who want a better world- and shut down business as usual!💥🦋", "islas1854": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "marco.vrs": "#schrauberblog #carguys do we give a fuck?", "aleksandar_g1": "Add a Chinese translation", "andrea.lucherini_": "Fanculo", "playboii_ca": "🤡", "margot_betemps": "@_alicemercurio smettila di inquinare con le tue scorregge", "luizzcar68": "Salve the oceanos 🐬🐟🐠🐋🐚🦀🐙🐟🐟", "niksart12": "👏👏👏👏👍💕", "andriw_carazoo": "Why is the climate strike during work/school hours? I mean what is the reasoning behind it? No hate, just curious", "cuurrootd.33": "Gracias x darme un dia de vacaciones❤", "lornawhite_": "greta i don’t doubt u bby", "danielhavega": "Hej Greta, en favorit bland Colombia och en skillnad mellan eleverna på världskalendrarna, nu i Mexiko är Colombia fortfarande mitt i världen, men vi lever och mycket av detta år också, som en förändring som den kommer. du gör det, snälla skulle jag vilja att här i Colombia det fanns en ny kultur och känsla av tillhörighet för ditt land och hela världen, hjälp mig i Colombia. himlen💗", "reverendo_secret": "❤️❤️❤️", "discovercloud": "Thanks for being so Loud, we needed it! ❤️ you are an incredible inspiration to humanity", "oofarmy._org": "The protests produced so much litter in New York, they don’t care about the environment, they just want to follow something", "monisund": "❤️", "_maren.2109_": "Thank you Greta! We love you!!!", "hugohernandez.c": "❤️❤️❤️💪💪💪💪", "roza.somogyi": "@_jojokf its cute they do this during school time but if any of those yutes had to acc give up their weekend or do some real work like clean the streets we wouldnt be seeing this outcome sooo ‘impressive’ yh yh good work greta hun", "saeed_mamdouhi": "Wasting many paper to show environmental slogans - environment supporters against the environment", "mssroby": "🙏🏻", "sara_gs78": "🙌🏼💘💪🏼", "alisa_ko39": "Berlin? Recognize this beauty", "lena_turner321": "❤️❤️", "popular.kid8901": "I hate you", "eva.kappas": "Yes!!!!", "angiemmini": "You are an extremely beautiful and an amazing young lady. You are doing a fantastic job. 👍👍👍", "araya_sylstar": "👏👏👏👏👏👏👏", "lukasfrompoland": "Greta for you I can strike every Friday", "supersuvnan": "Stupid 🤡🌍", "kevin.cxmm": "Fuck you Greta", "donatello_83k": "Lol Soros is financing this sht", "karolina_araujo51": "Fridays for foture", "diminosaurous": "Angry little girl", "marlysekarina": "@waleskami @marilyn_gonzalez_medina", "andremaxwell.real": "pensé que era el Ángel de la Independencia", "whereuatbih": "🌎❤️", "tjaeellen": "❤️❤️❤️❤️", "booksandflowers_essingen": "👊🏼😊🌸", "tumids": "tell me how much you paid to do these things.", "kel122007": "When are you coming to Montreal", "marciabelmiro": "@josubah_as", "flipping_fur": "Go Greta ✨🙏✨🤗🌷✨", "apx.batuhan": "ABİ YAPMA ATMA ŞU İZMARİTİNİ DENİZE", "artesania.reutilizada": "👏👏👏👏👏", "teigan14x": "I was at area 51 getting my pet alien", "art_pictures_fotografie": "Weiter so !!!", "fun4ball": "Mal aq", "carolinahealthy.life": "Good job @gretathunberg This is awesome , thank you, so much, we support you 💪 🇵🇪", "ronilicious_vegan": "Yes!!!! #govegan 💚", "liliana.bcn": "Yesss wer‘re dtrong😍🙏🏼", "lena.onnerstedt": "❤️😊👍 I AM GOING FRIDAY TO MEDBORGARPLATSEN AT 12 TO DEMONSTRATE FOR THE CLIMATE /ENVIRONMENTS AND FOR A BETTER WORLD🙏 TIP : LISTEN TO THE NEWEST UN CLIMATE REPORT WHICH CAME OUT TODAY WEDNESDAY 25/9 !", "livroseee01": "if we can’t strike is there anything else we can do?", "maggienetland": "How about y’all actually fucking clean the earth instead of stand around in a huge crowd like a bunch of retards", "71connyandersson": "👍👍", "connor_bradshaw90": "Idiots the whole lot of them", "fideli3": "💚", "blip_on_spectrum": "Action speaks... what kind of action is going make the difference... talking with corrupt and evil leaders ain’t gonna change shit... they didn’t listen when I was young they won’t listen now... all they see is dollar signs and there is no profit in peace... so what action are u going to take.. I do what I can.. I recycle.. I have an electric car and solar panels on the roof.. what I want to get is some Omni direction wind generators for the roof as well being in the uk I’d be off the grid. I’ve also been looking into atmosphere water generators.. to see if they could be installed and run through the toliet and shower.. but they are expensive and I’m poor..", "elnazliya": "tebrıkler kardesım pankartlarınız dunyayi kurtardi", "yeahnahnahyeahnuh": "And nothing came out of it", "harristic21": "What did that do to reduce global temperatures?", "negativevibe": "Half of these comments are heartbreaking. I’m sorry that so many people in the world have lost hope so completely that they want to take their rage out on a young girl who still believes in something. Greta, everything I’ve heard you say is powerful because it is TRUE. If your words had no power, these trolls wouldn’t be here. Keep powering through and speaking your truth- tis goes out not just to Greta but also to whoever probably manages her page for her.", "ellaxfredman": "❤️", "mcr2": "@lily.goodrich you following??🙌💪🏼", "inthelifeofa": "Such a wow feeling looking back only one year, seeing a lone 15-year old starting a little school strike for the climate. Now it's something completely different, such an amazing job you are doing, Greta. Or should I call you, Great-a? 😁", "ninjannaa": "loveee!! this is mexico city!! 🇲🇽 🇲🇽", "clai323": "Mi raccomando, quando manifestate cagate bene il posto come al solito. Manifestano per sensibilizzare la gente al problema climatico e in 2 ore inquinano più di India e Cina messe insieme. Oh Gre, hai mezzo forrogu. #saveyourforrogu", "adanna_o1": "Wait is it in London", "francinemendoza_": "❤️😍😍💞", "ritashreegogoi_": "Earth ......... We need to save you ,now💚🍃🌏.", "_myassisonfire_": "Everybody in the comments are saying these strikes are making a mess when they're not? I went to one a bit ago and stayed till it was over, everybody picked up after themself and not a single thing was cluttering the ground", "samuellife_sm": "❤️❤️", "kivanctatlitugfa": "followin please", "786.diana": "The people who is laughing of these ‘climate strikes’ have to understand that, if this announced disaster occur every one will affected > will die or will have illness or will have difficulty to get food, water 💦 as is already happening 🌳 🍲🍕🥖🧀🍑🍇✨", "diana.gotcher": "🙏🏻❤️Awesome!!", "daniela_kouyzer": "👏🏻👏🏻👏🏻", "kustbor2008": "Grattis Greta !!! 🙏🏻Till det fina pris du fått idag!!!! 👍🎶🌺🌺🌺🌎", "batuuerogluu": "KES KES KES KES KES", "vega_mariajose": "💙💙💙", "xlly_cxrrell": "Ngl that smoke can’t be good for the climate so well done for helping it", "_saaaraaa_22_": "This Friday in my village will be a Friday for future. My village is very small, but we want to partecipe 💓", "birchtree2014": "This is proof 4 million people are behind you..not the haters,..", "farukhas_": "Bu kadar kişi toolanıp asilnpisliği siz yapıyorsunuz anneni lanetliyim senin ben", "eunice.rodiles": "This pic is MÉXICO CITY. I was there", "belindahir": "🌍💚👏", "dianelysmelendez": "👏👏👏👏👏👏👏👏👏", "florian.hoesl": "Ganget ind Schule isch gscheider", "_.spit._": "Vai zia", "froilanpretty": "🙌", "climetti": "How does one strike climate? Not trying to be an ass, genuine question.", "charlieharriii": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "ishahshadab": "We are with you ❣️india❣️", "lolazishere": "Thats like the population of new zealand", "carlatirad.o": "@renatamaluf_ wey y yo creía que era mex", "isabellaaaa_30": "@karen._.2706", "zaradurrani": "❤️❤️❤️❤️", "reaganpeters": "@katelyn_g_peters", "lady.st.ella": "💚", "sealife_sos": "❤️", "thebergamot": "🙌🏻🙌🏻🙌🏻🙌🏻", "eyybcrkc": "You think so wrong 🇹🇷😠", "_simo_pax_05": "Unfortunately, most Italians students do not go to protest but go shopping or stay at home just because they are at home from school.😢The current generation of children is not worried about climate problems rather some students don't give a damn😢. However you are a fantastic person because no boy / girl in the world would have protested about climate change so I respect you a lot😊", "shibui_mochi": "✊🏻✊🏻💚💚", "erin_caddy.xo": "I feel bad for the ppl that live there and they have to cope with all the crowds and drama about fake climate change", "chloemarie8": "See you in the streets 🌎 💚", "release__your___rainbow____": "@gretathunberg @greenpeace 🌱❤️", "valborgsdotter": "Ja, ut till Parken på FRIDAY FOR FUTURE!!! For Climate Togethere dit Greta and THE whole World of DOERS!!! 🎀❤️💃😘🙃😜🤩😀😃😊😘😛😋😉🙃🙂🤗🥰😍🤪", "_spccky._": "😍😍", "edugated": "Greta come to india so we could explain this to our adults too", "saltwaterblessed.co": "👏👏🤙", "kentucky_fried_children": "Just fucking stop we get the message you are blocking our roads and disrupting daily life #howdareyou", "saadusmann": "Cmon g👊🏽", "vanispa": "👏👏👏👏👏", "fbmk.reeves": "Nova Ordem Mundial. Acorda povo isso é mais uma manobra q de levar a população para 3° guerra mundial", "7_gman_7": "@geneviev.e wanna go on Friday?", "jeduardo2106": "Bando de atoa vão caçar emprego", "ivanpietrobom": "🤣🤣🤣🤣", "manuel030304": "Pfuiiiiii", "stella_clrm": "Climate change is real whether you like it or not🤷🏼‍♀️", "lucaslisterr": "7000th Comment", "ocean_trash": "❤️", "yanelvis_boutique": "Nice pic!", "mane_pontoglio04": "Greta nessuno ti ha rubato nulla tantomeno il futuro, anzi la claque e l'ovazione te la sei conquistata grazie ad un sistema che apparentemente disprezzi.", "monalisa_lh": "👍", "sammyreality": "Just 💩", "saletechiarastella": "#Alltogetherbrasil 🌎🌳🐳🐝🙋🏼‍♀️", "quadrifoglio_restaurant": "Brava Greta!", "luisfernandobotel": "neecesitamos mas gretas en este mundo!!!", "_giorgio.pozzana_": "#pizzeriainumeri", "igerhan_ayyldz": "Boş yapma çay yap", "theluminouswanderer": "I’ll be out there Greta!! Thank you for your courage", "readybecks": "❤️", "marandasimonet": "@gretathunberg thank you, thank you, thank you for all that you do, for all the you sacrifice in order to fight the good fight. You are an inspiration and beacon of light for us all and truly a living legend at the young age of 16. Keep on keeping girl!! You have the support of the world 🌍 and the fact that you’re making some people very uncomfortable is a sign that the truth you speak is real and those throwing shade can’t handle it. Continue shining beautiful young woman, we are with you!!!", "liviadc39": "👏👏👏👏", "salvora.mx": "Yes! 👏 Go! 👏 Remember... 👏 Hand made sustainable fashion can helps stopping global warming!", "_jonnytrovato_": "Non te la prendere ma mi stai sul cazzo", "lasolar79": "💪💪💪💪", "neeranath": "❤️", "ebfjcjbabxif": "shut the fuck up please u autistic kid", "andrewhhuff": "First off, I’m not going to attack this kid. I’m not going to insult her, but I am going to point out what she is doing: not one single time through her emotional act did she say one piece of factual evidence. Here’s facts: NASA has stated that \"climate change\" has many factors, including the earth’s tilt. https:// earthobservatory.nasa.gov/features/Milankovitch/ milankovitch.php — climate change is also effected by orbital variations. https:// earthobservatory.nasa.gov/features/Milankovitch/ milankovitch_2.php , https:// earthobservatory.nasa.gov/features/Milankovitch/ milankovitch_3.php — the FACTS are climate change narratives not only have trillions of dollars backing them, but also convince people to vote for policies and laws that give the government more control, especially over taxation. In 2014, Antarctica’s sea ice reached RECORD MAXIMUM. It was so thick, a global warming expedition literally got stuck in it (NASA) — no the ice caps are NOT melting. The sea levels are rising? Also wrong — Permanent Service for Mean Sea Level (PSMSL) reports no rise in sea level. 99% of scientists agree global warming is man made? Also wrong, 31,487 scientists from around the world have signed a petition disagreeing with the climate change narrative (PetitionProject) Al Gore preaches the climate change narrative, but he makes MILLIONS off of it. | wish this girl knew that! — The Climategate scandal proved that key data involving man—made climate change was manipulated. (Info with direct links from DailyWire) — Last but not least: Finnish scientists released a studv: “No Exoerimental hQOR Evidence for the Significant Anthropogenic Climate Change.\" https://arxiv.org/pdf/190100165.pdf — my final points: I certainly believe in living a cleaner life, and protecting our planet. Do not pollute, pick up your trash, and those who don’t should be punished. With that being said, according to the Global Carbon Budget of 2018, China (208%) and India (155%) are responsible for INCREASED carbon emissions while the US (—10%) and Europe (—16%) have DECREASED carbon emissions. LASTLY: All | ask is that you do REAL research from actual studies before falling into the narrative.", "spookyfooo": "Don’t forget about China", "o.fazli1": "HÜCUMMMMMMMMMMMM", "dickgerrald": "Thanks for making great memes for us to laugh at. That’s really all you’ve done. Now get your ass back in school and paddle your way back. Airplanes cause pollution.", "jakesarkan": "I see smoke in the background looks like the protesters are polluting the air", "riddlemethis1348": "👏👏👏", "annakristinakvick": "Fantastiska fina Greta! Du är bäst🤗💕👏", "asiatomasoni": "💚💚💚", "koraysrw": "ABLA YAPMA ATMA ŞU İZMİRİTİNİ DENİZE", "majidofficial84": "❤❤❤❤Love from iran", "josemauromaurobarros": "FORA BOLSONARO E TRUMP!!!", "caiohpergentino": "Lixo", "asdasdasdasd.as": "Abi yapma atma şu izmaritini denize", "yigit.dmrll": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "veryrarerodgers": "I’d rather attend school", "ideniizk": "Kes la velet", "asghar.sarvi2227": "Hi Greta. We are with you in Iran. We follow your way🖖", "artemis.xp": "If the earth had excisted 24 hours, humans excist 3 seconds. Look what we have done.", "rafaelblessed": "BOLSONARO 🇧🇷🇧🇷🇧🇷 TRUMP 🇺🇸🇺🇸🇺🇸 ARE THE BEST ...", "arthurccn": "you are a shame", "emrhn_aydnn": "aNasKm", "semihkya06": "Gerizekalı", "antkano29": "How dare you 😂", "pepperoniiiiiiiiiiiiiiii": "Keep up with the good work. Love from India💕", "wiesia.anna": "👍👍👍", "nielsduejensen": "You trash", "_a_chrono_": "Too sasy", "kauizer": "hayallerinin ammına koyyyayım", "lindalusen": "🌟💚", "m3m3_p1ug": "🤡🤡🤡🤡🤡🤡🤡", "marisa._alba": "@rksmith_", "sametguzel152": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "angela_realtor_reynolds": "So much ignorance..smh", "forthebhoyss": "I post beer pics", "kaanggarip": "Abi yapma atma şu izmaritini denize", "billburnsdesign": "You have inspired millions of people! Please keep going and don’t let the weak minded negativity stop you! You are an inspiration, Greta!! Come to San Francisco! We would welcome you with open arms!!", "lorenaisabelprado": "👌🏻👍😘🌷", "classy.caleb": "Thank you for speaking for all our generations to come. You brought so much awareness to adults and many other people and I want to thank you", "_.brockstar": "🤡", "pennycompton17": "I tried to tell people at the age of 40, and no one cared , I asked them at 15 to look after the planet and nobody cared, I pleaded with them at 25 to ask the ask the council where they were dumping they waste at and at 40 became a dive master. I saw the mess in the Middle East at 45 and to be honest Fuck knows what I’ll see at the age of nearly 50😟", "sannino.mario_": "Così pacco scuola", "alvarogomessousa": "👌😀", "albertodegaspariii": "Dio can venerdì vedi come riempio di merda tutto", "emir.sgnd": "CRİNGE OROSPU ÇOCU SENİ OTUR KÖŞEYE AĞLA TİPİNİ DALAĞINI SİKTİMİN EVLADI SENİ BİDE İSVEÇTE YAŞAYIP GENÇLİĞİMİ ALDILAR DİYOSUN 1 HAFTA GELDE ORTADOĞU YA ÖLEN ÇOCUKLARI ÖLEN ANALARI BABALARI GÖR SEN ANNANENİSİNİ SİKTİMİN EVLADI ANANIN YURDUNU TAŞINI TOPRAĞINI ANANA ANALDAN HD SİKEİM SENİN TİPİNİ ŞEKLİNİ ŞEMALİNİ SİKTİMİN EVLADI SENİ", "serkan.egerci": "Biz senin neyini çaldık zalımın vata daşı", "kellyy.oneal": "God help us", "_mvrtincho420": "Tai pasa a kk", "branson_rom": "Diesel trucks are cool", "pinturasmagide": "🌸🌸💚🌸🌸", "onatdolekoglu": "Abi yapma, atma şu izmaritini denize.", "onr.cfrgl": "Boş yapıyon bee", "alessia.cr_surfer": "💪💪💪", "alam_guraya": "YOU ARE 'TATTEE' didi which means awesome in hindi language", "marcelacsic12": "The dreams have been shattered are the starving children, the victims of sexual abuse, organ trafficking, the victims of wars and dictatorships, who beg for alms at the traffic lights! GRETA SHUT UP, YOU DON'T KNOW WHAT IT IS TO HAVE A STOLEN CHILD! Your Soros puppet must be earning a lot to spread lies around the world! Will study! How many children wanted to have the opportunity to study and can't! Aren't you ashamed your lunatic? You are such a bad actress!", "thesebsshowdailyorweekly": "The picture is in Mexico City", "clementinevangisteren": "Greta, you make me hope!! i think you are a little like Gandhi!!!! The british empire laughed about him - and he changed everything in India!!! Take care!!!!!!", "luciano_monaco_": "Ur a fucking loser", "mariadelcarmengalarreta": "IMAGINE!!", "ulasadullayev": "You can just criticize Why don't you offer to the problems and just criticize governments if you are so smart!?", "merc_gt_love": "Türkiyeye gelme ananı sikerler 🇹🇷🇹🇷🇹🇷", "donny__lundberg": "go commit suicide you disgusting cunt", "auarmon": "Svante Thunberg's biggest fictional character is her own daughter. Brilliant, you dumb normies", "rajath037": "What beautiful and effective use of paper and polymers, blocking a main road thus diverting traffic leading to potential snarls. This is what real environmental marches should look like.", "aila90324": "Greta 👏👏👏❤️❤️❤️", "hakotella": "thunberg should be arrested", "jkmutuga": "periodt", "evasj19": "💪🍀", "person___of___interest": "You guys are protesting against climate change, but why there is so much Smoke and pollution in your rally...? Is that what u guys are doing for Climate change..? A pseudo Climate Activist, A Fake Activist..!!", "cleber.vasconcelos.16": "Steric 😂😂😂", "garypenetang": "Child abuse", "j_th_24.06": "Eigentlich dürfte sie dann auch kein Handy haben", "under_theradar_for_now": "When did Steve Anthony Lawrence have a sex change?", "deborahrobinson3724": "I hear your voices, but PLEASE pick up your rubbish next time 🌈", "monikageissler62": "Respekt 👏", "shabeeb.pc": "❤️", "vendula.poc": "👏", "a_g_tony35": "Plane rules fuck sail boats", "johnjones7489": "4 mil ain’t shit, maybe .1% of the world", "annaktius": "Greta Thunberg ❤️❤️", "judeprv_": "Pushing the elites agenda", "gmurilox": "💚🌎", "sueqli": "U r polluting by using Instagram and posting pictures", "mariechristinelundgren": "♥️💜💙💚💛🧡❤️", "matt.78.89": "Good job reading off of a script someone else wrote for you. Spreading a false human narrative used for political gain.", "brucewayne83": "Du är bäst", "danieltriwelsch": "💪💪💪💪", "world_bit": "Fantastic", "the.world.needs.help": "Amazing work!!!! Greta you rock♥️♥️", "haydenhaines1776": "Your a lunatic", "purple_prens": "No io non ci credo a queste cose ma come ragionate?", "gennissen0102": "So you support violance?", "helloworldjapan": "😍😍😍😍😍😍😍", "aj.ulibarri": "❤️", "leafenvy": "💚", "hasaucakir": "Kardeşim çoğrafik kader var amk bizde isyan etsek keşke de silivri işte", "dibashmazumdar007": "A pure pupet of leftists, libarndu gang", "bcarias._": "Go school just that", "danielhc.09": "Greta is a fat girl name FYI 🤷🏼‍♂️", "jonssonoscar_": "Greta kan du godkänna min d24 a", "andremascittomiele": "Talk about Russia", "a.juren": "Svegliati", "udan_pari_": "❤️❤️you", "redfield._.chris": "Will Sweden still be neutral in any future wars after thisv"}