{"thiccc_boi_666": "who even cares about climate change. the world ain’t ever gonna be perfect stop trying", "patx57": "❤️", "rees2409": "Yeah. #Hate is so 2008", "sarahpx85": "Ain't nothing wrong with your looks,clothes,differences or behaviours. From one aspie to another you keep going 💪", "gypsywander25": "🤗🤗🤗🤗 😍", "systemspm0244": "❤️❤️❤️❤️❤️", "de_fantasyllo": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "volo_________moi": "Who loves McDonald's ❤️❤️❤️❤️", "jamie.1086": "❤️", "uuser_2345678": "Finally in this photo if you look your age.", "lionxdjak": "You are so damn beautiful. Hurry with getting 18 so I can marry you!", "dianamontoneslava": "Siempre adelante Greta", "andji.jovanovic": "💕", "iampurity333": "May you receive spiritual protection in your heart and energy field in the face of any haters🙏", "ich___ich__": "She forgot ah shit", "angel.berlinnn": "Go to school", "danicohnteasis": "Guys who wants to come with me to the ocean with some plastic and feed some animals just to piss her off? 💀", "fragtmichndwerichbinvalelol": "Da is n sexy Typ hinter dir", "oyku.bor": "Bruh autism is literally an illness", "axel_lubbe": "Da siehst du ganz wie dein Vater aus ^^", "_red_valentino": "Statt accuort che cadi", "tia_______________n": "You have just described yourself. You are disgusting", "jonas_sk0012": "I think that it is nice that she reminds us that the climate is a issue. But her rhetoric is a catastrophe. Especially considering the fact that she is supposedly uniting the world to this cause. Her rhetoric is not uniting anyone. It is creating hate. I would eve go as far as saying Trump’s rhetoric is more uniting than her rhetoric.", "michael_n_lila": "Well you sure are ugly", "volo_anima_tua": "I highly doubt we are able to change this", "samuelsmuks": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "laurxane3": "Jaja alle schimpfen über autos und und und aber alle politiker müssen am besten 20 mal im jahr in ulaub fliegen denn mit den Fahrzeugen wo politiker fahren da kommt ja nur warme Luft hinten raus ist klar", "maity.49": "Hat diese Person eigentlich Geschwister? Weil eine allein kann ja nicht so dumm sein!", "duarteleal2460": "Plastic", "aziz_nordine": "👍👍👍...very nice writing...💜❤️...🌹🔥.", "amandabergggren": "Okej fast Due fett fin ❤️❤️😻", "lunita.chik": "Wow verte Nice!", "jonas.bindr": "@christoph_suess_ @tomsll wos feidan dir eigentlich?", "_luca__ferro_": "@msccargo 😂 @mattia_zanga", "mrvmerino": "Me encanta verte sonreír!! 💪💪", "boriqua566": "You make us proud. Your voice is so loud, keep it going Greta! We need you in our future👍🙏🏽", "dmr__selina": "@iva.na.ivi", "yv11x": "👏👏👏👏👏👏👏👏👏👏👏", "trevmizer": "All your doing is bitching. How about come up with a plan and people will listen.", "apogeemotoworks": "Ignore negative vibes. They feed of seeing your reaction. Instead feed of it and keep on doing your thing but now 3 times more intense. You’ll see how far you get. AND FUCK THE OTHERS.", "cowboy5871": "👎🕷🕷🕷🕷🕷🕷🕷🕷🕷🕷🕷🕷🕷🕷🕷", "hellothisismymemepage": "Hello and welcome to my meme page", "adventuresofbeanz": "i love what you’re doing", "j_ven11": "Go to school", "cfaulky": "Fear is a powerful motivator... Ive been blown away by the criticism against climate change. However... people ARE changing- and many are willing to learn and make even small changes that all add up. Thank you for encouraging politicians so engage in these discussions and focus on environmental agendas... It’s inspiring to follow your journey Greta- keep it up🙌", "bella_gilardi": "Well put. Keep up the good fight. Millions more are behind you.", "karinacpacheco_": "I still believe in the world 'cause people like you @gretathunberg thank you, girl. 🇧🇷", "bottinelli.09": "🖕🖕🖕🖕🖕💩💩💩", "nurse_s7": "Greta you are very very lovely and a special girl. SPECIAL. 😍😘😘😘😘😘", "ma_p3ho": "I don't mean this comment as a hate or whatever, it's just a simple question. Do you and your family live a zero-waste? How do you travel? It is a bike/walking or bus/plane? Do you buy only handmade fair clothes/sacondhand clothes instead of having new fast fashion ones? Are you vegan? Do you plant your own food?", "hannahflutesh": "To have a learning deficit doesnt make you special", "angieee.as": "@amelie_078 vallah mach keine Auge auf des Wasser", "leslie_barr_": "Keep up the good work Greta, many years ago a teacher at the school I attended said it was young peoples job to protest and make changes for the better. Our protest was about banning the bomb. Well done Greta for getting people talking and hopefully action will be taken.", "ruslanzxv": "😍", "bar0ony": "💕💙🌸", "emmanuelsiguenza": "Isn’t it past your curfew?", "farber954": "climate change is just one symptom of the abuse humanity has been dealing our planet..overfishing..species annihilation..", "c_lasprilla": "U go girl", "therealsupermaaaan": "Because you're a moron... You blame everyone, but has no solution for anything...", "wrecxford": "you're not going anywhere near the streets.", "theronald83": "When will everyone realize the Kabal rule the earth not government officials", "amspecial1": "You actually don't matter any more than anyone else. You use fuel for its many uses the same as everyone else. This way of life will continue for you because you like comfort.", "jxsi.hnm_": "@jayla.mllr", "henryzuidhof": "20, 000 scientists listen one teacher. And if the teacher is an idiot, all students are idiots too.", "owenglynne": "I've been sailing and surfing for years it is wind power we rely on but the boats we sail and materials they are made from is'nt much better really carbon fibre doesn't degrade it's in our sails Foyle's is in every part of sailing windsurfing surfing I was hired to Foyls windsurfing and snapped the thin and it shattered everywhere in the sea", "maimonuh": "@dania.benismail", "ivycinnamon": "But you’re mocking leaders? Teachers? Political leaders.....your speech was very off topic at most, accusing people, attacking people and full of hate. You are a child, stop with the vile hate and be positive with your cause not hateful and angry.", "dionavdili": "Greta stop writing bullshit there are lots of kids that are in need or get bullied and you cry about haters. You grew with your hype and now you should live with it and stop crying.", "evelyn.luca": "😍", "carson_hill1355mtf": "STFU you don’t even get bullied u little bitch you have fucking like more than 1M follows if you were being bullied no one would fucking notice you", "zoomhaydenxc": "Bullies?!? Where!?!? I’ll talk to them! digital 👏 across the face like Charlie Murphy!", "calvinwisaacson": "Awful smiley for someone who thinks we’re all dying hmmmmmm LMAO", "cvonutassy": "kärlek slår hat ❤️❤️❤️ du är en otrolig människa och det är ett faktum!", "honestme.33": "just ignore them honey you have half a world supporting you. They come after everyone.", "itz.sevval": "@_ervaaaaa_", "schnecken_peter": "How dare you 😂👌😢", "ie.vancik": "Arent you riding a boat that kinda ruins the climate?", "beamner_dad": "The reason people pick on children and teenagers promoting science is that they don't even have a high school degree let alone a PhD or any knowledge what so ever of what is happening to the planet. Ohh but I forgot Mickey mouse was one of the many scientists that signed off saying the world is in danger because of c02 emissions. The fact you came and attacked my country, Canada over our pollution when our big oil companies actually spend money to find ways to lower emissions and have even built c02 capturing facilities that turn it back into energy. If you want to put your nose into something you have no clue about look at countries like China or India. The only thing you've done is destroyed Canadian lives after thousands have lost they're jobs in the west. It's not about hating on you it's about you hating on us because your one sided when most of us Canadians actually try and preserve what we have up here but we also need industry to live.", "tom110157": "Take no notice of them Greta you keep doing what you're doing it's a serious issue.👍", "charitasai": "I totally agree with you @gretathunberg", "erklinder": "Åka båt eller", "88dragonsboutique": "You are not presenting 'all the science'.... That makes your argument bias. There are plenty of scientists that don't agree with your 'facts' about the science of Co2. Its not fair for you and your team to be fear mongering the children of the world like this.", "jase_da_ace": "❤️", "enchantress_emogirl": "Nice smile 💗💚", "prvt_m0r1tz": "Plastic", "emily.crm": "@vxn_offi", "johannabohlin__": "I can't believe the mean things people say and write about you. I am truly grateful for such a fantastic young woman to represent Mother Earth (and Sweden) in the way you do. You are a force. Thank you for not giving up.", "roonblad": "Ja kör d24 å ska förstör världen", "cirofiscoremax": "Tittyyyyyyy", "megowhatt": "Some people act strange around productivity. You are brave and correct. The work you are doing for our one and only beautiful planet is so important. Keep going!", "octoberfire13": "\"And a little child shall lead them\" ----. The bible says this - tell that to all of the ignorant fucks out there - YOU are an incredible indigo crystalline human being who has a vital mission to save our planet. I am so sorry for all of the idiots this world has. Keep shouting the truth!!!!! Thank you for existing!!!", "life.is.a.dimple": "🤢🤮", "zac.10r": "Your shirt is not eco friendly. Nor is the boat you're on thats burning fossil fuels. HOww DäRreę YøûUU!!! ¡11!1!!!", "low_rpm": "How dare you ignore China and India’s role !!!! You disgust me", "___.l_a_r_a.___": "What's wrong with them haters. For real. She's just presenting scientific facts as well as she stands up for what she thinks is right. (not to forget that the science has her back.) You are free to state wether you like this scientific \"point of view\" or if you don't, but all this hate on her as a person is so unnecessary.", "madamechourico": "@gretathunberg youre just what we need. You are amazing. Please ignore the imbeciles 🙌", "chiaraodelli_": "😁🌍", "cookie_pride_": "👏💝", "scat.packex1": "Lol she sounds like Donald Trump with all those lies and sacramwntz.", "hila.add91": "@gretathunberg Keep going beautiful girl! You are an absolute inspiration and a savior! And remember, whilst these bullies who have no life are actively choosing to put you down( how unbelievably sad), YOU ARE SAVING THE WORLD! 💪🏼💪🏼💪🏼💪🏼", "cars.cgn": "DIESEL4LIVE", "aleishathom": "You know getting to all these places that you are travelling to and the boats you use are contributing to climate change right....", "goopetr": "Who wrote this for you? #puppet", "lucarighi6": "Ma affonderai prima o poi?", "baberjamil44": "@muneeba___javed", "serega_geynts": "Поскольку Гретта – экологическая активистка, то она публично отказалась лететь на самолёте в Нью-Йорк. Официальная публичная причина, озвученная для СМИ: самолёт обладает слишком большим \"углеродным следом\": этот вид транспорта не экологичен, портит атмосферу, разрушает озоновый слой, развивает глобальное потепление и т.д. Гретта принципиально не летает на самолетах. Никогда. Поэтому из Швеции в Нью-Йорк она добиралась на яхте «Малиция II», ранее носившей название «Эдмонд де Ротшильд». Первое название вызвано тем, что заказчиком яхты был глава французской ветви Ротшильдов, бывший работодатель Эммануэля Макрона Бенджамин де Ротшильд. На «Малиции II» во время пересечения Атлантики, по требованию Греты, был опечатан дизельный мотор, который должен быть на каждом подобном плавсредстве в целях безопасности. В сети уже успели подискутировать на тему того, что производство самой яхты из углепластика оставляет не меньший, но даже больший \"углеродный след\". Но дело даже не в этом. На яхте якобы есть солнечные батареи и подводные турбины для выработки электроэнергии (движок то молчит), но дело и не в этом тоже. Дамы и господа – крепитесь. Сейчас будет самая мякотка: Гретта с сопровождающими пересекала атлантику на 20 метровой гоночной яхте с опечатанным дизельным мотором, то есть под парусом. Путешествие заняло около 20 дней. Экипаж яхты (без учеты пассажиров), необходимый чтобы яхта хоть куда-то приплыла вообще – 5 моряков. После прибытия в Нью-йорк, Гретта отдыхала несколько дней, потом выступала в ООН. Какое-то время после выступления она ещё проведёт в Нью-Йорке, потом тем же ходом домой в Швецию. Моряки, которые пригнали яхту с Греттой в Нью-Йорк сошли на берег и улетают домой самолётом. Им на смену прилетают самолётом ещё 5 моряков, которые будут на той же яхте везти Гретту обратно в Швецию ещё 20 дней. Итог: заботясь об экологии Гретта отказалась лететь вдвоём с папой через океан. Поэтому десять человек пересекают этот же океан на неэкологичном самолёте, чтобы сберечь окружающую среду. 10 авиабилетов вместо 4х авиабилетов, оставляя тот же \"углеродный след\".", "miguelitosueco": "Vet du ens hur många extra flygresor DU har skapat med att flyga ett helt team hit och dit för att DU ska kunna \"skina\" med att DU har åkt båt över Atlanten? Väldigt många fler än om du själv och någon mer hade flugit fram och tillbaka själva!! Var såg du vinsten i det förutom egen publicitet?! 🤮🤮🤮", "ryan25ritaa": "🤮🤮🤮🤮🤮", "bestiiivictoria": "HOW DARE YOU 🤦‍♀️", "sticki.bun": "No it’s not that, we just find you extremely annoying; you have one of those faces. 🤷🏻‍♀️", "l0n3.w0lf200": "@gretathunberg what if it turns out you and all the climate scientists were wrong? And global warming was just natural and inevitable", "ernest8pac": "I havent seen any science on your behalf yet.... how about a sail boat no engine 👌🏻 and camera crew and anyone else the same boats as you", "sueinburg": "When I was younger, it was all about saving the trees. Go to plastic that’s the answer! Then it was to much plastic in the ocean, go to paper....😏 The issues are not new just always changing with every generation. Anger is not always the answer. If your science is right it’s right. You also need to be in country’s where people are wearing mask because of pollution. Not picture yourself in front of beautiful mountains. Traveling to all the nice scenic places I’ve noticed you pictured in. Go to the places where people are truly suffering. Another thought...Why not do your protest on Saturday’s? Possibly because kids wouldn’t show up? Skipping school on Friday’s for a cause is so much more effective. Really?", "cecigrif": "A la gilada ni cabida, Greta hermosa, valiente! 💚", "rvd_toronto": "You are way too smart and mature for those losers! You are beautiful inside and out 💕💕💕", "haoshung7": "Enteligent people love you greta dont let the ignorant fools upset you.yourself and the next generation should be heard you and next genaration are our next leaders", "deniz_yoosefi": "Good luck", "maximegabus87": "Jveux pas faire lbatard mais ils ont obligatoirement utilisé un moteur pour la traversée", "chrissie_x_x_": "For everyone reading this comment. Isn’t it about doing the very best you can to do something positiv for our planet, for all the people that suffer for our luxury goods and for all the animals we kill just to satisfy hunger and our once again endless wish of luxury just to set some kind of statement. It’s not about you changing the planet in one step but it’s about noticing what’s wrong and what can be easily changed just by trying different things and learning to not just think about yourself and about what you “want” “need” and “desire”. We should be thankful that someone is trying this hard. And to all the haters... I’m glad that now you’re actually talking thinking and arguing about climate change😉", "vl_opps_lv": "I wish u boat would of sank", "yuliyasf": "What makes you different? Just because you decided not to be in school when everyone else is you are different? What you gonna do about kids that wished they could be getting education right now that you decided to neglect?", "allmygodsblack": "Hell yea thanks for everything. Fuck the haters !!", "iamnotarobotyet": "We loooooove to hate uuuuu!!!!😂you definitely deserve us!!!!", "ringo_tc": "All the haters will realise she is very right when there dying from climate change when we are older and there chuldren", "doseofhotcafelatte": "@patmac3 👍🏻", "crismerli": "Ativista sem sonhos? Sério. 🤣🤣🤣🤣", "geiles_schwein_____": "Drown yourself", "patmac3": "Don’t give up the fight!", "k.trissa": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿", "shadow_behind_yu": "I Hope you die", "medeastorfield": "Probably because you act like a retard in front of everyone 24/7", "swedishsparrow": "Bring me that horizon! You go girl! 👍⚓️☠️🌊", "lolitaultrachika": "Piece of shit", "ninageorgakopoulos": "You’re such a beautiful, smart and passionate young lady. Don’t lose your drive! ❤️", "vanessaschwarze": "👌🏼❤️", "joshjgb": "Tool of the rich", "nissems": "❤️", "heathjb5": "You are amazing @gretathunberg You will make a difference in this world! 🙏thankyou😁", "kevin_v.w_": "Traveling with boat can be worse for the planet", "misszimmer": "What are you actually doing to help other than talking? I don't see any pics of you actually doing anything productive..you know..helping. just running your angry little mouth", "jackstorrie": "Grow up there’s no crisis", "giorgia.de_stefanis": "Hai gli emorroidi se li hai dimmelo", "webjunkie23": "wasn't RU486 on sale in sweden in 2002?", "brianna_is_culmsy": "ok detta är för mycket din idiot", "romyl05": "You look so cute with open hair❤️you should wear it more like that!", "maeni.9071": "How dare the haters😂😂", "sephiroth_khan": "❤️", "george.rizov": "You have such a fantastic smile in this photo, and at the same time, you’re spreading positive energy to everyone on the planet!!!", "edvardroevik": "😁", "emilywiest": "You're incredible, thank you so much for fighting and keeping hope alive. There are many reasons adults are cruel the top two (in my opinion) being money and lack of education. Keep kicking ass kid.", "colored_graff": "Don’t be so naive. You have so much faith in these so called scientists. While you praise them there making the same inventions that kill are planet. I never heard you speak a word about chemicals they spray in the sky or the poison they put in our food. All of which are science driving. I agree the world is changing but it’s gonna Change with or without us.", "michellemckinlaysmith": "Greta, you look much \"nicer\" when you smile. :) You can still be firm and positive with a smile. I hope you can go see what's happening on the Pacific Coast with the sealions eating all of the salmon. It's horrible. Oregon doesn't know what to do about it and soon, we will have no fish. Climate change? Perhaps. It's heating the waters, moving the sealions up the coastline from California. They are even in our river system now. UGG.", "michael.vanderheiden.7": "Shut up child go play with your friends", "_majid_ku": "Your smile is worthy ...❤️❤️❤️❤️❤️", "siddharth_0076": "How dare you leave your school", "hsn.mhmdbwhsn": "😄🙋💋", "ellouisewilkie": "Fucking legend 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "tomf760": "Wow look at you on a boat pumping co2 into the ocean tut tut", "casch112": "😍 @gretathunberg", "lina.spzle": "@x.02emmadau10.x", "hayden.carmalt": "How dare you use a boat and shit talk UN leaders", "sophierosee._x": "GET IN THE BOAT", "afsheen_2009": "You are really brave 💪🏼", "adam_mack71": "Respect their diversity to hate you.", "kadir_sygn": "🇹🇷", "jesse7j": "This is all wrong, you should be in school", "meganlynnalder": "I am so inspired by you! I’m a PhD student researching Autism. Supportive of you and your differences. #GoScience!", "davidbl91": "Bby😍", "nihil_liberum_est": "KLIMA JUGEND 😂😂😂", "cjsouthwell_": "@oli.io", "morgan.tien": "❤️❤️❤️❤️", "kudram1977": "What is wrong with your looks, clothing or behavior? I see no issue.", "christian_tiller": "Mmmmmm milf @sondre.skaugen 🤪", "v1_lasco": "Keep your focus on the positive things and the people standing beside you. You and your generation will change the world that my generation neglected and abused. Change is coming.", "trm.nina": "@trommerlisa", "lexinejefferies": "You are my inspiration", "nill_2121": "boats increase global warming, go swimming", "reidscoones": "Oh my a boat I’m pretty sure they contribute to global warming", "oliver_rasche3": "Offene Haare stehen dir echt gut. Manchmal ist es besser das Gummi wegzulassen bei dir war’s ein Fehler", "gl44ch": "🛩", "mehdi.bagheri.78": "نخند مسواک گرون میشه", "_schmily_": "I just don't understand the hate in these comments! Keep going honey! I admire everything you do!!!", "marianduanet": "This too @mgbolin16 the 50 year old haters gona hate 🎼", "niclaswww": "Suomalaiset toi meni new yorkkii purjeveneel ja se kulutti enemmän ku lentokoneel meneminen😂😂😂😂😂", "speerzadi": "Greta is cool. Be like Greta!👍😃 #morepowertoyou", "begging4eilish": "True true true! Don't worry Greta, ignore them 💕", "infinity_spuki": "OMG YOU SAY SAVE THE WORLD BUT YOU GO WITH ONE BOAT OVER THE OCEAN", "wu.tang.mariee": "Haare offen sieht ja noch behinderter auf", "kristinehartgen": "⚡️⚡️⚡️⚡️💜💜💜💜💗💗💗💗", "veletcapsleri": "Ah shit Here we go again", "lxra_.1912": "Und zwei Wochen ins Meer geschissen !..🙄", "analdruse": "The hole world hate you Greta fuckingthunberg", "12dario91": "Schad esch dis verdammte scheff ned ondergange", "daniel123272727": "So Nice and frech to se you look fantastic and l love The ocean", "54.gwen": "@dmn.ad", "cyber_christ": "Greta what do you think about eliminating China/India and the emerging African continent from the globe in order to combat climate change?", "its_steven5_5": "How dare you", "paul.gagnon_": "Joe mama", "prinzess223": "Na wie ist sie denn zurück gekommen???", "we1yu_0uyan8": "Actually, even NASA said that there’s climate change because of change in the earths orbit and NASA definitely knows more than you. Like serious facts", "iam_louda": "👏👏👏👏👏👏👏👏👏👏", "simon_huber_2901": "Hübscher yet", "bl_aiir": "All you care about is just point making and arguing instead of actually doing something", "dmillaaaa": "look bitch, rolling coal is fun and you aint never gonna take that from me, fuck you and the EPA. #countryboycansurvive", "amie.escalante": "You are beautiful! ❤️", "margot_arte_povera": "👏👏👏💚💚💚🌷", "great_ravi_scudieri": "👏", "marcus_nyman_": "🤡", "withlesandlee": "Forget the haters.. We have them all the time but we truly believe that united we stand together in love and peace. We as an older couple sincerely want our beautiful work to be there for your generations to love and explore 💚💚💚💚💚", "oliviervandewaetere": "How dare you!", "fbi_04": "Theis is the final of the climage you Drive boat hahahahahah 😂", "lucylou_theresa": "You're an incredibly brave warrior and we're so grateful for all that you're doing. They are scared! 💪❤️", "poppyhxne": "You absolute phsyco", "rayna.auerbach": "you go girl!!!", "verdure.vino": "#climatechangeisreal #istandwithgreta", "katievantassell": "Keep going, kiddo! You're doing amazing things. We hear you, we see you, and we support you!", "mayaeugenie": "many scientists have also said climate change is a hoax... oh wait you only want to hear your side.", "hejhejhejhejehjehejjej": "🖕🏽", "eli_showtime": "Do you eat beef ? It’s just as bad for the environment having cattle and the release of there toxins so you should visit farmers first before your worried about climate change. And the cell phone your using to take pictures and be an activist to a made from oil but you already know that being so clever. @gretathunberg", "marta.alice_": "💙", "maniero86": "Dee caenee", "femme.fatality_": "Okay but global warming and cooling is natural. I AGREE right now we ARE GOING THROUGH GLOBAL WARMING but we will come to a point where it starts to cool again. Just look at graphs over the course of thousands of years.", "bobby_balboa90": "Starseed be strong!", "hippeechic": "you are light 💛", "summerstreasures": "Menschen sind nicht einzigartig sondern das, was sie aus den Dingen machen. Jeder ist anderst! ✨✨✨✨✨✨✨", "shuggito75": "Really look like someone has steal your childhood", "oggefogge": "Why didn't you just take the flight", "goni.nataraja": "Asd i see, most adults are just kids but with more years behind them, still having no f*ing clue about the world and how things are going. playing with big kids toys like cars and money but we basically do the same things as a 5 years old and we are super proud of our adult selves:/", "lucasbennettt": "I actually not an adult and its just fun fuckin around with u", "orsolyagonsalves": "I have twins possibly may have autism and just because they are different that doesn’t mean that they don’t know anything in fact they are both very smart and that is what some people are so scared of . You are perfect in every way sweetie and don’t ever listen to those negative people! I admire your intelligence!!!!!!!", "tianafowlerr": "you are complaining about pollution and animals dying, and here you are sitting on a SPEED BOAT on the OCEAN taking a photo and talking about haters. Your digging your own hole.", "discoveryspirit": "❤️❤️❤️❤️", "x.lxcxs": "theres no picture of your flight home?", "leni.wnzr": "du bist für umwelt und fährt mit einem boot", "samashaorig": "🙏🏼", "kingavry": "SHUT THE FUCK UP NIGGER", "jishwaduntop": "I was telling my mom about you (I’m 14) and was talking about how I wanted to be vegan because the planet is dying and I was saying how you were vegan and stuff and she said “within a year she’ll be eating meat” and I was speechless on how a 50 year old could somehow read the mind of a 16 year old who wasn’t even on the same continent. My mom says she believes in climate change and says she wants to stop it but she won’t even take a little step like being vegan to help. She won’t let me be vegan because she says it’s not healthy but she’s here being 50 and having arthritis when there is scientific studies proving that being vegan and eating organic can help get rid of diabetes and sooth arthritis. She’s so arrogant I can’t believe her sometimes 🙄", "adrianmendoza651": "I am with you", "osgood_newport": "It's not all adults thankfully. Keep at it and be strong.", "kiweess": "Hello we are small GRETAS. I'm Elsa and Júlia, and we are 9 years old 😘😘✌️✌️🌍🌍", "tatiana.holly": "❤️❤️❤️❤️", "mikecreegan13": "You look like an alien", "mattheeww": "Pecosso 💣", "my.wbls39": "Stay strong and keep fighting!", "stallard495": "Mouth grinning. Eyes dead.", "charliepr_09": "“bUt yOuR pOLLuTiNg tHe oCeAn!!!!”", "susannenajimaddinflod": "You 're very good looking /sweet, clever and bright girl. And you are very brave.", "julia.mcneill": "@nico010nico @sebsarcar the haters are as active as ever!", "lilthickky": "Boats cause polution", "jared081093": "Get em Greta!", "lazy_bishhhh": "“PEOPLE ARE DYING” head ass", "harry.birdsall": "THICCCCCY", "enricoacomanni": "Puzzi di plastica", "praise_oggie": "Silence, boomer", "sem_dargel": "Autist", "alcoricko12": "@gretathunberg where you say “they come up with every thinkable lie and conspiracy theory” isn’t that what you’re doing, I mean you can’t hay go round being a hypocrite can you if you’re the ‘leader of climate change’", "pvucic305": "I love you ♥️♥️♥️♥️♥️♥️♥️♥️", "rugbylover": "... and yet you mock us and tell us how we have “robbed” you of your future forgetting that we live in that future as well.", "pojhggu": "Que te valga no", "vincent_mansfeld_cb": "I am coming for you and when i see you @gretathunberg YOU‘RE NEXT", "rayanfelipeoficial": "Your dreams are not stollen, you spoilt brat.", "leni.australia": "You go girl! A lot of love❤️🙏", "tracey777poole": "Keep spreading your light Greta. Nothing’s going to stop it. It is too bright to fight. You are an inspiration and I truly admire your inner strength and determination. ❤️", "purplechicken_14": "I love you! You inspire me! 😍😍❤️❤️❤️❤️", "patrickmikey": "but ur not a scientist 🤣", "jackpalmer3815": "Brush ur teeth ya dog", "paul182838": "👎🏻Shit", "inspire.handledning": "Jag är pappa till 2 aspies och tycker att de är bäst! Bry dig inte om hatarna, fortsätt att vara dig själv!", "potprincessstephanie": "Love you girl. You give me hope", "hjonathan_06": "The only reason she goes boat is because it looks good in the media. The flight she really should have taken will go no matter what!", "nico.ngonda": "@greta.gre1 How sad my life of not traveling on a yacht and having breakfast 5000$ trash", "afghan_tanzz": "Iam really sepporting what you are doing to us and the next generation when it cames to climate questions.... But you are sponsored by a car campaign😊😊😊😊", "the_chcken_nugget": "You’re literally making an excuse for kids to leave school. Screaming “CHANGE” outside isn’t going to fix anything so shut up and it’s not just adults so be quite little girl", "kelencristinaborges": "Keep going @gretathunberg change is coming. We are all very proud of you and your brave generation. 💕", "rosiewhite\nVerified": "Verified", "twoscoops90": "Unless they payin’ your bills, pay them bitches no mind ✌🏻❤️ @gretathunberg", "chuy0556": "You look just like the little girl Hitler had on his propaganda posters.", "dhruvit_pindoria": "Hello, you probably wont see this comment but I would just like to say it is genuinely amazing what you have done and that to at such a young age. It is amazing that you have made such a massive change and inspired so many people. How dare others come after you about your looks and behaviour when you're simply doing nothing wrong. It's atrocious and pitiful that they are trying to shut such a strong, powerful and amazing voice. The consequences of their heinous actions are to be fixed by our generation just for them to complain about saving the lives of their children and if we continue this way it will be their lives as well. Not everyone can be completely eco friendly, but small steps make massive differences. 1 person may not be able to do much alone but if 7.5 billion of those single persons make a difference this would not be such a dangerous issue we have to worry about ever day and the foreseeable future which may not even exist due to our vulgar actions.", "0s.k.4r": "If ur such a freek about climate y u on a boat ?? It polluted the oceans ?", "elle_vievo": "☆ \" When they could do something good instead..!! \"", "raphael.crz": "How dare you", "garmentfarmer": "I'm with you Greta! stay strong , the truth is on your side", "kobo_diver": "How much does that boat pollute the ocean", "gmbkevans": "My husband and I think you are AMAZING ♡♡♡ I work in special education with many fine students and am appalled to hear a US Senator (Lindsey Graham) have the audacity to mock you in any way. You are a blessing and a game changer.... thank you for your incredible wisdom and audacity and intelligence and for your desire to make this world a better place. ♡♡♡", "keira.re.12": "Those haters should be ashamed because they have not done anything to help this earth and it is our home watching these things that is happening to our earth is horrible and I am very happy and glad for someone like you to do these incredible things and helping this world and I am also a someone who wants to help the world too and thank you very much for inspiring all these people and teaching them and I love listening to your important speach❤️👏👏", "ingezinnia": "💛", "danvik_berg": "Little shit that’s what you are", "caibarry": "I have a massive crush on you, please go to prom with me", "0onnie_": "Changing the World @gretathunberg", "aatmanhart": "Tell em! ❤️❤️❤️", "arash_sanayei": "💪😍", "benjah_679.em": "U watch pewdiepie?", "zoltan_steven": "The most current science says that Climate changes based on the rotation of the earth. So all of this \"crisis\" and \"possible extinction\" garbage is irrelevant to actual science. The people on the planet cannot change the climate.", "alvawkonigsson": "Gillar verkligen denhär bilden på dig, den är jättefin❤️", "jordi_ls_god": "Your haters don’t like your attitude and extreme and irrational point of view we all grew up hearing about climate change we’ve all been indoctrinated we all believe in it but when you lie to us and say that well be gone in 10-15 years we stop following when you accuse it of draining your education when it’s on you to be strong have the will power and keep going not on the temperature and those affected by it you must do for yourself before you do for others people that go after you for being different are fucked but you have to realize that not all of your criticism is invalid it has merit and at least in my opinion if someone insults you you might as well benefit from it and learn. Most people agree we should do something about climate change but give good economical alternatives and be rational you’ll haters will become your supporters", "stinater.p": "Fortsätt kämpa, ser upp till dig du är en så stark individ och sättet du behandlar all Trumps skit! Så himla starkt av dig, du får folk att få en bättre syn till vad som faktiskt händer!", "dance.moms.stan.05": "@lucymarfleet2005 she is literally me I am her let’s be honest", "sebastian_2005_738": "Ps.we hate you so much", "krysahamud": "Fuck off grete", "katieterringtonprivatetravel": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "zeta_swartz07": "❤️", "toast_246": "Dumm", "luna.basicss": "👍🏻👍🏻👍🏻👍🏻", "siimpaddict": "stfu greta", "j.french123": "Stfu ur probs on a Diesel engine boat ya cheeky cunt", "minibeatmusic": "Greta please take a look at my songs. I am a singersongwriter writing for children and adults. I have been writing songsabout the environment for around ten years. I have been trying to reach a platform as I know that children respond and take in board the issues they hear about through music. My son is autistic and the reason why I got into writing music for children . It’s a long story but many people have suggested I connect with you so here I am. Here is a link to some of my music and I have been busking at Trafalgar Square this week. Best wishes Caroline x💚 https://carolinechanearthcalling.bandcamp.com/releases", "stormhaasnoot": "I don't think that's an electric motor on that boat..", "sund_sofie": "Sverige är så stolt över dig", "zhenulencia": "Some people get absolutely blinded by money 💰", "_http__nele_": "Hallo my besti Sorry i throw hundred plastic bottles in the sea", "susannakjellbergart": "♥️", "divrugram": "@tomcruise2021 bhau mai marr gya iski hasi pr ❤️❤️", "kellygawronskii": "Your sixteen saying your “childhood was taken away” no one asked you to do this go to school and still make climate change protests with cardboard it’s creating more waste some do believe in climate change your just acting simply like a child", "eric_priiiiv": "@crossjoakim snygg va?????😍😍😍😍", "xavierbrgx": "Big Up! 🙌", "vilde.tveit.eide": "MILJØ SVIN", "ebony.lamb": "@kaylavidovic 🤣🤣🤣🤣", "123placeholderr": "i do not for a second believe shes not a media puppet. she doesnt actually do anything with science besides talk about so why is it her thats talking about it and not the people that are actually cleaning the ocean", "jaster.maciel": "⛵⛵⛵", "ramipokerito": "Menu", "jxstxn._05": "Ugly🤮", "spicyxchick": "not a threat. it's a joke for us hahaha.", "thunderstruck888": "Du dusselige Kuh hast doch n Schatten!!! Einen auf Klima heucheln aber mitm Boot darüber schippern und vom Heli beobachten lassen dass du nicht absäufst. Was bei dir nicht stimmt.....", "xuxa_leon_": "💪🏼💪🏼💪🏼", "einfach.paco": "How dare you?!😢", "lillineumeister": "👏🏼", "dave_s762": "Before fossil fuels before steam engines the earth had many changes going on the meltdown the freeze another meltdown the big floods the Droughts. I am much older than you but younger than most of all these people that you hold in high regard And take their advice for truth but I’m also young enough to remember what I learned in school what schools used to teach kids about how the earth has had so many cycles and how many times the earth has changed and will continue to change. Last time I checked 35 45 million years ago there was no airplanes no cars and no rockets launching into outer space and that long ago the changes that the earth went through were 20 times worse than anything that we can imagine that could happen in our life time. Sorry to brake it to you but u have been lied to and Used by lots of people I will 🙏🏼🙏🏼🙏🏼🙏🏼 for u I’m Judging you or picking on you or bullying you I’m simply stating the facts think about that the next time you travel to your next location", "sugandha1991": "❤️❤️ you're doing amazing things. People feel jealous and threatened and want to bring you down. Don't let them. We all believe in you. ❤️❤️", "fisherstime": "Knowing that you didn‘t wrote the Text says everything about you 🤦🏻‍♂️!", "flexxity_": "Damn that smile😍😍😍", "colemanfox23": "🙏🙏", "husainzakir10": "See your face again in the mirror, what looks? , What clothes?", "laraa507": "Sehr schöne Selfies, welche mit deinem mobilen Endgerät angefertigt wurden und dieses unter sehr guten Bedingungen hergestellt wurden🌞", "leonsofficial_": "You are amazing … I love you ♥️#saveourplanet", "paulin.076": "I love my moped it spreads so nice exhaust you too?💨 #savetheplanet @leonsofficial_ @laraa507", "lena_tthhee_lena": "You are really brave and thank you that you are helping the world that is really cool!", "mrs_kauahi2020": "❤️ You are such a beautiful light in this dark world!! Thank you for your strength & LOVE of our EARTH 🌍 for not staying quite ❤️ #riseup #alohaikekahiikekahi", "laru.uwu": "\"an horrible childhood\"", "jacky_1nov": "😍", "chigo.ng": "You ruined my childhood mimimi...", "tristen.jacobson": "Go back to the mental hospital", "erykmalerba": "Vatt coca", "noel.btl": "So and how did you get back from the US right you flew with the US airforce", "jason.187erzz": "This Fucking boat is Made of plastic!", "daddy.dracula": "I respect you more than I will ever respect the officials in power.", "benjamin_perer": "Wow, such a big hero, ain't you", "mollyhartzell1": "GRETA FOR PRESIDENT 🤩🤪😤", "chloedanyail": "your a joke. i’m the same age as you but i speak for myself not for what the adults behind me want me to say. if you wanna make a change use your own voice not others. your mouth may be moving but other peoples words are coming out of it. you have no idea what your doing. you are the joke of the decade hun.", "pedro_do_opala": "Coitada, sem infância, tendo que chorar num barco de luxo desse", "instapattycake": "Greta didn’t write this, did she, handler?", "natalia_catalinag_": "I'm so proud for you, you are amazing person!!", "maggiemae.mont": "Keep going! Adults mock you because you are mighty and fierce🙌🙌 and u know more than them. State the facts and you will never go wrong! My girls are inspired by you..my Aspie 18 year old and my 16 year old so Don't Stop Now🔥🔥🔥 U have a World To Change", "ethanlele1": "It’s so disappointing that people are hating and making fun of you, a person with Aspergers trying to help our planet, it’s disgusting and they should be ashamed", "tyra225325": "I find it amazing that a person like you - knowing how boats and engines can do serious damage to ocean - would post this photo to attack your “haters”. Your behavior totally belies your thoughts, which is your biggest enemy.", "caydenjames123": "You Swedish retard", "_____________isa______________": "👏🏼❤️👏🏼❤️👏🏼❤️👏🏼❤️", "johnny_mckenzie": "Did your mom write that too", "_elias_201": "🧐", "normansuppenschuessel": "Ah shit, here we go again", "tyler_denton23": "Like they do trump", "ssmo2015": "You go girl!!! 🙌 ❤️", "deniseemily08": "Girl I started becoming more involved in other things I'm passionate about xuz of you! You are awesome and keep it up!💕", "curicandcuric": "Thank you for fighting! We are doing the same and we recycle denim!! #united #gretaFights", "1k.jer_": "Bruh huge L", "alejandrol1426": "🤡🤡🤡🤡🤡🤡🤡🤡🤡", "bender.almond": "you clown🤡", "laura13067": "Your looks are pure,your clothes are appropriate,your behavior is mature and inspiring and your difference has made a HUGE difference in and on our planet and I cannot begin to tell you how much I love you and respect you!", "e_alery2686": "You do you boo! You are standing up for an amazing cause!!🙌🙌🙌", "susanwadeweeks": "Positivity please. Solutions. Many good people are making big changes and working on solutions. I find the campaign too negative . Spend that energy on practical action .", "cameron.epp": "You took a boat to America to not add to climate change but the crew flew back to Europe after", "bb8breydenread": "“HOW DARE YOU” you can’t talk you are literally mentally retarded", "laurrgemi": "I hope someday you figure out that climate change is being used to control us, to lierally break the backs of every American.My country is the country that has been willing to send its young people togive up their lives to save you when you get in trouble.When there is no United States, who will save you? Don't count on the New World Order to save you.", "6710.cecilia": "These people you are talking about, are not haters. They are sensible people who know the border between taking action, and going too far. These people know that you should use the money you spend on planes going around the world, to fund organizations that actually take plastic out of oceans. These clever people know that it is irrational to annoy the world leaders with, as you call it, empty words, when you yourself is merely a naive child. That you should spend the time in which you skip school, doing research about climate change and pollution. And when you have finished that, and know what you are talking about, only then should you start trying to convince others of what to do. These “haters” don’t say rude things about your appearance or make fun of you. They just try to tell you that you are mistaken in what you are saying. I am one of these people, and I am proud of being one.", "nowisavx": "\"I honestly don’t understand why adults would choose to spend their time mocking and threatening teenagers and children for promoting science...\" first of all, you're not promoting science. Second - you put yourself out there, so you have to accept the reactions, even if they're negative. It doesn't have anything to do with age.", "1iam.m3rray": "❤️", "frickingmemes69": "yeah FUCK you", "nathan_t05": "Ah yes I see your taking action for the environment sitting in a speed boat powered by PETROL. And wearing clothes made in FOREIGN COUNTRIES 🖕🏾", "hildaz73": "You have my support!", "lostsun6": "The boat painting is not eco friendly 😂😆😆😆😆😆", "vegan_sjh": "If you can Greta please ignore it. Obviously you get under some people’s skin. Which means your message is working. Be proud of so many people hating you!!! You’ve struck a nerve girl, keep doing what you’re doing!!!!", "joeytmods": "I don't understand either. I'd like to see Hydrogen cell electric vehicles grow more quickly in the US. Fracking needs to stop and I can think of two areas on this earth that are currently weeping oil or radioactive contamination into the ocean", "caponigiulio": "Hai detto di non inquinare fava teoia", "brittmarie.nyman": "It is a rule technique in my point of wiev.", "heleriin_heva": "You are doing the right thing! KEEP GOING! 👏👏😀😆", "blondie752": "Who writes your scripts for you?? I don’t think you. Anyone can read off a script. These aren’t your words.", "1xlu8ke.7": "🥕🥕", "lisa_ottilia": "❤️❤️❤️", "starsensual": "❤️", "thatpersonxyz": "Every human is different @gretathunberg", "marakylie": "👏👏👏", "maddiemadeleini": "You are so much better than them. Don't lose courage. So many support you", "piccuticca": "you're such an inspiring person, keep going and don't care!", "ancordovih": "Fuck you!", "instamatikat": "Climate revolution!", "love_life_animals_and_earth": "@gretathunberg sadly a lot of humans are mindless idiots and get satisfaction of off being internet trolls. You are smarter than they ever could be and they know it! Don’t listen to the losers and keep doing an awesome job, promoting science and speaking up. 💜 You are incredible! 💜", "lolwar14": "E 63 Amg😂", "arda_ttunc": "Sweet girl but YOU in HELP your MOTHER 29 30 35 40 YEAES OLD FRIEND", "60secondpiano": "You are such an inspiration!!! 👏", "ericluft21": "My love❤", "xmd2002": "Grins id so bled und geh zur schule", "max.akxla": "If y'all like fossil fuels, like my comment 😘😍", "temazcalli.maureen": "@gretathunberg Dear Beautiful Greta, I am a 63year young person, I believe in You, thank you for being YOU. I am so so proud of what you have started and created globally, you are an Angel in my eyes and I stand with you, I am also encouraging my niece to use her voice as well for the greater good of our planet. We are killing ourselves by killing our planet. #fridaysforfuture #climatechange #protectmotherearth", "ryan__william": "You can’t get what you want by complaining and blaming other people you twat", "pip_anderson77": "❤️", "rosemarylloyd18": "@gretathunberg you are a legend, a strong beautiful girl who is making real change, don’t dim your light or your facts or your wisdom, we will appreciate you in the history books in the future much love R.L x", "hanna0.0sophia": "Girl just keep on goin and dont mind em as they really had nothin better to do with life and theyre wasting it by sending hate to you.😚😚😚😚😚😚😚😚", "isak_duvan": "ur boat suck lol so slow :P", "jassu36": "You’re doing good. It’s easy to be a nobody and very difficult to be a somebody. Keep moving forward.", "cloudynugs": "who hates earth?", "wee_little_one": "People will say anything online sitting on a couch. Let them say that crap to your face! ...would never happen", "daigle.mario": "On an other boat with gas engine leaving residu in the water", "s1monsln": "How dare you driving s boat how dare you", "someoneteachmehowtoinvest": "Keep going, keep pushing!! You’re doing something so amazingly beautiful, and they’re missing that big time. Thank you for seeing the big picture", "imanthony.woah": "CEO of nature", "elviraskovsang": "You are working from such a pure state, with true love for other beings and the earth! 🌍 Everyone who has a true longing for a better world will be touched by your selfless work 💙🙏🏽 You are planting seeds in us, so we can help create the changes needed 🌿 THANK YOU! #youareontherighttrack #theworldneedsyou #dontrespondtoanger", "ensor3": "We don’t hate we just know fossil fuels will be here forever. 🔥🔥", "lilja_lyydiaazz": "You are strong girl keep your great Job and some day we are going To save our home planet together ❤️😍", "conor_capturing": "Operating on solar power? You’re polluting the planet.", "crespohamilton": "Representou", "hxnnes.xo": "man geh auf der autobahn spielen", "tim.etoshine1731_": "🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢", "nightingale161812": "🙌🏼", "vberenstein": "You are a badass! I'm so grateful for all that you are doing! 🙌", "tann_vont": "Oh no you put yourself in a global spotlight and were criticized.. no one would’ve ever seen that coming 👀", "joel_the_riceness": "I'm not a hater, but why are you riding a boat that is fossil fuel powered, I wish they was a alternative to all this nonsense, wait there is, people who criticize you are all dumb, dont listen to them, also nuclear power is the closest we have to having the same energy and being a reliable source, the waste can later be used for satellites like Voyager 1's plutionim battery.", "eemiliore": "Calla fea", "vikasthapa8902": "She polute the water for her shit", "elenekvernadzee": "zgva👍", "tcaciuc.davide": "A ritardata spastica de merda", "m3t4lh34d43ver": "Nice trup on a 2 million dollar boat that probably wastes as much gas in 1 hour as my car spends in 3 months", "gnllegnsn": "it's funny how adults choose to pick on a 16 year old instead of going to work. they said \"go back to school\" when they should go get a fucking job smh. like you're not doing anything either dipshit leave her alone she knows what she's doing", "hanim8592": "🙌", "eddy.sayers8": "All I’m saying is on the train she used single use items that damage the environment like the cup the bowl and the bag😂", "saffhughes": "@jack_gouveia_25 haterz back off", "wer.ist.eryk": "Ah shit Here we Go again", "tr_1989a": "Why are u sitting on a yacht to “combat climate change” a yacht that has a back up diesel (dirty fuel) engine. The crew on the yacht had to fly home and a replacement crew was flown out to take the yacht back. So you caused more harm to the planet than what you would of if you just got a flight. !!", "anadias2965": "@mariaeduardademelo.silva aa ela é maravilhosa 😍👏", "martemiss_": "You are amazing", "shanty.s_": "Stand proud", "kristinquinn84": "Such a nice picture", "amandabrookeford": "Being different is awesome! It inspires passion and neurodiversity is amazing!!", "houstontyrn": "Shut the fuck up", "angelsdanced": "Well said", "hiypi": "Like we said 1000 times... NOBODY CARES BITCH", "maurice.21.hass": "🖕🖕🖕", "scoutstout": "Don’t listen to them, greta! You are an inspiration!", "brittanysellsla": "You’re amazing and wonderful and perfect, Greta ❤️", "bryant.lm": "Ain’t nobody ruining your child hood just go to school and stop whining", "mr.morgan": "I’m the same age as you and I think the cause is good, but you are not. You think it’s all about you when it isn’t. You don’t deserve to be praised", "zerocandies": "Wow Cringe LP she like it 🤣 L○L @iamlpofficial #ahahah🤣", "busisen_07": "är det roligt att resa runt i världen", "nicoletta_cavazzini": "❤️", "amandal.g": "You on a fucking boat.", "gopp924": "Osm", "felipaflamander": "En hel bibel behövdes inte Greta, sorry i had to break it to you", "azraayank": "Dişlerini fırçala", "fr_.x0": "You go!! Keep doing what your doing your amazing", "metemano": "Maybe cause climate change is an excuse to tax CO2 you know the same shit you exhale !!!", "behnshun": "im going to shit my pants greta im going to affect the earth goodbye", "molsorensen": "Wait are you 6 years old", "dode_zaid91": "❤️", "will.i.want": "I love you, Greta. Don’t let them get you down. Keep fighting for what’s right!", "wasabi_bruhmoment": "Haters? I think she means memers", "kxshtrxm": "Gesichtsgrätsche rropt", "andreslijeronr": "Ya veo como te arruinaron tu infancia 🤦‍♂️🤷‍♂️", "prince.traps": "Ur stupid like legit stupid", "joeoldphotography": "Because your full of shit and we don't need to cut our emissions in half. That's not the fucking problem. Its all this nuclear testing that's changing shit in the long run and all the factory smoke. A car bearly has shit to do with the ecosystem. Stop ruining the car scene you fucking dumb ass", "goda.tb": "I mean u are a mf meme", "shannylie": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "cleanbanditlove1": "Beautiful picture!", "sonja_025": "As an adult, I'm sorry you had to deal with abuse from other adults. That is really despicable. You are gorgeous, strong, intelligent and they are just jealous. Keep being you and fighting for change 🤗😊", "conspiracy_boss": "I’m all for saving the environment but America is one of the best for keeping fossil fuel usage down, it’s the Far East countries that are doing the real harm because they have no regulations for fossil fuel usage", "jacqmira": "Haters gonna hate @gretathunberg. You keep doing what you're doing. They hate through fear. You've got this!! ❤️", "ruzica_bjelo": "❤️❤️😘😘😘💋", "_.shoulifa._": "You is beautiful girl", "therealbaby90s": "Adults sit on Instagram just like they previously & continuously do nothing but live a reality that's not realistic at all but a mere illusion of modern society", "johnroosvall": "A woman has reasons when they do things. And this is a woman that makes me smile and believe in the future.", "_.audrihh": "Personal attacks on character are a sign of weakness on their end, trying to divert from the real isssue which is that the climate is dying. Never stop , don’t stop! You’re a force to be reckoned with", "world_reece": "We live in a world where past leaders and leaders have such an outdated mindset,they are so out of touch with reality and the youth! Instead of teaming up and taking it in,they are fully selfish and don't give a fuck,and will make you out to look crazy so there agenda don't break!  Consciousness around the world is becoming a huge thing,even if it started off as a trend for people to be \"hippy and vegan\" well it looks like a trend accidentally woke a nation of sheep! And that's a good thing,people jumped on the band wagon and accidentally had spiritual awakenings!  The system will try anything to take your mind off the real subject They will set you against each other with hate tactics from the media, They will make people from charitable foundations look crazy and insane The system will make anyone who sounds positive sound so dumb,the funny thing is the Media can make someone so smart n intelligent look so stupid and crazy! But don't you see people this is what they want,  While your at home caring about random shit and fear tactics on tv  While we spend time on that,they are spending time over fishing our seas,killing coral reefs,killing endangered species / animals /plants Entire under water reefs are gone  Jungles and forests around the world get cut at a rate of 5 football feilds every minute When we're at home we sit back and say it's cool the earths huge it can't be that bad!  I've been blessed to be able to travel this beautiful world people,and as huge as it is,it literally takes one day by plane to reach the other side of the entire earth,the world is huge but now small because of technology we have  The earth our home and its dying people,we are not separate or apart from the animals and nature on this earth we are apart and are one!  A old saying you can't eat money,you can eat the fruit the tree produces though,a tree 🌲 produces so much more magical things than money  So before you go out or home today!try think to yourself What can I do huge or tiny that can help our home the earth today 🌏🌏🌏 Stay woke people 👁️", "gucciversacekik": "U a sunshine in my instagram feed", "andrerichson": "stfu you smell like cat food and kangaroo piss", "marc_ortiz17": "Yeah, who paid for the 3 million dollsr ship?", "albaarher": "Aw shit here we go again", "emma.want08": "Your a beautiful young woman", "rainbows.and.hearts": "@gretathunberg always be you. You’re changing things for the better. Be so proud. 🙌🏻", "federiicopieri": "@lorenzo__filippelli", "bsussman3": "As for the haters: Point t them and laugh.", "cida.quaranta": "Uma princesa", "caleigh.99": "Greta you are amazing, look at what your doing, it is amazing!!! So keep fighting! Thank you for doing this!", "sharon_ocasion": "Don’t be bothered by these people They are ignorant", "lifewith_zephyr": "Yes! You are strong Greta and helping to make us strong too!! 🙌", "sutter_odyssey": "Shouldn’t you be in school? Or doing something more productive?", "gryffindorgirl96": "Thank you Greta for everything you have done. I really appreciate all that you are doing. 👍❤️🙌", "marciabeth11": "Greata!! It is because darkness is attracted to the light. ♥️🙏 There are Angel's walking on this earth and you have the biggest wings and brightest aura I've ever seen. 😇 Please know a billion people are walking with you and holding your hand.", "alekseibokserzmei": "Красотка я с тобой!!!!👏❤️😍🔥", "busaattensonranah": "Tiksinçsin", "rockthekaz_bah": "One of the problems is you are part of the social media gen, where 15 mins is what you've got.. use it or lose it👍talking about it is cheap:)", "zzzzzzznsjs": "tipine sokam #BÖH #BÖH #BÖH", "slotenmakerdaniel": "The stone age gone not because the stones are finished; think about it", "dotsierob521": "You keep up the great work and ignore those so called adults!", "amorisperfect": "You are beautiful, and i fully support what you are doing", "m11193k": "#fuckgreta", "thiccmang.o": "HOW DARE YOU", "porschaskie": "@mtourkozecy9", "dtx.greengangnoah": "Who else wanna put her in a cod cross console lobby", "mariealicecanada": "I’m so sorry you are dealing with the worst of humanity...and all YOU are doing is trying to save us and engage us to help save ourselves and all our fellow creatures, water and oxygenating plants! 🇨🇦🙏❤️💋Do not let hate put even a tiny dent in your armour! ONLY LOVE gets in sweetheart!! Ok?? XOXO", "luci_fcajigas": "You are so beautiful", "emma8haines": "you deserve all the love", "ryanparsa08": "Fortsätt så Greta Thunberg", "1984eyes": "@bryonyalicia_ ❤️❤️❤️", "maria9505": "You are AMAZING! So HAPPY that there is someone like you on this planet! KEEP GOING SUPERWOMAN❤️", "valeriagranados_": "Thank you💚", "jonas_don": "@heitorfurtado129", "oliviaastl": "Go back to your country", "ian__hartt": "China is the one polluting", "_dennis028": "Ab ins Jahr 2003 Gretas Vater finden und ihm ein Kondom geben", "m.kiz126": "only for the fame u bitch ass kid", "acreatix": "Their very scared...and they re better be! ❤️ Loads of love Greta we r with u!❤️", "brad_middleton__": "@lillyjonessx", "ilaoscar": "Not hating @gretathunberg simply Is not that you are exactly an “explioted child” like the one Who work in Africa or south America Is stolen while U are speaking at onu and travelling the world ... your Message Is RIGHT ONLY DONT COMPARE YOURSELF WHITH THE ONES WHOSE YOUTH IS REALLY STOLEN🙏🏻", "swats_sp": "I can't believe that there are still so many dumbheads who cares more about finding flaws than accepting a simple BIG fact! *slow claps to them", "raigan_hubbard": "I just wanna know what paper planes you are using to fly all over the world", "amiraitkul": "Дура", "joelkingdomlowe": "Fortnite?", "analucera07": "it's really great that you care about the planet but insted of just complaining about EVERYTHING you could give us a solution. Btw stop saying people stole your childhood from you cuz it was your choice to leave school and \"fight for the planet\"", "vivianna_vv": "I love this girl ❤️❤️❤️❤️❤️ ❤️❤️", "kxylxigh.x": "You are amazing on what you do and you should not feel ashamed for what you are doing because your a teen/kid. They do it because they are either scared or jealous by the amount of wealth of knowledge you own but only you are stating facts and you should feel proud that you can stand in fro t of lots of people and have a voice and that's why so many kids these days look up to you because you are just like them and don't ever feel disappointed by them there just immature. Good luck!", "alexzander_sad": "Ha look a lil kid talking", "_.dim_ptrl._": "Ignore them and keep doing what you are doing. You are the only one who can save our planet earth", "johnsontanner137gmai": "Good smile", "ocastitatislillium": "You, your family, your race stole my past and my future greta. How dare you? Why we are destined to be poor or killed and but you are richass,", "themostamateurtonguebuds": "You go greta! Keep going.", "oscarson.simon": "Tjena brush", "04_maurxce": "Go in the foking school you dumb little girl", "the_wise_d": "Seems your living the dream. I don’t see your “childhood ruined”. Visiting a different country every week. Sign me up, I would have loved to miss school for a free world tour.", "_mradig_": "Fuck off", "monika_langova": "Well they are going after you because you naive little child 🙂", "quickjam2": "What science? What facts? You have shown NONE!!!! Just a retarded child with no clue!!!!", "stephchabros": "Love you girl. You’re beautiful ❤️", "kaylavidovic": "How dare you", "denis.atasoy": "Du förstör naturen med din mobil how dare you?", "slaventemmer": "🤡🤡🤡", "robertooanzaldi": "Very beautiful photo", "_the_meme_channel_": "I wanna know how young she is bc damn she is hella smart in in 9th grade and Shit we dont think about that", "stephotopdx": "@coleturner6", "mirriam_mazibuko": "Greatness @gretathunberg ,keep up the good work. There is no bigger problem than the crisis our planet is facing, your work is legendary!!❤️❤️❤️", "shellyaburton": "Damn girl!!!!", "lostboymeme.v3": "Agenda 2030", "kmrose316": "Love You Grete ❤️ forget the haters! You keep raising awareness kiddo! I believe in the science, and I believe in You! My daughter is a Vegan and has been preaching this science since she was just 12 years old. We have tried to do our part, but it’s not enough. We all need to do more! You don’t have an illness! You have a Super Power! What people need is a plan of action, find another way to power our cars and trucks, a way with no emissions. It is possible, the technology has been available for decades. Make plastic products out of biodegradable products like hemp instead of petroleum based products... plant more trees, I believe more people would get involved if someone would lay out a plan of some kind.", "diegomainardi_": "Is She on a yacht and She Is speeching about he childhood", "jdbsays": "Having a mental illness is an illness.", "wydeileen": "bruh i have to write abt you why you gotta do me like that", "ozanturanxx": "Cirkin orospu cocu hem pis gazlardan herkezi elestiriosun hemde tenkeye biniosun duygusuz orospu cocu", "alexgsm.02": "I think you’re awesome Greta, your dedication for protecting the Earth and trying to open people’s eyes for what’s happening right in front of us moves me and inspires me.", "sunflowwer13": "You go girl 🙌🙌🙌❤️❤️", "isaac_akanathandrake": "Your words are amazing Greta and the adults they are threatened because they fear of change or some feel powerless that a 16yo does more change than adult would I guess or they just have spare time and don't know what to do with it I'm an adult yes but I believe this future needs heroes like you and you're a great example for the children for many years in the future and what this world needs.👍 @gretathunberg", "lorraineburns608": "Prayers", "lisa_janzen_": "You keep so many of us going. Thanks for your incredible leadership. You’re such a beautiful person inside and out. ✨❤️🌍", "heloise_mrie": "How did we get ourselves in a situation where kids are more mature than adults?? When did everything wrong?? I mean we are their kids and it’s our future that’s on the line and they still don’t care...", "castrojossie9910": "@gretathunberg Thank you, great job! Hugs from Puerto Rico! ❤️👏", "mitchb421_": "No they are going by your bullshit propaganda because you are brainwashed as a child you haven’t reached adulthood to know anything about climate, humans can not stop climate it’s called Mother Nature get over it", "xixixixixixixiiiii": "Governments hold to much control! Someone needs to step in", "kguanse": "I would love to travel by boat with you!!!", "iamhumanlmao": "Awww you look so pretty! ❤️", "chris277_ficke": "🤡", "ib1e": "🙏🙏🙏🙏", "mrtraveltours": "You go girl ❤️", "vegan_uden": "They are different you are normal. Well.. you are great! Greta <3", "mehmetefe_6666": "You declare that your importing recycling and nature so much.If you really do,you wouldn’t wear another shirt in every picture dude.You bought that much clothes,then your talking about enviroment and things like this.You are even not doing the things that you said to people", "ttommasochellinii10": "Vacci a nuoto vaii @gretathunberg", "rainbowsf_": "Lo sen kimsennnn amerikaya kafa tutuyon hee valla trumpın güvenlikleri o kafayı kopartır haa demedi deme baağ bak bide yalan haberler yapma yaw co2 salınımında türkiye 20.sırada fransa da altlarda biyerde gelmiş diyon türkiye 3. Fransa almanya 1,2 fln la gidip doğru araştırsana awsu joju nyse sen anlmıcan ama yazam men diyomki● you are lier ●Okey sjdksnjsbd yalan atma yazıyodu galiba bnde bilmiyom google amcaya yazdım artık ne yqzıyo bilmem nyse hadi bay cınım", "thedrivenwomenproject": "Leadership can certainly be a lonesome endeavor. But clearly novelty (aka difference) is what it takes to bring heightened awareness and push for change to important topics. Thank you for embracing what makes you different instead of hiding it to “tame” the masses. Your differences is what makes your message stronger.", "gwenanna91": "You’re amazing!!!!! They are coming after you because you are hitting them where it hurts and affecting their profits. I have decided not to fly anymore and you are the reason for this decision! 🌈✨💕 Well done Greta you have done so so much good already for this world and I send you nothing but love, respect and gratitude 🙏🏽", "diana_krl_": "Cutii ❤️❤️", "jwanhaji07": "lycka till Greta", "0chill_ma": "Geh schlafen", "negroperoncho": "@kevinthomasmilla0", "lisset2mindful": "Girl...good questions. Bet they don't know.", "max_day_99": "But you didn’t have a child hood or achieve any of your dreams", "titianwidia": "👏👏👏", "johencisog": "Preciosa pequeña... Por más niños como tú 🙏❤️", "ethanmullins23": "Considering how wrong *science* has been about climate change before, kinda didn't trust climate science right now. I'm all for cleaner oceans and air though, which is what America is doing just fine. How about you lecture Asian countries and African countries, they're the one causing polluted air and garbage and waste in our oceans. Also Europe has worse air quality than the US🤷‍♂️", "otto_vandenberg": "I swear I'm going to become the God Emperor of the world and completely outlaw the word 'hater', it's like the word 'poser' but for normies", "ch_g_priv": "Her momma wrote this.", "ma.rianne7914": "Perhaps everyone « else » is different and you are the one sane soul in the world. Ignore them and carry on. It’s not too late. Well done to you.", "lane50002": "You are inimitable. Keep doing you.", "x_kat_eq_x": "your absolutely amazing! you do soooooo much in the world💛 your a very good person, don’t let anyone stop you from what your doing and don’t let haters bring you down. they are only commenting mean things is because they know that your doing amazing things for the world and they can’t simply do it. your amazing and keep doing what your doing💛", "ryanroepkee": "🤡🤡🤡", "theanniebauer": "Your caption is spot-on, @gretathunberg ! Keep going! 💞", "ianbmxx": "No que le robaron la infancia??", "hamachan604": "As adult I am so sorry and frustrated how world is full of selfish money and power greedy leaders who don’t care about environment. All they care is how much money they get in their pocket while next generation like you or my son and other kids have to deal with this polluted earth. I am so sorry we leave this shit to you. 😭😭. As a single person I tried as much but we all have to stand up together. Imagine if one person plant one tree on earth how it help? Imagine 2? Or 3? Imagine community and government actually encourage us do that? No matter what criticism or threat you got, you are out hope, brave smart Greta!! Keep strong, hopeful and sweet. 💕💕💕💕", "ropomipit": "HOW DARE YOU??? (No rompas la cadena)", "nicolecorradoart": "I too are #actuallyautistic and I feel that autism is an advantage to being a climate activist.", "brendanclontz": "Science is not facts. Science is only tentative it doesn't prove anything yes it helps explain things but science is only tentative.", "raffaell_araujo": "👏😍", "mariha.ch": "You're so pretty❤️", "finnox4453": "stay high 💯", "erikjanvankleef": "And the 4 crew members took the plane back ! What a comedian ! Oscar for best actress !!!", "chiara_montisci89": "Love you 💞 😍😍😍😍 from Sardinia 😚", "ifyouoffendedgtfo": "🤡", "mel_s_honey_": "💙💙💙💙💙💙🙌🏽", "leonbck": "Ich du gehst unter", "totally_rando_gallery": "So...when are you gonna go to China and India to preach at them? They are a bigger problem for the environment than Sweden or the US or Canada, or wherever else.", "plptzld3": "Epstein Island is no conspiracy. The same cult your parents are part of. You are being used cause THEY ARE THREATENED by the public talking about the cult. It’s easier to focus on the problems than on the cause.... But just stay in your dreamland where you can change something by TALKING. 🤣 we will see. The eye is bleeding and your parents won’t be saved due to your actions....", "cst_koon": "Loudest one to preach about climate. Look what you're enjoying. You are pathetic.", "kalyn_lepre": "You’re a inspirational badass. ✨💛", "l8n8_68": "You are the fucking hater!!!! Go back to school u idiot!!!! Or go fight China and India. Ask ur bosses if they will let u 🖕", "uminamisolelove": "climate change? the burning trees in some of the forest in the world? ask rich people, they know and burn them all!", "_svenwehrle_": "Dumme kurcke", "droemmer_om_stjerner": "You are extraordinary. Haters are ignorant. You fight for something bigger than all of them and all of us. This is our only planet we need to keep it safe. Thank you for providing you profound passion and facts. You are extraordinary!", "anapeoresnard": "eris mi humana favorita lpm no hay nadie más bacán que tú", "rezzoy": "Can‘t find dislike button", "rian.phantom": "Ich steh mit einem girl sie sieht aus wie Nicki Minaj", "magicwando": "❤️", "jake.davo": "The earth is flat", "james._.parkinson": "She’s on a boat, that contributes to sea pollution and climate change. Hypocrisy at its finest 🤡🤡🤡🤡", "the.st0ryteller": "The vehicle that you are using uses fuel. You know what I mean so you are hypocrite", "rufus_2003": "@xav.lf she is your autistic sister", "ashtonix": "lololol", "erke_crocheting": "Little Wonder Woman 😍", "mellonwaffel": "Never Kill the Diesel", "terry_betts": "Great winds for it! ❤️", "bylingbilder": "❤️💫", "dave_novak_ig": "Fuj ty mrdko špatná", "bernice_daily": "❤️⚡️", "noelsketchy_ambro": "Nice Childhood you have there.", "elliott_xd0": "🤡🤡🤡", "hosein_bolkheri": "👌👌💖", "_rory._.07": "That motor is warming up the ocean do u support climate change", "merlchen_8319": "@martin._8319", "bouldertommy": "Stay strong 💪 You are doing amazing thing! 🤙", "lo_sbieco": "Bla bla bla my mom makes money outta me.", "snakke.gxrll": "Go strong!! Great job!!", "ha_jo_2004": "Das ist ein Motorboot", "mawuno_art": "• @gretathunberg -This is you my lovely• • • “A great revolution of character in just a single individual will help achieve change in the destiny of a nation and further will enable a change in the destiny of humankind” 😊 •", "petrako_go": "There is always good people and bad ones. Good and evil fighting here. I thing it's better be with good side. Go Greta! 👍💚💚", "orest.andersen": "Watch your face during “that” speech - you’re the Hater ! You’re desperate and afraid not talk about real truth- the easiest way - is to REMOVE “uncomfortable COMMENTS “ 🤦🏻‍♂️", "sarceder": "Vi är fler som inte förstår. Vi står bakom dig, tillsammans med dig. Du är aldrig ensam.❤️", "bengwhite": "@ellatovey someone told me u look like this girl😂😂", "teabirdyyy": "❤️✊", "purplhayes7": "The pushback just confirms climate activism is working! Those who push-back do so out of their own fear & ignorance while the rest of us know the truth ... so keep moving through such negative forces... your generation and the Millenials are the Force we’ve been waiting for! 👏👏👍💕💕🙏🧚‍♀️", "akari.sora": "Haters gonna hate. Always and anyone, because the hate is in them. It is consuming them like a cancer so the only feeling we should have to them is pity. You shouldn't even care or think about it cause as you said the world is waking up and this is the only thing that matters.", "mcembalikci": "👏😊", "robin_blmq": "Kul å pissa i en hink", "aidan_weitz": "You claim being different is not an illness but being conservative in Los Angeles is like being a leper, your people call for change and progressiveness but how can we progress if we do not first accept each other. We can not solve the climate \"crisis\" divided, we must not all pull together regardless of political affiliation and solve the issues our world faces, but before we can do this we must stop teaching that people are evil just because they voted for trump. Most agree this is a problem we must have fixed but how can we fix it is you call anyone on the fence a hater and anti science, convince them dont shun them for being unsure. How can you claim to be liberal and accepting if anyone who differs from you is immediately a climate nazi.", "nnnxdiia": "u are contaminanting the ocean with that boat ... 💀", "regantothh": "❤️❤️", "lalfredoap": "❤️❤️❤️❤️❤️", "leffwoman": "Go Greta, Go!🌟", "rasmus____________": "How about doing something other than not being in school on Fridays?", "vicctoriaetta": "💖💖❤️❤️😊", "celianazarko": "Florzinha, nós não estamos contra você. Nós só queremos te dizer que o planeta não vai acabar. Nós é que vamos embora e vamos levar algumas espécies que deram azar de viver nesse nosso pequeno tempo no planeta, se é que eu posso resumir algo tão complexo numa frase como essa. Você já viajou de avião e viu lá de cima como somos insignificantes? Pois é, dinossauros também viveram aqui e foram extintos por muito menos. Quero dizer que devemos \"sujar\" o planeta? NÃO. Quero dizer que você faz parte de um plano e ele está dando certo que é o de amedrontar o maior número de pessoas possível e depois disso aparecer com a solução. Essa solução não será para salvar o planeta, acredite, será para nós aprisionar ainda mais nele. Você é linda e muito inteligente, e acredito que logo logo vai perceber essa trama. Com ♥️ Celia, from Brazil.", "harsh_black7": "F*ck haters we're with you🖤", "schi2o": "I lıke your dog teeth so fuckıng deadly", "danskeveganermemes": "Yeah fuxk you your just a little annoying kid so please go to helm disgusting little faggot", "ariannalupinii": "@laa__aliii 𝑟𝑒𝑔𝑎𝑙𝑎𝑚𝑒𝑙𝑎", "richiejamesdye": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "aspacefordifference": "Your courage and strength inspires me! I share your story with my autistic 9yo daughter and love the positive story you give! 🙌", "kenn_cosmo_w": "Do y’all realize she’s a CHILD and YOU’RE CYBER BULLYING A CHILD ? Y’all are absolutely disgusting people. She’s a CHILD that actually is very well put together and isn’t going out here doing something like licking ice cream at stores for likes on TIC TOCK. CLIMATE CHANGE IS REAL. Stop being ignorant to yourself and read a damn science book.", "son_of_yeezus_2.0": "Nigga we’re not hating you just annoying AF.", "lennkaramm": "Awesome girl 👧🏻 👏🏼👏🏼, do not pay attention to insane people!! The pollution already burn their brain 🧠!! So keep working on !! You guys deserve a clean world while growing ♥️♥️", "psychologic_art": "What IS the legitimate crisis @gretathunberg ? Who is legitimately responsible? I love what you're doing. While you have the world's ear for 2 or 3 weeks at best, please point out the real polluters. Please. Because, you'll just be a girl again, before you know it.", "aprajitads": "More power to you beautiful girl!", "clintdwhortley": "Your parents should have put you in timeout more often.", "keylaalyek11": "✨💜 🙏🏻 Beautiful brave soul.", "rare_budy": "On a boat, talking about environment😭😭", "bydiannarose": "You are such a queen, so proud 💖", "alex.aa06": "Accept the fact that if you step on the global stage,talking to all of the world’s leaders,you will get hate.Try mastering basic thinking first", "basticouu": "Money, money, money Must be funny In the rich childs world Money, money, money Always sunny In the rich childs world Aha aha All the things I could do If I had a little money It's a rich childs world.", "krab_spoon": "Ok retard", "rheasathnur": "you are an inspiration. thank you for taking action when it’s most needed💚💚", "_bmoss.12": "🤡🤡🤡🤡🤡", "mc.goo": "You are such an inspiration 😄", "kmyoung12": "@juliannap28 check her out!! I came across her page and thought about how the two of you working together would probably most certainly change the world! Love you!!! 🌎🌱", "bfost9": "#boatsgiveoffemissionstoo", "morgankbu": "I want to be like you, but my parents don’t think I’m serious about becoming vegetarian and laugh at me when I say", "km.christian": "PERIOD!!! 😩😍", "fw.a1exaa": "You are such an inspiration to me 👏👏", "wanna_be_asian": "Still dont care", "studioonline24": "You stay strong beautiful 🙌😍💕", "atsu.web": "We plant one tree for every follower 🌲", "josaphat_jr05": "Love You 💚💙💟💟", "victor_pacheco2k": "Engraçado roubaram minha infância e nunca andei em veleiro kkkk", "_curly_v5": "Human digestive system, the system used in the human body for the process of digestion. The human digestive system consists primarily of the digestive tract, or the series of structures and organs through which food and liquids pass during their processing into forms absorbable into the bloodstream. The system also consists of the structures through which wastes pass in the process of elimination and other organs that contribute juices necessary for the digestive process.", "coltnthompsonnn": "Go back to where u came from", "amandasbaxter": "AMEN 🙌🏼", "jakelee180": "Lies and conspiracy theories along the line of you suing 15 countries for climate change, and leave China out of it.. the worst in the world but I guess their fine", "dirtboydesigns": "I got your back young lady! Eff the ignorant!!! Something I thought you should read, lyrics by Justin Sullivan of New Model Army written in 1986......Ballad (Sullivan) When they look back at us and they write down their history What will they say about our generation? We're the ones who knew everything and still we did nothing Harvested everything, planted nothing. Well we live pretty well in the wake of the goldrush Floating in comfort on waves of our apathy Quietly gnawing away at Her body Until we mortgage the future, bury our children Storehouses full with the fruits we've been given We send off the scrag-ends to suckle the starving But still we can't feed this strange hunger inside Greedy, restless and unsatisfied.I was never much one for the great \"Big Bang\" theory Going out in a blaze of suicidal glory Not foolish and brave, these leaders of ours Just stupid and petty, unworthy of power; Just a little leak here and a small error there Another square mile poisoned forever A series of sad and pathetic little fizzles And out go the lights, never to return. The affair it is over, the passion is dead She stares at us now with ice in Her eyes But we turn away from these bitter reproaches And take up distractions to forget what we're doingI stand on these hills and I watch Her at night A thousands square miles, a million orange lights Wounded and scarred, She lies silent in pain Raped and betrayed in the cold acid rain And I wish and I wish We could start over again Yes I wish and I wish We could win back Her love once again", "anny112689_": "Mr James I've never had an issue of delay with my payout, i have made successful withdrawal, I thank God for a good account manager like Mr Garrison you can contact him..@9780.james_investment_forum", "_k.breedlove_": "Don’t worry about hatersssss!😝 So proud of you, sweetheart!! 💞💟💞🙏🏼🌎 #YouAreMyHero☺️ @gretathunberg", "mehmet_37yo": "Tipine attırayım", "tinapoellinger": "@roman_dinser", "papicarillo": "Ma sei vergine ?", "erinhartle": "A true inspiration to everyone!!!!", "onda_beatz": "Otro Timo publicitario! Ya no engañéis más a la gente!", "autty.autty": "Yes girl!", "0llieharper": "Go back to school", "j_odi_e": "Ignore all they hate u get but to most people u are doing an amazing job and we are be hind u for their we believe in u girl power believe in what u want to do not anyone else it your life do do what you wanna do I go girllll and it will make a change don’t worry xxx ❤️❤️", "eiffel_in_love77": "It’s not your look, it’s not your clothes, it’s not your voice. It’s your rhetoric and your lack of historical climate knowledge & data that makes me shake my head & mute you when you appear on tv. Please, please go back to world history and revisit the facts. Climate change wasn’t created by 20th or 21st century man. It’s an ongoing process and has been since man discovered earth.", "hozanist": "Mı kuze date daye ber füzeya dehla kıça dehla", "juliecanteven": "Regardless of your political stance no ADULT should be taking to social media to bully a 16 year old about how she looks or dresses. Not thoughtful disagreement on a topic, but bullying her about how she looks. Some of the comments are just nasty.", "daniel2thang": "You pretty cute doe", "sunshineoneandonly": "💕💕💕😘I love you .", "sbu_hobbyhorses": "’Em haters are just jealous 👍💕", "shasserd_": "Ur on a boat,, co2", "tm.nfld": "🤦‍♂️", "lacosmicaoficial": "❤️", "vesuviorace": "⛵⛵⛵", "f1_hub_": "Yeah but you look evil", "austinmarc": "❤️", "fleecycracker65": "You sound like a retard", "malicru1": "what is your global footprint lmfao", "alunatterson1": "Isn't it always a ecological crisis.", "lattesdotter": "You are an amazing young woman! And people show their true nature in the things they say about other people. The words and lies reflect back on the people, organizations, and companies that promote hatred and lies. They can't debate you logically with facts and science, because your understanding of the science and evidence is solid. So they attack you because they have nothing else. I have a nephew who was on a debate team in high school - I'm sure he could explain the rules of a legitimate debate.", "mariesikk": "Greta, you are a superhero! I hope you see all the people who are in awe, not just the ones who puke their words. You will go down in history for the way you fightes for the climate and for how you make so many people join you 🙌🏽", "memattic": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "seraphin.er": "SA Fishing Face Shields ** 40+ Designs verfügbar ** Qualitäts Bandana/Multifunktionstuch/Schlauchtuch/Halstuch aus Stoff & SPF 40 - Face Masks von SA Company, Black Skull https://www.amazon.de/dp/B01N6RXIB8/ref=cm_sw_r_cp_api_i_kZLKDbMDS6B9S", "ratbabbie": "Okay but she’s cute 👀👀👀", "migue.fdez_4": "% de lio? 😉🔥🔥", "orhunbag_": "allahım tipe bak ya", "nil.doganay": "oç", "debby_torres": "Greta, you are a simply remarkable young woman. Thank you!", "louis.wdl": "I hope this is a joke", "alex.muscatt": "🤡", "kingsusery": "Shutup", "iadjets": "IS THAT A BOAT?!!?!", "donnie_vandross": "How dare you sail to America on a carbon fibre yacht that you didn't build which cost £15million, that you didn’t earn, and which has a back-up diesel engine that you didn't mention,\"... I read that somewhere I thought it was funny", "jbeaner67": "People that mock and criticize someone simply shows they’re afraid and the politicians and media people that mock you are threatened by your unbelievable intelligence, professionalism, and your passion. They can’t understand something so complex but yet a 16 year old girl does and it makes them all look like boneheads (which they all are). They take cheap shots at you and become petty which is a crystal clear reflection on their intelligence and maturity. You’re an inspiration Greta. ❤️👏🏼🌏☀️❄️🌬🌊🌈🌫", "g3org.k0est1er": "Whaaaat? Photo was made by phone, phone needs battery, battery gets charged with electricity, electricity is made with coal-fired power station. HOW DARE YOU!", "where.my.head.at": "❤️❤️❤️", "stefanwintero": "Und die heim Reise mitn heli war bequem oder du fotze", "coletteursula": "The haters are usually highly privileged people who have never had the hardships or the one behind the screen, thinking they know everything about you. Lets burst their bubble when the time comes 😈", "vinny_valentino7": "Greta I have mild Autism. I'm so proud of you for standing up and taking action towards Climate Change! Don't listen to the haters! Keep doing great things for this Planet's Climate!!! 🙏❤️", "luisros1": "@juliaros_artist @valentinagauddie @valentinaschuffner", "krmozdogan": "🇹🇷🇹🇷 as as sen kmi şiqayet etion oç", "fitnesscoach1965": "Es wird ein Kampf gegen Windmühlen werden aber der Wind wird Greta unterstützen und die vielen Millionen Menschen gehen die Augen auf und nehmen sich immer mehr Zeit darüber nachzudenken was die „kleine Heldin“ vorhat 😎🌍✌🏻", "hardbroom_sisters_official": "You're words really help my self esteem😊", "simonajacqueline": "The same reason why they are not ACTUALLY acting on this crisis: ignorance! It’s easier for them to underestimate the situation and mocking kids for their awakening, than admitting they have failed us, the system they keep going failed us, everything they have created and focused on with ‘pride’ failed us. Us as all human beings living on this planet. The technologies to make the necessary changes happen faster do already exist, we all know it, and yet they keep focusing on temporary remedies than actual solutions. They failed, have failed and are still failing. That’s why. So thanks for your inspiring actions, dear Greta. Just know your sacrifices are fully acknowledged by the woke people. Please, don’t stop. Evidently we needed and still need you.", "bodilanneli": "You are the best girl in the would Greta! You make the would wake up! It's just the like you say😉", "tairimmer": "So you’re trying get different clothes so people won’t see you but you post a picture of you in your different clothes on Instagram where everybody can see?", "walker_32343": "We're right behind you Greta, it's high time we fixed this #createadifferentworld", "spunkymango": "i lost brain cells reading these comments. i’m so sorry you have to deal with this, being in the public eye isn’t easy. stay strong, you’re doing a wonderful thing, which we all should learn from ❤️", "sofiarossetti_": "@sarasousarossetti", "anna_maria_hedman": "They are wrong. You are beautiful, real, and totally inspiring! 🙂", "reginacalmar": "👏🏼👏🏼👏🏼👏🏼", "heathermcarthur99": "We're cheering you on Greta! ❤️❤️❤️", "iamtv.ig": "what if she has a growth disorder and she’s really 20 something.", "laiiaboren": "hero💖", "tewatling": "ur a wasteman", "yagizo_": "orospu çocuğu", "pharmakeiaherbs": "Sending you love ❤️", "janiquanettles": "You are brilliant and beautiful soul! Your actions are the strongest I’ve ever witnessed in my lifetime. Blessings to you, and you have already created a huge awareness on the global environmental consciousness that we all need. Thank you! ✨🙏🙌💛", "c.fynn21": "Just tell me what Co2 does exactly, cause no one can tell me🤓.", "adrienmarchetti": "💪🏽💪🏽💪🏽", "rjpixel": "You’re 1000% amazing! So happy to follow you and so proud and amazed at what you’re doing!", "rainey_bryc1690": "Did you have fun on your carbon boat with Diesel engine", "eedrew": "You are a gift to this earth. I am an adult and immensely inspired to be more active because of you. Thank you, Greta!", "spotti_x": "Gegen Umweltverschmutzung aber fährt erstmal dick mit nem Boot 👍", "alimbagheri": "Fuck you", "braydentaplin": "gay", "rosamavillarrealg": "@hector.andrade2 @vannyandradevillarreal", "ronnylaflame": "Wer will sie nicht smashen 😍 Baby @toni.kasai @nikmooc", "nathan_higgers_321": "If you tell me there’s no social media expert writing the captions and choosing the pictures you post, you’re lying", "unofficialkiddy": "hOw dArE yOu¿", "clayvaneaton21": "Clout chaser", "lil_uti_vert_._": "the ceo of nature is mad 😡😡", "lisatarasova": "We love you. You are the most inspiring person of our century. Thank you for making the world open their eyes! ❤️", "litzfitness": "Keep up the good work girl! 👏🏼👏🏼👏🏼 @gretathunberg 💙💙💙", "_t33na": "You’re so pretty!!", "manuela_evans2019": "@gretathunberg well a lot of people will attack you however evil will never win. You have the force of millions behind you nothing to be afraid. There is no haters when you do the right thing, there is only people suffering for not being able to be like you those are the haters. Keep going ✨", "gudischade": "👍🤜🤛👏🙌❤️", "ila_lona": "Keep going! You are doing a great job and you inspire so many people around the world!", "mofjrd": "❤️❤️❤️❤️", "lox588": "👏", "nieeemand__": "HoW dAre YoU", "champloo.o": "@momayey", "whteganggang": "stay strong greta💪 I'm with you", "lisameyer1308": "You are amazing! This is one adult that believes you are a hero for three people @gretathunberg 😍😍", "marti.mete06": "You are the best🔥🔥", "saigeetha_nandakumar": "❤️", "broox_cherry": "Shut up ur the reason why ppl need to get bullied", "hello.__oo": "Fucking bitch", "itwasntme.s": "When u act like an adult u ought to be ready to take critisicm like one. Every negative comment is not bullying u politically correct nazis, some ppl will agree with u upon expressing an opinion some ppl won't, stop shaming every soul for not agreeing with ur environmental crap, do good for urself, ain't a straw less gonna save the world, educate urselves first don't repeat everything u hear", "polski._": "U dont even write your Words and ur retarded", "rogeriotaques1967": "nao acredito em vc", "_tn48_": "Bratze @picht.02", "flockin_falcon": "Go to school", "toiasananes": "💚❤️💚", "derrickkusjex": "Kankerhoer", "yasminfreitasbr": "Maravilhosa! Orgulho de VC!", "ivankolegar": "let att vara dum som du ny hitler ???", "siwanator_marty": "Never give up!!!!💕💕❤️❤️", "mylenadratcu": "There’s no comfort zone, you’re the one who let yourself to be lead by fake hypothesis", "estefania.bih": "lol i can only laugh about you", "_lena_fd_": "You Are amazing 💖💖💖"}