{"lizziemc1999": "I wonder how many people drove there, took the bus or flew. Kind of hypocritical if you ask me and protesters aren’t the cleanest of people. They leave a lot of litter my friend’s dad is a bin man and he was complaining about the amount of junk that was left after a protest in London. It took 2 bin lorries to clean up all the empty drink bottles and plastic bags. Not only that but the stunts some people do to prove their points causes traffic to build up and causes congestion and long cues that make an otherwise 10-15 minute car journey take 45-90 minutes because some lunatic glued themselves to the floor. I 100% agree with your passion, tenacity, energy and enthusiasm but that’s just my opinion and I am entitled to one. Keep fighting for your beliefs. (Tips for improvement- Please tell the people that protest along side you to pick up their litter and walk/cycle there.)", "aziz_nordine": "💜❤️💜...🌹🔥🔥...👍👍👍.", "angel.berlinnn": "Geh verrecken", "anniechristianx": "💚❤️🇮🇹", "nxvsxm": "U callin mans to pull up and those mans probably came in cars and carbon dioxide in the sky great climate change", "hm_simo_006": "EMBEEEEEEEEEEEEEEEEEEEEEEEEEEE🇮🇹❤️🇮🇹❤️🇮🇹❤️🇮🇹❤️🇮🇹❤️🇮🇹", "surgutskaia84": "👏👏👏😍😍😍❤️", "gxkaay": "@a1ixan__ @nhdmrc @rinor_ferati die bastarde wollen mir das Geschäfft kaputt machen alda", "natchou1988": "@danaebergeron C'est impressionnant", "lau5bua": "It looks like a hord from walking dead", "lp_weber": "A lot of Co2 being expelled right there.", "noplastik.fr": "Magnifique, c’est génial👁🧠🏅👍🏿♻️", "instrutorpolicialrocha": "The world is full of idiots.", "mazra_e": "✌🏻✌🏻✌🏻✌🏻✌🏻✌🏻", "fabrizio_digirolamo98": "🔥🇮🇹", "freya_walkerxxo": "I bet people dropped a lot of plastic then 😂😂😂 @jesswallisx_", "carson_hill1355mtf": "Bro they litter a shit ton", "colin.a12": "When poop is on sale😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "calvinwisaacson": "Look at all this worthless CO2 being created!!!", "paolo_d_d": "Impiccati artista", "msa._.costa": "💪💪💪", "lucale.ka_": "Lecca il mio olio motore porco dio", "bruna__migliore": "Yea,save the worlddddddd💘", "zen_astrology": "🔥😍", "fernanalm": "👌👏👏👏👏👌", "natalietomasicc": "@anitasipura @elneraasezairi FINDET GRETA!!!", "cristal.ny": "@lucasdtolentino", "zeynel.24": "👏👏👏👏", "al_hramoy": "Давайте вы все, против меня. Я к русский, готов вас выебать", "mia_lopez157": "In that protest you just cut down all those trees to make posters that are going to end in oceans. So that just stupid", "hasslehoff785": "Look at all that garbage and waste created for the sake of a catchy slogan to put on a sign 🤦‍♂️ what a shame! How dare you! How about those 500k people go out and clean the streets or plant a tree!", "deutschprojektdeutsch": "muss groß", "sophiehaggstromm": "Due cp kolla här alla som tar sig dit släpper ut avgaser pfttt prngaräee ända du vikl va", "gerryscottidank": "Non venire in Italia", "lunas_dre": "Guck wie viele einfach nicht in die Schule wollen und deswegen zu so einer fotze gehen", "chanelle__sieber": "I first thought it was rubbish", "pyro_1312_ben": "Junge so Viele junge Dumme Leute auf einen Fleck 😂😂", "ubaidullah__b": "👍🏻👍🏻👍🏻", "siskaselement": "❤️🙏❤️", "ryan25ritaa": "😂😂😂😂", "edrecovery_pureandfree": "💛💛💛💛 Wow amazing", "arturino_64": "How dare you", "piyumi682": "We can fight im here with you save the nature we can do it", "tony6699noronha": "Why?", "56eliaz": "Müllhalde", "elias7.2": "In the beninging", "il_tempio_delle_meme": "Mamma mia", "hsn.mhmdbwhsn": ":-)😄😄😄😄😄😄😄🙋🙌💑💋", "brockpaterson0405": "Look at all that methane and co2 being produced in 1 place, mustnt be good for the planet, y’all should stop😂", "drewa2217": "Do the stanky leg", "burgess_charles": "Keep doing what you're doing always! 👏", "nemovajulie": "FINALLY", "projeto_mulhereseacao": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏🤝👏👏👏👏👏", "aussiebat28": "Hope you like cutting people off so they can’t get to work and to places where they might need to see family #fuckclimatechange", "grigore_rotaru": "Need to meet doesent mater how much it costs i am with u", "_kai______": "Dirty Italians needing to go to work !", "alionasuniverse": "Sinceramente non credo a tutti quelli che sono usciti fuori per marciare che fanno qualcosa di concreto per il pianeta. Tra di loro saranno in pochissimi che in quotidianità fanno qualcosa di concreto. E poi spiegatemi il senso di queste marce.", "line_luciole": "♥️", "gunnerhertenstein": "Why are you taking pictures of trash", "about_.alessia_._": "😍", "dra.gabrielagilperez": "❤️❤️❤️❤️❤️🙌🙌", "8i.mrtz": "@gretathunberg Hast du Interesse an einem Nasenaffen?", "isurvived911": "bro i honestly thought this was a junk yard full of plastic bottles at first", "lukabjornestad": "What are you protesting again?", "selin.zh": "Shut up", "rxbn.rs": "massen behinderung", "thehussainisarwars": "best of luck", "kadir_sygn": "🇹🇷", "amydav0": "Greta you are truly amazing", "blaisebennefield": "Me and the boys on the way to confront the CEO of gay", "umutbahceci0": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "jannishollfelder": "Fridays for Hubraum🤙🏼🍀🍀🍀🍀", "skylinha0606": "Grow trees instead of blocking the streets", "shes_a_vegan": "Hope everyone is not leaving behind any trash on these marches/strikes. I have heard many rumors that the streets left behind are trashed and I hope that they are just rumors!!", "kim.p16": "Gretas sklaven😂", "thetriza": "Looks like a trump rally", "x.crack_": "@nicola.stallone alle kein lappen damn", "colinryjordan": "look you cant change the world this is climate change sorry to say but keep on trying", "hubert.spindler_040": "Da scheasln tausende vo leid und do sagt niemand wos", "brunogalante18": "#merobaronmiinfancia", "itsonlyels": "All that co2 they’re breathing out is causing pollution", "marta_cron": "Peccato che poi le strade siano rimaste piene di bottiglie di plastica per terra.contradittorio, vero?", "_fraanbeleen": "Dmssss bknnn", "leon260701": "Auto For the win", "banilaager": "Yeah lots of people striking with their plastic signs, plastic bottles to drink from and probably with those nice vegan drinks of which 90% of the ingredients need to be shipped for thousands of miles around the globe. Look behind the curtain! Greta is only a tool!!", "melanieidachopko": "Amazing", "zandro0007": "EFFZEH in London @luis__ccaa 😂😂😂", "chadliiiiiiiiiiiiiiiiiiiiiiiii": "Imagine of Optimus prime came out of nowhere and ran them all over LMAOOO😂😂😂", "duke.siberian.husky": "Ok. But, WHERE ARE you Greta? Brazil just got hit by Venezuela with criminal oil spill, and you DO NOT SAY A WORD!!! SAHME ON YOU GRETA.", "andrea.moselli": "Seguitemi se siete italiani", "jacksonpearcy": "Cold isn’t it 😝🤡", "xx_.dav1dx": "climatic crisis ist not real don’t listen to them what they are talking about their are just talking about shit dan dumb stuff that’s not real", "martinfugunt": "I mog di nett", "thomas_the_dank_engine14": "🅱️🅱️", "_change__world_": "💪🏻💪🏻💪🏻❤❤🌏🌏", "kellygawronskii": "LOOK AT ALL THE WASTE YOU’RE CREATING HOW IS GOOD FOR THE PLANT?", "ale.marianii": "Pizza mandolino pasta and foca", "dotchyyt": "Literally all the children their are for the insta stories and then they leave all their shit behind that's big dummy dumb", "er1ch.187erzz": "😴 i was sleeping on this das HAHAHAHAJAJAJAJAJAJAJHQHAHAHAHAHA", "bagr.czet": "I wanna be like you, you should be a queen of all world ! Good luck !(sorry for mistakes)", "berto.nium": "I can see memes from here", "cheodioesistere": "Hold on Italy!!! We're doing a great job for the world❤️", "anderson_fernandes_bmx": "Police should expel these vandals based on rubber bullets and tear gas!", "findinghappiness4": "Why u all people who are protesting just plant some trees..... that will we better😇", "jason_jou": "UR CREATING AIR POLLUTION, DO U KNOW THAT PEOPLE EXHALE?", "blackombra": "@gretathunberg you have to fight hard for a future", "duckfuck88": "Cringe.", "flexxity_": "Ilyyyyyy😍😍💗💗💗", "colemanfox23": "😍😍😍", "jessicathomson___": "Bull shit", "tinatimmie": "👏👏👏🇸🇪❤️", "shaanaj_2721": "Great👏👏👏👏👏👏👏👏👏", "alex_jaeckle_18": "Ur terrible", "pat.savetheplanet": "Only the mass can change it", "leegiffard": "A huge carbon footprint. Many people using vehicles to attend, mobile phones to post and just to ask, how do you charge your mobile phone to post on Instagram?", "limmagst": "🤩😍🤑❤️👏🤗 amazing kids worth millions bimbos🤣", "ang.gubert": "👏👏", "_wesleyadolph": "🤡", "freddyluongo": "VAI A SCUOLA E NON ROMPERE I COGLIONI", "miafiedlerrr": "where's waldo be like:", "laurin_18_": "🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "robzh10": "Great waste of paper and the amount of trash that resulted in this", "martacanovo": "🌭", "mukimuki64": "Warming lies😜", "demonicvalkyriev": "It’s in Italy, lmaoooo that makes sense a bunch of soft idiots", "immaarii_": "💜", "s1monsln": "@osamabinladen", "louis_brepoels": "Jou", "_chiara.diguardo_": "Cero anch'io😍😂", "sharra7agario": "🔥", "mechisg": "@tommyjfranco", "tiagooffredi._": "@samuel.giambo frate ci siamooo", "davidafarmer": "Press on!!!", "pinnpipe": "you scam artist", "peterd2000": "😏", "shady_dc5": "Climate strike did nothing", "pippilin2": "❤️👏", "mel.suze": "@jmmanoccio", "deniiz.yngz": "@xmalloryo", "apple__ioss_": "👏", "degenerate_god": "Greta, do you ever sometimes get overwhelmed by the fact that you brought all of these people together? No matter what happens, you never back down. You’ve done so much for the entire world. You truly represent the idea that anyone can change the world. Anyone can make a difference. Its so hard sometimes, but don’t lose hope. You’ve inspired millions. Keep making a difference, please don’t ever stop fighting. We need people like you. Thank you.", "bulldogtide228": "@gretathunberg Always respect your parents because parents teach their children wisdom which will come in handy. If you play video games, play old games on NES, SNES ,dying a lot in video games teaches you perseverance and makes beating them better. Campaign hard for China and India to clean up their pollution. Fairbanks Alaska, Los Angeles, Central Jersey all have pollution issues that need a lot of attention (superfund +)", "s.o.4.a": "@luna_474_", "furbovolpe": "Sei Brava💖👏", "jonathan.danaher": "all those people out of work and school and for what? you’re missing out on growing the economy and learning new things because you want to “fight” for the environment? instead of wasting your time waving your cardboard and plastic signs and skipping school, you should be actually doing something to help the environment. clean up your local beach or switch to public transport or even buy an electric car. going on meaningless strikes and wasting your time protesting is not going to solve the climate issue at hand. in fact, all the cars and planes and boats and trains that were used to GET all of you to your protests made a worse impact on the environment than staying at home would have done.", "_.alexiiaaaaa._": "spero che non vedi milano..", "jay_6c": "💪🏻💪🏻💪🏻", "ldrawfinsta": "@sc0ttal look at all those people. releasing carbon into the earth. killing us.", "casciano_insane_workout": "L'importante è non fare un cazzo, vero? Stupidi perditempo sinistroidi ricordate, il lavoro rende liberi", "_tony08_": "What did they use to get there.... a car so stfu", "nataliavdzalm": "@frekevannimwegen 💗💫", "_petra_sunshine_": "👎👎👎gefällt nicht", "bemglo\nVerified": "Verified", "alohaa.ty": "Are those signs bio degradable?", "riverscuomo.feels": "Greta look up 2 girls 1 cup", "fabuleuse_co": "@natan.drt @_eilahtan__ bravo Torino👏👏👏", "justanothersoern": "Today every trash gots 2 Mio likes 👽", "franco_ube": "Io ero lì ma non per manifestare! Evitate sta merda che non riesco a passare", "lorenzobizzozzaro": "Le foto dei rifiuti per le strade e il globo che prende fuoco le tieni in archivio?", "r8viloo": "I want to run them over", "zzdcccc": "where did all these guys park their cars?", "anthonybattaglia281": "@like.disco.lemonade_ wow 🌲 💪", "iamdeniadenia": "👏", "manchester.aviation07": "✈️✈️✈️✈️✈️", "millie_14_xx": "😍", "kimlorio20": "@basicincomemarch #YangGang #yang2020 @andrewyang2020", "wemerson.szp": "voce e a melhor pessoa q tem nesse mundo atualmente!", "frejaasofia": "💪🏻", "danikshvayko": "Ok now what", "dennyynielsen": "Tltkl4l4otototott", "officialwhirlpeace": "❤️ 🌎 And 🐋 💯% @officialwhirlpeace", "susyflores397": "Cuánta basura con esas pancartas 😒😡", "sicktric.k": "What about HAARP, and chemtrails? @gretathunberg no? You’re a puppet aren’t you", "marga.vandervet": "Impressive 😍", "downundernf": "I pity you Greta, you should be in school, not be in public being used as a globalist mouthpiece for inconclusive, alarmist propaganda.", "zahraa_95.2": "#save_the_Iraqi_people", "nsh.anhr": "#hello_world", "_svenwehrle_": "🤢🤢🤢🤢🤢🤮🤮🤮🤮🤮", "0chill_ma": "Geht nachhause", "nessun262": "Io sono di Torino", "ericspago_": "Climate can’t fucking hear you, if you want change stop fucking protesting and do something", "teecenola": "🌎 🤝", "leekingsauce": "Idiots, not one of them has done any research for themselves, they get all the information from the media, which makes everything they know a LIE, sheep puppets, wake up and question everything, EVERYTHING", "_sa.m4": "مرحباً أيها العالم هناك شعب يقوم بثورة الآن، في شوارع العراق Hello world, there are people making revolutin now , in lraq! Show your support for right of lraqi people to protest Peacefully! #Save_the_Iraqi_people", "franztier_hd": "Lass meine 1500 ps im auto in ruhe 😭", "chiarabrasa._": "Siamo fantastici🤪", "lindavelu05": "💞😍", "sambentaleb": "@kianafoote!", "gloomyhosting": "I wish I was King Kong so I could stomp on them. 😔", "silke_ll": "So many brainwashed people. Sad", "d3nn15": "Look at all that paper made from trees @gavino__o", "gah_vun": "Who is working?", "clarazamora03": "Juntos somos mas fuertes🔥👏🤟✊", "l_rerdt": "I hope a terrorist blew them uo", "keenanwillixm": "@justin420boi hOw dArE yOu", "gabriele.maestri_": "TORINO CI SIAMO?", "rian.phantom": "Like wenn ihr Andi‘s Springmaus kennt", "mupina": "Meravigliosi giovani", "biaaanxoxo": "@henry.20", "cerberoto": "😎💖", "fergalantonioli": "Ite what’s good wifey🤭😏.", "mafrapie": "Torino ❤️❤️❤️", "elviraworld": "❤", "samiradedic": "@gretathunberg 👏🏻👏🏻👏🏻👏🏻", "irenas1221": "You’re not alone ♥️ Thanks for starting something amazing...we really needed something like this💞", "evama38": "Greta Thunberg is being exploited by adults to give their Climate Change crusade a special appeal , to soften hearts because she is a child! I think it disgusting effectively child abuse, making this young girl seem a national hero when she isn't at all! NO scientists have proved beyond doubt that man on earth is responsible for global warming or climate change! Greta Thunberg knows nothing about climate change beyond spurious information adult are feeding her! #wakeup #think", "palimpalim______": "fake", "katieeb03": "TRUMP2020", "sustainabilityforourchildren": "❤️", "mensgide19": "😮😮😮", "houda77": "Wow", "antonios85": "@cittaditorino sei bellissima ❤️❤️❤️❤️❤️", "rosamavillarrealg": "@hector.andrade2 @vannyandradevillarreal", "zynbog": "Det ä nu man ska ha en fet bomb", "117_tiger": "WOW🤯", "ariana_itaa": "Torino🇮🇹🇮🇹❤️", "giuseppe.gregorace": "Lol", "rubianapinto": "So good 👏👏👏👏👏 LET'S go🏃‍♀️💪", "nanni.marianne": "Did you also see the pictures of all the trash after the climatestrike? Doesn't fit together somehow....🤔", "vitoasasa_": "🇮🇹🇮🇹🇮🇹", "eldanielsilverio": "🖤", "manslindner": "Torino, ser du vilken gata? @esquillinho", "fquintner": "@erikatee1", "leoo_poli_": "Viva la plastica", "carmenmoncada96": "@cgerardinamq @carmenwilliana", "petroula_mpakali": "@nikoleta_mpakali", "laurendin22": "❤️", "_mch_grg": "Vorrei solo vedere la immondizia che hanno lasciato in giro dopo la protesta...", "sirpawickholm": "👍👍👍👍👍👍👍", "diamanten.klara": "Hello i like that you have be en", "joshuart22": "You curry munching meatbaw sooking Anal bead eating hun fuck off and die", "riederstein": "👏👏👏", "siciuz_berlu": "🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹", "rupikaur_\nVerified": "Verified", "shmooki96": "Vergrab dich", "jade.rxbertss_": "we saving ✊😌", "prahs_leahcim": "🤡🤡🤡🤡🤡", "mari.cadeddu31_": "My son was there! Very proud mom. All together we can change", "zay_toun": "We are the change Song now worldwide for freedom #gretathunberg 🌎❤️", "bea__veloso": "!", "paulamerkl": "💪💪💪♥️♥️♥️♥️", "alessia.zn": "👏", "iamsarafim": "🙏🙏🙏🙏", "_coronaeborealis": "Such paper wastage", "caltomic": "how many trees y’all cut down for those signs??", "julian_trev94": "Fake.", "nicholasdepetris": "Daje torinooo", "giu_montes": "🇮🇹🇮🇹🇮🇹✌#fridaysforfuture", "la_puffetteria": "❤️", "xxhaina": "💪💪💪", "victoriabaltodano": "Bravo Italia 🇮🇹!!!", "98._abvg": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "_tahiya._": "We are with u 👏", "jamesdavidloveiii": "@gretathunberg thank you", "lesleecookmft": "She is our heroine, may she be protected and blessed as she leads this charge to save all species including Homo Sapien Sapien. Join in this pledge of your attention/ choices and values. We must demand sustainable transportation and stopping single use plastics🙏🏼 She possesses such courage and light, we love you Greta. Be safe 💜🌏💞💗", "imflacko_venerus": "I torinesi so come te...sciem", "soule.said_167": "Nice", "lorenzo.zarini": "Vai così Greta combatti per salvare il mondo", "beatrizmonzonbm": "👍👌👏👍👌👏👍👌👏", "sarahchristina3000": "“I will make mere youths their officials; children will rule over them. People will oppress each other— man against man, neighbor against neighbor. The young will rise up against the old, the nobody against the honored.\" - Isaiah 3:4", "youhanwong": "Greta I'm so happy to see huge waves of actions, news and movements in saving our mother's nature. I love nature, seeing them being destroyed by humans make me sad, frustrated and mad. In my daily life i do my part in reducing carbon footprint. However i feel ashamed that i didnt do enough. I see that you are the change maker in saving this planet. I will follow and support you. ❤️🔥", "silviacarta._.06": "😎Italy 😎😎", "lena.lindblom.56": "Fantastic 😀💚💚💚", "maestro_riga": "🎵", "iosif_stalin_komrade": "Bellissimi i cartelloni meme🤣😂🤣🤣😂🤣", "xrbanbury": "🙌🙌💚", "stevie_divona": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "pixiebagge": "oh shit wow", "liberty578": "😳🙌🏻✊🏻", "jqken": "🤡", "certainly.maybe": "The climate does not care about your strike", "mumukshavinitkhicha": "@gretathunberg Instead of people marching on the streets like this, if each one of them planted a tree, just imagine how the world would have been a better place to live already. Stop protesting, start planting.", "marion.pinkhaus": "✨📸👌✨🍀", "alessandraleoact": "Incredible, fantastic", "giuseppe_ribello": "Chitemmuort miett napl", "emmanuelle.marchand.5": "Congretulation Greta And thanks a lot !.....go go go 👏👏", "_yngmala_": "Si ma tanto le strade erano piene di spazzatura", "inesfaccani": "@_bea.006_", "raimondogomes": "👌👌👌❤️👌👌👌👌", "julitschkasan": "💖💖💖💖", "lxisx.x": "💚🌍🌍💪", "adapalmasky": "♡", "thereal_bordagram": "Ma quale futuro....", "malvaemusic": "System change", "worldtraveler1993": "Proud of you 💪🏽", "locco_jd9": "I truly hate these people because firstly they cut the tree and make a paper and then write on it.. Save the tree.. Climate strike 🔥🔥😩😩😩😩😩b", "marcelotag": "Torino ❤️", "diego6004027": "This is Amazing!!!", "loeticialefebvre": "❤️❤️👏", "cecilia.andreottii": "Home❤️", "mekka_design": "Amazing!!!", "kaiser_aiden": "Your mom sex", "aldogromponesalgueiro": "Bravi tutti!!!!!.", "_ritikrs_": "You used paper and cardboard to make those sign increasing company demands and the increase production of paper thus more trees being cut down how about “planning before you enter a protest idiots” also if your gonna say it’s recycled, well it still was born from virgin paper also the energy used to recycle paper creates carbon emissions so why should we have to listen to a protest where the people themselves aren’t doing their part bunch of hypocrites lol", "_beatricedosio_": "❤️", "bcr_sps": "👌👌👌👏👏👏👏", "elephant_advocate": "Incredible,Amazing and People Power will over come all things 🙏💖🤗💝", "_.greg._17": "🇮🇹🇮🇹❤️", "kabal_sakir": "🔔🔔🔔🔔🔔", "johannawestfelt": "👏👏👏❣❣❣", "sofyy_.07": "👏👏👏👏", "dani.giacobbe": "Solo perché era venerdì", "gerardi.sofia": "Thank you Greta❤️😍", "anikophotos": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏😍💪💪💪💪💪💪💪💪💪💪💪", "peaceandloveindustry": "Greta follow us", "igintokius": "👏", "vanigliaphotos": "MY city ❤️💪", "bree_pullinger_interiors": "💥", "_don_ton": "#gogretago", "annika.strandberg": "🤗", "manojkarela_indian": "Big salute for @gretathunberg you are fighting for climate change and Indian people are fighting for religion caste extra extra", "les_aventures_de_k": "💪🏻💪🏻💪🏻💪🏻", "nellapalladini__": "😘👏👏👏😘", "xxngui": "👏👏👏", "time5548": "👍👍👍👍👍", "sqwiqui": "Greta fuck off you bitch", "secret_t_phantom.ares": "🤮🤮🤮", "tizi_fi": "Noiiiii 👏", "onestopecoshop": "👏👏👏👏 people are waking up and realising what is happening to our world!", "d.avid.ee": "Famm na birr greta thunberg", "smains": "This is great 💚", "davidebriguglio": "@the_ciccolo_unofficial vedo anche te", "sassieschuijt": "Wow👌", "eniihorvath11": "I were in a climate strike tooo on friday in Hungary❤️❤️", "maaryi.chutney": "@derendora", "labyrinthag": "🌞🌞🌞🌞🌞🌞", "wela734": "👏👏👏👏", "soulbobber": "👏👏💕💕🔥", "salviamogaia": "Eravamo tutti insieme 🌸 grazie a te Greta!", "kimdejesus": "🙏🙏🙏", "mila_arcimavi": "❤️", "mcervilleram": "@jelena.peraldo 💕 @dadarosy73 💕", "jasminebutera": "@jurassicjacinda", "fannypriv_06": "😭😍", "mauricinhoakel": "Tais reclamando de q capeta??? Vai cuidar da sua cabeça!! Os neuronios tão prejudicados!", "carly_heaton": "Wow!!!", "ladro_restaurant": "💚💚💚💚💚🍕", "alecita_gonz": "🙌🙏🏻❤️", "heath_campbell_": "💙🖤💙🖤💙👑", "fire.jaguar": "That’s amazing! You are a great leader!🙌", "sanhirofficial": "❤️💙", "noahhadams": "Wow! So many retards!", "marlon.w.h": "Perhaps it's these millions of humans that are the problem. I'm struck by their resemblance to a swarm of insects in these images. ... creepy.", "ana_ibaher": "@ricardvp", "elt8970": "Thank you for being such an inspiration AND an ACTUAL role model.", "irishgt413": "@ash_olive1217 😳😳", "partybutt": "🙌🔥🙌🔥🙌", "pytt.chelseaaa": "Damnnnnnn", "magdayandar": "😍😍😍", "chermiekins": "👏💜👏💜👏💜👏💜", "lyn.disanti": "Thank you for your passion! I support you 100%!", "ansbu8": "🤩🤩🤩🤩🤩", "zuehl83": "LMAO WAYYYYY TOO MANY FUCKING PEOPLE! HOW ABOUT BIRTH CONTROL ON EVERY WOMAN WHO HAS KIDS, PEOPLE NEED TO STOP FUCKING EACH OTHER, AND FOCUS ON OUR ENVIRONMENT. I MEAN IT IS THE PEOPLE THAT ARE POPULATING/AND POLLUTING THE EARTH RIGHT? GIVE ME A DAMN BREAK, ALL THOSE PEOPLE THAT ARE AT THESE RALLYS SHOULD BE FIXED, JUST LIKE SPAYING/NEUTERING THE ANIMALS.", "mityastaev": "Wow!!! @nataryz", "guillermiinaa_": "👏🏼👏🏼👏🏼😘😘", "argie_brodsky": "Maravilloso 😊❤", "shalaineadolfo": "👍👍👍❤️", "super_utente_anonimo": "Quanti Gretini che ci sono in giro", "dthwala.india": "STOP PRODUCING MORE PEOPLE...", "cacaujunqueira": "Go Greta, go!! We are all with you! Come to Brazil!! 💚💚💚👏🏽👏🏽👏🏽👏🏽", "adam67702": "Ohhhh. The insolvent European countries. Awesome. I hope the rising ocean gets this first", "ana_car0lina_maciel_": "bando de vagabundo", "alt3ya": "we stan 🙌🏼❤️", "paragonegallery": "You are the sanest, smartest person on the planet💚💚💚", "themindfulfork": "Wow!!", "moonsorbiting": "💚💚💚", "erica_drommi": "‼️‼️", "riccardocialfi": "❤️", "jason_jorel_gordon_brodie_": "I taxisti non riescono a passare", "giovaschiavone": "Boja fauss", "terresa7277": "@rickjrussell ❤️🙌🏻❤️", "paucagtk": "@_steerr", "make_tralee_great_again": "THE EARTH IS FLAT", "jaejaec7": "I am with you Greta 100% I absolutely love what you’re doing and we as youths say we should keep pushing and moving forward with you. 👏🏾👏🏾👏🏾❤️", "etu_etu_": "💚💚💚💚💚", "marialeticiafilpi": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kellychildsxo": "👊🏻👊🏻👊🏻", "almostanonymous": "😮", "riahino": "This is amazing", "rickyvecc": "Ok..she speaks about CHEMTRAILS around All the WORLD...??? THEY GENERATE CAOS IN CLIMA!!", "cohn.christina": "🙌", "matrin_sz": "👏👏👏", "florenceisabellemegginson": "Much hope on the horizon for us 🌈🌈💚💙", "vanbergen11": "🙌🏻🙌🏻💪🏻💪🏻", "unterseecafe": "💙💚💚💙", "neekskinorganics": "👏🏻", "iblamejordan\nVerified": "Verified", "drew._.pc": "😍", "carolynschmitz": "🙏🏻", "piamadde72": "Greta you are amazing🙏❤️👌", "emilyshouselondon": "We can do this! 💪", "henrikemilson": "❤️", "danmaier1980": "💪💪💪💪💪", "zazicrafts": "Amazing🤗", "brooklynsurfcompany": "🙏🏽 🌎 🙏🏽", "ziggyeriksson": "❤️💪", "gabrielaletterese": "Italy🇮🇹🌏", "fridayforfuturetorino": "Thank you Greta", "sweetsexichic": "you go girl", "flowers_miriam": "👋👋👋❤️❤️", "bella_di_papa": "Hai rotto...sei una comparsa", "d3prespresso": "All the trees that died for the signs..", "another_human_here": "Yess", "earthstrongsupplyco": "EarthStrong🌍🌎Follow us", "piercewehrle7": "Who knew italians were so easy to fall in line with anything? Cough* cough* Mussolini and WW2. 😂", "imargsx": "#turinthegreat 😃", "nitnendo": "Shes 16 not 10 her parents arent forcing her anything", "liuguapia": "💗💗💗🌟🌟🌟👍👍👍", "daratatada": "❤️", "freedom_ethics": "Oh If only they all would be vegan. I can imagine this very possible dream 💚", "brinkofeden": "What else can we do but go on strike for our planet? Lower our use of car/plane travels? Have less/no children... Oh, you say that stuff is neccessary in our everyday life, can't be avoided? Well, good thing you can also help by switching to a plant-based diet or simply by buying vegan! Go vegan, and be the change you wish to see in this world🌱.", "_sabatiino_": "Grazie al cazzo abbiamo l'assenza giustificata", "cartographynyc": "@cello_ny", "gabri_neverstop": "@vittoriacontee 🤟🏼🤟🏼🤟🏼", "tritondive": "👏 Yes", "alessiobuonofiglio": "Carry on!", "mundosonoliento": "@sarah_martin10 obviously the only photo you liked of this page was the one of italy", "renatorenatorenatoooo": "Hanno trovato la scusa per non andare a scuola", "bjrdesign": "Its chilling💥💥💥", "mirefugioanimal": "👏👏👏👏👍🤗😙", "giuliaapacifico": "😍😍😍😍😍😍", "brahmak": "Fantastic. 🙏🙏", "joaniedecker58": "@gretathunberg you are truly amazing and an inspiration to the World 💞", "rosmarielarsson": "👏👏👏👏💓", "george._tb": "@arthxr_19", "clarapleca": "@antoniomele993", "therebeccababb": "LETS GO 💚", "antoniomele993": "A milano per protestare hanno dato fuoco a un mappamondo gigante 🤦‍♂️😅", "sofiachaverra180": "hej greta mitt namn är soffia och jag vill säga tack för vad du gör för världen och då hade jag också tänkt att ta hand om världen när du gör en protest men jag visste inte var jag skulle börja förrän jag såg en video av dig och jag såg hur spännande att du kommer från Colombia och jag vill säga att jag beundrar dig och jag vill hjälpa dig, jag vet inte var du ska börja, tack för din uppmärksamhet att: sofia chaverra", "suescott8591": "😍👏🏼😻🌺💋", "leone_30": "You started a movement 👏🏼👏🏼", "sweetjst": "OHHH YESSS, I'M ITALIAAANNN", "irma_serafini": "💓💓💓", "daniel5943": "Bravissimo !❤️❤️😎😎😂🔥🔥🔥🔥👏👏👏😎😎🙌😢😍😍❤️❤️", "almarghanijo": "This is all your work Greta thank you ,well done", "lejardindesev": "We will win this war. EARTH and children are more important than money. 👍👏👏", "fabi_il_fenomeno": "😂👎", "greger_nuget": "Fuck you Greta", "dorronfranco": "🌏🌎🌍SAVE PLANET EARTH🌏🌎🌍", "sussilago_stjarngren": "❤️", "beestenindenbosch": "Wonderful‼️ And i do hope that all those millions are also Plant some extra Trees&Plants in their own gardens, balconies, walls, rooftops and in their neighbourhood, for immediatly effect Cooling Down the Planet, Regreen-Revolution 🌳💚🍀 #justdiggit #leadtz #africawoodgrow @blackjaguarfound", "francesca.cesca": "💕❤️😂🎉🎉", "friscooo0": "❤️", "gaitasarah": "😻", "mysodergren": "👊👊👊🎉", "saviogabriele": "Ti amo", "cubodilanga": "💪💪", "niculupo": "💪💪👏👏", "spanu785": "I was here:) So on my blog\" il tocco angelico, on my facebook page\" L' essenza dell' umanità\" and \"Spanu785\"( instagram) ; I'm writing about social humanity and new evolution!", "pippiripiii": "❤️❤️❤️", "veronicamainetti": "🙌♥️🙌", "fahadmarzoog": "👍🙋‍♂️💪💪💪💪💪💪", "atuccia": "♥️💪😍", "parapura_official": "❤️🙌🏻", "andreivrea": "Vai a cagare stronza...", "vegan86girl": "😲", "jonas_bo.sr": "Alles klar im BH? @thiloninjo", "katherine_aubemochon": "How many were there?", "kellymcglinch": "@slowfoodnyc @martinaken @cermilio13 look at Torino!", "jania60": "👏👏👏👏👏👍👍👍👍", "luxury_homes____": "Please follow me to receive all the new please😩", "stayscozy": "Just wow", "stucev": "Very nice 👍👍👍💓💓💓", "clromano": "Incredible. That’s wonderful", "patruskanina": "✊🏻✊🏻✊🏻💪🏻💪🏻💪🏻", "massloskochen": "💟", "thousandwords8": "Love you Greta. You are a Wonderful Human.", "nichtganzdruff": "Fuck you 🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "fritz.liz": "Amazing!!!! Great job!!!!", "__iimyasmin__": "👑👑", "marcelinhaneves": "👏👏👏", "karinmajerc": "@bia_noa", "triotenor": "#climatehoax", "greeninfluence.co": "Amazing 🙌🏻🙌🏻💚🌍", "wellcruznery": "👎", "raffaele_simoni": "❤️❤️❤️", "lindgren.mark": "👍", "robinintheroses": "So proud of you and your leadership!", "_robertaragusa": "What do you think about the answer of Sky News Australia?", "eatthis12": "👏👏👏👏", "epoca_vintage": "😍😍😍", "ibrahim08.12.2019": "#dienstagfordiesel", "mrgnshlds": "🔥🔥🤘", "el.panzer_": "Inizia a scopare", "dramaistanbulfilmatolyesi": "🌺✌️", "banjosteatro": "❤️❤️❤️❤️❤️", "bumbee_deleon": "Lol significantly more people than the trump inauguration", "embeeferrell": "The children shall lead us!!", "slimiboi": "Bruh i just wanna live lemme live till i die then yall can do whatever yall want", "in_events_sustainability": "💚", "tommy_nygren2929": "So good", "mammachecasa": "❤️👏🏻👌🏻💪🏻", "haggitrich": "TelAviv Israel is marching too", "marcel.idfwy": "F*CK climatestrike and go to school.", "shohrehkhaatoon": "💚✊💚", "jahniece": "Thank you Great for inspiring the world! 🙌", "valeriobenedetti37": "Grazie mille Greta🇮🇹🇮🇹(thank you very much Greta)", "perpetual.warfare": "😯", "karinhorvallius": "💪❤️🌎", "vieirasantosadri": "@victorfale @betinarconceicao", "isabelle.balaguer": "👍👍👍👍", "juliechicstyle": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "tiandcocomaui": "It is a great first step for the change, BUT THE ACTUAL Actions are the immediate needs, for all of us to live in a sustainable way DAILY. EAT CLEAN, WEAR CLEAN, BUY and LIVE CLEAN🌿🌿🌿Those clean definitions =Not buying pesticide/ herbicide used organic food, Not buying new conventionally grown cotton clothing ( they use sooo much chemicals to grow cotton, contaminate and killing the nature) and most of other conventionally made clothing😃reuse ♻️ recycle, save natural resources🌿Live Happily 🌈🌈🌈", "valeriecarreras": "👏👏Gracias por lo que haces👍❤️", "lauracobain_": "👏👏👏👏", "laylinchen2016": "👏🏼👏🏼👏🏼💚💪🏼", "kiranboman": "😍🤗🙏", "ilir.rutigliano": "La zona😈", "dcg60": "Keep it going - the planet 🌍 is dying 😢🥵🥶😱", "swedishanton": "Bravissimo Italia! 💚💚💚", "flockdance": "YES", "piccola.upi": "Love this!!! ❤️", "neonbblue": "⚡️", "kimlisbethkristensen": "Wow 😮 😍😍😍", "jilleigirl": "🌎✊🏽🔺✊🏽🌊", "lajosefine_": "💪💪💪💪💚💚💚", "_j_2020_": "😎🖤😎🖤😎", "tripbicycle": "All world need it👀👌", "silvia.mrc": "🙏🏻🙏🏻🙏🏻🔥🔥🔥", "hridayamayurveda": "Wow!!!", "dnick4545": "Could you tell me just 1 Climate Change Disaster Prediction that has come true in the last 50 years? I’ll wait.", "monti.python": "#FridaysForFuture", "mario_giannetto": "Cara @gretathunberg tu dici che ti hanno rubato l'infanzia.. io ti farei vivere una settimana in africa senza cibo e senza cure poi vorrei vedere come ti lamenti ancora e tutte queste pecore ammaestrate che ti vengono dietro.. siete solamente ipocriti, IL CAMBIAMENTO PARTE DALL'INDIVIDUO QUINDI DA OGNUNO DI NOI. COMPLIMENTI AVETE FATTO UN GIORNO DI SCIOPERO I GOVERNI CONTINUANO A FARE QUELLO CHE HANNO SEMPRE FATTO SE NON PEGGIO E PER NON FINIRE AVETE SPORCATO CON MOZZICONI DI SIGARETTA E CARTE LE PIAZZE DI MEZZA ITALIA.. SIETE SOLAMENTE IPOCRITI.", "luthful7": "👏👏👏🍀", "davidmolina282": "Todos los ciudadanos del mundo tienen que poner. su granito de arena, empezando en nuestros hogares.y al mundo industrializado piquetear su comercialización no consumiendo sus productos que contaminan la flora y fauna de nuestro respectivos países 💐💐", "natalieespin": "👏🏼👏👏🏿", "chantelevaa": "Amazing, thank u for standing for our future.", "karinharngren": "Man kan inte gömma sig för fakta!!!!!", "nicola_pel_": "♥️♥️♥️", "bombstylist": "Chills", "bariatric.babe.aus": "Hello! Please sign and share this petition in support of declaring a climate emergency in Australia 🌏 https://www.aph.gov.au/petition_sign?id=EN1041", "mel_yarbs": "Beautiful, amazing, inspiring 🙌🙌", "anya.c.s": "Wow 😍", "matejulius_ks": "@sam.vr_20", "esmevellez": "💖", "kasia_esque": "Look at all that trash polluting the - oh no wait, that’s people, who actually belong in that environment. ❤️@gretathunberg❤️", "pichieyy": "I was there.❤️", "svm_fernando": "🇮🇹💚", "ryan.mcmahon__": "ok retard", "missed_where_thats_my_problem": "It generally looks like trash on the road, not being offensive but It actually looks like the rubbish after a parade", "otelloboutique": "Turin", "mattsdonaldson": "Wow", "semithiel": "Wow 😮 great 👏🏾👏🏾👏🏾❤️❤️❤️", "_beatrice.sanna_": "Italiani!!!!💪🇮🇹", "avaleannebentley": "Climate change has always been a natural happening of earth in its constant pursuit of balance. However the consequences of the industrial revolution and global consumerism are everywhere. The extinction of thousands of animals, the elimination of thousands of acres of natural land, the numerous cities with unhealthy air quality, the fear of people afraid to make changes because it would affect their level of power (rule) and/or their bank accounts. And I think this represents something amazing with people coming together in connection when some much out in the world right now is geared to human separation.", "kawakison": "Fohk jo", "_angyb_": "Parli dell'inquinamento e del pianeta e usi internet...", "phoenix_treeleaf": "🙏🏼🌿🌏🌿♾", "1droadiesryebeaumont": "👏👏👏👏❤️❤️❤️❤️", "simondambro": "❤️❤️❤️❤️❤️ Torinooo!", "salitarrr": "🤡", "sturboxz11": "🔝🔝", "carmenonloll": "🤞🤞", "francescogucciardo_": "Toooo tutte le strade di Torino sporche di immondizia", "rarosem": "Proud of my city! GREAT!💪", "marisol.gasparini": "Venice", "renatuz_8": "Sei ridicola", "_ilragazzino_": "O mongoloidi ipocriti del cazzo lasciate stare mio fratello @aletraffic e continuate a buttare i filtri delle vostre cannette per terra", "beau_loves_pandas": "Where is this????", "lubdubk8": "🙌💗🙌💗🙌", "this_is_domy": "😍💪🏼😍💪🏼😍💪🏼😍", "patrizia.sanna.96": "🌹🌹🌹🌹🌹🌹🌹🌹", "nounaowel": "🙏🙏🙏🙏🍀🙏🍀🙏🍀🍀", "barskymilde": "💪🏻💪🏻", "cleopatranarlis": "You are changing the world Greta! 💗", "lamacorno.del.dank.mp4": "Porcaccio dio", "_tommaso.giovanelli_": "Fai schifo", "mariannedechko": "👏👏👏👏👏👏", "monflanquin": "👏👏👏⭐️⭐️⭐️", "vic_20_ciko": "😍", "youngdecisionmakers": "🙌🙌", "cosmin_vaitra": "Ciao Greta, legalizza anche l'erba perfavore @gretathunberg", "oslosentrumnu": "💚💚", "__goli10042__": "Fuck yea io ero la", "ennen_priv": "INDIA IS WITH YOU", "pamsimonsson": "Stunning! Awesome! 👊🏾", "moonaries67": "Yes!!", "yes.yes.i.did": "Only 22 people in Atlanta! Still fun tho!", "voz_e_art": "👏💞😍🙏", "ike_ake_esq": "🙌🙌 people power in action.", "bg._13": "SHUUUUUSH", "a.l.i.c.e.m.a.r.i.o.t.t.i": "👏👏👏", "giusygrazianoo": "♥️", "leeon.lbr": "Burn them", "fab_ietto": "Brava Greta ❤️", "sofiandsof": "Italy😍", "corrineschillinger": "WOW👏🏻👏🏻👏🏻🙏🙏🙏", "martjna.spg": "my city❤️", "andasola": "👊🏽👊🏽", "mccasba": "That’s a huge crowd, period", "mats_skilberg": "Don't just hope for change, make it happen 👍", "cher_ry_blossom": "No serviria mas que en vez de marchar ponerse a recojer la mierda que hay en las calles y con mierda me refiero a basura en los ríos y toda la contaminación que haye parece estúpido porque caminando y marchando mo se va hacer mucho.", "floxro": "@nessanienchen italien", "2h_meme_rosmini": "Tutta gente che non aveva voglia di andare a scuola", "lessmeatplease": "Imagine what could happen if each of these people halved or eliminated animal protein from their diets altogether ✌🏼", "macorinas": "😍😍👏👏👏👏👏💙💙💚💚", "gorgo.14": "🇮🇹", "expelliarmus_weasley": "Wow", "_specificstore_": "with you🙏🇮🇳", "anneli.karmala": "💖💖💖💖💖", "wasfedina": "This is my city! Proud of you. 👏🏼👏🏼👏🏼", "lotabonifacic_": "❤❤❤❤❤❤❤❤❤❤❤❤❤❤", "nath0545": "🔥🔥🔥🔥", "mamiminnie_cri": "@era_vero_83!!!", "caraguti": "YESSSSSSSSSS💙💙💙💙💙💙", "mariebleau": "Wooow 💪", "mhughes513": "As the people that were going to take her back over on the boat took a plane to get there 🤦‍♂️", "one_step_byond": "Thank you Greta!!", "mariacordones.cordones": "Gracias @gretathunberg he querdio ayudar a cambiar el cambio climatico para bien", "markdfe": "👏👏", "mcap9891": "Stay strong Greta!!! You are the bright side❤️", "eli_chies": "👏🏻👏🏻👏🏻", "jannaacorrea": "🇧🇷", "corneliajacksonn": "💪", "josenasca": "👏🏻👏🏻👏🏻", "mikaelhallfastigheter": "And it all started with a young girl in #stockholm that had an idea. Well done #gretathunberg you deserve all the #respect you can ever get. Forget about the #trolls they don't know why they do what they. One day hopefully even the #trolls will say #thankyou #gretathunberg for your dedication. Let's help save our #planet our #motherearth anyway we can", "barbarapfister": "😻😻😻🙌🏽 Wave of the Now!!! 🙌🏽👍🏽 Thank you Greta!!! 💛🧡❤️", "kaif.energy.bebida": "please share photos of all the rubbish left by these people on the floor and street!!", "lightpencil_1965": "I'm in the shot together with my children, proud of them and to be there 💙😍🌎🌍🌏🌿🌹!!!", "its_lulu._": "You are the best!! You made all this happen❤️❤️", "gaia.rossiiii": "Italyy🌍", "tyoca": "👍👍👍", "karinacorradinijazz": "You created this! I love you so much!! 💖💖💖", "fiivos": "👏👏👏", "_alicenespeca_": "So che ci sono degli italianisotto questo post", "dortmundprinzessin": "Almost crying💖 so great to see", "atlanticcoastsurfschool": "👌💪💪", "mineisalison": "You've made the young generation proud. Please keep doing what you are. As you said, the haters are more active than ever. \" Change is coming, whether you like it or not. \" love u @gretathunberg", "suma_lakshmi": "💪👏👏👏👏✊❤️", "claudiabr1": "💚💪🏽", "ksc_flo_": "Un Deutschland so 100 Leute die Veranstalter holy shit wie viele 🤣😂", "darkcuriosity": "Excellent! 👍🏻 Also polite reminder: do not feed the trolls. Let them perish in their own toxins. 💀", "laguawatergardenvilla": "Wow!!!! We can do together🌍❤️👍👍👍👍👍👍", "_sophiafabbri_": "♥️", "suffering_squash": "👏👏👏👏", "maria_dolfin88": "🔝🔝🔝🔝 nella mia città Torino!!!❤️❤️❤️😍", "snoeflux": "Greta: Is genuinely trying to get people to save the environment cause earth is literally on fire.", "robertabaffyna": "Vai....TORINO... 🔝🔝...#fridayforthefuture ..", "stefaniachiti": "Go on❤️🔝🔝", "maelle.tessier_": "@tuyetlovedesign 😍😭", "grogro2009": "❤️❤️❤️💪💪💪", "auro_lag_11": "In Catania 15.000 🔥🔥", "veganjunkstar": "💥💥💥", "movingtosweden.se": "Heja heja!👏👏👏👏", "giuliaaconventi": "💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻", "aurora_isabel_andrade_____": "👏👏 💪💪👑👑", "magao_meravigliao": "Vai a scuola e non rompere i coglioni", "marc111ram": "Donde van las masas humanas es donde esta el borregomatrix, es donde está el humano dormido, el zombi, el psicópata, es más peligroso que encontrarte un tiburón blanco cuando estás haciendo una inmersión en apnea. Despierta, todo es una mentira.", "jilldeinlife": "🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼", "maolderi": "@taylorehenry_", "karolinalundqvist79": "❤️❤️❤️", "annette.doose": "❤️❤️❤️❤️❤️❤️❤️❤️", "kashanpassmore": "💓💓💓💓🔥", "consciousdocdash": "Wow", "flossiefaelossie": "Why is the uk so slow to embrace this???? Greta, we need you here", "granata2344": "Juve merda", "plateroticaterina": "👏👏👏👏👏👏👏", "_elisarusso_": "Oh mon dieu🙄", "_.riccardo.papa._": "On Padua was 15.000 students to protest❤️🌍", "estherjulix.kl": "You are a hero 😱❤️", "kayparchia": "Greta 💪🏽💪🏽💪🏽", "fede.cschtt": "🇮🇹❤️", "gemmastano": "Absolutely phenomenal!!!! We have to believe, together we can make a difference and over through this toxic system - after all we are the consumers!", "paobolochock": "I want to see all the trash they leave in the streets", "alfa.1ne": "Dovevo andare al sushi e te con le tue stronzate hai bloccato tutte le strade", "tinacrisrib": "👏👏👏👏👏👏❤️❤️", "ieylikci": "Our strike in turin was amazinf!", "karre63": "👍👍👍", "mattia_vautero": "@gretathunberg forse c'era anche @fab96io_ , salutalo per favore è il suo compleanno e il suo sogno è quello di incontrarti", "prignitzhof": "😮", "maritaadolfsson67": "👏🏼👍🏻Galet bra 💪", "demerino77": "👏👏👏👏", "wandaweg": "💚💚💚👋👋👋🙏🏽🙏🏽🙏🏽", "ganeshaz": "👏👏👏👏", "jacopo_mancinii": "Ma vaffanculo", "404_.err0r": "😂😂😂", "mariorubens9": "👏👏👏👏👏👏", "mermaids_moonlight_": "Thank you everyone 😭", "cyndicasanova1": "❤️👌🤙🤗👏🎉👍Greta you are the begining of our future for our kids, grandkids, great grandkids and so on. More generations to come. Don't give up. Our youth are listening to you.👍🎉👏🤗🤙👌❤️", "lolademarco": "❤️👏💖👏👏👏", "hollywrens": "Beautiful humanity", "oblancapoeydionisio": "❤️❤️❤️", "tetet_ig": "👍💙", "hothifa.bone": "Why??", "ashleydunstan1": "Looks like a flock of sheep with sheep mindsets to me. Someone should tell them all that the scientists climate predictions from 30 years ago have nearly all been wrong. Since they love to keep saying...’Oh but listen to the science!’ Overpopulation is a bigger immediate threat than climate change!", "slim.chedi.23": "@mr.ismaaaa guarda Torino", "padis_official_3": "What a bullshit", "irene_niosi": "@emadamico", "jacqueline_thecakelady": "💚", "_mike.w.n": "I'm Italian, I'm outraged by the fact that after the majority, he left the billboards and other crap on the floor", "munroe_theshipoo": "🙌🙌🙌🌈🌈🌈", "joydvssn": "🙏", "memez.on.lil_roy.v2": "Why the people dont go to area51 😥😥😥😥😥", "madasariley": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻😘", "barbaracampi1973": "😊😍🇮🇹", "flavia.guglielmino": "🍀🌍", "omarbazzoniprofilovecchio": "@martina_lizzeri questa rubando foto dei candelieri a Sassari🤣🤥", "francescocupi": "your strenght is powerful and stimulant!the planet need person like you thank you soo much", "ronjahagvar": "💪🏼🌱", "karinjimfeltghatan": "✌🏼♥️🌹", "legaspikrizia": "❤️❤️❤️❤️❤️", "edoardo_mastrodicasa": "Pizza mafia", "dasha_shulb": "😍", "marty.bosio_": "Greta chiama torino risponde cosi❤️💪", "_.davico": "Torino siamo noi", "bipolar_c1p0": "Mongoloide capitalista.", "elizabethrents4u": "Absolutely Beautiful Greta❣Forget about the haters‼🙌💯👍🏻🙏🏼😎", "_cavall_": "Io c'ero!!", "sarahvanboxtel": "♥️♥️", "cirobarretta__": "💚🙌🏼", "iris_valente_": "❤️❤️❤️", "bibarella7": "Wonderful like life itself", "wildes.f_": "❤️", "edtsori": "😍❤️", "ipshika_24": "Omg😳😳😳😳😳😳😳😳😳😳😳😳😳😳😳", "sofia_fiscante": "Sta cosa é stata inutile perché hanno sprecato un sacco di carta per scrivere cosa che potevano anche dire a voce. E anche perché appena finita sta manifestazione hanno buttato tutti i cartelloni a terra", "devidvotadoro": "Eddai che sei calda🔥", "michaelc0stell01": "Skank", "barbara.sabbadini": "❤️👏👏👏", "stonerv0sa": "Viva l'Italia 🇮🇹 ❤️", "sigche": "1,700,000 STRONG and growing!", "luluvenanzi": "🇮🇹🇮🇹🇮🇹🇮🇹", "acardini": "🔥🔥🔥🔥🔥", "thegirlwithkoka": "Imagine the number of papers wasted to make these posters and the fuel used by these people to come together. Isn't it ironic enough? Imagine if these many people would have planted one plant each; things would have then actually become better with a great better result. We humans need to look upon ourselves before pushing and blaming the issue on the government.🌎🙌", "_chii.ara_": "👏🏻❤️", "irenebartolozzii": "🇮🇹❤️", "taniatorrini": "👍🏻👍🏻👍🏻🌿", "nidiabarreira": "Controle de natalidade, gente! O mundo não suporta mais tanta gente!", "_ma.n.u._": "Forza Italyy❤️", "patoaguilard": "Enfriar la ambición , COMPRAR CADA VEZ MENOS!!", "el_greco_tales": "Massive💪💪💚💚", "bjorngorts": "👏👏👏👏👏👏👏", "sarahedeakin": "Bravo Torino! 🙌", "m_s_t_e": "💯💯💯", "let.us.plant.trees.now": "Together we rise", "_lubee_03_": "w i 2t", "ritujain1980": "👏❤️👌🏻👍🏻", "ingegerdpeterson": "👏👏👏👏", "ale_lecce06": "❤️", "nishtha_ms": "Woaaa", "escuela_vientoymar": "People are rising up!!!🙌 #noworever #climatechange", "harriet.km": "💪💪💪", "mike_lamb_": "@ardi.tay I see u", "vedilabio": "A vde a tarand eheh", "spallino.elena": "💪💪🏻💪🏾💪🏿", "kurmkaroliina": "😍😍😍😍😍😍", "manon_art_": "💜😍", "milly.santiago03": "👏👏👏", "mariela_degregorio": "You rock @gretathunberg !!!!", "sabrina_iannucci": "@beatrice_surano ❤️", "mattia.iberti": "🔥🔥", "audeimar": "Anyone that went to this is just as autistic, handicapped and retarded as Greta", "thejesa": "Grande Torino!", "phedra_gm": "...and some detractors continue to bla bla bla... let's go forward regardless!!!!! Amazing crowds!!!", "ali124076": "❤️👏👏👏", "mrsbossyscary": "@giulia.giordano wow!! ❤️", "ineedbillieeilish": "I would be there ;-;", "antoniamurua": "👏👏👏", "dav_diii": "YESSSS!", "_________roby__________": "I was here", "beneee97": "100 people that clean their cities are way useful that 1 million people that march in the streets without doing nothing concretely @gretathunberg 🤷", "ya.ser5150": "Grisqr", "il_correttore_dellaferrari": "👊🏻👊🏻👊🏻👊🏻👊🏻👊🏻", "sylvie.ferrero": "👏👏👏👏👏👏👏👏👏👏", "digerstet": "😂😂😂", "lia_aquilante": "#whoisactuallyGreta", "lollo_10093": "gia lo sai @gretathunberg", "nippukissa": "😮😮😮🙌❤️❤️❤️🌏", "wilfredbion": "Siamo tutti con te Greta 💪", "mathildaolsson89": "@toky212", "firefly414": "All those signs people took such care drawing are now sitting in landfills. Shame.", "_alberto.ribaudo_": "Grazie @bataviacostanza di averci fatto saltare scuola", "davideescarpellini": "🤩🤩🤩🤩", "dym3czek": "🤩🤩", "helloworldjapan": "❤️❤️❤️❤️❤️❤️❤️", "slick_angel300": "Can’t imagine the amount of rubbish that big crowd left in those streets", "mynameismerle": "@g.magai 😌", "itsmattgerm": "💚💚💚", "contronarrazioni": "❤️", "florales_gabriele_gaetjens": "Yes we can ( maybe better than Obama )", "chris_ohlandt": "So sad look at all you fucking sheep, why don’t u people bend over and let the government hog the rest of our resources and why don’t we give up our vehicles and air conditioning while we are at it. 🐑don’t realize the earth cycles in heating and cooling stages over long periods of time, yes we shouldn’t throw plastic in the damn ocean but otherwise y’all just ignorant falling for a scheme to get us to change our lifestyles now pertaining to rights and the resources we have access to.", "amberhngs": "@ove_lorenz you can be proud of your new hometown 💙💙", "_sofiacosa_": "TORINO BATTE TUTTI", "lorenzo_deias": "Wooo forza juvee", "andreeribeiro": "Soros🔥🔥🔥🔥", "albaudem": "We can do it 🌎🌍🌏", "fedeaccattoli_": "Go cazzo", "majalena.calvo": "💚🍃🍀", "tirth_jain_2002": "Wowowowow Amazing all Jainism are supported you 👍👍👍✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊✊", "cristianbennardi": "Italiani porcodio presnti", "r_joanne11389": "What does this actually do though. I mean it is beautiful but what actual results do@we see from taking a strike?", "just_anillusion": "BELLA GRETA, SONO NELL'ANGOLINO, MA CI SONO!", "1000_years_too_late": "🌳💚🌲🤘", "k.lindberger.gajda": "Sååå braaaaa", "xvm.nn": "italy😤💗", "rasmus_soderstrom_": "👌🏻🌚", "otsomatias": "don't really blame you, who have a hard time accepting something so horrible as climate change to be true. You weren't educated about it so of course it's hard to take in something this shocking so fast. - But the science is clear, and if that's not enough for you, I tell a personal experience: the winter has been constantly getting shorter and less snowy for the last 20 years here in Finland. Every year of my later childhood, I wondered \"where's the snow gone?\" ♥️ so just check, because you could be wrong - give yourself a chance to get it right here.", "phoebe.lou23": "👏👏👏😊", "manuterz": "😍😍😍 i love you Torino!!!!", "wong_crowd": "@elisagret how amazing is this!?", "nanagabriela": "👏🏻👏🏻👏🏻👏🏻👏🏻💪🏼💛", "loslocosgabbert": "👏", "nithya_aionios": "🙌🙌", "waynewilson71": "❤️", "saki7rara": "👏👏👏👏👏💕", "de_ro661": "Keep going guys no Planet B#climatestrike"}