{"ardeiudz": "i live at30 min of montreal", "scallywag_b": "Looks like a Trump Rally ..🇺🇸", "keljll": "HELLLLLLO GRETA!", "ihad50": "95% haben keinem Bock auf Schule und Lehrer,deshalb sind sie da", "aleksandrfarneze": "Perfect", "shahrzad_talebie": "Yes yes yes 👏", "myleo.dicap_": "YEAH !!!", "homem_fresh": "Not a single image of you or them planting anything just hot words and a group of blind bored angry people with nothing to do but complain versus acting doing sowing what will reap peace and greenery and beauty", "paupini": "❤️", "alessiocavallini1965": "👏👏👏👏👏👏👏👏👏👏❤️", "frederickforgues": "🌩", "cenyrasilva": "Vamos STF tomar uma decisão sobre esse presídente.Foraaaa do mandato. é demais ele está fazendo.", "hermanbolling": "@maddebolling", "woohoozippy": "🤔....😂", "megansnyder778": "Change is coming all right. When half the population is wiped out in the name of fake global warming to save the planet.. They will put her ugly Asperger face on the new flag.", "daniellewjderksen": "IT MAKES ME LAUGH 😂😂 HOW BRAINLESS ADULTS HERE TRY TO MAKE FUN OF A INTELLIGENT CHILD. SAYS IT ALL 😂😂", "samuelsmuks": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "skykadup": "нехуя се сколько долбаебов", "aziz_nordine": "💜❤️...👍🔥.", "ginodewildd": "This is not verry Greta", "mj9143149": "A menina que arrasta multidões 👏👏👏👏👏👏👏", "adampat10": "Wow", "mar.poetry.iab": "Humans ✅🎭✅", "cowboy5871": "👎👎👎👎👎👎", "marry_j_j": "I see more trash(there signs) than people!!! Think about how people get to your fucking demonstrations. I’ve watched it they are dropped of in cars for example Porsche. And u are trying to tell us it’s a good demonstration?! Bro this is not changing anything! Thousands of people with signs made out of plastic where the fuck is the logical part to this? @gretathunberg it’s just completely non sense.", "gemm_perez": "@diegoubis4", "lindonpettylll": "nothing like creating more carbon", "bruh_its_succcc": "Bruh I thought it was plastic", "janhvi892": "🙌🙌", "_knutbry_": "Keep Going,keep going !", "cv.191119": "🧟‍♀️🧟‍♀️🧟‍♀️🧟‍♀️🧟‍♀️🧟‍♀️🧟‍♀️🧟‍♀️", "plantilona": "Os podéis ir todos ,a limpiar basura ,de los bosques ,o de los ríos ,en vez de protestar .... Eso es cuidar el planeta no gritar en la calle", "unerocma1": "Half of montreal city’s inhabitants", "lilyrunway": "I don’t understand how having this strike where thousands of paper posters are made and most likely lots of water bottles used is a good look for climate change.", "tomsuppentelleryt": "The first sentence of my brother when he saw that picture :\"is that trash?\" like greta lul", "wolfie__7": "Oh no all that carbon dioxide them people are breathing", "johnc.pratt": "Now that is a crowd!💪🌎", "epicrunmoment": "change is coming👍🏽", "moonlitchevy": "Lol all those people are unemployed dam", "nedeljkovic.dejan": "No its not", "esther.gaa": "Wow😥😥", "nklein_16_": "Lol this bitch lol", "kata_ri_na": "@eva.castro.1998 i see you", "natanobile": "Good job! ❤️", "bjorkvikens_kaniner": "😍❤️❤️❤️👍🏻👍🏻👍🏻", "j.68650": "Guauuuuu 💯👌😮😯🙏very good 😱📸thanks God 🌍😍🌌👍🌕☀️🙌🤗💐", "ken_sandmore": "Im sure they left all there garbage too. Assssholess", "uglydachshund": "So how did all of these people get there - car, plane? And overpopulation is a huge problem.", "nedv4": "Sai quanto rudo c'è dopo tutta quella gente che passa? @gretathunberg", "madikanti_rakesh": "Amazing. 😍👍", "max_2tg": "How dare you", "jarman4892": "Trump's inauguration didn't get any where that number", "pop_vinyl_pics": "🔥🔥🔥", "nchase22": "@loganaew", "gooburz": "Not seeing it, people just gathering and protesting does nothing. But good job ignorant media puppet 👏👏👏", "qi_gong_woman": "You are Unbelievably Awesome ❤️", "al_hramoy": "Блять, на забив. ЪУЪ сука", "rahmanamiraa_": "Amazing 🔥❤", "marcantoniuscasel": "How dare you , better dont leave all the trash on the floor !", "dave_daveson_g": "I didn't know that canada has so much inhabitants 😂😂", "elenacruz": "@darthmikesound", "michael.vanderheiden.7": "They are all retards and greta getting richer and richer haha stupids", "neekee44": "@sachamoise", "nikan__11": "What are you even doing about it all your doing is starting protests that’s not doing anything.", "fredlesk": "I’d love to see the mounds of trash left behind by this crowd.", "fiona_376": "This make, that you feel great!❤", "abd_tahmasebi": "😍💙💙💙", "tonifive": "Go @gretathunberg go!!!!💥💥💥💥", "_byjxshua": "How dare you!", "barbaraphotoart": "So cool 😎❤️❤️❤️❤️👍🏻👍🏻👍🏻👍🏻👍🏻", "_berto919": "I thought the post was a river of trash", "travelpiccolaghianda": "Your power to move so many people and to raise awareness is something we'll owe you forever 🙌", "capt.kjaneway": "❤️", "cadew8787": "That’s a lot of paper from the trees we’re trying to save", "almabadi_private_school": "🙌🙌🙌👏👏👏", "paolo_d_d": "Vedi le tue masse di perdenti e falliti vi preoccupate del clima e non del sangue versato ogni giorno in questo mondo di lacrime tu sei lanticristo", "857hekmf": "Das sind kurden @zuhal.gt", "indirasmum": "wow that is a lot of people 😮", "keanoskoo": "On the oder side of the ocean", "matupplyst": "Följ gärna min sida för matfakta och dess påverkan på oss", "dana_may138": "Who cleans up the mess after all these strikes?", "andria4_milly": "Wow", "telmvest": "Hahahaha change is coming 😂😂", "daniel123272727": "So -BIG LOVE FOR FO FUTURE CHANGE is COMMING WITH TRUE LOVE AND JUSTICE IT IS SO STONG💞🌏I \"M WITH YOU WITH LOVE-💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞", "thiagojfn": "Marcha a favor de BOLSONARO 🇧🇷🇧🇷🇧🇷", "earth_mode_girl": "I have been obsessed with what Greta is saying. I have decided to go on a journey to make myself more aware about what is happening to the planet and what subtle changes we can bring in our lives to undo the damage. I would love for you to join me and share your ideas and where you are in your journey. #EarthModeOn", "lillyy_lpz": "@_krisztaa !!!", "cousin_nunu": "Truly amazing the movement you’ve inspired young lady 🙏", "rose___david": "I was here ❤️❤️", "lil.matte.quello": "Raga dono daccordo con quello che dice la ragazza, se fossero parole sue😂☺️", "mikhail_avva": "С отравленной головой в будущее не пройдем🤔", "kadir_sygn": "🇹🇷", "amydav0": "Come on we can do this", "cemal_sevindi": "😂😂😂😂😂😂😂😂😂, 😂😂😂😂😂🤣🤣🤣🤣🤣🤣", "ms_seoul2003": "Just another 37 million people should participate", "dennis.lkpg": "So cool!", "john.mercier.19": "❤️❤️❤️", "deryslyttle": "WOW! I’ve never seen so many people together!", "anna21.8.00": "🌎🕋", "janparker_artist": "unbelievable.......but doable with courage and conviction. Thankyou Greta", "withlesandlee": "Yesssssssssss @wanderingforests amazing 👍👍👍👍", "benxz_79": "And they are breathing it not good for the climate they should breath less", "aldo_gusmao": "spoiled girl, I'm waiting for your rally about the oil spilled on the beaches of northeastern Brazil.", "kellerkatze420": "Die Hälfte davon war wegen dem Pokemon Go Event da", "annelinnstralaland": "😊💕😭", "gianniasioli__": "W la plastica", "skylinha0606": "The fact that they say ''save the planet'' and stuff, yet they waste paper and cardboard and keep blocking the streets. Nothing what they are doing is happening or changing. What they can do is have fun growing trees. That's better than wasting paper. Striking does not work and most the students (even my friends) in my school just do strike so they can skip class. Fucking christ...", "regiane_alvesferreira": "@taiswiedemann", "xzaggyx": "She on the payroll of my main man georgie", "yannik.wdl": "Freitags in der hood", "erika.lindberg.crawford": "❤️❤️❤️💕💕💕💕💕", "natalienfs": "✊✊✊", "jysan_kz": "Шведтер сендер ислам дінін қабылдаңдар", "diabolikedevakant": "un altro fenomeno da baraccone dopo la Ferragni ...ci mancava!", "coraliielamoureux": "on est les best guys hehe 💕", "bluejadegallery": "This was just amazing!!!", "weloveourfirstfamily": "NO CHANGE IS COMING ALL HIRED PROTESTERS THIS IS ABOUT CONTROLLING THE PEOPLE NOT CLEANING UP THE WORLD!!", "leahcasalattico": "❤️", "rachlee111": "Imagine all the litter left behind. Did you clean it up, Greta?", "mgfunk81": "@gretathunberg What really is the issue with a \"mass human extinction\"? What makes humans so special that we should thrive on this planet forever? Answer: Nothing. we are not special and/or privileged beings. Just like other habitants of this planet, we will go extinct. We truly are parasitic and this is the exact reason I refused to have children. I don't want to add more fuel to the fire than I already am. Simply being human nowadays destroys the eco system of this planet. We consume, waste, breed, infect and repeat...daily. The ebb and flow of climate change is meant to wipe us out because earth is purging the parasitic habitants called \"humans\"- In the meantime, enjoy your time on this beautiful planet which will eventually find a way to get rid of us no matter what. Be as kind as you can to everyone (maybe not everyone. fuck it). And love as hard as you can- I believe our bodies perish but the energy running through it cannot be made nor destroyed. We shall somehow live forever in one form or another. I shall see. Good luck, everyone ✨", "omniato": "@menna.khallaf @amirakhallaf @iiikmh2 بينما انتم نائمون هناك طفلة تغير العالم 😂اما انا الحمد لله كنت هناك", "ashley.heinsalo": "People are like parasites..", "mynz_04": "It does not itch 🖕", "khyedxn": "Tosser", "leon_prvt187_das_wollte_justus": "Du bist scheiße", "ronsrehab": "Wonder what happened to the signs after this protest", "ta_grandz_mere": "La honte ptn", "jakub_malota": "Hahaha Greta plasticberg und 500.000 persone", "shea.llan": "look at all them gay cunts", "abbiehughess._": "the ants 🐜", "edward.durant": "All these people for fuck all", "imklea": "Sensational!", "graacecullen": "I have chills 🥰🥰🥰👏🏻👏🏻👏🏻", "pacific20": "No one cares", "zandro0007": "Rock am Ring?? @domenic_holz", "riasatsiddiquera": "😍👌🔛👍💚💖❤🍦🍦🍦🍦🍦🍦🍦🍦🍦🍦🍦🍦⛅🌏👽💨🔽☕Ⓜ💙📺📻👟👞⌚🔦🔦🎀📱💻💿🎡🎬🎥📷📹📼🌳🌵🐘🐢🐦🌱🌺🎷🎤🔊🔄", "mirellannatot": "Have you seen that amount of trash laying around on the roads after a climate strike @gretathunberg ? No, okey than, google it. But the main things of going striking is, that everyone can post #climatestrike and so on in their instagram stories because its now \"in\" and everyone does it. I bet, that probably more than 50% of the people going on these strikes, still drink out of plastic bottles and doing nothing, but just going there for skipping school or beeing \"cool\" 🤡 That makes me sick", "duke.siberian.husky": "Ok. But, WHERE ARE you Greta? Brazil just got hit by Venezuela with criminal oil spill, and you DO NOT SAY A WORD!!! SAHME ON YOU GRETA.", "ylimetfolk": "I wonder how much trash was left behind after that. Also, just standing around with signs won’t do anything, how about plant some trees or something", "p.c.horn": "This must be a joke😂😂", "c.edm.604": "Pissing off commuters who don't know who to vote for isn't helping greta...... This is just a freebie for the conservatives.... Come on", "dado.simonelli": "tutta le gente che vorrebbe uccidere", "julykier": "❤️❤️❤️", "_mr_wink_": "😱", "becroww": "1 person saved an island by planting trees, if 1 person can save a whole island, then imagine what 500,000 people can do. But what do we do? We protest.", "flemdog349": "None of them have jobs", "kern_der.echte88": "Gehts wida ind schui und lernts ebs gscheids habds mehr dava es vawädn hosnscheisa hads sechane wo ned wissnd wo d milch her kimmd owa hautpsache in an freida a recht a gaude mocha. Gehts fuad und habds a gaude weil steam misasma oile", "6uckarooo": "When u realized there are 7 billion people in population and you only have 500k, say sike RightNow", "thomasschmidt165": "The great miracle has come and will go when it has made enough money. Dear people, do not let yourself be influenced by any medium😢😢😢😢", "hoisty_hamstring": "Not gonna lie thought those people were trash until I looked closer", "iscarfcat": "I wonder how much garbage is getting dropped in that crowd", "mccarthy._.17": "wonder how much trash was left over from the strike 😬", "berni_illibauer": "🤬🤬🤬", "30_drake2": "I wonder what’s that park going to look like after everyone. Lmao 🤡", "william06rl": "Fetto", "loprezel": "#dougcoe", "spicyxchick": "nothing change. it's still so warm.", "danaxomega": "huh they kinda look like trash on the earth they kinda are if they're coming just to see you", "kelseyhollefreund": "@gretathunberg the Canadian election is coming up soon! 🇨🇦 We are DANGERIOUSLY close to electing a leader who doesn’t believe in climate change and has NO PLANS to combat it! Many people are considering voting conservative just to punish Tredau. Which would mean wasting 4/11 years we have left to transform our economy! Please help! I want to hold a benefit or do a video collaboration maybe with you and @greenpeace_canada to raise awareness for what is at stake this election!", "farook_firo": "🔥🔥🔥", "alexioffe95": "Greta please make only the ones who came pay your co2 taxes", "brownriceronin": "Mhmmmn, look at all that wanted paper 🤷🏻‍♂️🤷🏻‍♂️", "nhoffman68": "It's funny that people actually support and follow someone that uses an apostrophe instead of a comma in a number. If you can't even write things correctly, how should we know that you are doing anything else correctly?", "flobgorp": "❌⭕️Bullshit...Haven come this far do you still think that people need this....stop this public speaking,these summits and meetings,instead get your ass up and go clean the earth....⭕️❌", "william.nicholas_89": "Good thing people like @boyanslat are coming up with ways to actually make a change", "brigitte135": "Great for such a young Swedish girl to be involved in climate change!", "omeumundorosablog": "Yes!👏", "tjorven.b_": "Well, that photo... I have goosebumps", "j_n_a_games": "Looking like a @miniblazenfh concert", "kianna_theblueberry": "👏👏👏👏", "crybbygoth": "Imagine the mess they left.", "_.sierratango": "So many placards! So much of pollution which will contribute to harm our nature. HOW DARE YOU?", "chrisywoo": "Would love to have seen the amount of litter after this bullshit march", "dper65": "Hmmm all these people could have cleaned up the streets in each country, do you know how clean it would be, .... btw what ever happened to all those placards,,, I bet it’s garbage somewhere", "laura13067": "Would you LOOK at that!!!👏", "putins_wasserhahn": "@_me1i5s_ die alle da sollen uns folgen bre", "worldfullofmoons": "@david.houck", "aspiadolecente": "I am @aspiadolecente , i do not speak english and spanish yes", "ashleeisaac_": "@kayley_tassell", "laurencelamothe2019": "omg it’s pretty", "motherofsammy": "Incredible!", "dawa500": "#Islam_is_the_truth Islam” literally means to believe in one God and obey his teachings, which are moral teachings to help us live a happy, wonderful life. Islam is not a new religion but all prophets came to teach people Islam, all came to call people to believe in one God and obey his commandments, so we consider Jesus , Moses ,Abraham etc are all Muslims including Muhammad who was not the founder of Islam but the last prophet of Islam. he came to teach people the correct pure message after it was altered and modified.", "mr.dcnt": "Change are worse grades", "_i_am_ally": "@natsolina change is coming whether you like it or not!!!😏😏", "justin.rt14": "@phil_.13", "instajuodulyte": "Nature is not a benign soft power, nature kills with earthquakes, tsunamis, floods, deadly snakes and bacterias, and hundreds of other dangers for civilisation, long before any human technological advancement.", "soalexng": "imagine all the plastic waste left behind by this crowd 😮", "rockstarpr_sukku": "They all will release equal amount of carbon an heat at same time at same place !! What about that!!", "ardaksknklc14": "He yarram he", "audifahrer1111": "500000 brainwashed", "armin_lofflad_2507": "Aber den Müll liegen lassen. Ist eh unnötig die ganze schei**. #fridaysforhubraum", "i_am_emrys_": "Only if this many people showed up for the Area51 raid", "the.real.johan": "Y todas esas personas malgastando papel osea luchan por el cambio climatico haciendo pancartas con grandes cantidades de papel 😂", "susie.tunian": "😍👏🏻✌🏻", "barbchristian15": "Yes🙌🙌Thank you!! My kids thank you as well!!", "an.ders3351": "If only these people gatherrd to plant trees instead of protesting then they are actually want change not just to look like they are caring.. Im not an invironmentalist but I have planted trees in my life, how about you Greta how many trees have u planted yet, aside from passing the speeches that ur crazy advicers has told you", "bailey_cooper_420": "It's a bunch of plastic", "ansh_officialpage3": "Did any budy plant any tree??🤣🤣🤣, it's just a time pass crowd", "bmoxon2481": "SO impressive!!", "gjleksvhdkw": "i wish so many people were for iraq too", "mackenziewieser": "Amazing 🙌", "ryanheffley_": "Oh really", "____keven_____": "@iamzlatanibrahimovic", "clio.tdi": "Wenn du mit 500000 Menschen kommst haha kommen wir mit 1 Mio autos😊 #fridaysforhubraum", "banksson.se": "😜", "lisevwd": "Ok,creep go to school. HoW DaRe YoU miss school", "ghjsiij": "Nonono", "_ligia_beatriz": "👏👏👏", "wonderful_world_of_pizzi": "🙌❤️", "archer.and.pearl.designs": "Attracting attention to the issue is great. But What are you doing about the destruction of trees and grass and all of the extreme amount of trash being left behind at all of your \"rallies\" for change.", "kirlchen": "Thank you for visiting Canada!", "doonii_m": "@bulent_kul 500‘000 am streike aber all lönd abfall ligge🤦🏻‍♂️", "that.alien.crackhead": "THATS US!", "llmxaxrxvxixnll": "I wonder how much plastic all those people left behind. Don't @ me", "leoniie_gsn": "@mekdes.g18 läuft", "metalbrush": "Promise us change.... don’t fail us", "ju.est_19xx": "Dare you", "limmagst": "Amazing kids🤩😍🤑👏 worth millions bimbos 🙌", "caballobocagrande": "¿When es the change coming? ¿When are u going to attack specific BIG companies?", "yasmin_sidhu_": "A definition of \"sustainability\" could be argued to be a system that can be continued ad infinitum. What woukd happen if all 16 year olds quit school? Wh", "5699_claudia": "❤️", "ardaepik": "Amk malı İsveçte eylem yapsan nolcak zaten tertemiz ülke kafanı skm senin", "mickjigga": "Montréal 👏🏻👏🏻👏🏻👏🏻✊🏼", "studiolashlift": "Amazing 👏👏", "happy_roco": "💚💚💚💚", "pedz_bebz": "@quinnyb01 she’s picking up steam...don’t poo poo my girl @gretathunberg 😘", "willlane.123": "Ridiculous this is", "j.07kr": "Jag käkar halal🥩🥩🥩🥩🥩", "_fagotkoroviev": "Trash walked on the European streats watch online without registration", "yannis_b201": "The last drop petrol will run through a V12 🔥", "ginsko_": "@va1erja wenn Ginski mal wieder top kommt 😂😂😂😂", "nrlshaa_": "@h.a_17 im on your side now😭💯", "christoffer_larsen_": "🤡", "daigle.mario": "Yep and they left garbages all over the place", "alexpeters582": "500,000 brainwashed cucks", "pasquy.pezzillo": "😍😍😍😍", "elviraskovsang": "🙏🏽 Change is coming #greatfull ❤️", "photographer.mehrdad.modiri": "👏👏👏", "chide_nweke": "Bellissimo 👏🥺", "chaudharyshb": "If each of them would have planted 1 tree atleast😑😑", "_nicad_eliyev": "😮😮 Uydaa😮😮", "707erorr": "Yesillik kalmadi yaw", "paloma.bc_": "@_sophie.halpin_ je t ai vu 👀", "agrreyes": "💪🏽", "ronoqh56": "Lol how much trash did they leave behind 😐", "livi.stoll": "Wo ist der Beweis, dass der Klimawandel vom Menschen erschaffen ist?!", "ich7552": "rather a Ferrari than these fucking vegan idiots", "v_i_c_t_o__": "❤️❤️❤️🔥thanks for coming we all love you here❤️❤️🔥🔥", "ayoaspxct": "Imagine thinking your solving climate change by walking down a street with cardboard and plastic bottles and all the litter you retards left behind, yeah nice 🤡🤡", "mangalaki": "Fuck yeah!!!!!! 💪🏾💪🏾💪🏾💪🏾", "txffany.l": "OMG I WAS THERE ANG I SAW YOU IT WAS AMAZING🤩!!", "briansmither": "Wow looks like Trump’s inauguration, just, you know, with a lot more people 👍😂", "elan.hanks": "All of them drove tho", "uweullrich25_singer_songwriter": "Yes", "kepenek.daniel": "ok vittu ingen bryr", "elizabethpaig.e": "Love this", "crocsaremtfav": "Bunch of loonies", "sammalviola": "If only this many people raided area 51 😔", "monika.sharma582": "Damnn😮", "deniiz.yngz": "@xmalloryo", "david_per": "I appreciate that❤️", "fxrxah": "#Hello_world #There_are_people_Making #Revolution_now_in_iraq ! #Show_your_support_for_the #right_of_Iraq_people_to #protest_peacefully #Save_the_Iraqi_people #HELP_Iraq", "jesusvieira2000": "Why does it looks like plastic pollution?", "tanyadurney": "@shannondrewitt04", "dirty_lemonjuice_": "Look at all those retards🤡", "ildacarvalheiro": "👏👏👏👏👏👏👏👏👏👏👏👏", "mari.omeara27": "🙌👏❤️🔥 Amazing", "che_76lillac": "Tiohtià:ke = Montréal", "isabellaagder": "❤️", "jeen_a.kemp_": "And you got 5000 more in sri lanka", "thedenvercecil": "Just imagine if all those people were at work instead of polluting and littering", "icemanpicshot26": "✊🏿🙏🏿", "yonatan_hagen": "The nature looks terrible on this picture...", "sophramsay": "@dante.a.m insane turnout", "mach.mal.mindset": "Wow👍🏼", "remunddanny": "💵💵💵", "briseis54": "@the_east_wind10.10 Yes! I am glad, we agree! Action has to be taken and spreading awareness as well. Thank you for your reply!🌎💚🙏❤️", "gassmannjohannes": "So viele Menschen auf einem Platz?! Geht gar nicht! Ich meine die produzieren doch CO2, indem sie ausatmen. Zeit für eine Atemsteuer🖕🖕🖕😂😂😂 #gretathunfisch ? NEIN DANKE!", "ludodelaproteine": "1/6 of montreals popultion", "danny3180": "Good job Greta!! 😍", "twinflame73": "Amazing!!!", "sutter_odyssey": "They accomplished nothing and wasted time", "liambrown614": "And I am in that line just to buy an iPhone at the apple store", "jun10r699": "All those people throwing garbage in the ground 😂", "kinjameme": "No change 😂😂😂😂😂😂😂😂 how many people drove their cars after this .........😂😂😂😂 You are just a daring joke ...@gretathunberg", "marleytobin": "Gives me chills 😍", "luke.rndm": "Je t'aime, Mademoiselle. 🖤", "tanya_f__": "👍👍👍👏👏👏👏👏👏👏", "markchristonsmith": "#cancelchevron", "srphn_mntsgl": "💚", "oktavialind": "😍", "patric_poulain": "Looks like a lot of trash from this perspective.. Ahh it is its human 🙊", "edoardosulpizii": "Se rimaneate la a casa sai quanta co2 risparmiavate !", "douwe.struiksma_": "Hahah al die mensen flikkeren plastic bekers op de grond en shit", "l.oberste": "How many co2 did the Masse of people clear", "lola_lingerie_shop": "💪🤞🤞🤞👍🍀 🌿🌱", "virtual.australian.defence": "🤡", "think_possitive_live_possitive": "@stk_elias ✌", "bemglo\nVerified": "Verified", "anita.smilee": "Amazing! I went to protest here in downtown toronto ❤️", "noab704": "Awesome!❤️🌍", "manchester.aviation07": "✈️✈️✈️✈️", "millie_14_xx": "Amazing", "sarhpons": "Admirable", "kimlorio20": "@basicincomemarch #basicincomemarch #HumanityFirst #YangGang #Yang2020", "evelinatrofim": "@kubiceksuchy 😍", "wtf_mug": "Where's wally", "bormann.susanne": "✨💪✨💪✨💪✨💪✨", "dalton.wheeler21": "Thought it was a landfill at first", "togetherwecansavetheworld": "YOU DID THIS. THIS IS BECAUSE OF YOU, AND WE ARE SO GRATEFUL. YOU ARE A HERO. THANK YOU❤️", "nani_lehua": "@austinj2493", "loudomut": "Много ли мусора они там оставили после себя?", "bruh_guy_supporter": "How dare you", "mediumsalad": "I hope people clean up after these protests cause NY was trashed.", "albertogomes7155": "Força greta🙌yes nature😢😘", "tamarahidalgoecfad": "@notes_andbooks", "philipp.fl": "Non sense", "aaaaxxeel": "@carlwallquist hahaha helvete", "onlydqxzzy": "It's so sad to see that", "tim_smaling": "#votetrump2020", "iamdeniadenia": "❤️", "elsailonaleja": "Wow", "jenessaparent": "@britsyyd", "allenisherman": "Bravo!", "r0r0_caty": "#Hello_world #There_are_people_Making #Revolution_now_in_iraq ! #Show_your_support_for_the #right_of_Iraq_people_to #protest_peacefully #Save_the_Iraqi_people #HELP_Iraq #saveIraqipeople", "joacoohenriquez": "💚💚💚", "eftoda": "Piles of trash", "ro_cahill_27": "If only this was Area 51", "anitabelamb": "👏👏👏👏", "kerraz__17": "#save_the_lraqi_people #saveiraqipeople", "dalkhafine": "💚", "kathleen_2510": "Amazing mobilisation of people!! 🌏💚", "tiagoserafim16": "Yes, we can! 🌍🏞", "moonmaan94": "Wow", "wilhelmscream_mtl": "Ok but... Where's Waldo?", "sam_love_98": "Amazing 🙏🙌", "simmy_steele": "🙌🙌🙌", "simonesteelephotographyuk": "Incredible 🙌", "eleniusa": "Change is coming 🙌👏👏👏", "saxophotograph": "Because a bunch of sweaty people standing outside will help something that is naturally occuring", "milan_chhatraliya": "This is not Tomorrowland this is global climate strikes stay for justice 🙌🙌", "mxbayy": "Mass gathering of crowd may lead an tremendous increase in the level of carbon dioxide 😂", "cadjjdjsbsjs": "😿", "signehestnes": "Yes!!!!✊✊✊✊", "jungkookduh": "but the people have to do something else than striking!!!", "liam.javaid": "Wow u really Good fam, saik", "____________clark": "Funny how after these marches there’s more trash on the street than before.", "wilm_ir": "اسکل همین پرچم و .. که زباله میشه دوباره ریخته میشه توی طبیعت که", "sofiaengman_": "helt sjukt! du är grym👊🏼❤️", "coreybradley_": "I would be curious to the amount of trash left behind after such an event. 🙌🏻", "michele_269": "@marinamualem את חייבת להכיר את הילדה המדהימה הזו! 😻", "tonysautoservice": "@alyda_s see what I’m sayyyyin", "emma._0198": "❤️", "birrighinde": "@isabelle_joelle", "itezwatitez": "Thats what sje said", "mathilde_lava": "@maeveroylenoir t’es où?", "rian.phantom": "@thecandyflippers live konzert 🤒", "anylaademaj": "❤❤❤❤", "c_krugg": "Trump 2020", "arbabolgholoob": "Power❤️", "masukuboi_": "All those bodies are warming shit so u are a dumbass", "chris.chevalier": "So proud of my hometown!", "biaaanxoxo": "@henry.20", "_svenwehrle_": "So ein schwachsinn", "tylerhendrickss": "all their hot ass breathe in one area causin climate change", "attackandy": "So, do any of these 500,000 people have a solution that isn’t insane and could actually work or are they just gonna dance around the fact that the best thing they could possibly do for the environment is committing mass suicide?", "0chill_ma": "Was ein Müll", "travellinghopper": "Awesome❤️💚💚💚💚", "frankie_nunyabisni": "People looking like pollution from far away..says sumthin", "buddha7637": "School life Boy men School life Babby Fb cr god bless u 🙌 Buddha ☯️ like 👍 nic 👼", "hsueueysyshwheys": "💏", "emmsy.roberts": "👏👏❤️👏👏 an inspiration!", "a.monia.b": "The trash produced from this March in Montreal was unacceptable; if we want to use our voice for change why isn’t this crowd of people using their voice in our up coming elections? We need change, we are happy to skip school and shout for change and continue to live the same way when the parade is over. I for one would like to see the words from this crowd be put into action when the polls open. We have a Green Party, why aren’t we voting for them? Why do we always vote defensively? Why are the same systems always in place? Because we allow them to be.", "aryann1904": "How dare they", "io6843": "Una marea di sfigati", "_marianne_lanctot_": "OMG this is AMAZING", "henrique.tn1": "Thats what area 51 raid should have been like", "firoozkazemi846": "😍❤️👏👏👏🙌😍😍❤️", "le_soleil_yer_la_bas": "No is not coming because you dump ass dont gonna change so this not gonna change stupid bitch", "bobzaily": "🤡", "angelmendezsegovia": "Incredible 👏👏", "carolealexis": "✨✨✨✨✨✨💖💖💖💖", "ybbn_spotter": "I’ve a question for you. You use your phone for Instagram and electricity to power it right? Doesn’t that cause globally warming??", "tyler.searle1": "change ain’t coming bitch", "_loyal520": "Was wohl bei diesen Menschenmassen für ein Plastikmüll entstehen mag", "woah_its_ray1": "Feel free to keep the “nice” train going on my recent 🔥", "13_atlanta": "🌱🌳🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "iamkgp._prajapati": "Good job dear for earth 😘", "palimpalim______": "fake", "rya_grace": "I am so proud", "xofficialpage": "Imagine all these people getting together to overthrow governments and the evil people who are funding this climate bs movement (george soros)🤣smh", "bvbyk8": "my city❤️", "carrieschulz_": "@erykaschulz", "doostjohn": "🙌🏻✌🏻🦋", "kimwithoutborders": "@heatshute", "sergach98\nVerified": "Verified", "omar._kanan": "They only went cuz it was a Friday and it was to skip school if it was Saturday no one would have went for this crap", "sydvishnu": "Climate change is real. You deniers are just scared. “All truth passes through three stages. First, it is ridiculed. Second, it is violently opposed. Third, it is accepted as being self-evident.” -Arthur Schopenhauer (German philosopher, 1788-1860)", "samiradedic": "@gretathunberg 👏🏻👏🏻👏🏻👏🏻", "serendipia.____": "👏👏👏😘💪💪💪💪💪", "enviromentalartist": "You are an inspiration to us all 👏", "musiquemaison": "Fière d'être Québécois ⚜✌😊", "chavoshi.nazeri": "500.000 unaware and stupid people who know nothing.", "belliho666": "Che merda", "westsideprincesaa": "Pourtant le mont royal était degueulasse apres🤡", "evama38": "The public child abuse in using Greta Thunberg to push the Fossil Free campaign to end investments in oil and gas world-wide, has far wealthier sponsors than local Swedish businessmen such as Ingmar Renzhog and Bo Thorén!! The billion dollar climate-change industry is hyped up for a reason!!", "grilloramos": "It would be so nice if these 5000.000 actually helped sorting the problem reducing their usage of single use plastic and becoming vegetarian (at least) or vegan (at best). The problem is that people do those things and don’t really help doing anything else. I’m tired of people already!", "oxfaminternational\nVerified": "Verified", "apuchalt": "And what do we do now??? We can do nothing else", "eternal.raven_": "All this effort, time, and angry you do to cry and complain, and gather million of people for what. How about the whole bunch of you go plant trees, or go to your local community, park, river, beach etc and pick up trash, or better yet. Everyone donate money to build recycle plants... the fact you guys just complain and pint finger, but make no effort to do something about is sad. Our planet is gonna lash out to us humans for trashing it. Mark my words...", "paola.pinelo": "💚💚", "erk.lzr": "Go to shool", "harrysharp20089": "Ugh these marches are stupid it’s depriving young people of an education where they could be learning about how to make a change instead of standing around doing nothing and helping nobody", "fergalantonioli": "I’m gonna get @sinclairdobbs to pattern your behaviour", "rob_lichty": "That’s a lot of trash. Really need to clean it up", "mepherdonas": "💚💪🏻🌏", "ebbaferlin": "The earthqueen😍 love you", "familyvlogfun": "👏👏👏👏IM PROUD CAUSE I WAS THERE TOO 👏👏👏👏😂😂BLESS YOU #GRETA @gretathunberg", "majaeklund1": "❤️", "_dariograf_": "Als grüäni siächä scholololo do sind als tummi siächä schololololo @thabofe @_silvan_._", "jhezabsms": "This is amazing!", "sondre.mt": "🤡🤡🤡", "numtumbot": "Blame india and asian countries. They do all the polluting.", "miriamodemba": "Wow wow wow", "laurens_vanhulle": "🙌", "thefunnyside1": "Imagine how much litter everyone left..", "danielliguerson": "👏🏽👏🏽👏🏽👏🏽🤩🤩", "nationaler_reaktionist": "ihateyou", "cristo_tv1": "🙌🙌🙌🙌🙌🙌", "margareta.eriksson": "Fantastiskt!❤️", "maubomb1": "What a waste of time", "rickymoore_18": "TRUMP 2020", "_kiara__15__": "😯😧😲👏🏻👍🏻❤️❤️", "__taissafarmiga__": "👏👏👏", "eby_nellissery": "😍😍❤️❤️🔥🔥🔥🔥👌🏽👌🏽", "arteve8": "Wow🦋🦋🦋🦋🦋🦋🦋🦋", "creativelydebra": "Everyone has been clearly waiting for this change momentum. Keep going #teamgreta you are going awesome! We need your inspiration.", "steepics": "svegliatevi tutti e 500000", "bartow_hipster_": "500000 people less.. how much CO2 can we save?", "swimsen_joelsen": "✈️✈️✈️", "ah_14lpz": "Schön den rasen kaputt machen 🤦‍♂️👮🏾‍♀️", "rosella_assaker": "@hayek.maguy", "yanthe_kid": "Sylver one world one dream Do you believe in a world Where we can achieve The same goal, the same dream We know we can succeed Something inside so strong I know you got the heart Something inside so strong The heart to carry on One world, one dream Where everybody's free One heart, one team A world for you and me One world, one dream Where everybody's free One heart, one team A world for you and me One world, one dream One world, one dream Do you believe in yourself You know you can achieve Your goal, your dream Anything you want to be Something inside so strong I know you got the heart Something inside so strong The heart to carry on One world, one dream Where everybody's free One heart, one team A world for you and me One world, one dream One world, one dream Inner peace and harmony A better world for you and me Inner peace and harmony A better world for you and me One world, one dream One world, one dream Where everybody's free One heart, one team A world for you and me One world, one dream Where everybody's free One heart, one team A world for you and me", "miki_pnw": "Well done ms thunberg 🙌👏", "garrettxf8000": "I wonder how much garbage you fucking muppets left that day 😂. And don’t tell me out of 500,000 nobody dropped garbage out of there pocket or some shit. All the time you dip shits spend time protesting is just a waste of time you could have been out there trying to stop climate change you all are fuck ups. All the best to you fuck heads 👋", "queenlylee1": "Yes Montreal!", "alexi_kiara_": "Who cleaned up the mess afterwards? Instead of skipping school, go plant trees in your free Saturday or Sunday. 🙄 Bored of this nonsense", "alexiapasquet": "🙌🙌", "mandylstein": "Way to go!!!❤️❤️❤️❤️", "sirpawickholm": "👍👍👍👍👍👍👍👍👍👍👍", "hiyaa.xox": "amazing🌴🌍", "marii.fabre": "👏👏", "katie.kat.lawrence": "That’s amazing only a hero can do something this empowering!! 💙", "elxnaa._14": "Amazing 😍", "aaronius007": "Who is giving you these false numbers? Or are you just making it up as you go along?", "voicethechange": "❤️❤️❤️", "man_tits_1001": "@olliemonaghan I can see your cute ass in this", "alessandro_niccoli_": "Fai cacare❤️", "asa_sadowsky": "Did you see what the park looked like after these fuckheads left? Full of plastic shit.", "rex_is_k1ng": "This is all they know to do and I would like to see what it looked like when they left", "2pk.1": "❤️ فباااك ضيفَنََي متفاعل ثواني", "dcs_portugal": "Now we just need one a-10c strafe run", "i_am_no_capitalist": "Yoloo", "juan__2307": "Is amazing see how one girl can change the world", "karate_team_tuebingen": "💪amazing 👊", "eco_difference_": "💚🌍", "morkalosa": "Everyone is the leader of his/her conscience. Conscience transcends the differences between ethnicities, nationalities and religious beliefs. You and I can protect the conscience in our heart, and together we can create an era of love and peace. http://www.fowpal.org/?q=introduction", "abiahsuperstar": "Wow!!!!🌴🌴💚💯", "enahssmith": "Looks like a lot of Co2 emissions to me. Why aren’t they planting trees?", "samherring02": "Climate change is fucking bullshit.", "amaury.l31": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👐🏻👐🏻👎🏻", "sohamkushe": "Dadar station at peak hours", "kupro_way": "#trashtag", "gleisahlqvist": "😁😁😁😁", "philippe_barrere": "A major event", "paulamerkl": "♥️♥️♥️🙏🙏🙏", "jezuz_from_konoha": "This is what the Area 51 Raid should’ve looked like", "hanunderwater": "💙💙💙💙💙", "marniekjanssens": "👍👍👍", "andiiii1986": "No chance to change one hole thing. All the kids with the newes smartphones and new clothes. Stubid and blinde peoples, you are all to blame for climate change and drive the earth through your consumption into death", "rolfkjellmann": "🙌", "aidagio8": "✌✌✌✌✌✌✌✌✌✌✌", "alvarolucena16": "You are trash", "jyllamemes": "Veri nise puplic! Meni piipol.", "andrenalinfoto": "Wow! 👏❤️👏", "jacquibeard_": "@scottie_mackey", "zay_toun": "We are the change here our song worldwide in 7 languages 🌎for freedom and stopping war worldwide", "l_matthew_l69": "Instead of wasting your time striking mabye go and actually do something about it like plant some trees Instead of blocking people trying to do there job or ban cars mabye(never gonna happen) or mabye strike on a Saturday in ur own time don't just skip school, do it wen it really affects u more than just skipping school then people might listen.", "realaugie": "Lotta dummies", "niggasextimejuantimeniggasex": "How do you protest climate change???????", "jonny_the_youngy": "So only 27% of the population of Montreal (roughly 1.8 mil) weird flex but ok", "july.11.06": "if everyone plant a tree", "anniedway": "And half of them went and ate at fast food restaurants, ordered UBER EATS, went shopping for junk they did not need, they wasted more cardboard and used more plastic bottles to drink out of, ate some form of animal for dinner, and got bored and drove off to the mall or movies when this was done. I met someone that used to work in a sector of Government that received non stop stupid complaints from civilians for changes to be made with recycling alone. So millions of dollars was wasted on recycling programs, such as the ones used in malls and restaurants, to shut up the same clowns marching for change. Only 5% of everything used was being recycled, and the rest was being thrown in the trash. In the end more and more gave up on the programs, because it was a hugeee waste of money. He also told me that MOST products can't be recycled because of the labeling, plastics, and so forth, so it releases huge amounts of C02 into the atmosphere, and the rest is sent off to landfills or countries that find other use for it. Nice way to get your cardio on tho", "jamir____e": "❤️❤️❤️❤️❤️❤️", "sara.b.143": "Wowwww", "sashaleekay": "👌🏼", "thesosnowski": "What fucking change? All you’ve done is make them walk🤡", "cameronjonnes": "🤡", "7gravitacion7universal7": "Epico! 😮🌻", "earthlingidyle": "#grethathunberg is vegan for a reason! 🌱", "leyla_ysn": "🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦", "_jcostanzo_": "That’s a lot of garbage those people gunna leave behind. Pretty ironic that the climate change people leave the biggest mess when done protesting to save the turtles lmao", "victoriabaltodano": "Amazing inspiration 🤩", "naturerootgreen": "This is so amazing and powerful ✊✊✊❤️❤️❤️", "balake_2222": "I feel bad for the people here just trying to enjoy there day", "fletch_xd": "Fuck you", "aminagebauer": "Yesyesyesyesyesyes", "wet_as_a_sweater": "Find Waldo", "nch.armonia": "👏👏👏👏👏👏👏", "_we_will_live": "This is fucking amazing", "annabelmazzotti": "Wowsers!!!!! What power is there! So heartening! Keep it up!", "thebravecowboy": "Incredible 😍", "merlotmi": "👌👌👌👌magnifique ❣️❣️❣️", "rzvc.g": "I wonder how much garbage these hippies left behind..", "senitals_ken69": "Paperback ......?????😂😂😂stupid", "freddy.wheat": "🤡🤡🤡🤡🤡🤡🤡", "mjreagan21": "What are u going to change😂", "n.i.g.g.a_yeet": "You smell", "jymrhn": "Quelle connerie !", "irishmassagetherapy": "Out numbered Trump👍", "trippssey": "First glance, thought this was a river of trash lmao.", "stawowczykmarcin": "500,000 sheep that's a big flok", "cobaltry": "👊", "vegan_4tw": "Woooo weeee!!!", "bonafedeelia": "Boia", "nataliabelle": "Now I wonder where all of those cardboard signs are going to end up... in the trash? I don’t think so... very likely on THE FLOOR!!! I would like to see this many people coming together to actually do something about the real problem in climate change. It’s unconsciousness, and just like @gretathunberg says, we must be informed. So try to comprehend that if we fix the trash problem Im sure everything else will follow in a chain reaction. If we clean the road we step on... we will have a clean path... Always!!! So I just hope that one day this many people can come together to pick up the trash and put it where it belongs. In the trash bins, so they can be transported to places where they should be able to be recycled or re-used for trash is all just materials not being used. And then maybe when we are all on the same page, us as the people solving the real problems, then maybe we can all demand our politicians and world leaders to make the correct decisions. I would like to see them try to defy us if we are all conscious of our actions.... they won’t be able to. That’s our future! So please focus on the real problem... it’s called TRASH! And the physical trash is just a reflection of the trash in our minds. Those little pieces of negativity that are contaminating your life that you don’t even pay attention too. Start paying attention to the minuscule pieces of trash that you walk over every day... realize that you CAN and SHOULD pick them up and put them in a trash bin. Clean your path! Be the change! Clean our world! Clean your mind! And see what happens.", "annika_naciuk": "@adammudryk !!!", "eliott_f_5.9": "That’s a lot of oxygen being used up", "qwertyuiop4469": "👏", "ronilovestuna": "Go pick up trash instead of being useless", "urb_one": "👏👏👏", "guitardre": "I found waldo", "phatfumbs": "Greta can you tell me why the world smells?", "artemisoulsea": "Wow! 💙🙏", "environmentalopinions": "Even old men care deeply about this. I am a 75 year old former science teacher with 4 grandchildren. I fear for them and their children when they come along Besides, this is by far my favorite planet.", "julian_trev94": "Fake.", "life_of_sooz": "👏👏👏", "c.bibs_21": "Imagine if they all planted a tree instead", "tom_xdits": "Wow🙏🏻🙌🏻", "_.imsippinteainyohood_": "E la Madonna", "heimiti_cuellar": "@mrstiaretaina", "_jetfight_": "Thought it was a dirty river lol", "cantstopsharon": "Wow!!!! Great!", "nickchristensen3": "@sarahmae444", "sam.thegibbon": "🔥", "gi.useppe1296": "OH JESUS", "brd1434": "#Islam_is_the_truth  Islam” literally means to believe in one God and obey his teachings, which are moral teachings to help us live a happy, wonderful life. Islam is not a new religion but all prophets came to teach people Islam, all came to call people to believe in one God and obey his commandments, so we consider Jesus , Moses ,Abraham etc are all Muslims including Muhammad who was not the founder of Islam but the last prophet of Islam. he came to teach people the correct pure message after it was altered and modified.", "meditate_101": "❤️", "martine5555": "Omg omg omg....❤❤❤", "alex__bbx": "I’m going to start this Right war! ❤️🌍", "prada_bea_": "😩😩😩❤️amazing keep going", "sushi_the_elephant": "Can you see me?", "kimdaviies": "Hello greta", "gili_the_bunny": "Yes! 🌎great job Greta!!!", "joseph_cstln": "Les gens commencent à comprendre les enjeux de la vie🙏❤️❤️❤️👑", "chubikaofficial": "❤️❤️❤️❤️❤️", "ve_mas_alla_": "STOP WAR AGAINST VENEZUELAN PEOPLE , STOP XENOFOBIA STOP BLOQUEOS. 👏@gretathunberg #climetestrike.", "bphanitchob": "😍😍😍", "maestro_riga": "🎵", "cccolumbia": "👍🏼👍🏼👍🏼", "d_themyscira76": "Fake Photo", "mirian_helf": "😍💓💓😍", "qlcssytapes": "wow thats a lot of CO2 lmao im ruining the mood rn", "tina_jahn": "WOW!😍", "asa.backstrom": "💪❤️💪", "monadersack": "@_sandray_", "1970purton": "Change is coming, whether you like it or not.", "reamolefe": "Amazing 🤯🙌🏾", "plingan59": "💪🏻❤️", "move_out_draw_fire": "I bet the trash left behind was incredible. 😂😂😂😂😂", "kinglsmith": "Get them off the grass, it’s trying to make oxygen.", "johannayge": "🙌🙌🙌", "snlemoing_author": "👌👌👌", "_louisshelley": "Woah! 👏👏", "stella_e.o": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "adam.regangriffith": "@abains 500,00 people!!!!!!!!", "pawsnfuzz": "🐾🐾We’re #woof you", "soule.said_167": "good", "earth.on.fire": "woohoo!!✊", "igorssouza": "@senadofederal @planalto", "ellis_kirk05": "Ok so to everyone who thinks she is the worlds savour and that they would blindly follow her off a cliff watch no bullshits vid on her if you’re to lazy here’s a link https://m.youtube./watch?v=SvqGVJE6i2s", "noemiguasta": "👏💕", "brindle_crews": "You know a gathering like this is horrible for the local ecosystem right? Let's see the before and after pics of this area when they are done.", "rainbowbliss321": "schools destroy the lives of kids end schools schools are torture and produce trauma to induce the system on kids minds end schools now we don't need schools and teachers we can learn by ourselves and be together the same end schools now kids can't spend life time forced to be closed in schools", "momsbirdnest": "It’s coming 🌏 We love you our big mother", "bumblebeecalligraphy": "amazing! you’re a huge inspiration to me", "conceptomagaly": "❤️🙌👊", "soven_socken": "💪💪👏👏👏👏💪❤️", "shophealthyplanet": "Hi everyone I’m a non profit shop that sells some products that are good for the environment", "lunat_icata": "😍", "constanza_ro_traslavina": "Podemos salvar al planeta empezando por no comer carne, la industria ganadera es la que mas contamina. Enserio, en la misma linea estan las industrias.", "khadigayehia": "@malak_yasser.02", "fringetree7": "❤️", "alexguzdial": "None of these ppl have jobs.", "oksana.gelman": "Amazing!! Thank you for stirring up the world 🌎 ♻️ #gretathunberg #saynotoplastic #reduce #reuse #recycle #reducewaste", "bill124murray": "Greta with out a Script. Pretty sad. https://m.youtube.com/watch?v=AX_8DNOln1g. Watch it on you tube.", "alwaysaryan": "Wowwwwww! Canadians!👏", "lasnibat": "Proud of you girl! 🙏🏻💪🏻🙌🏻💚", "maryellenshaw.rnlaw": "Truly an amazing child. A natural leader full of compassion for all life. 💖", "gabadonde": "Wow😱", "nicozlat92": "I was there 😍😍😍😍😍😍", "paulusgoerden": "😋", "nils.schanze": "der klimawandel ist nicht menschengemacht", "der_kev_272": "Alles fake", "brasil_litoral": "😴", "exuseme_mynameis_1001011001101": "👏", "nutnut_elf": "Wow. i thought it was a gravel path. Its people power!", "paspertinent": "YASSSSSS ✊🏼", "jeviensdesetoiles": "Wow, wow, wow!", "hotchicotchi": "Greta, du är fantastisk! Du har åstadkommit mer än vad våra ”kära politiker” har försökt att göra på, jag vet inte vad.... Fortsätt kämpa, mänskligheten behöver det! 😀👍😉#klimatstrejk ##gretathunberg #politiker #miljöpartiet", "dennis_moeschwitzer_95": "🤮🤮🤮🤮", "kaisaanjou": "❤️", "kristinakolthoff": "😯👌", "dianalovesplants": "Wow. What a crowd!", "vellyings": "❤️👏🔥😢😍😮😂👏😮😢", "waltermsoriano": "🇦🇷 Apoyamos tu lucha Greta !!! Sin tu lucha no habrá otras !!! Porque sos el futuro y porque tu lucha es también la lucha de nuestros hijos !!! Te admiramos profundamente!!!", "jonathanhorne": "Wow!", "sushmapatil_sm_": "Yes", "trishaputas": "🤩🤩🤩🤩🤩🤩", "kickstartdemoc": "We love you! 😍👏", "julianchomontoya": "💪🏻💚Amazing! Come to Argentina!", "mariajohanssonntr": "❤️", "nanakiknana": "Bigger than tRump!", "bonnie_pott": "Waaw🤩🤩", "da.kimeli": "💚💚💚💚", "alexandralunnstudio": "Looks like pebbles on the sea", "a.rowan.bird": "that is incredible!! you are the definition of inspiring. i also have autism and severe anxiety, getting up in front of all those people is just mind blowing to me and i have so much respect for you. you have so many comments you'll never see this, but you're definitely a hero of mine. you're earth's avenging angel, stay strong!!", "albraun_2000": "😍❤️", "sensei_caramanno": "5000,000 In Montreal more than in woodstock and the music is different. good Greta💕💕💕", "chris_marylya": "the fight must continue, its for the sake of all of us", "dann_bastarache": "❤️❤️❤️❤️", "niroshan_photografy": "#climatestrike #supporting #saveearth", "noemiacs": "@csillamidwife", "syl_scia26": "En français stp", "vicavire": "Wow! @gretathunberg 🤗👍🏻😄", "etamagnusson": "💞Amazing!!!!💞", "konrad_skowyra": "Idiot", "holgerssonstina": "så coolt 🌍🍀💚", "lusysoluck": "🔥🔥🔥", "wesley_kobbi": "Please help me spread to the world the genocide of the indigenous peoples and the end of the Amazon perpetrated by yhe Brazilian government, follow me on Instagram and help me.", "punaruthan_purdsws": "I want to join . #purdsws #PunaruthanRuralDevelopmentandSocialWelfareSociety #jyotirayal", "bassiniregina": "💚💚💚💚💚", "menstyle.and.the.city": "#FuckGretelforFuture ☠️💉💊🖕", "sinama_berlin": "wow!!Amazing!!💕🤗🤗👍", "jqken": "🤡", "fffcavan": "👏", "the.nahar.sh": "Wowww", "mr.autismo": "Just stop. Protesters are releasing more co2 which means youre just making it worse", "rjunior_emancipacao_forever": "É presiso uma lutar contra esse sistema sem sentido para humanidade e superar o capitalismo no Planeta e construir uma sociedade transcendente ecológica e social.Não podemos esperar pelos políticos deste sistema capitalista que corrói as entranhas do ser humano.", "deakys.floof": "I live four hours far from Montréal so I couldn’t do it 😔 i live one hour far from Québec City (they did it too) but i didn’t do it either :(( i had school", "sylviacoeurciarlo.xoxo": "👏🖤👏🖤👏 Wonderful ! Thank You ! @gretathunberg 🖤👏", "em._jai": "Ngl at first i thought it was a huge amount of rubbish...", "bella_maria_sangiorgi": "❤️❤️🔥🔥😘", "edberghelena": "Greta! Du är Grym! ❤️🌍", "ladamagic": "😍😍😍", "ceternitc_90": "👏👏🙏🙌", "ayfer_149": "👏👏👏👏👏👏👍👍👍👍👍❤️❤️❤️❤️", "cor.golverdingen": "Happy weekend greta. Greetings 🌞🌞🌞🌞🌞🌞🌞🌞🌞🌞🌞🌞", "tech.gla": "❤️", "narciarzbiegowy": "Yeeeessss!", "dugzybonez73": "500,000 marching but no action really ,let's topple the ones who are really causing the pollution and killing people for their war games and weapons", "iamnoturlover": "🔥🙌", "bianca_tullo": "🙌🙌🙌", "shoveonyourjumper": "I'd say that's more people that at the @realdonaldtrump inauguration #trump #gretathunberg", "thea_handler": "Für alle die nur dumm reden und dieses Mädchen beleidigen. Seht euch an wie viele Menschen Greta unterstützen in ihrem Kampf", "brianholder1972": "Death to oil and coal! Www.waterpoweredcar.com", "reis9045": "🙌", "_officialsharankor": "Very nice greta", "pacripereira": "🌎🌍🌏 thank you from 🇵🇹", "estela_el": "🙌🙌🙌", "foxcorvus": "Alls whites men and women 😂😂😂", "lena_volterra": "Wow!!!", "rosengren42": "Hur påverkar miljön att alla dessa människor samlas??", "pammraider": "💖😍😍😍😍😍", "suzana.alipio": "👏👏", "emmeslaughter": "if cersei supports the climate strike everyone should ^", "north_beach_dog_care": "Beautiful", "raushantukenova": "🙌🙌🙌✊✊✊", "ewa.sandberg.355": "Första intrycket var en grusväg. Roligt när gruset var människor.", "gergely.lilla": "DU ÄR BÄST 🤗🤗🤗", "sofiemothander": "Wow vad häftigt💚", "josephesquilin": "👏👏👏👏", "carolyn.eaton": "@igersmontreal Wow!", "redlilmissy": "🙌🏽 🌎❤️", "claudiabichara": "👏👏👏👏👏🙏🙏🙏🙏🙏🙏🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️", "margotcormiersplane": "Wow 😊", "christianhudak623": "All of these people together breathing is really gonna hurt the atmosphere...oh no 🥵", "asafthedog": "@rcc.ronaldo", "kelstar498": "Go Greta go!! 🙏🏼", "nicollperacha": "Impressive!", "graffotografa": "You rock Greta! Look what you’ve inspired!", "rabbo07": "Bitch", "lmmday": "This is frickin' gorgeous!", "stormie20084": "Wow!!! Truly amazing and hopeful🙌🏼", "john.mckee_": "You do know they all drove cars to get there, right?", "robiin_rb": "Kill it self", "iamchanysculinarypassions": "Wow..This is amazing #makeachange", "sendur.c": "😍🔥🔥", "plamb27": "Great river!", "attieanddora": "🤩", "leaxllovee": "😍💗", "itss_josh07": "Notice how the grass are being stepped? HOW DARE YOU", "gardienceleste": "C'est la seule inondation climatique qui fait plaisir à voir ! 🙏😍😘", "worldtraveler1993": "💪🏽💪🏽💪🏽", "green.party.central.nova": "The time to act is now! ✊", "jamie.debonis": "Beautiful! 🙌🏼😍", "blueyeraven1": "Change is coming! 💪", "askungen47": "💖😍", "donatella.bruno93": "🤗❤️", "sopho_sourav": "🙌🙌🙌🙌🙌🙌🙌", "nihil_liberum_est": "Yeah... I wonder what damage was done here with garbage ect...", "zimmerman12": "AMAZINGGG", "pranswear": "👏👏👏👏👏👏👏👏👍❤️❤️", "emrecan0650": "You're a very stupid girl. into Turkey of the country that most gas emissions in the world've also included. However, Turkey ranked last.", "rishabhmehta6": "@gretathunberg What do you think about a #climatestrike here in india. We are the second largest population. India can be an impact.. I so appreciate your move for climate ❤️ #saveenvironment #savetheearth #fridayforfuture #climatestrike", "_earth2019_": "Together we stand together we change 🌏🌍🙌", "abdillahforgod": "Lmao im not sure..500k is few than bomb nuclear production", "chained_boots": "I thought this was a mountain of plastic for a split second! Woah", "sylvie_ledoux": "👏💙", "charlestonmarysullivan": "♥️♥️♥️ Thank you all", "devdhil": "Angel", "alessandramartinezleonardo": "👏👏👏", "dirtybirty24": "❤️", "bharat_gurjar48": "I just came to laugh on critic comment 😂", "notsobuono": "👏👏👏", "exonphspoilers": "Amazing!!💚", "lilaponymaedchen": "🙌🙌🙌🙌", "familytime2310": "Yessss! Amazing!", "sumerriqi.4g": "Imagine how much trash this protest is gonna leave behind", "erin_e_2020": "🤗💫🙌🙏🏻👏👏", "tadeasdolezi": "Go Greta go!", "masih.___": "🤡", "lindie_lg": "Yessss!! 🎉🎉", "annjameson52": "🙌🙌🙌💚💙", "mshyam1124": "How dare you 😆😆😆", "chrissis.lifestyle7": "So amazing 👏👏✊👍💚", "giahedq": "Wow! 👏", "martina_dal_torrione": "👏 Io sostengo questa battaglia 🙏❤️ @gretathunberg", "nsamanda": "💕", "scorpian_venus": "oh wow 🔥", "aanianandh": "Amazing", "63laur": "👏👏👏", "lelya120.matte": "Really nice speach and a pleasure to be there to defend my amazing planet", "lenchen2416": "egal saufen ist wichtiger😊", "leelawood": "👏👏👏👏", "mariabjerkheden": "@leaboicel", "rita.roos2": "Hopefully at least half of these people DO something!", "mariclahec": "👏👏increible..", "aguasleslie": "ERA DE ESPERAR , EL MUNDO ÉSTA DESPERTANDO, GRACIAS GRETA THUMBERG POR AYUDARNOS A DESPERTAR, DIOS TODOPODEROSO TE BENDIGA GRANDEMENTE POR TODA LA VIDA", "oh.r.o.s.a.l.i.e": "Ur amazing😍❤️💕", "2gatherwithany1": "😮", "lilleyogahus": "Peace within / peace in the World", "ana_san_gom": "WoW WoW WoW x1000", "mctufty": "Astonishing❤️", "xhalimello": "damn im proud", "redcottonsocks": "YES!!! 🙌", "marangaswim": "🙌🏻🙌🏻🙌🏻", "besmagaani": "❤️❤️👌🏻", "saracalcagno_painter": "❤️❤️❤️", "bethikana": "These picture looks like trash, garbage.", "roxannecambridge": "Incredible!!!", "pascals_bbq": "👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎", "___d3nise___": "we hope the change will happen🤞", "leona_iossifxv": "Dump", "chitreestore": "You did that🔥", "elephant_advocate": "A fantastic turn out AMAZING 🙏💝🤗💖", "kustbor2008": "👏👏👏👏👏", "jluvlight": "WOW!! 😁", "whypeoplehateme": "🙏🙏🙏", "vitadg2017": "Wowwww...yehhh is coming 😂😘🎉🙌", "shubhamks22": "Amazing and wow😮", "melanietutor_": "dont stop greta", "eurision": "😱😍😍😍😍😍👍👍👍👍🙏🙏🙏🙏🙏💚💚💚💚💚", "pubblicita.direnzo.1": "Olloo", "91antoniofernandes": "Esta manifestação deixou o percurso cheio da mais diversa porcaria poluente. Falam em toneladas de lixo... A ser verdade é um grande exemplo de protecção do ambiente!", "sedrajundi": "🙌🏽🇨🇦", "may_naomi_photography": "Wooowww!!👏👏👏👏👏", "the_purple_alien_gang": "no.", "carlosvaronabjj": "Let’s help everyone become vegan to help as well 😁👌🏾 eating meat doesn’t help climate change. 🌀", "eviachten": "O wow 🤩😳", "life_of_tyson1": "Amazing! 👏👏👏", "gem_wiehahn": "💚💚💚", "herrskon": "Wow! 🙌🏻✨", "naprapat_louise": "WOOOOW ✨🙏🏻🤩👏🏻", "jonaasl": "#fridaysforfaulenzen", "vittransfuhleblack": "JA. UPP TILL KAMP!", "barbara_kraemer": "Fantastic!!! 🔥❤️❤️❤️", "_ritikrs_": "You used paper and cardboard to make those sign increasing company demands and the increase production of paper thus more trees being cut down how about “planning before you enter a protest idiots” also if your gonna say it’s recycled, well it still was born from virgin paper also the energy used to recycle paper creates carbon emissions so why should we have to listen to a protest where the people themselves aren’t doing their part bunch of hypocrites lol", "thehypelyrics": "Are these people or what?", "this_is_loafy_account": "Yayayay", "bennibusirivici": "🌞🌲🍀☘️🌳🌵🌴☀️☀️🌄🌅⭐🌟🌈🌏🌎🌍🌕🌙🐵🙈🙉🙊🐻🦁🐯🐱🐶🐺🐹🐭🐰🦝🦡🦊🐨🐼🐷🐽🐗🦓🦄🐴🐮🦛🦌🐸🐲🐉🐢🐊🐍🦎🐇🐀🐁🐩🐕🐈🐖🐎🐄🐂🐃🐑🐏🐐🦙🦥🐘🦏🦒🦘🐒🦍🦧🐪🐫🐿️🦔🦦🦨🦇🦉🦅🐦🦜🕊️🦢🦩🦚🦃🦆🐧🐓🐔🐣🐤🐥🦈🐬🐋🐳🐟🐠🐡🦐🦞🦀🦑🐙🦪🦂🕷️🕸️🐚🐌🐜🦗🐝🐞🦋🐛🦠", "animals.and.botanicals": "So amazing!!!! Fantastic!!!!", "zazarnj": "💗💗", "kabal_sakir": "🔔🔔🔔🔔🔔"}