{"peyton_yeigh": "Are you fucking stupid the US is responsible for a very small portion of carbon emissions", "jessii.045": "What. The. Actual. Fuck", "alejandrol1426": "🤡🤡🤡🤡🤡", "_man_made_god_": "But u forget Spain ? A country that is penalizing people for generating their own clean energy by imposing a sun tax and forcing people to stay connected to the grid at ever increasing extortionate prices !!!!", "citizenofdreams": "Honey, why are you wearing jeans? Have you checked the fabrication of those abominations?", "peytonhicks.39": "Ur a dumb liberal", "fusionfusun": "Bombs clean the air! You can ask this to countries who trigger wars!", "anderson_fernandes_bmx": "countries that don't accept this scam should treat you as TERRORISTS! Everyone who wakes up from MATRIX knows that global warming is a scam!This damn old George Soros and Al Gore go to hell with you Greta Thunberg retard. 🖕🏻🧔🏻🖕🏻FUCK YOU VERY MUCH, BITCH MOTHER FUCK 🤢🤮🤮🤮🤮🤮🤮🤮🤮", "nicooo_________": "Puzzi greta", "rosacayres71": "❤️❤️❤️❤️❤️", "swathirufina": "Q😘", "kadir_sygn": "🇹🇷", "jch__13": "Imagine wearing strap shoes at age 14:( How dare you", "gl44ch": "🛩", "rian.phantom": "Schwedische Nationalmannschaft , krank", "v_r_u_s_h_a_l_i_e": "And some information for u..india is doing great for our nature.. reducing plastic use,act for animal abuse,river cleaning, Cleanliness in nation program (swachcta abhiyan) which can get hygiene in surrounding...if u know greta .. prime minister modi get award for swacchta abhiyan from bill gates and got earth champion award beside Canada's pm .i hope u will know that he is doing great bcoz i saw ur video in name of pm modi about giving knowledge on nature to him..", "ma.rianne7914": "You are quite right. This is your parents and grandparents mess. Not yours to clean up but there it is. It must be cleaned up We have no time left and we must each and everyone of us act if we care to preserve life on earth . When humans are gone earth will self correct. That is some consolation but sad indeed for all we hold dear. Never give up.", "jasminewiener": "Okay, ARE YOU SURE YOUR NOT 13. Like I’m not hating or anything but damn you look young as all hell.", "0chill_ma": "Schwüler dreckiger Kinder Chor ich fick doch eure eltern", "adam__b__kimmick": "Who else loved it when trump crashed her party", "ja.max.757": "Get some new shoes Greta", "kaylavidovic": "How dare you", "saman.morgan": "Thank you for doing the things us young people don’t have a say in", "sko_grace": "Where can I find the document it is not in her bio anymore", "andrerichson": "Imagine being so cringe cause you think you have power when your really just an annoying little girl 🤡", "kimdaviies": "Sweet cheeks come over here", "vegan_4tw": "The power of youth!! Keep strong and keep fighting the most important fight for our lives, all the living on this planet, and beyond!!!", "gamewinner.mvp": "🙏🏼🙏🏼🙏🏼", "jussaralee": "Pressure is a weapon we still have, let’s exercise it.", "marcos_almeives": "Stupid teen 🖕", "burntcakeart": "alil you haters go fuck yourselves. Greta is actually doing something. You are all hating on someone who's trying to save your asses and the planet. Ppl make mistakes and maybe she didn't go after the big guys, but she is still helping. So stop whining that she has a disability and that her parents are after a paycheck. She's trying to do something. Unlike you. So if you have nothing nice to say about an inspirational person who's trying to save us, then you should just be quiet and rot in hell. Or stay on our dying planet. That's gonna becomes hell soon enough if we don't do anything.", "ruya_ucum": "SHUT UP ! LITTLE GIRL YOU DON'T NOW ANYTHING GO BACK TO SCHOOL", "jack_z._": "First, my friends, whether ur from Jesusland, the US, Canada, or any nations, MAKE YOURSELF THINK HARDER. Greta’s being young has nothing to do with her proposals. If you really heard her stories, you would see how much she understood the current situations than the old decrepit sofa-haunching balds in the audience. It’s highly possible that she sees as much as what a qualified activist does. How dare you say that her being young and choosing to leave school hamper her understanding of climate? Have you EVRR reflected how much bullshoot schools been teaching when you step your feet into society eh? No speaker speaks flawlessly, but her essential message is so urgent and real that your denial due to her dropout, her writhing appearance, or indignation, only brought up the fool horror of how STUPID and INCORRIGIBLE creature Mother Earth has molded.", "_hinokamii_": "@_lissoo_", "zeelineofproducts": "🙌😍...", "alimbagheri": "Fuck you", "mayamakeupto": "Good going! Thank you on behalf of concerned children today and in the future. ❤️❤️❤️❤️❤️❤️", "leventg.jpeg": "Why don't you sue your own country?Why Turkey?How dare you?🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "zinkunst": "Listen to all of you which are not unterstand the situation. This girl is a Symbol for saving our climate. She is not that alone. Every of us has to do Something for a cleaner Future. And not to judge about a person running through demonstrations.", "happyhippieflowerpower": "Go girl 👍👍👍♥️♥️♥️🙏🏻🙏🏻👍", "creativesoulyoga": "You ARE WHAT THE WORLD WAS WAITING FOR ❤❤❤❤", "artbylisa13": "He isn't refunding the military at all. Where do you get your information. Seriously. He actually cut funding for military programs. I have family members that are on a waiting list just to see a doctor at the V A hospital. I myself am a government worker. You need to really learn.", "jqken": "🤡", "xxchritinaxx": "Honestly all these people tearing her down saying she’s being manipulated and needs to go back to school need to rethink their priorities. Instead of tearing down a 16 year old who’s trying to save this world, maybe you guys should go back to school.", "valdirteixeiraneto": "@catarina_lorenzo !! Boooaa!!", "baba.booss": "ta bort dig själv", "pclz74": "It is great that @gretathunberg is raising awareness but as Greta had pointed out, there are many other activist children that have to be recognised. Let’s remember as @autumn.peltier @littlemissflint because they are not only complainkng but also taking actions in her own communities.", "karre63": "👍👍", "thetragiccomedy": "So, those sneakers. Guess the carbon imprint Little Girl #hypocrite", "k.marshall19": "I stand with you thank you for being so powerful and being the good and strength we all need. I’m sorry the burden is falling on your shoulders but you’re doing a hell of a good job holding it up and being one of the most beautiful and strongest people I’ve ever seen", "tealtree7": "I’m", "rupbhowmik": "🤩🥰😍🤩😍🤩🥰🤩🥰🤩🥰🤩🥰🤩🥰🥰🤩", "tabishrza01": "👍", "animals.and.peace": "Thank you all! 💚☮️💚☮️💚☮️", "endlessstylezz": "It’s no surprise that a self-labeled “Finance executive” with very few followers is spewing hypocritical and outright clearly tantalizing comments in order to direct attention towards his own self serving motives; by sparking controversy around his own platform to attract more followers and clients... Go get a real job buddy, quit leaching off the well to do public in order to line ur pockets. Smarten up...", "lorenzo_itroc": "🤡🤡🤡🤡🤡🤡🤡🤡🤡", "whothefuckisfilip": "bro these sneakers don't match the fit", "heatherlavinrealestate": "Greta - ignore all these disbelievers and hateful people. They live in a world of ignorance. Thank you for your activism and brilliance. You are an amazing person who will do much for all of us. Even the hateful ignorants.", "amelinimeli": "👏👏👏👏👏👏👏", "iamdeniiel": "The New world order !", "ryan_8d": "Why are u still using cars to get around?", "homaei_2536": "👏👏👏👏", "mlo618": "@nicod_1", "jared.diamond.9": "I still applaud you for for standing up at the UN. Keep strong 💪 and don’t ever back down. 🙏💪✌️❤️❤️❤️❤️❤️", "plantiful.images": "❤️🌿🌸🌳❤️", "joanascalone": "So many hates but Greta, my love and I'm pretty sure the love of 100000000000ⁿ other humans is with you. People that have heard of you and even people who haven't. And, in the plbig picture even these 'haters'. I guess they just want to feel special too. So: You're doing everything right and WE support you 💚🌷🌻 With stand united and will make the difference that really has to be made!", "23_gun_salute_": "Unity is colorful 💓💓", "gregommmmmmmm": "👏💚🌳💚👍💪👋save the climate💚💚💚", "mamma.49": "👍❤", "sick_messina_": "I like plastic", "eupriscilamatos": "M A R I O N E T E", "official_uves11": "Every little makes a little", "bxde.pvge": "🤡🤡🤡🤡", "acpeternella": "😍😍😍😍👏🏼👏🏼👏🏼👏🏼👏🏼", "gannerov": "It's funny to see so many idiots", "betta_wildorchid": "@gretathunberg WHOS BEHIND YOU. Come on, tell us. And maybe after we will listen and care. Because it’s not gonna be a kid for sure. You sound so hypocrite.", "alicemolella": "@_chiara.sacchi_ che cosa ci facevi con Greta?🤔❤️", "annadevivo13": "❤️", "1latte1sugar": "You better of fucking rowed to Italy otherwise your a CLIMATE SCAM!", "bruman54": "It's a shame that your parents want to be famous that they would put their child with autism in front of the whole world for attention", "mvrkopilipovic": "my father left", "brasil_litoral": "😈🕵️", "bernieandgeorge": "🌟🌟", "roberta.b.oliv": "@mariateresalua acho que os adultos se sentem ameaçados por você, quando você começa a falar com argumentos.", "nachoffk": "Un poquito pesada y tal", "aydennn04": "Crying isn’t gonna make your cause worth a damn", "m_swens": "@daniellalteixeira", "amt_life__live": "@klimatforandring.nu Maybe mass extinction is a blessing. The earth is stronger than us. It will survive humanity. What if 100% of humanity is going ecofriendly? It will still grow at alarming rate. I think that overpopulation is the real issue here. Humanity is trying to erradicate every disease or disaster nature is throwing at us. There are more people alive today than ever excisted in the history of the world added up! #overcrowding", "zeke_milli": "💩👏", "ralph_bingen": "🖕", "sophie.snewin": "You are so strong, you are bringing us all such hope!", "erikaxixaa": "@teresa_di_massa quella sembra @manfredi_viviana", "jade_x_anunalover": "❤️❤️❤️❤️", "_sloppy.exe": "Please not so many motivated people at once", "trans_atlantic_slave_trade_88": "Lets use 16 yr. old liberal girls to mainstream hysteria!", "luisheston": "Gobshite", "kerstin1157": "Why are so many people asking Greta to come up with solutions? She's pointing out the problems and she's very right doing so. It's the (hopefully adult) politicians who have to present the solutions. And you and I can contribute.", "jack.crenshaw": "🤢🤮", "aidanrgallagher\nVerified": "Verified", "rapha_elmi": "🖕🖕🖕🖕", "patmorec83": "Good luck Greta! You are going to need it. Im saddened and shocked by some of the comments I have read. Very few people seem to actually be listening to you. Dont give up hope you are doing something truly amazing. Dont give up, be strong and I wish you all the very very best.", "lorrainelson61": "You go for it, Greta ✌️", "monteiro.elvio": "😂😂😂😂", "jakeshannonn": "Dumb bitch", "poxx_victor": "💩💩💩", "nara.raquels": "💜", "aaaaaaassssssssttttttttggggggg": "Fuck You Greta! 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "red_trainer_05": "Slut", "absolute_ayeshaa": "The donation is in dollers or other ????? I am from INDIA. KEEP IT UP GIRL... WE ARE WITH YOU", "sara_erb": "👏👏👏👏", "holdenhughes.us": "🤡", "timriley_719": "didn’t know karen could be a teenager", "rrdaca7": "DIO CANEEEEE", "gokhanunited": "This climate change bullshit is clearing the way for big business. The Blended Finance Action Taskforce - comprised of 50 financial giants including HSBC, JP Morgan and Citi - is explicit calling for a “layer of government and philanthropic capital” as there are “profits to be had” in “climate related sectors across three regions including Latin America, Asia and Africa”. Put simply, financial giants want your pensions and your taxes to support their investments half a world away. Greta and The Climate Emergency Movement are paralyzing your with fear, and knowldingly or unknowingly aiding the interests of the worlds mega rich.", "_aaila._": "greta, a young child: lemme go fight climate change today  hardcore republicans, who act like even younger children: A CHILD A CHILD WE MUST STOP THE CHILD  ig hardcore republicans: WELLLLLL youre SOOOOOOO privelaged for wanting to LIVE. We Were aLl GonNa DiE AnYwaYs.", "gabrielaahartman": "We are with you!❤️", "alostengineer.i": "💖♥️❤️", "raaqueel_fernandess": "Fantoche de esquerda", "tokyo2020_toy": "😢", "mamadou_diallo_": "👏🏻👏🏻😀❤️🙏🏽😍", "superevas_": "👏🏻🌸👏🏻🌸👏🏻🌸💪🏻🌸", "mathiashatak": "Vi är så stolta över dig Greta! Fortsätt kampen! 👊", "ricks_hemp_oil": "Job well done Greta!!", "milanaxxmilanaxx": "Go girl", "vinnegozunegozo": "you're a liar and asshole @gretathunberg", "papicarillo": "Suck my dick", "fabisedlts": "To all that say that she should go back to school: She is younger than you all and she got so far in her life. she has achieved more than you. And she‘s right. People are dying all over the world and you are hating a girl because she doesn’t go to school because of your mistakes. And even if you don’t share her opinion: let her do her things. I think it’s great to engage yourself for our planet. It’s not okay to destroy our planet. And it’s not okay to destroy our childhood. I‘m just a child but i believe that it’s good to DO something for the earth. Not only talk about unimportant things.", "mabrydoesthings": "You’re a boss! Go girl!!", "fotosxhuelgaclimatica": "👏👏Join the global photo campaign using #photo4climatestrike and #fotosxhuelgaclimatica", "walkingspeedily": "how tall are you", "pencilpenpaperppp": "Ignore the haters Greta - you are the voice of today’s concerned young who are worried about climate change. The naysayers are in denial. You go girl !! We are so proud of you ❤️❤️❤️❤️😘", "enviromemetallyfriendly": "👉🏻 Follow @enviromemetallyfriendly for more climate-related memes", "paolasulponte": "♥️", "vincentvalentin25": "🇩🇪🇫🇷❤💪. Raina Ivanova is not a German name. Soo weird", "aurorahartistry": "People really are insane... keep up the good work kids! The world is watching", "justinetzin\nVerified": "Verified", "barbozdemir": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "camron_glover_99": "Don’t even have good grammer!!! And yet they let you read your parents speech at the UN!! Oh and btw it’s Chiara and I not I and Chiara!", "autisticleftwingqueer": "Good on you all. When young people's voices are heard and listened to everybody benefits, the future is yours after all.", "toeszyslak": "Couldn’t sign up to support as it only seems to accept numerical or US zip codes - can it be changed to accept UK post codes please?", "negr.4": "Che bei piedi", "axellifmoren": "Du är så cool! Är min största idol!(:", "kathrynmellen": "@oprah now Write About This Stand Up and be A Voice for #climatestrike Climate Change🙏", "sillagesparis": "Thank god for you!", "sunflower__lavender": "👏🏻", "dienstagdientdemdiesel": "Just kids that are thinking they are as smart as politics .", "broadermindsirl": "👏", "kirgizistanbul": "👎👎👎", "melihkorucu": "We may not have signed and obeyed. But you should have complained all the countries. We may be generating 1% emissions, but the fact that the United States generates 10% emissions cannot be underestimated. The first thing we have to destroy is nuclear energy before it destroys us and the world.", "sylviadelgadoidarr": "💚💚❤️❤️", "mgonzalez1920": "@gretathunberg Just wanted to say, I love what you are doing and I am a big fan of yours! Sending you much love from California! YASSS GIRL! Keep the fight alive!! 💕👏❤️🔥🙌 #MightyWomen #RESIST #SaveTheEarth", "arieke.christina": "Remember the climate change is because of chemtrails!!!! That is the biggest reason and nobody is talking about this!!!!!!!", "popularchips": "Yes!!!!", "_em.000_": "Älskar dig du är verkligen en fantastisk förebild för alla❤ Fattar inte va de som hatar tänker med egentligen😘😘😘", "darko_canic": "🤮🤮🤮🤮🤮🤮🤮🤮", "matthew_palmer_": "End yourself", "missflora.factory": "👏👏👏", "rosanocte": "Wow I can't believe some of the abusive comments on here, truly makes me so sad and a bit sick, it would be good if people would think before they speak, it's ok to have a different opinion but there's no need to express it in such a personal and abusive way. Please think before you post, someone recently said to me that people post things on social media that they would never say to your face - so true and so sad - I am shocked and sad that anyone would think it's ok to say these things to anyone let alone a 16 year old :/ enough said - be nice", "mattia_20a": "Biuuuuuuuuuuuuu", "ggeewhiz": "@titantrev13", "irondreamstx": "5, excluding China. You're being called out for a reason. Too bad your intentions dont seem noble when you leave the biggest polluter off your list. Oh well, you do you.", "emre___cubuk": "lel", "michael_b24n": "Hurensohn", "lauraalvarez012": "@edu_meji son activos.👏👏👏👏👏👏👏", "florenciaberti": "❤️👏❤️👏❤️👏❤️👏❤️👏❤️😘😘😘", "007forest": "Great 💜💜💜💜💜💜", "lehua_unea": "✊🏽✊🏽❤️❤️❤️", "bestieb63": "You are so inspiring!", "kohlharrington": "❤️", "izziasha": "❤️", "bremix3": "Thank you Greta you’re a hero!!!❤️", "mesenerr": "Fuck off sjw", "vivitinyspring": "🙌🏻 🌎 🙏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "swaggy.memes69": "Retard", "jonathanberook7781": "Just stop and actually use ur brain for once", "sandranaya05": "💜💜", "_.brunoribeiro": "Nego exagera nesse aquecimento global puta merda, politicamente correto é foda ... n venham c essa d q estamos morrendo não ... deixem de querer lacrar", "bohemiansoul26": "Stay strong, Greta! You are so awesome!", "artisan954": "#naturenow 😎", "cedarlamb": "Leftists, scaring children since 1918.", "prema_b": "💚🌏💚🌍💙🌎💙", "handsonlearningideas": "❤️❤️❤️", "candanoclau": "👏🏻👏🏻👏🏻👏🏻", "pollyskis": "YES😍👍", "sebsterc": "Fucking creepy we need to perform an exorcisms on her", "transparente.morada": "Go vegan💗", "sparky2403": "Thank you!", "dam.sooo": "@swedense where are you?", "lll_oak_cliff": "✌🏼✌🏼✌🏼👏🏼👏🏼👏🏼", "gabrielgbravo": "Las multinacionales nos llenan de plástico, demasiados envases, demasiados sabores.", "yanelvis_boutique": "Fab!", "lauracobain_": "👏👏👏", "glors74": "👋👍👋👍👋", "irenemruz": "Im so happy you exist", "heraldoandrade1": "Fight for the children and adolescents of your age who are starving and dying in Africa and the Middle East. It will be more important !!!", "nikola.m_8263": "Greta yarakberg braucht 🥕", "nellydvelasquez": "...why is it mostly angry guys that are bullying her...", "niclas_black": "I don't understand this girl, they criticized other countries, but her homeland has much problems. Sweden has much old nuclear power plants at the Baltic Sea, and nobody do anything against this? She should take care about her homeland, when her homeland is perfect, then she can criticized other countries. In the nature of Sweden are many waste, special in the citys. The US doesn't has this problem, the nature and the city's are very clean, and the nature was so wonderful! Much better than the nature and the citys in Sweden. Sweden is so worse...", "jrevelyn27": "Some of these comments are mind blowing. Agree or disagree, this is child. Some of the insults coming from so called adults, it's shameful.", "calilifebylaila": "I am 100% in 💃", "ethan.donnelly": "AMAZING!", "noplasticantas": "Well done👏 finally", "desapego.vairagya": "🙌🏻❤️✨", "cocoonwellnessmelbourne": "Oh my goodness Greta THANK YOU 🙏", "jordana_antonia": "You’re all amazing!!!!", "peanutbutterjellyandjam": "Which countries?", "71connyandersson": "👍👍 ni unga ger mig hop för mina barn, barnbarn och kommande generationer . Kämpa! Jag ska göra vad jag kan för att ni ska få en bra framtid👍", "kustbor2008": "👏👏👏", "artesania.reutilizada": "👏👏👏👏👏", "gamaga.abyayala.danza": "😘", "an_ge_lita": "Bolivia también", "valborgsdotter": "♥️🌻♥️Go Lovely Youngsters!🌻♥️🌻", "ogzhncyln00": "Abi atma şu izmariti denize", "_zwiebelinsta_": "Schlampe", "lionsmane0": "Well done! 👏👏👏👏", "popular.kid8901": "Stupid", "kane._moreton": "God bless America 🇺🇸 for not falling victim to some deranged 16 year old without any facts. And I thought yelling and giving dirty looks didn’t get you anywhere in life she’s proved me wrong 😂", "farris_o": "nothing but respect for MY president(s)", "stop2drop": "We are a group of people who are against the pollution! Please help us with your Support! Save our planet!🌍🚬 #stop2drop #fillthebottle Please support", "kankerbroodje1": "Make more kids not follow lessons in school just like you good job", "ege.kayrak": "🇹🇷", "shoresh_vahabi": "👏👏👏👏👏👏👏🌹🌹🌹", "kendizzleswizzl": "👏🏻👏🏻👏🏻👏🏻👏🏻", "birgittajaremalm": "Greta, don't tire yourself with listening to ignorent people. The world is listening to you!❤️❤️❤️", "gabriapt": "❤️🙌🏻", "utkult": "Exploitation of children 🤢", "cendrines": "💥👏🏼👏🏼👏🏼", "thomas_gstnl": "😂", "lottecarolineb": "🌎🙏💚", "umutakbuulut1903": "Amık isveçlisi", "arquitectasdelalma": "💚🙏💚🙏💚🙏💚", "edd.shuu": "how to", "cherri_porter": "I would love to see @gretathunberg amplify the voices of, and join forces with, young activist of color.", "kittychelka": "You go girl!!! 💚💚💚🌎🌍🌏", "antkano29": "Just letting you know I’ll be driving me ford diesel across the country starting now......how dare you😂", "caiohpergentino": "Lixo humano", "yigit.dmrll": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "yuceposey": "Amina kodumun salagi", "elli.wrangtorp": "👏Wow! Amazing!! ❤️❤️", "ramiro_paz39": "Soros soros soros", "ruined_myself_again": "Someone needs to learn what a right is", "romeocrthd": "@gretathunberg You are a clear example of the MK-ULTRA project. You are used by oligarchies and globalist factual powers to deceive people. Climate change is a scam. And you are a devilish and Luciferian girl, surely you have a chip inserted in your body with which they control you.", "hungryandfoolishyouth": "SE ANCHE TU VUOI COMBATTERE IL CAMBIAMENTO CLIMATICO SEGUI 👉🏻 @hungryandfoolishyouth 💚", "p_1290_a": "Es gibt keinen Klimanotfall Ein globales Netzwerk von 500-Wissenschaftlern und -Fachleuten hat diese dringende Botschaft vorbereitet. Die Klimawissenschaft sollte weniger politisch sein, während die Klimapolitik wissenschaftlicher sein sollte. Wissenschaftler sollten offen auf die Unsicherheiten und Übertreibungen bei ihren Vorhersagen zur globalen Erwärmung eingehen, während Politiker den tatsächlichen Nutzen sowie die imaginären Kosten für die Anpassung an die globale Erwärmung und die tatsächlichen Kosten sowie den imaginären Nutzen der Abschwächung leidenschaftslos berücksichtigen sollten.  Natürliche sowie anthropogene Faktoren verursachen eine Erwärmung Das geologische Archiv zeigt, dass sich das Erdklima seit Bestehen des Planeten mit natürlichen Kälte- und Warmphasen verändert hat. Die kleine Eiszeit endete erst mit 1850. Daher ist es nicht verwunderlich, dass wir jetzt eine Phase der Erwärmung erleben.  Die Erwärmung ist viel langsamer als vorhergesagt Die Welt hat sich mit weniger als der Hälfte der ursprünglich vorhergesagten Rate erwärmt und mit weniger als der Hälfte der Rate, die aufgrund des anthropogenen Nettoantriebs und des Strahlungsungleichgewichts zu erwarten ist. Es zeigt uns, dass wir den Klimawandel nicht verstehen.  Die Klimapolitik stützt sich auf unzureichende Modelle Klimamodelle weisen viele Mängel auf und sind als politische Instrumente nicht aus der Ferne plausibel. Darüber hinaus übertreiben sie höchstwahrscheinlich die Wirkung von Treibhausgasen wie CO2. Darüber hinaus ignorieren sie die Tatsache, dass die Anreicherung der Atmosphäre mit CO2 von Vorteil ist.  CO2 ist pflanzliche Nahrung, die Grundlage allen Lebens auf der Erde CO2 ist kein Schadstoff. Es ist wesentlich für alles Leben auf der Erde. Die Photosynthese ist ein Segen. Mehr CO2 schont die Natur und die Erde: Zusätzliches CO2 in der Luft hat das Wachstum der globalen Pflanzenbiomasse gefördert. Es ist auch gut für die Landwirtschaft und erhöht die Ernteerträge weltweit.", "rafaelblessed": "BOLSONARO ❤️❤️❤️❤️🇧🇷🇧🇷🇧🇷🇧🇷", "padmacandrameek": "Sending love and support. Standing with you 😍", "crackhead_v.2": "Fick dich du grüne fotze ich hoffe du wirst vergaßt", "frostberggunnar": "Great, fantastic, well done ❤️❤️❤️", "_ayushoraon_07": "Please file a complaint against India", "rivers_tenzin": "🙏❤️🙏", "ourplanettheirstoo": "👏👏🤘🙏", "odd.karma": "Hey guys , I give you 10 options , read each story ... Worth more than Nobel . And please Note .... All of these women are Illiterate , more than 50 years old , No Social Media Support , Coming from Remotest part of India ,where lost of us would forget their comforts or life standards in a day ... Read On , and Decide . https://www.thebetterindia.com/175401/padma-shri-women-winners-achievers-inspiring-india/", "bratzgelina": "Future serial killer 😕", "dagonsixtattoo": "🤮🤮🤮🤮", "ivmetu4music": "Thanks from @ivme.tu", "mangoraj_": "F", "h_u_m_a_n_p_e_r_s_o_n": "@gretathunberg can you use your platform to highlight young activists of color?", "munniata": "I thought this was some kind of joke or parody sketch. She should be more concerned about the open borders in Sweden", "sanemyaz": "Go go girlll!!!", "angela_realtor_reynolds": "It's NOT global warming..dip shits..its nothing but chemtrails and HAARP...wow", "tm.nfld": "🤦‍♂️", "barrow.cn": "The future leaders of our planet....❤❤", "klarinecka00": "🤮🤮🤮🤮🤮🤮🤮🤮🤮", "yasiplusone": "You have the support of my family which includes our three children who believe in all that you do.", "emmamaggi_": "❤️", "waldo_mayn": "Climate has been changing since the beginning of time, it changed multiple times when we wasnt here, and its going to change again no matter what you people are trying to do. Thats just how the world is, like it or not.", "mar_de_hipocrisia": "❤❤❤❤❤", "jebereon": "ARÁBIA SAUDITA 😁😁😁😁", "pagnussatti_": "Parabéns , eu vi aqui no Brasil 🇧🇷🇧🇷", "tarunkvian": "You are great", "wineandsunshine_": "@karlacalif @brittneyreed_", "michelleleitelobo": "👎👎👎👎👎👎👎👎👎👎👎👎👎", "samira__qanbari": "I proud of you", "tommeg60": "Greta vincitrice dell'Oscar come miglior attrice drammatica 👎👎👎", "sirroronoa": "SEND NUDES", "gavnels": "@owenrody", "young_vamplord": "Nothing like a bunch of teenagers to tell professors and scientists they’re wrong... hahahahaha", "vashist67436": "I am with u", "joratshin": "Keep it up! We are with you 💯", "ttha.chris": "In una foto del mio alluce c'è più q.i.", "globo.lixo": "#fakenews #fakenews #fakenews #fakenews #fakenews #fakenews", "ben.davies333": "Imagine wearing a pink skirt and blue trainers ur fucking childish grow the fuck up no one asked if the planet was ok to back to school stop complaining, and grow some tits", "ajeebogareemo": "🌸", "k07820": "why is your friend and biggest war monger obama not on the pic?", "champrusty": "Which countries are they????", "holliebob_": "@crystaldelphia_one in a way, you're correct, but you are grossly inaccurate too? We were *meant* to have that 10000 year warmth, however we entered that period roughly 11,700 years ago and thus we should be coming out of it and be getting colder. That 10000 year period you are referring to was the grace period the earth uses in a cycle called the \"100,000\" year cycle, where the earth spends 900,000 years growing massive ice sheets then loses them again over 10,000 years. The actual earth is slightly wonky in orbit, however that coupled with rate of us pumping CO2 to the atmosphere it is incredibly likely we won't enter one for another 100,000 years which is incredibly damaging to the earth and could be irreparable. THAT is global warming mate. Do yourself a favour and Google that.", "kristinscott_": "I LOVE YOU GRETA", "maria_sole7": "🙄", "margaritaansoleagarod": "❤️🌻👏🌻❤️", "francesc_ciurana": "🎗", "nilsaliliana": "👏👏💪💪asi debemos ser.gracias por darme ejemplo", "ontheissueswithsam": "🤡", "shum007.ea": "🤣🤣🤣🤣🤣", "andersogr": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "jensmitts": "Thank You All!", "jennyblessings": "Thank you!🙏💕", "cl0i": "QUEEN", "lvgan__": "Your views are irrelevant", "luvers.land": "U such an inspiration happy trails from Colorado", "ricardoaboscan": "😍👏🤮", "imari_91": "I thought it used to be polite to list yourself at the end. I think you are focusing on YOU and what YOU do. Well, you do not focus on nothing, but in what the people behind you tell you to focus on.", "astrologikaa": "TAKE CARE MY DEARS", "klimatsamling_goteborg": "💚", "cowboy5871": "👎👎👎👎👎", "_camstewart": "@dannyp_003", "iscanlon13": "👏", "wrsdrigo": "Vai aprender a pentear o cabelo , ninguém cai nesse discurso barato da esquerda", "blitzderdeutchland": "Same like Hitler Youth", "starrhout": "AMAZING", "ilariabudriesi": "You are such an inspiration for the whole humanity. Thank you.", "amanda_nareal": "👏👏👏", "qiwei.song": "Climate change is a global issue that the entire world needs to deal with. But data has different ways of interpretation. Carbon emission needs to be analyzed from Carbon Emission per person. Then the comparison would probably make more senses. If you rank these countries that way, then result is much different.", "adamstnk": "last 4 photos and still the same shirt", "torresdaai": "😂", "andy.ces83": "Go Greta don't stop!!! 💪🏻💪🏻💪🏻 You're You're a beacon of hope to people! 😉", "datumposter": "👏👏", "fotopro_alvarovergara": "💪💪💪", "perolanyman": "Some people are jealous because you dare saying what you think abd stand for it", "kigakome": "Grattis till att ha vunnit \"Right Livelihood Award\". Snälla gör ditt bästa som Jeanne d'Arc i världen.", "olesia_varlamova": "But who will fight for peace? When the wars stop? When the arms sales stop?", "kathy_bee57": "💚", "nadinka_nutrishka": "@sammcleod82", "d.c.delac": "🤡", "themusicianship": "Go Greta Gooooooo! We stand with you!!! 💙🧡💙🧡💙🧡💙", "janeradage75": "Greta, you're a Tall Poppy and it's very hard to carry on being one, as many will try and cut you down to their size. But that's part of human nature too. However, many other people are doing a great job to help mend our planet, but whatever is done seems to appear of little value, as we know the whole system of the world needs to change. That's going to take some time. The Tall Poppy keeps people on their toes and is a herald for our best interest whether we like it or not!♥️♥️♥️", "sdj82sdj": "Stay strong!", "almighty.gvtor": "🤡🤡", "doyouneedtoknowwhy": "G*d bless you children. Thank you.", "shubhampanwar2002": "👏👏👌👍", "martoerhardt": "💚🙏💪", "karajuana_": "GRETA TALK ABOUT ANIMAL AGRICULTURE PLEASE", "im.not.t0xic": "How old are u?", "jeddingens": "Dear Greta, You are nourishing the heart of a great new Nation that knows no boundaries. Keep surging, keep inspiring, and let love be your unfailing compass.", "karliiv_yiim": "Praying my country, China, would help. I have to admit, it would be rather hard, but I hope someday, maybe someday, everyone will try to contribute to this 💙 Love from China.", "bassinbohndo": "This whole narrative is about money! Here you have a 16 year old playing angry girl now with 5.6 million followers. She’s making big💰 - it’s not about the climate change it’s always been about the money. It’s always about the money. Problem is they need our money for these assholes to make theirs.", "11neros11": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "johnpulido417": "✨💚✨💚✨", "jamie_m107": "U poor kids, go back to school", "solankisraj1": "Amiguita que dios te bendiga # gretathunberg", "gabrender": "The New world Leaders👍❤️", "merche_palme": "💙🙌", "pietroscompa_": "Mettitelo nel cul", "ahoura.cyrus": "💙", "pedromennaferreira": "sua comunista retardada", "fridhaay_": "See ya👋", "agomez_9": "These are fucking kids people are we really fucking supporting this", "ceylandio": "🇧🇷👏👏", "carmenlccannizzo": "😍💪💪💪", "urantech.store": "Venom, Rick Sanchez from Rick&Morty, Jason from Friday 13, Purge, Ariana Grande and other LED Maks for Halloween!👻 check it out!👻🎃", "cparkr_": "🤡", "viosuniverse": "👏👏👏👏👏👏", "mario.rossi876": "💪", "helene.snna": "Youre so amazing!!😍", "johannes.bhf": "Sikerem AMK", "dezndotcats": "👍👍👍👍👍👍👍👍👍", "mlodylaurak": "You are our inspiration and hope!!!!! Keep going girl ❤️ You're a hero 💪💪👏👏👏👏", "torstenradtke": "Many thanks for this great step.for my child's future🙏😊👣", "peshvabaazee": "👏👏 So Please to see You Greta.💙💙💙💙💙💙💙💞💞💞💟💞💞💞", "shiquita16": "Why you do not protect children from gender ideology??????", "_jnz04": "@neox_cartoons", "thestatelottery": "In solidarity", "fr_ancesco_anzi": "Dobbiamo rispettare il mondo", "g.a.r.y.e.v.a.n.s": "CHINA", "werestuck": "Hi there instagramer! Do you want to know more about our current world problems and It shows? Then FOLLOW US! You Will also find a new charity twice a week and have the chance to donate money to make change! How cool isn’t that? 🐠💙🌱🌳", "boskophoto": "Greed hmmm I am barely paying my bills, my parents are poor, I have not stocks nor shares in any companies, and I hate rich fat men and bankers! Yeah you know me well douche bag!", "_stefaniaortiz_": "Su le mani per greta Milanoooooo", "anaflaviareikitheta": "👏👏👏✨✨🍀🍀🍀", "alluneedisluff": "👏🏼👏🏼👏🏼👏🏼👏🏼 Thank you @gretathunberg", "desiyatrii": "Trash", "elena.r.sersen": "Anyway 👀👀", "bowling_alley_carpet": "Thank you for standing with us!!", "deschmellen": "❤️❤️❤️❤️❤️❤️❤️ You go girl!", "littlebudgiefamily": "💕💕💕💕💕💕💕💚", "luca_cap04": "Why are u still alive?", "cookie1love": "Just one question . How many trees 🌳 did you planted till today?", "lenaacnilsson": "👏👏👏", "ave__j": "Thank you so much !! You all chaining this sick game and let me believe in our future! We're so strong together! @gretathunberg you are 10 years younger than me and I've learned so much from you !! You are my idol! Thank you !! You got my fullest respect. To you all out there !!! don't miss this, everyone counts. go out and save our home !! I will - this friday - in my hometown Frankfurt am Main - Germany !!! Hope to see you all at the streets ! Save our our 🌍 !!! #teamearth #savetheplanet #gogreen #fridaysforfuture #gretathunberg", "vi.vi.d7": "Pehli fursat mein nikal @gretathunberg", "__deeepz_": "Gud going girl.. Well done", "hexelucie": "👎🤮", "theotisandsamshow": "Good work!", "easyway2learn24": "❤️", "kirstenklene": "💚💚💚", "lzesales": "The Amazon is from Brazil, your opinion about the Amazon does not count, because I live there, I saw no burn, puppet of false news and communists", "mabel.inca": "Bravo 👏 I 💕💕💕", "julzblack321": "True soldiers ❤️", "prana_air": "👏👏👏", "didiandersonx": "And the Cherry on top is Trump being impeached!", "roma_support_81": "Con la cadena de oro el de alado", "uilsontsilva": "Tmjforever😂", "theglossarymagazine": "💗💗💗", "datepie": "@dreamnowdo", "lenastrombeerg": "💞💞💞", "poetnsen": "👍😆", "pep_ensesa": "This is gay", "prinsessa_ss": "Sär grupp", "weshalokh": "She is a voice of despair. Not an icon for the youth", "creative_photographer1955": "Man made climate change is bullshit. Made up nonsense man cannot stop this.", "nielsenarms91340": "@gretathunberg in America your complaint doesn't mean anything here", "cum_spaghetti": "DU FÅR F", "mamaurasolove": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "enesmutluer_": "Orrruspu çocuğuuuu 🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "polanskar": "🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹📢", "edoardo.galimberti": "@marco_zibra, @i_am_dala, @erica_ostini", "furkanizgix": "Sümüklü 🇹🇷🇹🇷🇹🇷🇹🇷", "snorkmaiden42": "⚡️⚡️⚡️", "gabrielerizzoo": "Ciao Greta", "annikenbinz": "You go girl💥💥💥", "emma.fox.wilson": "You are a world leader ✊🏻", "carolinereidartist": "Great stuff", "est4nis": "🔥", "jose062675": "It was hell waking up to my wife growing so cold with me and basically don't have sex with me anymore cos she said she love me but not in love with me what the hell is that anyway. It was so bad that she moved out and for 6 months it was terrible for me so i had to look for a way out and find about Dr Obudu who I read so many testimony about his great work of getting ex back and saving marriages with his great spell and I did contact him today am happy with my wife as she is back to me and we now have sex like a happy couple. This took Dr Obudu 6 days if you have any problem and need help contact him on + 1 5 0 3 7 7 3 9 1 1 4 he will make your problem go away", "nooneimportant82648": "Retards", "ahmettpskl61": "Idiots", "bortstuggu": "Love you! Keep going 💪❤️👍😍", "allebergqvist": "@gustav_einarsson", "felixlycke": "Disel bensin❤️❤️", "chocolate_snob": "Where can we find the attendees and the absentees of the climate summit?", "skyabove_earthbelow_firewithin": "@gretathunberg 🙌🏻You’ve already changed the course of our history. Let that sink in. THANK YOU 🙏🏻", "sarahkpriestley": "Thank you Greta for all you do", "wjsmiller": "🤡🤡🤡", "eymen_turgutt": "KIMSE BIZI SIKAYET EDEMEZ AYAGINIZI DENK ALIN LAN🇹🇷🇹🇷🇹🇷🇹🇷", "pernillabaralt": "Could not be more proud working for @unicef Working everyday with partners to make a reality for children’s rights including the right to make their voices heard #ForEveryChild #CRC30", "beratchangr": "🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "albert.betta": "👍", "shyamsundar5301": "👍🔥", "ker_stin2018": "❤️❤️❤️Greta😍❤️❤️❤️", "caro_lasso_stein": "💪❤️🌍", "jaki.347": "Go back to school little child", "thelatestshoutout": "The Real Avengers", "sofiatagtstrom": "👊🏼", "ally_irvine": "What you are doing is incredible 👏👏👏", "goodwell_livewell_coaching": "I love how your being so serious about this, but don't give a shit about your education 😂😂😂😂😂😂", "noplacelikehome.nl": "💞👊💞", "bertha_rina_mirsky": "And they say that kids/youth are lazy and don't care ❤️🌹❤️", "its_cherinet": "I had a wonderful interview with you", "jo_buddha": "I hope you never ever read my comment because that means you‘re staying clear of the comment section and all the bullshit published here. Please don’t look at all the dumb things people have to say.", "francesco_cesaro_": "- thunberg + tuborg", "jusustainability": "👏", "666luziferia": "I've never seen so many Bullshit Comment's!We haven't bought the Earth,but We are stealing it,from our Children and their Children! So stop telling her,that it would be better for the Climate Collapse, if She go to School!That will never save this Planet!Fight,as long as such Stupids, learned It! 👏👏👏👏👏👏👏Greta,you have my deepest Respect! Susanne from Hamburg 😊😍", "iarafoschino": "🙏🙏🙏🙏🙏🙏🙏❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😍😍😍😍😍😍😍😍❤️❤️❤️❤️🙏You are all amazing ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "keremmoztuncer": "Ananı sikeyim orospu", "idaostensson": "Yaaas 🔥 action!!", "ostlinglind": "💚💚💚", "girlstar14": "Can you add Australia to that list?!", "eyupyagmurr": "Orospuuu", "hooniefeltham": "Well done Greta. Such a good idea to invoke the UN Convention! Brilliant!", "thisisnehabisht": "👏🏻👏🏻👏🏻", "emirserinyurek": "Ananı sikim", "theycallmemayo": "Wow this is amazing", "anita.s.bergstrom": "♥️♥️♥️", "linarocontini": "😍💚🍬🎀😘🎈", "rachmm66": "Go Greta ✊🏻✊🏻", "worldmovementorder": "Please check DM!!❤️", "cbmjain": "Greta will you marry me?", "drheididouglass_nz": "Wow, thank you, 💚😊", "rievoddercouture": "💚🌿🌱", "the.wonder_wolf": "🔥🔥🔥🔥", "ikke_i_bruk_123_ghj": "❤️❤️💗🌎🌍", "lilleyogahus": "Who would ever have thought the adults would leave the climate crisis to be solved by children? Children are truly our light", "gispert_chauveau": "Great Greta.", "mikaelanylund": "❤️ ❤️", "commiecobie": "Noice", "sanfranjane": "Beautiful 😭💗", "ravi_banns": "👌👌👌👌👌👌", "emre_candan4554": "Hepinizin aq", "beth_speedsters_always": "you guys are so inspirational, making the world a better place for our generation. thank you 💛", "karinhorvallius": "💪❤️🌎", "reza_zaheli": "Greetings to you active successful girl👏🏻✌", "faten.allawi97": "Please filed complaint against iraq the government are complete assholes the Heat and the pollution are unbearable the oil Fields are working 24/7", "charlieberlin": "THANK YOU", "savin.sathyan": "👍", "maxi_d_s_": "Can you please tag them 😊", "fernda_avila": "Why is Argentina on the list of the most polluting countries? I do not understand, we are not a country compared to the United States, China. To say that we are one of the main polluting countries makes no sense.", "paginaemquarentena": "Você me dá medo 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "noramtzleal": "❤️❤️❤️❤️❤️", "giulay.80": "❤️💪🏼", "berthaaguilar2661": "🙌🙌", "mugwortea": "🙌🏼🖤🙌🏼", "erinsblurbs": "👏🏻👏🏻👏🏻👏🏻", "shristimaurya307": "So madame when are you throwing away all the air conditioners of your house. When are you reducing your paper consumption? Be it in the form of toilet paper, tissues or even the ones used in the protests. And do you travel through all the places on foot? Coz car emissions too cause air pollution.Looks like you're the most concerned human on this planet for the planet. Or are you just faking it bitch?", "bluesalt.art": "It's not just the system of operation that needs to change on planet earth but our system of thought. Anyone with Aspergers cannot simply ignore a major injustice as though there was no crime. Greta's \"success\" (although she would accept no such recognition until things began to improve in a major way) is because she experienced a radical shift in her framework of think upon learning about climate change. Change always happens it's our thinking system that will determines who survives, who thrives and who will not.", "carolinalagerwall": "💪❤️ Awesome!!!", "sundri_narayan": "🙌🏼🙌🏼🙌🏼🙌🏼", "supriyatoletyart": "Thank you so much for trying to make a change, for trying to push those in power to put into motion the required action to stop the polluters. Your efforts will be remembered and revered forever. Stay strong and ignore the haters. Love from India.", "supriyatolety": "Thank you so much for trying to make a change, for trying to push those in power to implement the required action to stop the polluters. Your efforts will be remembered and revered forever. Stay strong and ignore the haters. Love from India.", "2020benco": "dum dvärgslampa", "clark_kent_0815": "Greta, do you and us a favor and drive back home and go to school. Your father has now made enough money with you !!!", "vernamarilena": "👏👏👏👏👏👏👏👏👏👏.", "seasun.love": "🧡🧡🧡", "enzonuttela": "#slasher #bonecoassassino", "meganhascats": "🙌", "chansondelaterre": "We are behind you completely. Thank you for being the voice we desperately needed. ❤️", "gypsywild84": "So proud of you, little dove!!!", "marticurto_": "😍", "williamf__________": "❤️", "roz.tehrani20": "❤️❤️❤️", "lukas_reschke": "I love this so much thank you and I love you shoes", "roth.azulik": "🌿", "shoprevari": "You are such an inspiration! Keep up the amazing work, we’re right there with you! 💪🏼💚", "amberkrobson": "🙌🏻🙌🏻🙌🏻🙌🏻 Yes!!!!", "susanjoy": "Go get em Greta!!", "camille.celeste": "@josh_f32", "chaylien_": "You are making big waves in the ocean, thank you for being our voice. ❤️", "mwfamilyranch": "No nasty glances at our president Greta. There's more than just the USA you need to look at. 😡", "robbienimmons": "Who asked", "totallynotrijah": "ouch I’m moving to Saudi Arabia", "vivianaverastegui10": "✨✨✨🙌", "laissaanja": "👏🏻👏🏻👏🏻👏🏻❤️", "pee_to_tha_jay": "So greta when a volcano errupts who should we go and hunt down with our protests ?", "holger1803": "👍. 👏", "rosetta.defranco": "👏🏻👏🏻👏🏻", "swedenborgken": "Viktigt inlägg som stöd för Greta och alla unga, som kämpar mot en numera fullt möjlig klimatkatastrof, och de ska ha all heder och respekt för detta! -Äras den som äras bör, Greta med medhjälpare!  https://www.nzherald.co.nz/nz/news/a...ectid=12270875", "gocoronakiller": "Your Jewish agent @gretathunberg", "be_not_deceived": "Shouldn’t you kids be in school?", "julie_was": "Ah... yes... another reason to be proud of being an American these days- look who we share the “have not ratified the rights of the child” list with. I always hoped we would join the ranks of Russia, Saudi Arabia, and China on day! Death penalty and now this! So proud!  NOT!!!", "ingridhesser": "💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚", "tanny.shaab": "👏🔥🔥", "coyotebeaver": "Right on!", "nanoraies": "So proud of you and these amazing brave children! I’m honoured that I sang for this cause, and for you all at UNICEF yesterday 🙏🏻💜", "deokie_tt": "Excellent", "bennjaaa__": "a las naciones les chupo 3 huevos", "sharonolszowka": "❤️", "seguridad49": "Saludos grande amiga greta y gracias por tu entrega que Dios y la virgen te proteja siempre un beso grande 🌹🌹🌹🌹🌹🌹🌹🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "dossirules": "With you❤️", "scottbarrels": "🙌", "gabriela.fossati": "So proud of you and all these brave children. This is something WE should have done before you were even born. I am humbled by your strength", "dennisoliveira": "👏🏽👏🏽👏🏽🙌🏽❤️", "crystaldelphia_one": "They have been lying to you your whole life. Over the last 40 years of my life every 20 years they said the climate would kill us in 10 years. Perfect example of this is \"the Inconvenient Truth\" Young lady, the world is not ending. There is no extinction coming. This is nothing more than a push for more government control over our lives. You have been lied to.", "acosta_ju123": "Viva Greta! ❤️", "pip3dr33m": "Please Greta, can you address the Australian Priminister directly via tweet or something and condemn him for not showing at the climate conference? He was actually with Gina Rinehart, the woman who owns all the coal and iron ore mines in Australia. @gretathunberg", "lisajkb": "“As we burn fossil fuels and atmospheric carbon levels go up, the ocean absorbs more carbon dioxide to stay in balance. But this absorption has a price: these reactions lower the water’s pH, meaning it’s more acidic. And the ocean has its limits.”", "lgreenspan29": "👏🏼👏🏼👏🏼👏🏼👏🏼", "sharon_karyasa": "Extremely proud", "wayneawsvancouverbc": "Very proud of you Greta🌟❗❗❗❗❗May Allah always make things easy for you Ameen Ameen Ameen May HE remove all obstacles from your path Ameen Ameen Ameen", "c.ledge": "Cunt", "yungboicody": "Cunt", "thee.lizard.king": "Love seeing people accomplishing nothing bc Russia and China don't give even the slightest f*** about your legal complaint.", "mollyrjj": "There are always these comments like “oh, she’s just a kid trying to be an adult” or “she’s promoting a leftist agenda” etc etc, but take a second and look at what Greta is contributing to the world—she is a role model for our generation, she is passionate about an issue and actually DOING something to bring awareness to it, and most importantly, she is influencing WORLD LEADERS to take action on a REAL crisis that threatens our planet. Before you criticize and hate on her, inform and educate yourself, and reflect on this: while Greta is out there, fighting for the environment, what are YOU contributing behind your phone screen?", "therealbrittanymanville": "🙌🏼🙌🏼🙌🏼🙌🏼", "ecarlate3": "“Yesterday I posted a photo wearing a borrowed T-shirt that says I’m against fascism. That T-shirt can apparently to some be linked to a violent movement,” she tweeted. 🤔", "july_sublett": "Thank you thank you thank you 😘❤️❤️❤️❤️❤️❤️❤️❤️❤️", "thenatalieaguilar": "Thank you. ❤️", "amyjirout": "❤️💪❤️", "instituteforanimalhappiness": "Cheering for this team!! 🙌💚🌟", "jessicadettmannauthor": "You’re all absolutely wonderful. 👏👏👏👏👏👏👏", "josiebellart": "🌳", "thismodernidea": "Dear @Gretathunberg you’re the hero we need, not the one we deserve.", "sarahneczwid": "Awesome!! Thank you!! You’re all doing great work.", "moonblue1122": "💐💞💐💞😍", "natalie.t.saavedra": "Gracias no te rindas!!", "echowhiskeybear": "Angry little MK Ultra Hitler girl. Go home. Get some therapy. Things will be OK.", "ameliaacoleman": "💚💚💚", "lcbrunet": "👏👏👏❤️❤️❤️", "peilinlu": "U go Gretaaaaa!!!✨✨✨", "ljgarman": "I support you!", "sya.avery": "and they say the whole Asia is the cause of global warming 💀", "therealjvilla": "🙌🙌🙌🙌", "awm_awmi_21": "👏👏💪", "jensmithledford": "❤️🙏✌🏽", "linds_gibson": "You are amazing and such an inspiration to all! Thank you!💜💜💜", "denmarkey": "You’re such a spoiled brat. STFU.", "lorenaceciliaparra": "👏👏👏👏👏", "deepshikha.chauhan.779": "You are the light of hope, we all wish to be. You are the encouragement we seek to be. You are we all should be", "ninasolstice": "💖", "nani___0": "😘", "kimmcann": "😅💞🌏", "kjagersonny": "Child trafficking organization", "astral.fae": "Hi Greta. I don’t know if you will see this or notice this. But all of these people hating you for standing up and wanting to make positive change have their own demons to deal with. Use their hate and turn it into fire and passion and spite. Keep doing what you’re doing. Those that point a finger at you in disgust will thank you later, or at least wish they didn’t discredit you. Have a good day/evening.", "pugsrule808": "Thank you ❤️", "lindawelch04": "Hooray!", "sandhya_sandy_23": "I want to join with you sister @gretathunberg ... I'm from India", "chloemckennaaa": "@heirstoouroceans YESSS", "lmcmanman": "People need to draw the line where they spend their $. Stop supporting the companies that are destroying the 🌎", "cathouse81": "✊🏻 Respect! 🙏🏻 Thank You! 💪🏻 Stay Strong!", "saraths1996": "@gretathunberg.. I support your views and all. But one thing, criticizing the entire generations before us. Even some of them wanted to change this but they just couldn't reach other people like you can today. Understand their limitations before you blame the entire generation and start doing things. What we need are not speeches but action. 🔥🔥🔥🔥🔥🔥", "warehammer": "I’m so proud of you", "pureform_pilates_physio_avalon": "Thank you Greta & all these other amazing children 💞💞💞💞", "oakley_hadaway": "Climate change was created by Maurice strong in the UN to benefit his Rothschild and Rockefeller business friends who at the time of supporting and creating it was also in the oil industry still pumping away, as well as being appointed to more oil companies in Canada.", "misssalomeshead": "💚💚💚💚", "luciaglima1": "Greta Thunberg x George Soros", "antoniapimentelferreira": "Parabéns! Greta vc é a voz dos nossos jovens para o mundo, esses nossos governantes deveriam ter você como exemplo na defesa do sistema climático do nosso planeta", "diannemccowen": "Cant find link in bio?????", "hcloudtighe": "thank you", "godisking_christianae86": "#neverforget #racistdebramessing #frommycolddeadhands #KAG2020 #takethemicfromtaylorswift #metoo GOD is great🙌🙌🙌#ifitbleedsitleads #godisgood #godisgreat #christianphobic #maga🇺🇸🇺🇸🇺🇸 #Trump2020 #kag #blexit #lexit #walkaway #itsoktobewhite.#itsoktobeblack #latinosfortrump #asiansfortrump #istandwithtrump #fakenews #cnn #demsnbc #buildthewall #straightpride #stopthebias #2ndamendment #theleftcantmeme.#bringbackalexjones #freethinkers #thegreatawakening", "swedenjamaica": "😮", "taluna78": "👏🏽", "mechelleanne": "You are a queen. Honored to hear you ♥️", "margaretnotmaggie": "Please ignore the negative comments. From one neuro atypical person to another, I see what you are doing and I know that others are blind. You understand what must be done and have a clear view of the way forward. Thank you for persevering in relentless pursuit of that vision.", "wtmluisa": "girl boss", "hi.im.ehma": "Support from Toronto! Pls come her next", "paulajuarez_ph": "👏👏👏👏👏👏 thank you!", "arkaaaadius": "A bunch of indoctrinated kids 🤦‍♂️My question is where are parents? Ohhhhh I forgot..... They are antifa members. You said that someone has stolen your childhood... Blame your parents, they've taken you out from therapy and school so that you can act as their money machine.... Pathetic", "dainamariephotography": "Should have added Australia to that list @gretathunberg", "yogahoopla": "👏👏Keep it up! So shameful that the US has not gotten on board😡", "stonekoldrock": "You are a brainwashed pawn in the globalist game. Stop spewing the rhetoric you hear and are told to say, and do your own research. Stop being a fascist puppet.", "lovejengrant": "🙌🙌🙌", "spacecadetkala": "Hi Greta! I love what you’re doing! Keep it up!  I wanted to double check, I just looked up the CRC treaty on un.org to see who has ratified and it looks like Russia, China, and Saudi Arabia have. This is the first I’m hearing about it. Good stuff!", "molzmcgill": "🙌🏻🙌🏻🙌🏻 Yes. Thank you all for your perseverance and personal sacrifice for us all. We’re ready to step up our homegrown efforts when and how again.", "melania629": "Amazing!", "lachicasustentable": "Amazing !!!", "vcalderon.u": "Chile no tiene ninguna ley que favorezca al medio ambiente, tenemos en todo el país problemas sin resolver y que los políticos y el actual presidente no hacen nada. Fue premiado por los corruptos internacionales.", "kylerusso_": "Butt", "robertapfingstensr": "#nobelforgreta", "alaw240": "Lol these countries are quaking at a bunch of school kids school project.", "goddessmoon11.11": "Yes!!!! 🙌🙌🙌", "jesaroundtheworld": "Wauw...you went there huh? Nice to see you took another 15 kids on too your band wagon. Also funny how “conveniently” you choose not to file a complaint against US, China, Russia.... I see you are starting to get the hang of politics as well..... US has truly done you well! 👎🏼👎🏼👎🏼👎🏼", "mayeaguilar": "Gracias por tu valentía y coraje, eres una inspiración!!! ❤️", "jorge_1600_3200_5k": "How much did your parents beat you, im 17 and i still havent broken", "thesoundoholic": "Thank you!", "nancypalooza": "THANK YOU GRETA!", "karemedler": "You are amazing Greta!!!", "angepeggers": "@pegramdarren", "patricia_vidal_ba": "https://www.google.com/url?sa=t&source=web&rct=j&url=https://m.elmostrador.cl/noticias/pais/2019/08/02/contaminacion-informe-quintero-puchuncavi-ninez/amp/&ved=2ahUKEwi11OraxujkAhURK7kGHdDFBGsQFjAAegQIBxAC&usg=AOvVaw05QLI2BkasE-ZMD-WpfX6x&ampcf=1. 🇨🇱", "cantormaylssonn": "Hipócrita", "adrianmck": "🙏🏽🙏🏽🙏🏽💪🏾💪🏾💪🏾👏🏽👏🏽👏🏽❤️❤️❤️", "3x3__stories": "Using the law is a slow process but ultimately it is one of the most powerful tools available. As a law student, I’m always excited to see people dive into the legal process to effectuate change. Can’t wait to see where all of you go next with this. 💓", "ramirez_miryam": "👏", "julianaalmeida8737": "we are all with you... TOGETHER WE'LL MAKE A DIFFERENCE !!! @gretathunberg", "top_gun_abran": "Eco fascist poster child", "myriamlaraacuna": "❤️❤️😍", "fquintner": "❤️", "conservatives_california": "she is not the brightest book on the shelf", "riozerovinteum": "YOU DO NOT REPRESENT ME", "the_48": "FINALLY..!!! A MOVER!!! To This Generation I Say... YOUR PARENTS ARE BURNING YOUR HOUSE DOWN... AND THIS WHILE THEY SAY I LOVE YOU... #GreedKills #GreenEarthLives", "euluizcarlos.oficial": "Convido você pra conhecer a situação da Venezuela, país que o socialismo do Chaves e maduro acabaram com a Venezuela, venha conhecer o socialismo que deu certo, deixou todos pobres na miséria e sem liberdade #hipocrisia", "soldado_renato": "#bolsonaro2022", "cabinetofmillionaires": "🏆", "valentinamaria71": "I can't believe there are comments that are insulting her or trying to tell her she's wrong, imagine being so immature", "tadeucarlos2010_": "You are a bad actress 😂😂...Looking for fame?Grow up first.Don’t lie,become a woman!!🤦🏻‍♂️🤦🏻‍♂️😂😂", "pepiconelizabeth": "🤗", "maya_fiset_comedienne": "😍", "brookeellee": "God bless you and your bravery and maturity 💕💕💕", "careaboutclimate": "Good ✊🌎", "phsimensatto": "💩", "brandon_herrick22": "Go talk to China", "telephonebuildingbeacon": "So encouraged by their work. Amazing 💕", "the.new.old_diana": "#mkultra #soros follow the money ppl.", "alteazza": "Shut up little girl and go back to school you can’t change mother Nature", "kuyabdl_qq": "I find it hard to believe that this person honestly has 5.3 million followers 🤷🏻‍♂️", "alexneto33": "Lyer!", "annica.lundmark": "🙌", "scarlett__pearce": "always love & support 🙏🏽 don’t listen to the ignorant and hateful. those with any sense stand with Greta!! ❤️", "nandasilvaesilva7": "Blá blá blá blá blá blá blá blá....💩💩💩💩💩💩", "ericmarkert1": "Ur a literal communist", "theokusetya": "@davidmileshogg you and Greta look so perfect for each other", "jay_carrot": "U r all wearing clothes made by factories in China that contribute to climate change", "ryan_ravioli": "attaining bread for the planet", "earthaltar": "👏👏👏👏 🙌🏻🙌🏻🙌🏻🙌🏻", "martinjaviier_": "Teni cara e chana", "beau.delachapelle": "Anyone who fallows u is a dumbass", "lalisaracl": "You complain of a few countries like Turkey because they pollute the environment ettin. graphics but says that it is low in Turkey's carbon emissions.", "veganed": "Go vegan like Greta!!", "satanic_spartacist": "Great job! Watch some ContraPoints or Philosophy Tube, I think both of them can really help you develop your politics as you get older", "bobby_day03": "debate @thecjpearson", "_nicolas_gohler_": "Do whatever it takes we all belive in u!!!", "cea617": "You go girl!! Don’t listen to the bullies! ✨", "ali.ahmadi.no": "Fools group. All together 🐖", "meargomez14": "👏🏼✨🙏🏼", "rileyackles": "stop bullying a child wtf is wrong with you guys", "the4489vvbn": "Fake political lies", "chanymullins": "World changers!", "hailthenarcissisthero": "Your parents approved of the world, as it was and as they saw it would be, when they made the decision to have children.", "emanuelsiqueira_": "🇧🇷🤩", "ignacioabayay_": "Parecí pitufa entre todos esos wnes 💓", "m.t.rex67": "I'm a Middle Eastern child: In a world where people in poor countries die because of poverty and war, in rich and developed countries, some of the kids worry about global warming and the extinction of polar bears, Is rescuing polar bears really more important than endangering a human life !? 🤔😐🤐😑😶👎", "finottifelipe": "Demon 👿🤡💩", "_rachelpachel": "Greta, you are making a change. Today my class watched your UN talk and broke it down. We declared it the “best speech after I Have a Dream” so you can know that the world is ready for you. We are right with you.", "maygraham89": "💗", "mudaddscharacter": "So proud of you baby girl 🔥❕", "uptempogirl": "Youre so wonderful!!!", "debileebee": "You have shone a light !! Keep shining ❤️❤️❤️", "rodferbo": "💥💥💥", "just_a_lonely_goat": "So proud of you hun, keep up the good work and don’t let anyone put you down 💖", "soyjorhancastillo": "🙄🙄🙄🙄🙄🙄 bla bla bla", "hdrmonitor": "Gretard", "ashxamiri": "💙🙌🏽", "theodorekrentz": "♟", "jimmy_phadphom": "Climate change is not important", "_geraltt_": "and the oscar for best acting goes to ......", "claudinhamcribeiro": "💕💕💕", "antifaisgay": "Greta is a nazi", "sumarsenalfan123": "Do you eat beef?", "shmarklar": "Stop letting them use you", "jban_1984": "Péssima atriz 👎🏼", "denisesmusic": "I can belive that u are suing Argentina, Brazil, France, Germany, and Turkey and leting out of it China, EEUU and México. Besides Argentina has no money to change anithing, we have lot of people starving or without jobs with a debt to pay in the next 10 years. Trump says ther is no climate change but EEUU is not in the list...", "helebonn": "@leighhalove", "cristabla": "could you mention the famine...", "ajleveris_6": "🤡 how dare u", "_carlaccunha": "You rock @gretathunberg 🌻 I'm with you in prayers!", "dachegeigerii": "👏🏼👏🏼👏🏼👏🏼", "yogasamba": "🙌💕🙏🏼", "nicheguccis": "GO GRETA! DONT LISTEN TO THE HATERS", "juligodoymza": "Gracias @gretathunberg por todas tus fuerzas, tu valentía y tu presencia en éste mundo! Te admiro desde el corazón, y cada vez que te escucho o te leo, me emociono completamente 😍 Te amamos, Greta! Sos grande! 💞", "corporalcuck": "Climate change hoax?", "mohammadgh28": "Thanks girl", "makinitup101": "Stop your crying & whining. You are ignorant to the world. How DARE you talk as you did. Fuck off hypocrite!! Where did electricity you used for your whining come from!!!!", "melissapejagger": "We love you all thank you for everything you guys are doing and don’t give up 🇨🇦🇨🇦❤️👏🙌", "makiii_omoriii": "💛💛💛💛💛⭐️", "elaineflx": "😂😂😂😂", "linea_flexo": "❤️❤️", "cecilleweldon": "Boom pow. Bring on the new age, the new economy - 🌿🙌", "adventuresofcdub": "💗💪🏻 🌍 💕", "cristianow9": "Tzr", "michelle_lafondah": "@jamesbolton_official awesome", "shivaloka_soul_jewelry": "❤️❤️❤️", "ubergecko_": "Cringe!", "lottieottie": "You are an amazing young woman. I am sorry my generation has failed your generation. You give me hope.", "orlandomonte.s": "Don't give up!!! You're doing a perfect job and it's just the beggining!!!", "micasolpasut": "❤️", "junzhangofficial": "Not impressed, anybody can complain nobody knows how to solve. Even if she isn’t she sounds like a privileged brat complaining about everybody else while she is doing the same. Matter of fact she probably fly (aka CO2) if you want to lead, lead by example not by shouting to everyone else.", "stachelrochen_": "Thank god for you. I may be far from perfect and I hands down own a car that I drive daily and a lot... unfortunately, I do not have many alternatives- but thank you. You are an eye opener to the world and I will do what I can I’m my power to help. I don’t know if you guys have a major donation center or anything but I will gladly donate what I can as I can. I wish our generation before yours had the courage to stand up as you are. Your fight is just beginning and I pray that you succeed. 10 years for change is too long. Example: Colorado is making it mandatory in 5 years that some 5% of cars on dealer lots have to be electric. I believe we are in need of 75% not 5% and not in 5 years more like in the next year. We are moving FAR TO SLOWLY and a little patch here and a little patch there may solidify happiness to many, because the DO NOT UNDERSTAND, the Severity of our planets actual condition. I think all countries and states also need to make any car older than 15 years illegal. I get that is difficult as many people cannot afford “newer” than 15 year old cars. I get that, believe me. But we need to start doing things now. 15 years is quite generous.... just sayin. Thank you @gretathunberg Thank you 🙏", "theavocadotribe": "🙌🏻🙌🏻🙌🏻", "chad_billington": "Pray for this child and protect her at all costs! Go Greta!", "daniellyhauser": "Globalist Puppet !!!", "ceblanks": "@wet_matt", "ale_nakashima": "キモい、vc é nojenta 💩", "jackiemurciaxo": "Absolutely amazing. Thank you!!", "katherinne.cabrera": "❤️🇨🇱", "anto_nini": "gracias!!!! 👏🏻❤️✨😻🤩🔝🧡", "desire.sephine": "Well done! We stand with you 🙌🏽", "notlawnalyd": "why is she famous please tell me", "marcelosekeres": "Fake...Project of soros", "regienk": "Go back to s hool", "davis_boone101": "🤡🤡🤡🤡", "james.league": "Greta you are an actual dumbass", "vanvandutra": "Vá estudar.", "calebsthomas": "You look fucking retarded", "ha_jar198": "I love you❤️", "kilel691": "Greta halt die fresse", "carolinjernstrom": "👏", "alikary2019": "🙌😍😍😍", "willmoldenhauerr": "U just had to add the “with aspergers” in ur bio", "mdogg_420": "Climate change is a massive scam on the population of earth.", "aitanaroda": "You're just saying what you're told to say. You're just a political puppet", "bodie_punta": "Brasil los necesita. El Amazonas está muriendo!!", "rohit_tetali": "L @the.edwin.t", "kick_u": "why you don’t play with your dog anymore?", "makeup_4_the_dark_heart": "The world needs more Gretas!!! Don't worry about all these chump supporters... Ur doing great babe... 🖤❤️🖤❤️", "suzannelolsen": "Good stuff! Keep at it! Your message is getting through to plenty of people. 💚💚", "majumagalhaes": "Uauuuu 👏🏼👏🏼👏🏼👏🏼 @catarina_lorenzo siga nessa!!!! Orgulhando a Bahia! ❤️", "jimijam_shadowman": "👏🏼👏❤️", "damo.2017": "This 5G IS SOMETHING THAT NEEDS ADDRESSING WITH THE GOVERNMENTS", "franciscoafilho100": "A @gretathunberg faz discurso de ódio e raiva e os direitos dela foram tirados pelo @georgesoros que se utiliza de sua fundação para intervir em soberania peli MUNDO!!!", "corey.flanders": "Does anyone know if she’s religious or not", "begocabellonakasu": "Great, great job", "till.e.y": "The USA is among the countries that contribute the least to this apparent issue. You’re fucking retarded.", "flaviamontenegro9": "😘😘💪", "goodbyeinstgram6": "You are brainwashed!!", "stevewiliams677": "On God I’m just tryn get my money up an make my day 1’s prada me.... fuck a tree lets get that real green up first 🤧💵🤑🔥🏁💯😈", "haleyauthor": "You are incredible!!!!", "janwerda": "👏👏👏", "vinivga": "Now back to school... unless @georgesoros made a huge money transfer... you know he is old and soon will be burning in hell so... safer to study 👍🤣", "hayleyfrankart": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "jadenlamson": "Sucks to be you lmao", "_asaphack_": "Ass burgers", "suebakerartist": "✊🏼✊🏼✊🏼✊🏼", "tbbesmer": "Fake", "chrisracchini": "you're unreal", "liamengsl": "nazi", "dokedoyle": ". . go back to school @gretathunberg", "sezertoker": "🇹🇷🇹🇷🇹🇷", "vie_intentionnelle": "Bravo Greta", "paola_calafiori": "You're so inspiring!", "gpagejeffs": "👏 Keep going Greta! 👏 You’re the change I want to see in the world.", "patrick_tandy": "⭐️👏👏👏👏", "vegederrian": "Thank you! Stay strong! Unbelievable that the joke of a president is mocking teenagers for caring about the planet.", "madelyn.weaver2000": "The USA is too afraid to agree to children filing lawsuits", "emilysilveira25": "💩💩💩", "ben_robinson2003": "Global warming bullshit no 🧢", "rominaricar": "Sos increíble 🙌🏻💖", "pedrotriguinho": "💚", "_______________________gab": "👏🏼👏🏼👏🏼", "micahmaniax": "Your so fucking ugly when you cry tears run down your back", "tylerevje24": "Are u fucking retarted", "ishuhot": "How dare you", "joy.shenn": "Why are you blaming the nation's who aren't the biggest polluters? Go and make a speech in the countries you filed a lawsuit against", "dphilll": "You’re a straight G", "floriasigismondi\nVerified": "Verified", "roseh71953": "Bless you Greta! 💕💕", "lolarabbit": "👏👏👏👏👏", "se7yu": "👏👏 I would like to support japan", "smashdpotato": "Heroes", "gkamyar": "Greta, there is only so much the governments can or will do. Why not focus on the normal people, kids, families, athletes, etc. and try to teach them what needs to be done also. This fight that you have started is fantastic and it is spreading all over the world, but once the media forgets it because of some other “hot” news, your message will not be heard for a while. That is why I think a movement to teach the 7.5 billion non-government people on how they can do their part to help the environment can also have as much or maybe even more effect. Thank you for all that you are doing for all humanity... best of luck to you and the rest of the earth’s population!", "leslie34andrus": "Hey bossy girl go home and stay home.... stop telling us what to do.....", "dozer_only": "You don’t speak for me and how Dare you think otherwise! I can’t stand your face!! Fk off", "jackieblue_": "You are all such an inspiration, thank you thank you thank you for everything you are doing🙏💖", "boi_ca": "Poor girl needs help", "stephyaya23": "💯💯💯 We need you the next generation needs you and all the women in this world need you❤️❤️❤️", "elevatedtimber": "Hows that autism treatin ya?", "mi_sueno_de_hadas": "Las personas creen que tu pides ayuda solo por el planeta y se sienten ajenos, la ayuda sería realmente para las personas, por que el planeta sabe cuidarse sólo, lo ha hecho por millones de años, así que debemos estar todos muy preocupados ya que en este problema de la humanidad y el planeta sabemos quien si va a sobrevivir...", "_matisp12": "Wena Greta pa cuando su salida", "noriorganics": "Hollywood needs you", "ieatspidersalive007": "#yougogirl"}