{"sunnass1989": "Evil", "eins_schlevy": "@kevx8x hier ist DEIN Klimagretel😁😂🤙", "jesus_trys": "Aaaaaaah", "jacksprinzessin": "HOW DARE YOU HAHAHAHHA", "mountain_girl_eva_noelle": "Your amazing Greta!", "shimmering57": "I hope Greta takes on child abuse. In Scioto County Ohio we have an EVIL MONSTER, Larry Dean Porter aka DEAN. A baby molester and child molester told by son and other. Read \"Scioto County Dean Feed\" @Amazom.com and watch Angela M. Clemente on UTube \"Forgotten Women of Ohio\" other murdered and abused women here in Ohio. Some offical's at courthouse involved as well! DEAN is a Daytime Stalker on Facebook, watch what your children are doing on line! Shops for lil girl's at Walmart and Schoolyards. Use to be the coach at South Webster High School in South, Webster, Ohio. Imagine girls having sleep overs at the EVIL MONSTERS house, OMG😢😢😢 What is wrong with law enforcement, DEAN is a informant for Scioto County Sheriff's Department. WTF??? One day here he was telling brother and I DEAN and his Grandfather burned up a colored family in Lyra, Ohio. He shut up before saying they killed them or not??? Is this not terrorism? Why is this EVIL MONSTER walking the streets??? Two missing girls Megan Lancaster and Kyla Eitel, DEAN both knew. Lil girl murdered on Armstrong Street, again DEAN'S neighbor. Son's wife murdered on Sciotoville, Ohio train tressel beautiful lady😢What did she know on DEAN??? SEND SOMEONE TO GET THE EVIL MONDTER OFF THE STREET, keep these lil girls safe!!!", "sair.serif": "@elifeyuppp cahilleri dinliyorumdur.", "r.r.dhage": "GREAT GRETA 👌", "griez_man88": "M caes al huevo", "dssevern": "Hang in there Greta. I too have had about enough of the dismissive head games. <3", "finn1eh": "This kid killed my goldfish with her boat", "marcos____marcos": "ACTIVIST GEOGE SOROS.🔥🔥🔥", "ryanadougherty": "Ok no one is going to respect you if you get all aggressive like crazy liberals do", "youngreese39": "How dare you 😢", "rcflyingdk": "😭😭😭😭😭", "renamed_user_1941_1945": "Западная гниль, вы ещё кошек и собак в 5 рядов посадите рядом с этой ебанутой", "bellaliney123": "What a caring person you are xx", "izadarasz3437": "glupia pizda", "court061203": "Oof#", "the_names_are_taken_so_its_me": "💋", "paola_128_oliveira": "The problem is that there are so many young people even younger that she wants to do something real for Brazil and no one sees but then just because the girl lives there on Thursdays everyone has to bow his head and listen? I consider this a beginning of inequality which is the truth O problema é que tem tantos jovens até mais novos que ela querendo fazer alguma coisa de verdade pelo Brasil e ninguém vê mas dai só porque a menina mora lá nos quintos todo mundo tem que abaixar a cabeça e escutar? Considero isso um início de desigualdade essa que é a verdade we get into social networks and we see kids that's right kids trying to fight it everyday we see young people having their voices shut up because no one cares Are there white, black, Indian, Asian and even physically disabled people trying to do something and no one sees it now just because the girl has ibope everyone has to accept? nos entramos nas redes sociais e vemos crianças tão crianças tentando lutar contra isso todos os dias vemos jovens tendo suas vozes caladas porque ninguém está nem aí Tem branco, negro, índio, asiático e até pessoas com deficiência física tentando fazer alguma coisa e ninguém vê agora apenas porque uma menina tem ibope todo mundo que aceita? Pronto falei", "suannysc": "@pedropestanamastercoach me diz se essa garota n é iluminada?", "_nina_361_": "Sryyyy gällll", "yllndrit_osdautaj": "You looks like 12 years old.... i hate you Because you are fake", "saartjemaes_": "HOW DARE YOU?!", "nano.3run": "No te piques", "_.cxcaine._": "Fuck u", "cillian_colmey": "Will she fuck off it’s a natural process like get a life u sad fuck", "mxurice_rxberts": "Sorry hard", "0007_alberto": "que marra só pra nao ir a escola ..jajajajajaj", "holdi_mtb_": "Na heute sauer😂😂😂😂", "mr.fulsoner": "Haben Kinder auch schon was zu sagen 🤣", "nuriaollede": "👏👏", "_.alinaaa03": "How dare you", "angel.berlinnn": "Wie die sich fühlt als wär sie Trump ey glaub mir du bist nix", "bustos3191": "😎😎😎", "fragtmichndwerichbinvalelol": "Greta ist sauer😢", "just.florena": "Quando tua mamma invece di buttare le pile nella raccolta apposita le butta nell’umido", "feet_are_beautiful_1978": "Mama, mama do you want to change my diaper ?? I have a lot of shit in my diaper ! 👶👶👶💩💩💩", "logansdaysout": "Your fantastic thankyou for your efforts", "jvlian.56": "How dare you🤡", "_its_dark": "You be a kleinkind also fresse", "olli1802_": "@_its___james_ how dare you motherfucker 😡", "ibracadabra51": "You look like a serial killer on trial", "axl_vandommele": "Hhahaha", "izaak.gonzalez.0517": "HoW dArE YoU!q@$!", "paith79": "You're a boring child... i really want to know who is sponsoring all this shit", "rastaaaa754m": "I wish i were you", "fynnito.prive": "Bish", "j1a5n07": "Der Gesichtsausdruck meiner Mutter wenn ich wieder mit PC teilen ankomme", "viljanacc200": "U dont Even look like 16 , u have autism", "mcherbert": "We should listen to the scientists!! you are a drop out. stand down.", "investor_cuxlnrx": "😂", "_bereuzinho": "Aí aí vocês roubaram minha infância, quanto drama que até sufoca.", "madamesesil": "👍❤️❤️❤️", "millerframes": "Euzinha prestes a fazer birra 😢", "megansnyder778": "Copied and pasted from some loony libtard. Real scientists and climatologists have written hundreds of papers, you are a lying pawn and a fugly little GOON", "mrpelle1988": "👍👍😇", "joaum_machado": "How dare you?", "cglover0520": "Your parents wrote this for you?", "n_atallo": "👎👎👎👎👎👎👎👎👎🖕🖕🖕🖕🖕🖕🤮🤮🤮🤮", "larrybrummelyahoocom": "What's crock of crap!!!! I am supposed to believe this angry 16 yr old is the expert on climate change... The climate has been changing since the creation of time.", "cowboy5871": "👎👎👎👎👎", "jesusslva": "Quanta hipocrisia", "zafirorakelita": "Guerrera de luz !!adelante mucha fuerza greta", "xxanniexxy": "Cool but can you provide some solutions instead of being angry because that doesn’t help", "pedrooaugustoo7": "Ustra vive", "ryan.romero24": "Faggot jesus", "little.lady.bear": "@gretathunberg You don’t have any opinions!!! You’ve got George Soros people writing a script for every word you say!!! You are being used little one. You work for George Soros you should research him and the evil people you work for and get away from them and find somewhere safe and be a child", "dome______________": "@_niko.013", "lauuraessc": "Sad girl :(", "nayara.tp": "Que haces de basta", "_.celine.langer._": "Ihhhhhhhh", "786____70806": "Greta du pic übersetzt das in deine Sprache lösch dich du kachba wie siehst du aus wir ein hurensohn Erde bring dich um häng dich auf du fischfresse wie siehst du aus wie ein krebsmensch Erde bring dich um heute noch", "dievo4009": "@luca.zh1 𝒹𝒾𝑒 fotze als lehrerin", "celinaspxg": "🤮🤮🤮", "citizen_wrong_think": "I still question your motives Greta. Hopefully many more do as well. You aren’t a moral authority on anything. Thanks for coming out though", "1rcher": "You need Jesus!", "tibor.feher.7399": "Fulladj meg te kibaszott álszent budos picsaju fasszopo nyomorult kurva", "carlosrabellode": "...isso mesmo defender a natureza 👏", "jazmyntara": "But the scientists who generate these so called “reports” are paid and funded by the corrupt government. For every one “government” scientists who says there’s a climate crisis, there are 3 who disagree and have the factual evidence to prove it.", "torrelisandro_": "Ir a la escuela no en pedo no?", "sr.r1ck": "Ta enfadada", "carlos.meireles": "Até pareces má assim", "_leon_dn": "How dare you hahahha", "darren_mccantz": "🤡", "asgoreedremurr": "🤡🤡🤡", "emilio_066": "A lot of environment and your sofa is made of animal skin", "the_nes_warrior": "You are a kid. You don't rule the world. Go to school and be quiet.", "onlyme.oofx": "Wow go to school", "rayhan.boiserie": "When we fixing the fucking climate bro", "ltte": "❤️", "marishene": "@mama_dvo @jasminepercy", "gabriellakwete_": "You are strong @gretathunberg ...i'm with you for save this world", "gloria.egger": "HOW DARE YOU🖕", "mxpgnz": "Smoke grass eat ass and drive fast 😍😍", "v_28_06": "Stupid so much...", "dybaler_28": "keep it up greta save the climate", "marniemartin_mydrumlife": "“To those who question my so called ‘opinions’, refer to page 108 chapter 2 in the SE1, 5 IPCC report. There you’ll find our rapidly declining CO2 budgets. This is not opinions or politics it’s the current best available science” So now the CO2 budgets are rapidly declining as well as the environment? Because science! I see what you guys did there. Nice try. 😉👌🏻👌🏻👌🏻👁", "josefelix_garcia": "Por que no la tratan de la enfermad que tiene y dejan de usarla?", "jxst._.leni": "@stxfanxstranger", "zebata": ".|. .|. Noob", "andrey_slepchenko": "Какое у тебя мерзкое ебло", "dante_ariel2005": "Traiganme al conchetumare que no recicla", "honestme.33": "Keep up the good work", "markustiula": "@waltter.i", "1milo36": "Försöker du vara cool när du sitter i det tjocka huset lika tjockt som du 🤬🤬🤬🤬", "xv_xxzox": "Du hässliche kachloe", "cerys_harts6": "@xx_lilia_m_xx @gracie_.adams", "kamil.yilmaz.9085": "How dare you", "anniesworkroom": "Awesome thanks for sharing your voice!", "barakatyounis": "Princess and pretty Angle look ♥ InLoveWithGreta", "jjeat0n": "Dude shut the fuck up", "gavinthenaenae": "HOW DARE YOU HEADASSSSSS", "wbrandon902": "Bang", "louisiana_oilfieldtrash887": "What exactly are you striking against? The vehicle you used to get to this location that day was made by oil and plastics and rubber. The electricity in that room was produced by fossil fuels. The microphone you speak your nonsense into is made possible by plastics and oil. Your clothes, toothbrush, medicines, cellphones, cameras, houses, etc.... all possible because of OIL. You want to play a part then go live in a hut in the woods", "brendan.roman": "Shut the fuck up. Did I ask you to speak? No. Do I care? Fuck no. Now stop.", "3301_q22g": "Never give up, we will never die, keep “fridays for future”..", "luvv_": "Many of u people commenting are just plain cruel. Can not a single on of u add a little intellect to ur comment? All of u type ur slurs about this child, and for what? Does dragging her do anything? And is not, how are any different form the slurs u are spewing? How are u any better? What difference are u making? Good or bad? What can u say ur doing to evoke change? Nothing? Then why even type ur dumb and meaningless words, and leave it here? Get a life, time is running out.", "calvinwisaacson": "The earth actually needs more CO2 silly brainwashed child... look at REAL SCIENCE", "candicej_x": "What an absolute inspiration you are @gretathunberg ♥️", "atfmrsyd": "the face full of hate", "abg1972c": "😂😂😂😂😂😂💩", "joshfryer95": "@ryann.whi lets go Greta 🤣", "madikennedi": "why are her parents pretending she’s the one writing the captions", "norbertto_c": "You are crazy 🤢", "selfpromote_police_officer_b": "Ae ne seri", "gman1963813": "You’re a fraud and so is your climate religion 🖕", "miridi_": "Ihr Blick 🤣 @justcelinaaaa_", "drs.elsewhere": "@jack.beaza", "_samira_154": "Is that a plastic micro ?", "juradiin": "🤢🤢🤢🤢🤢🤢🤢🤮🤮🤮🤮", "cali_venom91": "😂🤮🖕🤢", "rayacquires": "So fucking gross", "hi_im_carterrr": "OK BOOMER", "will.kinggg_": "I sHoUld bE iN sChOoL", "dianalin1996": "Lol", "payamrezvani5858gm": "💚💚💚💚💚", "arvidpousette": "HOW DARE YOU??????", "exxepsylonn": "How dare you?", "mxrtz.drl": "8i", "36.active": "Ok boomer", "karla.elizabeth.butler": "You did amazing", "colethecowboi": "Mom can we get trump No we have trump at home Trump at home", "kingperformance": "@bmw_m2_coupe dein Blick wenn der Turbo nicht rechtzeitig fertig wird ?🤓", "lucyvictoriia": "How dare you", "luuucaaas_": "Ok boomer.", "godsavesb": "Ma vaffanculo va", "_y4nn_": "@loris.rouiller c'est theophile", "sanni_kazimi_123": "Du är bäst kom ijen 👏🏻👏🏻💪🏻💪🏻", "twitter.patedd": "Go girl 💘", "_jakobwilliams14": "Looks like a little girl when she’s told she can’t stay up past 9:30", "avagiles25": "@minialiv", "chantelly_lace_": "@achygrandma", "boobyscroton": "Clown 🤡", "corry_vegan_earthling": "Poor poor child.... you don’t know nothing about the world.... you are in fact very dangerous ..... you operate for Soros & Bono (not the singer) and are a puppet for them. You get sponsored by companies but won’t say anything about it. Be the pizzagate puppet, be the MK ultra kid, distract the mass with your false words. Blind them also with your shouting. Where is your solution ? What is your plan ? Be a kid and go suck your thumb because you are not ready to deal with the “real” world. Poor child 👶🏻", "aman012guliani": "@narendramodi", "adam_codaccioni": "Ok boomer", "juli.36.47": "HOW DARE U", "88dragonsboutique": "I bet this has got to do with wind turbines and a tax plan to get everyone to pay for them..... We'll see but I not keen to see wind turbine stamped all over the world. They are loud and kill birds. Anyway all of this does not add up.", "antonie_dewaal": "@niels_van_herpen @timdevos033 @tom___0416 godverdomme hee moeders mooiste ist nie🤢🤢🤢🤢🤢", "ssm.here": "🖖🏻", "tajomadi": "👏🏻😊", "brot852": "@nayarvalente", "mvihrs03": "Autistic retard🖕", "ari.nwt": "🙄", "officell_.sofia": "HOW DERE YOU ?!😂😂😂", "whollymothervegan": "Can you hurry up and turn 35 so you can run for President. Please and thank you!", "zaramolaei": "🙌دوست دارم", "laurel_ah": "@heather.kirsebom", "lpbb_25": "Bruh..... it not smart", "luva_2312": "@s4y1o @tony.mk5", "izzyrodda_x": "sonnia @emmatkinsonx", "stern.ryan_t": "How many thousands of pounds of jet fuel have you pissed through in the last 6 months you iggnorant brat?", "lebaneseinbrazil": "Where are your thoughts with the Lebanese 🇱🇧👊👊👊people! Or is it that it doesn’t give relevance", "ryan25ritaa": "🤮🤮🤮🤮🤮🤮😱😱😱😱😱", "_.c0llin._": "Fortnite beste", "maling33": "Absolutley LOVE this girl. 💛", "mrplugyt": "Sieht aus wie vor Gericht.", "livedramafree": "Just a puppet being used as a political pawn, sadly your parents are allowing them to use you. I don’t doubt you sincerity on what you believe, but 5 years from now I doubt anyone will remember who your name..", "tony6699noronha": "👏", "mamabearsgonefishin": "@sailormouth so impressed by her", "mr.stringhead": "🙌🙌🙌", "hackerman____": "Retard", "grizzly_288": "Poor kid :v", "king.jaja": "Poor kid manipulated by the media. Go find God and you’ll find the truth. Science isn’t going to save you. Don’t be another smart dummy 🤦‍♂️ like Einstein", "joselozada518": "💩💩💩", "ulisescpa": "Que plante un árbol! 🌳", "7en11even": "Shut the fuck up I don't care", "freddiemercuryisrising": "Lol pawn", "gregcondike49": "Lol this isnt even greta writing the caption it’s written to smart for it to be her", "_pan_pan400": "HoW dArE yOu", "marcus_fourie": "I’d like to see any of you make any sort of difference in the world", "_.rvdnicki._": "@_.karolq", "leoooscutie": "Greta Thunfisch ist backkkk😭😂", "trppymrgn": "how old are u", "vtx.halalhabbibi": "How dare you!", "_alxna.0811_": "HOW DARE YOU", "jerry_yang78": "fuckin stupid", "drk_dodge": "Makes me want bacon🐖🐷😂", "_.giuli0._": "Ma vai a scuola😂", "ahmet.01prvt": "When you lookin at someones eyes and think what is in side her had:", "lynette.iiq": "😍😍😍😍", "xbbonldbump69": "Wa wa wa look at me blaming America wa wa go to China and India", "paulhunt333": "Go eat shit you smarmy little cunt", "klm51788": "@jessemagid", "enes.yilmzx": "Ağla", "andres_musso": "🤣🤣🤮🤮🤮 boring", "room_hero": "Я люблю тебя. Я ХОЧУ УЛЕТЕТЬ С ТОБОЙ НА ПАРОВОМ САМОЛЕТЕ В ДАЛЬ😍😍😍", "cathaldroney": "Hardddddddd", "_.peeppa._": "Ma faccielo un sorriso", "lms_4545": "@ale_ang_23 , Tu ne suis pas ta copine ecolo ? 🤣", "hammashitmaker": "Y u so mad? Didn’t get a cookie?", "matt_8027": "Lol this is fucking stupid", "ckasdpb81mbhs": "Little DEMON! You need to be dealt with!", "hadi140104": "😂😂😂😂😂", "kimberly.cobbs.58": "😍", "hannahburjoski": "*wears a flannel to a court room and wants to be taken seriously*", "cookie_od2012": "All men want to be defensive as it destroys their profits. It is ok, they are just digging their own graves. There is no such thing as the end of the world as men will create their doomsday with their own hands. The more they do it the faster they die. This planet would not last a generation. Therefore, humans should stop procreating as the future generations would not survive anyway. When everyone is into technology, they are actually killing their own species.", "lulustoovintage": "Well said🌎🌎🌎", "sk.sullivan": "Ur twelve", "jaywantvlone": "Who is joe", "pratik_hasabnis": "Had bc", "castilar_18": "🤣", "erenncanycl": "Yarram", "th_bier": "If you’re that good, why aren’t you the one making the policy", "iamnotarobotyet": "You’re such a puppet!", "arrietarafa737": "You’re an angel. God will give you the correct way to change the world . If you don’t believe in god, something will guide you in the correct path💙💙👏", "junior_pearcey": "Don’t *", "_stef_wes_": "since now all u done is complain its good to complain bring some awarness to it but theres no solotion just pure critical aspect of how we do thing and every bodys like uhh she done so many great thing. but honestly not reallyy", "darkochowchow": "Pawn ♟", "sophielamb93": "@emmachipp go girl", "theesamboyd": "Who types this shit for you?", "zefyrworldwide": "DM 🌬🌬🌬🌬🌸🌸🌸🌸🌸🌸🌸", "a_man_has_no_name_xx": "@theellenshow", "diego23__11": "Fuvk yoy", "nick.purdy": "Mad lad", "nittney_love": "Please do your own research. Yes listen To scientists not the politicians who are just wanting to fatten their pockets!!", "alex__xxstone": "You’re just in it for the clout", "tomhrzg": "😢😢😢", "map.paul": "Your words & actions are fully aligned!!! Very young , but an old soul who simply knows what needs to be done to save this planet . One person can & does make a difference and you are making that very clear . So happy you have a platform for change so this world has a voice :)", "mauiahxfindi": "Cut the cameras ....deadass", "michael.vanderheiden.7": "🤮🤮🤮", "sar__toast": "idiot child", "mel1_78": "How dare u", "_zeitlows": "@larspalluch 😂😂😂", "_.t0my_0310._": "Donde esta el conchetumare que no recicla?", "_wheres.my.juul_": "How dare you", "usernamesesh": "When you mom takes your phone", "sstrbac_": "Greta da pusi kurac", "bjornvaneck": "@martijn_westeneng da wijf is ni goed bij dr hoofd kel", "xjil_6": "@xjo.ch wat ein Gesicht", "carloscmny": "Stupid", "irishstats": "💩💩💩💩💩💩 🌞 🌞", "tyier55": "Looking stupid", "amirhossein_nicknafs": "کی تخم داره اینو بگیره", "kunal.png": "Scam", "edvardroevik": "🤨", "alessiapma_": "Me :buys a plastic packet . Greta:how dare you", "tildecuomo": "@filippagram_", "galahad_1997": "👎", "jkov777": "Learn the difference between science and statistics sweetie", "gizmo.cats": "As a US citizen, I'm ashamed 😡 that our Congressional representatives think science is a belief. 😢", "cel1naaa._": "@miridi_ @oliveiraxpimenta aufpassen sonst wisst ihr was passiert die Greta kommt", "alexandrerss_": "HIPÓCRITA 🤔🤑🤔🤑🤔🤑", "amin_omran": "You'r EVIL", "jakehannann": "How r u 16 you look 12", "stojankajazic": "♥️♥️🌹🌹💞💞", "thomasthevibetrain": "Just cry bitch", "ian_the_lee_man": "When mom doesn’t get you McDonalds", "rachel_gannon": "respect", "ryanjgilio": "Screw the turtles", "sercan_1731": "I fucking hate you", "enver.mertt": "balon", "remo__012": "how old are you 6? 😂shit child fuck you", "forceka11": "@tonaya_manini cuando eres cachencha pero ambientalmente consiente", "hallsy.519": "The usa is the biggest problem.", "joulina.michelle": "How dare you?!😂", "gl44ch": "🛩", "rdaugherty23": "quick question, wtf is anyone supposed to do about climate change, have people go out and throw ice in the ocean😂😂. there’s nothing we can do, suck it up and quit being a pussy. i think its funny that grown ass adults r listening to a 16 year old that doesn’t go to school, real fucking great america. this is what r country has come too", "missc91": "@aaronhall90 how dare you", "the.soul.assassin": "When I was your age we were ALL gonna die from a hole in the ozone layer and Y2K was going to crash Global markets.", "timmy_shaw_": "You’re literally not 16 years old lmao", "joe.dda": "🤢🤢", "jacobsen_roar": "❤️ø", "jonas_gem": "❤️", "thread__star": "Hello, @gretathunberg", "liamleblanc28": "Fag", "blvnt_man": "y u already look 65", "claralanyiceramics": "@gretathunberg I’m so sorry there is so much hate on your IG- love your determination and unwillingness to bend when you know you are right. @kidslovehorses this pic made me smile because of how many times I’ve seen this look on your face since we were kids ❤️", "ethannmorgan": "Marry me", "saint_james_from_decatur": "🔥🔥🔥🙌🏾🙏🏾💪🏾👏🏾 YOU ARE A WONDERFUL HUMAN BEING Greta. GOD BLESS YOU. GODSPEED!", "benno_206": "@m.karch10 finden Deinen Blick sehr anziehend ❤️", "noah_chapman_____": "Stfu", "usslabella": "@aidanlabella I can’t stand this eurowhore 🇮🇹❤️🇺🇸", "charlie.unwxn": "Shut up greta", "il_vostro_kebabbaro_dank_": "Io quando prendo 2 in matematica", "blaisebennefield": "What to do if juice box is stuck in ass and I tried to get it out with pliers now they are in their too", "blaizemalik": "Khaba", "joaopedromsr": "How dare you?", "chaptertwoinlife": "@gretathunberg The truth is a hard pill to swallow for those that are up to no good. Fear and denial clouds their minds!", "gonzalessanchez4": "@kiefer_esp le diste laik a esta foto", "febtucked": "😂😂😂😂😂клоун", "jozef.novotny333": "Pekné oči máš❤️", "_killingamockingbird": "How dare you kemal @mehmetkemallsahin", "chxis_weixhert": "Fuck you Greta", "wu.tang.mariee": "Mensch Greta guck nicht so böse", "opizwiesel": "Hello Miss attention eater.", "kay_kleinke": "Go back to shool", "squib_cock_v1": "Bruh shut up", "jaymoss_x": "Stop trying to prove people wrong", "martina_112zu": "Fühl dich nicht so cool weil du auf einem Stuhl Sitz wo sonst die Politiker sitzen und dass bist du noch lange nicht und ich hoffe dass dass auch noch lange so bleibt.", "perropresa3": "Fuck u", "senne_oost": "Dumbass", "mikhail_avva": "Мы живём на планете про которую ничего не знаем. Где наши знания? Вот с чего надо начинать! ✊", "kadir_sygn": "🇹🇷", "bangeryalin": "ABİNYAPMA ATMA SU İZMARİTİNİ DENİZE APTWL OROSPU COCUGU", "travelpiccolaghianda": "Stand up for us all. Thanks ❤️greta", "trent_williams__05": "The face you make when you realize you’re a joke", "kenneth.dtx": "Oh u think u a bad bitch huh💀", "aj.106_": "when the FUCK we fixin this climate bruh", "in_the_bloom18": "Ode to viceroy", "___bommel___": "#flachland", "jesusrosendo5": "Cuando ves a mike usando una pajita @mariagarcia_calvo", "official_jojo.14": "@gretathunberg bockiges Gesicht izz da 💪", "leonie.mayyy": "Da queen 👑", "_die_tro_": "Not stonks", "joni_12_funke": "Hässlicher den je zuvor", "sopa_de_polenta": "Trump: a greta:JAW DERE YOU", "xheniconiku": "I am reading the comments and noticed a lot of comments where they are written :GREAT WORK,GREAT JOB..I didn't know that reading adult speeches is a job", "golfsharks": "You’re probably the most annoying person on this planet. Just saying.", "srlperez1": "Ass face", "rq_max_610": "Fotze", "jakey_shorty": "I found the meme!!", "federico_puglielli126": "Fo cess", "thegr3at_": "How dare u", "marianduanet": "This is for you @mgbolin16", "artnekto": "Die bitch ❤️", "katiehseifer": "and to all those people who are like “she’s a child she should be in school”...ok, you try working as hard as she does to save the future of our planet. smh", "adam_then_45": "Everything she says is so called, because none of what she says is true.", "pet_plant14": "No", "whotf.ernest": "thats cool and all but who asked", "claudihenri": "2 Mil quilômetros de petróleo nas praias brasileiras lançadas criminalmente, e estamos perguntando, o Greenpeace & Greta estão de férias? Já questionaram Maduro sobre isto?", "nesquik_senpai": "Traiganme al weon que dijo que chile está en guerra", "jakeamandling": "How tf is she 16", "pleasehorny": "Is this a jojo reference?", "cmsa8639": "Stfu", "jacobcleary_5": "These facts were provided by the EUs scientists not any other ones.Its political bias at its finest.Well done greta you've officially been played ya clown 🤡🤦‍♂️", "stutijaiswalofficial": "What to tell about you Greta, you're really great!love you the most!!💜💜", "nr1_135": "Arge", "nabil.shakur": "Tfou", "lolitaultrachika": "Miss pig", "er.llvmi_s": "@zhyvka00", "houst08": "Global warming a myth", "ebux_xd": "Friday for Hubraum!!!!!!!!!!", "amin_bra_": "Bruderthungerg", "ramin.o52": "Ağlamağa hazırlaşır😂", "sedddda": "@tm__889 richtige aggressionen m abend", "priscila_a_arruda": "Boçal!!!!!!!!", "flavi_led": "Uma bosta vista de garota", "chonky79": "You’re just a child actor raised by actors. Nothing more. I’ve seen your scripted talks and you unscripted talks. Vastly different. 🤡", "bircebirgen": "🦑", "22schultzd": "You look like a Karen", "ercan.mgts": "@oezzy_mxm how dare you", "francesfallon": "Can this bitch not smile tf 😩😩😩😩😩", "slowara": "You look like a boy", "__arman11__": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "jonmattiaskj": "😉", "rubenwarmerdam_": "@onderdrukt nou krijg ik die gespierde armen in mijn hoofd op je account😂😂😂", "brokenewos": "Entire eco systems are collapsing 😂😂😂😂", "carlosasssss": "You kind of look like mousolini", "zupermilton": "A good song greta tunberg remix youtube", "tinacarneiros": "@giuliagrabert", "mohamed.t_": "@nadiawikiv hier heult die ja schon wieder fast😂😂😂", "kursatonur": "sümük surat", "alireza_faraji72": "🌹", "laurin.shl15": "🔝", "spirit_of_creatures": "I know how to stop global warming, just put cubes of ice in the attic and Antarctic. Problem solved", "mateja.m1trovice": "@sascha619 how dare you", "rjacko95": "I dont question your opinions, I question your willingness to read a script without knowing what your fear mongering is doing to other kids", "sero.2020": "How dare you", "peoplecallmeelias": "Du huansohn", "andersonalejandro12": "Vendehumos", "miljonairpub": "You look like a crack addict", "sarlinanatala2017": "Грета,ты большая умница!Иди вперед!💚", "dadgostar170": "👍👍👍👌👌👏👏👏💚💚💚", "ella_grace.xox": "@lewis.westwell", "2001_pontiac_aztek": "Shut Up Greta No One Cares", "sihingyener": "@cbeeyza", "2016_ft1_soopra": "The ceo of natur is MADDD", "p33photography": "Thank you. Thank you. It’s not about opinions, politics, religion, etc. It’s about uniting behind science and humans!", "xxfc06": "Senin ananı sikeyim🇹🇷", "_shahito_": "@madsthestig din nye giz?", "lennart_nmn": "#dienstagfürdiesel", "_elcharro": "Mamma mia", "amor_handmade": "Great job @gretathunberg 🙌", "masoooony": "You know nothing about anything, you should not have an opinion, neither should I, neither should the rest of us, except for scientists that actually know what they are talking about", "discoveryspirit": "👏👏👏👏👏👏", "aiden_colquhoun": "Staunch", "maite_loves_horses": "how old are you?! 👍👍👍👍", "clutchmy_pearl": "DMn you sure are gonna be one hell of an ugly woman 😂😂🤣", "jakubnovotny_": "Jses pica", "josuroff": "parece o demônio", "amazgreen": "excellent to keep fighting for our mother earth", "sophie_skriboth": "Was glaubst du eig ?", "sawarovski": "You only liar smear.", "aandreil": "She looks like 10 year olds when they get clothes for Christmas", "just.jade27": "lol she talks like an adult which makes actual adults mad haha which is why a lot of people are hating on her. she’s not crazy, she’s just very mature", "noah_95_official": "Sembri un'pò pascarella li così @chicco_g19", "skiiii96": "what the fuck we gon do bout climate change", "victoria525": "How dare you😂", "linus.stiegler": "Ich mag es mit einem Ford Mustang GT(schöner 5 Liter V8 der viel Sprit frisst) um kurven zu heitzen und die Reifen Qualmen zu lassen 😂Und ich weiß nicht ob du es irgendwie nötig hast dich in den Mittelpunkt zu stellen oder ob du einfach nur Verrückt bist. Ich halte das alles für Quatsch. Ich hab Spaß und Lebe mein Leben.", "michvlx": "Who are you wtf kid", "nathi7770": "shut up greta your childhood is now it wasn‘t yesterday and you can‘t do anything little girl 😂the world is broken you can‘t fix her", "xx_teganwright_xx": "Hard lass Greta on the scene wouldn’t mess with her @_rachelxdroz 😂", "calvin_2002_": "Greta Think it is Professional to cry in a government buildings...😂", "orsolyagonsalves": "Thank you Thank you for being you!!!!!! I’m with you !!!!!!!!❤", "thomas_norrort": "Ta inte åt dig av kritiken. Jag har själv inte så mycket nya möbler i min lägenhet. Mycket har jag ärvt från morfar när han dog. Jag har fyndat en del på second handbutiker.", "carlhappyhill": "Was bildest du dir ein? @pascalgorki", "story.of.cory": "Curious who wrote that for you.... we are listening to the scientist and science. That’s why we’re skeptics... you’re a puppet. And too young to even recognize that.", "juliallzj": "@alena41033", "maxr1000": "Bloody poppy coc", "georgegadsdon2004": "Be the voice for the environment and the planet.🌲", "58ben_": "Nicht demonstrieren gehen sondern in die Schule gehen", "h2o_battyman": "How are you 16", "sabrinaterence\nVerified": "Verified", "cam_af11": "That is simply incorrect. The claims that there is \"more\" severe weather is also inaccurate. Im sorry if you've invested time and money into a fallacy, but many have been manipulated into believing in this myth. I spend a lot of time helping people realize the extent of of the \"climate crisis\" ridiculousness (including many children). Id be more then happy to help you if you like.", "jaylacousinsx": "@long_live_greta your girlfriend", "campboah": "Me when I meet the CEO of climate change", "liam_.harris": "U don’t deserve anything u horrific girl u think climate change is real lol", "chill._.dreams": "I'm very impressed with you", "femme.fatality_": "I wish I could dislike a picture", "js631988": "Interesting statement. I only drive bicycle inside city or use trams/trains (which run electric) for work. I love meat but I only eat it once a week. I believe normal people like me are generally aware of climatic conditions. I just don’t understand the sudden drama 🤔 Electric cars are made of materials which are much worse than our diesel/petrol vehicles. The situation with climate we have now is a result of 100 years and not the last 10 years. What we see now is a result of 100 year effect. 50 years ago we burnt wood for heating, we don’t do that now.. that has already made a massive improvement to our society. If the developed countries want to make a change, they need to help the developing countries change by improving their infrastructure. Nowadays many developing countries have educated people but have no infrastructure unfortunately. Maybe if Greta really cared, she should donate the millions she owns towards such causes ? 🤔 It’s always cool to look green in front of my friends, neighbors and society but really living it ? 🤔🤔", "tackmanpekka": "You dont understand that we who live in your country of origin (Sweden) won’t be able to live without cars, trains, trucks, gas and diesel? The transport to the supermarkets and every store needs some kind of transport that is almost always delivered by a truck, car, train or aircraft. Often a combination of some of them and out country will completely collapse without vehicles of this kind. And what about the farm owners? How are they supposed to be able to work their farm without tractors, trucks to transport, and so on? Without them we will also fucking collapse. I dont understand what has happened to the society, lower the gas prices and fokus on stuff thats less important for the people of the country that affects the environment", "wahbi.elfaageh": "❤️👍👏👏👏@gretathunberg", "william_elms1": "🗑", "edsonnunes2018": "Vai plantar uma árvore sua louca .🇧🇷🇧🇷🇧🇷🇧🇷 kkkkkk", "leandroguaru": "Spoiled chield😎😎😎", "lucky_nikitos": "15 летние чучело", "pascalbuettner": "hure", "t.rey88": "You look like you could be 16 or 60", "renomike": "Shouldn’t you be in school instead of being used as a political tool??", "earth.ly_weirdo": "Thankyou so much Greta....you're amazing....We are all with you.....You are a true warrior.....a true saviour of our earth.....you have restored hopes in many disheartened hearts...... You are bringing attention to our mother earth's broken spirit....you are truly making a difference...we are there with all the noble hearts fighting for this great movement.....and save all the flora and fauna that we have brought sorrow to.........", "doubleyutike_": "Kaba pikir aku takut au @aws_akbar_wira", "wobble2006": "#climatestrike", "sky_cxz": "Brownies für downies", "r_salewski": "😂😂😂🗣", "daniel.c_14": "You are famouse of plastic😒", "ekstrasaudi": "2 step it", "pierce745": "Oooooooo scary", "a.shevckenko": "Yeet", "mbiagiotti03": "@jake_ferioli", "stalnoi_muzhik": "Is only opinion. No facts ☭", "_ryanjamieson": "@georgeplant_", "tommy__hb___": "Bel microfono", "martin.payer": "@michaelunterkirchner_16 🤭🤭🤭🤭🤭die schaut schon böse", "americs_best_fights": "Your actions are futile you will never become someone who people listen though you can try but climates were higher before humans came so man made global warming is a myth though global warming is not since you are still young and do not understand what the hell you are talking about but still you are spreading awareness to a myth this is just like the moth man situation if you’ve ever heard of that", "andrew_penyak": "Be think about the ocean pollution a real issue unlike man made global warming is a myth", "nataniel.filho": "Explain to me why your silence about the Venezuelan oil spill on the Brazilian coast.", "na_zamut_andruha": "Дибил блят", "balkanwhistlegarage": "Jeri Diiizeel???", "brixn.780": "Looks kinda gay to me", "dimethyl.vessel": "Who writes your speeches?", "jakee_760": "💸💸💸", "jd_vm": "When a Prius driver sees someone roll coal", "dgv_photo": "It’s all politics.", "liam.jackson22": "I like what your trying to do, but I can’t agree with how you did it. Honestly in my opinion you just stood up there and told the whole UN to go duck themselves. (Not literally) and you should’ve probably presented the issue better. Like not saying \"I, me, myself\" and speak for the people. The way you said things also didn’t sound convincing. I really like what your going for here, but yelling at the UN unfortunately won’t actually do anything.", "thetriza": "R u the girl from Willy wonka?", "korean_bastard_69": "Greta: i would like to talk to the ceo of earth", "mb.krg": "Котак жемеш", "hustlejunkieone": "Lol", "lu.igi3195": "Go back play barbies", "astonish_moi": "She looks crazed", "riley_rans1": "U look ten", "d3nny_lfd": "Haha", "gigi.za.jopy": "Иди нахуй, детство у неё украли....", "nniuq_ronoc": "You on trial for being a bitch", "foxmckenna": "Greta you make me hope that climate change is real and the earth will end in 12 years. Your generation is cancerous 🤡🌎", "mattbacafoo": "Fake news", "rtrtrt3476": "How dare you,lol", "dnxbxhxbx__": "the CEO of nature mad mad", "jameschristopherhill": "Once in a lifetime, a hero all of humanity and the life on Earth herself can look up to for inspiration comes along. Thank you for doing and saying what this 53 year old man that's just as angry and frustrated as you are mainly for our youth is, could not do and that is reach my colleagues and piers with FACTS about how little time we have left if it's not too late already. It's time for these fat, old, useless pieces of garbage that call themselves \"humans\" to be taken out of the seats of power they hold for if this was a corporation, they would have been fired day 1, especially the current waste of carbon president of the United States that has, just in his time, destroyed more of our world than can be imagined and he started it by not signing the Paris Accord that lead to other so-called leaders walking away from the table. What do they care? It's a power game for them as they care nothing for Earth and the youth for they know they are old and soon to pass, but it's like their game is destroy as many lives of current and future generations as possible and it's an addiction to them. I've been tired of their false promises and direct lies for decades, but it just took an angry 16 year old child to fire back at their deceptions and evil. I'm with you and that look on your face in congress is the same look I have every day! Let's put it this way, since 2016 when Trump was elected, I have suffered amplified serious anxiety and depression (diagnosed) that has even affected my marriage as even my wife thinks I should stay quiet and not rock the boat. To which I say, If I say nothing, I'm just as guilty as the garbage that do nothing to protect our environment and use the media to promote their fossil fuel buddies' agendas of destroying our atmosphere and your future for their own selfish temporary gain. It's time the entire world, especially our youth stand up and replace these so-called false leaders, wolves in sheep's clothing. Keep up the great fight - we are proud of you!", "lacinok_": "the theater is very clear in the middle. you liar", "oxycodone____": "The CEO of nature", "alexx_x_prvt": "Beleidigte Mettwurst @lisaaxspaam @laser_piti", "petersladcik": "And ten years ago the increasing amounts of c02 was destroying the ozone...", "ela.ozatay": "Wooooooow ur soooooo smaaaart aren't uuu lol go to school", "caiooperez": "Blablabla", "fatherbutinyellow": "Shut the fuck up", "enrico.dellangelo": "M si o cess", "_eritchd_": "Lollipop", "lekynzie": "CEO of nature", "ale.and.alters": "Nah I'm not for giving anything to the corrupt UN", "cooper_24_smith": "Kill the pigs kill the pigs for food!", "isaaccfw": "kinda sad how y’all worship these “facts” but ignore the actual facts about how bad gun control is ☕️", "zhangji8357": "nb！nb！", "ulannicki": "Fcking rothshield fcking soros fcking rockefella she is a fcking israeli", "ang3ladri3l69": "Sub2pewdiepie", "l4kaas": "👎", "hayden_farner_": "How about instead of bitching to the world on how messed up it is and accusing everyone in the world on “stealing your childhood” how about you actually go out and pick up garage with some people that are actually helping the world out. All you do is sit behind a desk and bitch and complain because the world is not how you like it. Don’t tell anyone to do anything before you actually work a couple months with an organization that actually helps out the earth.", "kronic_twinc": "You are amazing", "fsb_nikto": "Noob, fuck you ans suck me, bitch🖕🖕🖕", "i.c.e.b.e.r.g__": "Bi siz zekisiniz anasını satayım", "amit.nisan": "“How absolutely dare you!” 😂🤣", "kai_stk": "Mach dich in die Schule!!", "harls_m05h": "How dare you", "mhatrechinu": "Besides stating all the problems.. what's the solution you are willing to provide", "mellamoisabelleamor": "How come when I’ve looked you up in other interviews, you stuttered so much that you passed the question off to the rest of the people on your panel also known as your handlers? 🤔", "prvt.juulian": "HOW DARE U Du lachfigur 🖕🏻", "theraverj": "@dlightsqrd", "hasan_efe_99": "Șșșș go home little baby 🍼 🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷🇹🇷", "daviddobridnyuk": "HOW DARE YOU", "luki_enzo": "@noah.gvl ohoh", "ollieflower": "How Dare You!", "carl_sawaya": "😤😤😤👏👏👏", "kiddy_fiddler_69": "When the fuck we fixing the climate bro", "naomihtg_": "@claraexc @albertcristoper ini dia yg pernah dibilang sama pak Denny itu", "____zachefron_": "Did you’re mom drive you to that debate ?", "rizzo_off_the_walls": "okay ms wanna be famous smartass having ass with your bull shitting ass face go die in hell", "felipeemc_": "Grande Pinochet", "sc_sebabikek": "Enojadita más linda 😍", "monimendez1": "You’re a shining light in a dwindling world", "rhiannon_adam": "Yes!", "rachlee111": "Angry little vegan. It needs to eat a steak! You are definitely lacking in iron", "cny.cst": "Bing bong bing bing bong", "_declankelly_": "did she provide any solutions to climate change?", "lars._.020": "🖕🏿", "_sara_marchione_": "😍😍😍😍😍", "fab.sautour": "Il like big car like a Toyota supra mk4 with a 2jz and that do so many pollution hooooo yaiiiiiiiii", "charles_jsp_": "When your mom says we have food at home", "o.dogukann": "Küçük ırıspı", "undergroundslayer": "when the fuck we fixing the climate bro", "samuelenag": "Go to school", "yusufturalllc": "🇹🇷", "_tombeech": "@charlie_.dunn", "notsash.a": "🤡", "santoscostadudu696": "Fantoche", "david.wchmn": "How dare you 😂😂", "raccoon_king69": "DUMBASS", "nicolas_valdes23": "Go to class mate🤣", "jevans_2005": "Get back to the kitchen and make me a sandwich", "jldinapoli": "Brainwashed Liberal puppet. Crawl back under whatever hole you slithered out of", "micodin777": "Get this little ass kid back in class", "_carrsonn_": "There is no scientific evidence that Co2 emissions are the dominant factor for a change in the climate", "ely4012": "Pscopata", "quickjam2": "Tell us oh wise one, how does co2 warm the planet??? And don't use that ridiculous claim that it blocks out going radiation and not incoming!!! And to my knowledge heat still rises!!!!!!", "noel.bs_": "Kindergarten kind", "_._elikaa_._": "@gretathunberg fuck you motherfucker", "georgeranevsky": "ICON!", "moritz.tms": "🤮", "charlie.vy": "U look abit angry my friend", "prestigelengthshairandbeauty": "Actually whilst u are \"preaching\" to the world to become famous and causing people to protest, whilst these protests occurs u are bringing traffic to a standstill with car engines pumping more Co2 into the air. Truth is we will not destroy planet earth, maybe just the human race eventually,but as it has done for the last 400 billion years,the earth will adapt and evolve. U want change over night,this isn't something that will happen I'm afraid. School strikes u applaud.. well done destroying kids education. My advice... quit trying to become famous. Hitler was a also a brainwashing dictator .. just a thought.", "anythingforaquicklaugh": "You're getting bullied", "tom.giillespie": "greta why arnt you making me a sandwich im hungry, you could use those massive arms for my sandwich", "felix.nilsson.04": "And science says diesel and twostroke engines are the best, but nooooo, they're called the bad guy. The worst offender to the climate are electric cars, but those get so much praise for being environmentally friendly, they're not, don", "landwirt_aus_sh": "How dare you", "j_06.lc": "In the 70s they said that in ten years the world ends and here we are, unpresentable communist", "jaxom.schwarz": "the CEO of nature is angry", "clown_shoo": "Ok puppet👍🏼", "yulissanv": "@robdelahoya", "aliyahchecks": "Bitches be smart", "rathjineet28": "U bastard You’re so ugly", "palatpanir_": "youre such an inspiration!!", "monteiro.elvio": "😂😂😂😂😂😂😂😂😂", "x_lylaaaa_x": "👏👏👏", "game_and_watch13": "Go back to school and know your fucking place trash", "mert.bysn": "Can you read diputs other way round?", "jirkaptacek666": "🤮🤮🤮🤮🤮🤮🤮🤮🤮", "roseflowert": "TEAM GRETA 🌍🌏🌎", "charliev45": "Weirdo", "luca_ardeu": "🔥🔥🔥", "svenska_masspsykosen": "Wow vilken tuff brud. Vad har du uppfunnit? @gretathunberg", "husaria87": "👎👎👎👎👎", "bryn.15": "Grow a pair", "childish_mambino": "С таким лицом тебе нужно в школе двойку получать, дура", "tini_mcmillan": "She looks so fierce and determine!", "juanmariarce": "q enferma", "sonny": "How dare u", "jesseengelland": "Ur actually dumb", "mz.slimthick": "@sevimli3_1 this young lady reminds me of you ❤️", "j1wavyy": "your voice pisses me off", "kiki_je_letadlo": "Go rather to school, that's not for you little girl.", "joshhr14": "She didn't write this, some account manager did, just like she didn't write any of her speeches. It's not her words. The left is brainwashing our youth", "superhjalteelin": "@greenmovement2017", "brdncpr19": "Ur adopted", "notjustmusic_withkaran": "Why so many followers", "xx_the_jedi_council_xx": "Why do you cry about the fact you should be in school yet you put yourself in this position, like bruh sound effect # 2", "vivianzwamel": "Tjena snygging", "r._.jary": "Who else is here because of the meme", "athana_gav": "Άιντε βρε πουτανοσπερμα", "haz700": "How dare you", "oisin.simo": "Free r kelly", "ecnirpneno": "we meed more jaquie fresco in our world, smile.", "alexander.dagsberg": "Now that’s some crazy translation, lemme guess, Google translation?", "josrey1903": "👏👏👏🎶❤️", "paul.ha___": "Fuck you bich", "lea_leitl_": "Ugly bitch 🤮", "roan_de_hertogh": "how dare you", "matthewjohnryan": "My only concernsy are you can write and read stuff but you seem to have a general lack of knowledge on facts. You can't answer simple questions which you should be able to. And why didn't you nominate your own country to sue when you petitioned them initially for lack of action?", "k7_andrxs": "Wena ctm", "jakub_malota": "Jaahahhahahahahahahahhha shit", "ascione_giuseppe": "👏👏 👏 👏 👏", "isak_beta": "Frächi göörä", "x.cep.x2009": "You’re a strong kid who is making everyone aware. People will thank you one day even if the greedy ones don’t! Thank you 😘", "itsbr4ve": "Ooof the ceo of nature is mad 😡", "renatureman": "https://www.instagram.com/p/B3c0fcbHSxK/?utm_source=ig_web_copy_link", "vaclav_istvan": "@kazma_kazmitch že by novej díl?😅😅", "imback697": "Co2 is plant food fyi. Co2 levels were 10x higher in the past and everything was just fine. 500 climate scientists wrote to the UN that there is no climate emergency. And how come if someone ask you a question you can't even answer without a script? Could you show me those so called ecosystem collapsing because of this great great \"climate crisis\" we are experiencing?", "doktorzamimove": "How dare you", "_____dino": "Your speech ? You little mutt it’s all scripted you wouldn’t know left from right", "ishita.jain09": "I can't believe people r so negative and they can be so hateful towards a 16 year old and seriously what all were u doing when u were 16, probably not giving a fuck about the world! So please if u can't support her then keep ur mouths shut.", "habsandchevys": "You crazy", "ghost718edward": "😂😂😂", "dc213dc": "you’re such a pathetic clown", "mtbteddymtb": "Fan vad sur du är", "pr0retr073": "🤡🤡🤡🤡", "bro_egora_kreeda": "Суууучька, боооольнаая!", "stellagarotti": "@euan.reid__ oo yummy", "ego_maipiu": "gino", "bri_chepetlaa_": "why does she always look depressed?¿", "bobbi.turnbull": "@fynnshaw0904 ur lass", "rithienroll": "Bullshit", "crisfacco": "🤦‍♀️", "compressedairo": "Ben Shapiro vibes.", "komando_plague_schizophreny": "Se uma desgraça dessa leva 3 tiros na cara não vai mudar nada na terra e menos uma praga , fuck you stuped fuuuuuuuckk yyyoooooouuuuuuuuuuu", "jan.mrkus": "🤦🏻‍♂️", "kavin.be.pimpin": "Greta I have one question for you. Do u travel by plane and car or do u sail across the ocean and walk?", "typisch_mirror": "Bitch🤔", "andrescarche": "🤮💩💩💩💩🤮🤮🤮", "savva_8595": "Лицо как у дауна", "swipecardslowly": "Dont give up and dont get discouraged, You are challenging groups who dont care about you or your grandchildren. Our planet is very fragile and so are we...both are in desperate need of change.", "gabriel.the.amazing": "How about you target India, Africa and China you low IQ mongoloid, the U.S. and Europe produce 100x less trash, waste, carbon fusions, than those other countries. The simple answer why you dont though is because the U.S. and other European countries are being targeted for reasons unknown to the public.", "supreme._.weeb.3.0": "CEO of nature looks mad", "ig.kerryx": "@_.sj._.photography._", "clothilde_letexier": "@xleeloux c’est elle ?💍", "gabriellepearsonn": "wasteman", "we_can_fight_for_climate": "You are so strong and brave. I hope that one day, I can make as big an impact on the climate as you have. Thank you for fighting for our world.", "j0_bamba": "🤡🤡🤡", "lfl3x": "🤡🤡🤡🤡", "aldussnow94": "Bojan Stan, thats the man, but you are Just a girl, whos angry on all world😂", "aaron_4634": "❤️❤️❤️❤️❤️❤️👍👍👍🤘", "meowfie": "You go Greta! 🙌", "benjah_679.em": "Nigga😂", "fit4mombrooklyn": "👏🏼👏🏼👏🏼👏🏼", "hamburgwestkings": "B I T C H", "blue_riox": "HOW DARE YOU?! 😭", "svd_quirin": "so called schulaufgabe", "schcris": "👹👹👹 Cret(ininha)....🤣🤣🤣 🤡🤡🤡", "sebastian_vivas98": "Pendeja puta", "portillo__97": "She looks like evil 👹", "polibiosswhore": "we hate u muah", "bluefiremagnolia": "@gretathunberg the PR people who propped you up to this drama forgot about your parents and their great contribution to the so called CO2 emissions ? You could have used internet to communicate instead of yachting ur way to UN and blabbering the shit you said. The truth is you are funded by a darker society who wants to take the world back and scarier part it’s funded by the morons who destroyed the world. You are nothing but a mentally unstable girl being used by the liberals. You don’t deserve anything you get and everything you speak is being taught to you. Your society was developed emitting tons of CO2 and you are talking all this now and the developing world who has no means to afford for cleaner energy should just get wiped out of the planet ? Can you tell us how the 35 member crew who came with you to New York for your yacht adventure got back ? They used airplanes , stop fooling. Russians know who you are and your family and your filth. Fake you are ☝🏽", "poisonous_avacado": "Gayyyy", "youngandwise99": "Hook, line and sinker. -The Scientists", "thomaslo_chs": "Bring back the ****ing v12s", "luborepasky": "Kurva jedna 🙏🙏 🔥🔥🔥", "denchowski": "If CO2 levels are the only thing you are worried about, you clearly know nothing about the issues we face regarding climate change.", "anderson_fernandes_bmx": "laughed a lot when President Donald Trump ignores this brat🤣🤣🤣🤣🤣🤣🤣🤣go back to school, go study, system puppet! I hope the world gets into world war 3 because you little girl talking nonsense will be responsible for that! 🤟🏻👿🤟🏻 and their sponsors, George Demon Soros, All Gore are going to hell soon! the true Brazilians, we will not allow control of other countries!", "jasminefourie": "Amazing @majaziden", "susannakjellbergart": "♥️👍", "kazu_kanau_55": "好む好まないのではなく。自然はあなた方を見ています。その世界は目の前に来ています🌏二酸化炭素排出ゼロ地球温暖化STOP🌏海水も陸も温度が増せば増す程、自然災害は脅威を増す。自然災害は計り知れないだからこそ自然エネルギーと防災と環境問題に今後の蓄えが必要不可欠です。", "silverspoonzen": "Go go Greta! Save our planet! ☺️", "justin.pajor": "On da gang", "george.tts": "Put more makeup to look like you are crying kiddo", "millegoldstar": "Scientists are LIENTISTS!!! 🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "peyser_04": "Why yo forehead bigger than the Eiffel tower", "maquiavelico_27977": "😍", "aishakick": "I dont know if you are in the proyect MKultra with the illuminati, I tjink that you are with them...", "sahalmaymon": "I MEAN NO HATE BUTTTTTTTT WHAT A CLOWN !! you are new malala!! TALK ABOUT THE INNOCENT PEOPLE DYING IN SYRIA !! TALK ABOUT HUMANITY, POVERTY!!! YOU HAVE THE PRIVILEGE TO SEND BEFORE THE UN THEN USE YOUR VOICE FOR THEM WHO ARE DYING LIKE ANIMALS!! TALKING ABOUT CLIMATE CHANGE JUST LOOK AROUND!!! TRYNA SAVE THE PLANET YEAH WELL SAVE HUMANITY FIRST !!!!!!! STOP THIS SHITTY DRAMA OF YOURS!!!!!! PLEASE!!! And yes complete your school too tho.!!", "fionacoco89": "Greta, is mankind going to be alright? Tell me the truth I have eyes and ears for it!", "vitiligo_colour": "💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚", "garik4789": "🤦🏻‍♂️", "jonathancguerra": "Mimimi... 😂😂😂", "james_deblois06": "Eh", "becoming_theone": "Fake", "andrew_6.2": "💩💩💩💩", "elvis_buhr": "Som att det var du som tog reda på den infon", "scallywag_b": "Why don’t she take her silly ass to China .... go tell the commi’s to clean their air ! Wait let me answer that . She and her cronies would be locked up and beat daily for inciting propaganda and lies !", "daniel_mrtn": "#howdareyou", "ricardio_brando": "Tötet es mit Feuer", "simon.7584": "@ricardio_brando ertränkt es in Erdöl", "celxn01": "@sanemaleyna die boss bitch😂😂😂😂", "dancer.astra": "@stephenmerchant couldn't help but notice how much she looks like you! 👀☺", "jittyboy": "Your not doin shit you dumb little cunt kys", "jason__cowles": "How dare you are 16 years old and has no idea what is happing so grow up.", "24_pack_of_gogurt": "It’s not only the US. China and other shitholes like that are much more worse than us. Go try telling China to lower their emissions and they’ll tell you to fuck off", "juliana_mendoza333": "Fuck toy gretaaaaa! You don’t even know what’s to come from poverty! Talking about you guys stole my childhood! Fuck you", "ystor.a": "Don’t get me wrong, climate change and global warming are problems but in my view they aren’t the only problems and we shouldn’t only focus on them. There are children dying because they don’t have enough to eat, still people don’t know how to read/write and in America it’s easier for 20 year olds to buy a gun than a beer so in my view it’s good to do something for climate change but we shouldn’t only focus on it.", "zoltan_steven": "Well the NASA scientists said that climate change has to do with the rotation of the earth...meaning there's nothing we can do about it....whoops", "benni_jrs": "@gzl_paul", "ludovica_dells": "ehi faccia di merda", "larakeane09": "I’m a boss ass b** @cocohealyoconnorr 🤛", "_mjjohnsonn_": "Skank", "ali_alshami9": "Shut the hell up", "fatihgul025": "It's ridiculous how a 16 years child is speaking in such an important place.", "realericalynn": "Science also says there are only 2 genders, but most libturds don't want to believe that.", "i_r_e_n_55": "You are great Greta🌷❤️", "nedb4l": "💖", "amelie._.michel": "👍🏻❤️❤️❤️❤️❤️", "okandengi": "Bshitter", "kernibaer": "@tobiedelb schau wie sie blöde drein schaut", "adam_sasin": "Kráva seš", "juliankls.04": "Lösch dich", "tiffanyclaeys": "Bitch you should go fuck yourself. No one gives a fuck about your fucking opinion", "anniexrae": "joe mamma", "mgracewilliams04": "The CEO of nature is MAD. THE CEO OF NATURE IS MAD.", "anasta.george": "Go away you idiot", "daniel_.mx_": "🤢🤮", "tdmorgan0": "Fix your attitude", "raberhashem": "Gå till fkn skolan för i helvete", "elouise.2019": "💖", "l.e.e.l.i": "🚀🛳🛩🚀🛩🛳🛩🛩🛩🛩", "i_luv_china_china_luv_me_": "Me getting mad at the CEO of pollution", "madhav_s_xxiii": "You Dick", "shamriz.khan1": "🤮", "gunner.s.09": "All your doing is suing countries that don’t even give out half the amount co2 as China or India. Stupid bitch 🤦🏻‍♂️", "xx_diamon69lord_xx": "Ur flat af bitch", "jaime._lr": "hahaha lmao🤡", "galanopoulos2": "virgin", "tessiee19": "@ninavanamsterdam dit is dat idiote kind van die klimaat toespraak, heb je dat filmpje gezien?", "_adinanabdulla": "Yes👌👊👌👌👌👌👌greta", "electra_heart08": "Aww....you are so inspirational.. attacking others and being a hypocrite...if you want to stop trees getting cut down...stop writing your awful speeches on paper!", "epic.gama": "Libtard", "tb1907tobi": "🖕🖕", "lennard.pra": "How dare you", "steven_.2020": "Still gonna straight pipe and tune my diesel", "_bb.9_": "Oh so pretty 🤮", "karinsnis_": "@malin.olssonblom", "official_lena63": "Werden Kinder jetzt auch noch die Weltherrschaft kriegen oder was 😂😂😂@x_zuzia_14", "loprezel": "#dougcoe", "bentheeshay": "🤡", "agnunez108": "Pero tú quién te has creído???Primero trátate tú,que dejas bastante que desear", "mo.ejaz97": "Du sollst stevren", "robin_963": "🤮🤮🤮🖕", "b_coneybeer": "You aren’t helping the cause. You just talk angry into a microphone, while lesser known individuals are out there ACTUALLY trying to find ways to help our planet.", "sky_the_l0st": "I think you mean inclination in carbon dioxide emissions right? I thought the greenhouse gasses were the problem", "matthew___williams": "lol", "gpsy_familia": "Fuck you bitch, look the childrens in syria and palestine.", "kxv.249": "Fotze!", "pizza__darian": "How their u", "de_nuke2": "Co2 stonks are not so well", "lil_ferryy": "Kut kind", "ram.nicos1a": "You are 16 and you havent got boobies haha you should give up", "tiago.92": "Illuminati puppet", "1.edsel": "äckel", "jessie._.wren": "Is she even a bloody scientist", "thijsspoelman": "What would the world be without you!", "alexander.bbls": "to hard for me i think you have big problems", "tomglasby_": "@alex_glasser when mom say no fortnite 😡😡😡😡", "s4tanb4by": "Eshay", "oc0___": "@nickfoster7 how dare you", "heri_trejo": "🤡🤡", "vabe7": "You look like you are a bitch to ppl", "m_tuzovsky": "Fucking stupid little bitch, die in hardest pain whore 🤢🤮", "andy2222andy2222": "Get the fuck out of here nobody cares", "ynotferrinda": "Maybe we should ground all aircraft and ships... turn off all electricity and gas... stop all trains, trucks and cars and maybe then the world will be a better place! Hopefully you will become a scientist yourself so you can do your OWN research and know the truth about climate change. The world is evolving and won't be here forever and it won't be climate change that ruins it! Armageddon is just around the corner.", "el_brandon_503": "Yo she got famous over a stupid speech... 🤣 climate change is normal, chill tf out. Y’all actin like it’s something nobody experienced before. Just stay in school fr. Yo grades probably failing cuz you be worryin too much over climate 🤣", "gustavov.oliveira": "Rola", "_bulijan_": "Mo ass Mo tits? Are you really 16??", "albert.f521": "Noch single ?", "1jamiethomas": "You defo wear shoes to bed", "blowboy14": "FCK GRETA", "beinggmeghann": "Cannot believe this.", "george_turn3r": "Stfu and actually do something", "felipe___.ll": "Marioneta", "anna.the.mango": "So inspiring!!!", "caleb_szargowicz2": "The past two generations didn’t ruin shit for you we’re fighting in wars when you were sitting on your ass just cause you say something doesn’t mean your shit and by the way saying a problem doesn’t fix it ur just a kid with a wana be cool life @gretathunberg", "iamjelenaofficial": "@gretathunberg and @jamie_s_margolin you're both doing amazing work", "nikoladejanovic1": "@jeri_dizel #gretakurveta", "_ta_rr_es_": "Why arnt u in the kitchen", "mihaiqtm": "Bruh u look eleven", "brandontalob": "u offer no solution to the devastation that u would cause", "william.nicholas_89": "@boyanslat is really a threat to you??", "briseis54": "@instajuodulytes I cannot see any sense in the comparison of atomic bombs and reporting data concerning pollution. Maybe you will understand better when thinking again. I give you a hint: gathering data does not kill anyone. ;-)", "at_flyy": "Damn bro das crazy... I don't remember askin tho", "erlaine_ferr": "🤔🤔", "luisdiazgds": "This is not science, it’s a socialist agenda", "fukaaron": "Assburgers right", "onelove1ryder": "Your such a Boss❤️"}