{"graceistewart": "What does that say? Sorry I don’t speak the Francis", "denminstamor": "+", "fxn_2005": "🖕", "yellowcrayonkid": "vegan brat", "sandronovaisoficial": "Só entendi a parte q fala skol", "jacobcleary_5": "You are stopping education for something humans have nothing to do with and cant change?Jesus christ you really are being used and misinformed 🤦‍♂️", "light_arts_": "All these people are using banner and colours for the protests that destroy our environment too if you really wannna do something plant tree don't do dumb protests", "isaac.zachrisson": "😍😍😍", "kadir_sygn": "🇹🇷", "blaisebennefield": "Good thing no one gives a flying fucj", "__yoonlee__": "Ya yeet", "radbrad7111": "Better plant some saplings with such a huge crowd. Just sitting down on the roads won't help", "gl44ch": "🛩", "hsn.mhmdbwhsn": "👏👏👏👏👏👏", "yourecolostyle": "🥰💪💪💪just amazing", "giorgia.de_stefanis": "È un fotomontaggio", "evanz_0327": "The sheer amount of toxicity in the comments of a 16 year old climate activists post really makes you think about how dark and horrible the world really is.", "dado.simonelli": "BIMBA MINCHIA DI MERDA", "kim.p16": "Dieselllllllllll", "pinatel.ozenka2": "Сборище идиотов, которых используют в качестве инструмента для отмывания денег", "adolfpikelhelm": "incredible we are still going to die", "landon.knuckles": "ignorant ass", "ywhyya": "Sagdaki ablanin tel ns", "chadisjuicy": "trash", "oneplanet_left": "Amazing! If only more people would protest like you do!", "xstardog97x": "School is spelled with a C not a K silly!", "karanbhoir154": "you use cardboards which come from trees", "bobsponge6_9": "This shit gay", "dra.gabrielagilperez": "🙌🙌🙌🙌❤️❤️❤️❤️", "laurin.shl15": "Lösch dich", "bridzetabritanija_": "Good job Greta!", "weloveourfirstfamily": "THE PROTESTERS ARE ALL HIRED BY THE GLOBALISTS TO PUSH A DANGEROUS GLOBALIST AGENDA!! 😡 #CLIMATECHANGEHOAX", "sindy_536": "SkSkSk SaVe ThE TuRtElS", "fridakihl05": "E det dina kompisar", "robopigeon_501": "🤡", "_sara_marchione_": "Never give up💘", "hugh.mungus1776": "Bull shit", "i.c.e.b.e.r.g__": "Bence çok konuşuyorsun", "beamofgay": "why is sinjin in this photo", "opizwiesel": "Go back to Sweden your home country and initiate tuesdays against test tracks in the north of the country.....", "mason.marrs33": "You’re a fucking moron", "billy_graham_777": "Amazing 👍", "sixthwizard": "GO TO SCHOOL", "farshid_mohammadi240": "#The_Dilemma_A_Film_by_Farshid_Mohammadi", "coach_jon1984": "Little eco tyrant. You need to say something about India and Chinas pollution before you point the finger at us.", "alexander.dagsberg": "Wew, that’s some nasty children not getting the right education in their life career.", "malachi._.ak17": "Now here’s a good way to get out of school", "bmanus078": "Why did you kill a tree just to make that sign pls plant a tree instead of killing one for no reason", "matteo__dg": "Go back to school", "tobi_11.6": "🖕", "coco654867": "🤡", "monteiro.elvio": "crazy! 🙄", "fint117": "Wtf just propose ideas to the government don’t go on a school strike cos you’re ruining your education actually do something instead of doing pointless strikes. Twats.", "one_clums_boi": "You ugli", "k.petrushevski": "You are so brave girl👏", "tonimaycrochet": "Those kids need to stay in school. If they actually plan on helping the environment, they need their education. Being all bark, and no bite won’t get them far. They should be more like these kids😊. . . . https://www.elephantjournal.com/2017/06/14-child-inventors-who-just-might-save-the-world/", "harrryli": "Bro shut up no one care", "mellowshooter": "free @barackobama", "ericrogerssss": "@boyanslat needs coverage too", "moilee": "✨♥️🌎♥️✨", "jakub_malota": "😱", "zaka424hk": "Fuck greta", "just_bout_life": "Ask me who is Joe", "kayo_marbilus\nVerified": "Verified", "_karsten_peters_": "Everyone, we need to stop making fun of this girl and instead put all the blame onto her parents and the far left, they are the ones who are using her for the political aspect of climate change", "666gang666gang666": "🥇", "schcris": "Vái estudar amada....ganha mais.....conhecimento....é mais difícil ser manipulada....😉", "carolinajosephsson": "❤️👏👏👏", "poisonous_avacado": "Gayy", "bb11gg6": "Why anyone would want to pose with a moron like @gretathunberg is beyond me", "_.keomaferhati._": "Manipolata", "ppurple.haze": "Stead of blablabla make your 7m followers to plant one little tiny tree each. But it is easier for her and her admirers just to talk and talk and talk.", "becroww": "Instead of protesting why dont they just do it themselves instead of asking other people to do it for them. They could go to the amazon and plant trees", "marios_fysseas": "ΡΕ ΕΊΣΑΙ ΤΡΕΛΉ ΡΕΕΕΕΕΕ", "annarshe": "Geh mal zur Schule", "phil_51e": "#climate#active#fisting", "jonnysavage619": "I like ur motives don't get me wrong but not going to school isn't gonna change anything I recommend u keep going to school just protest against what you've been protesting", "domenix.00": "Fuck you you little shit all you want is to get popular and have fame but 90% of the population hates you", "robinschhh": "@jannik_wiedemer", "microwavablesausages": "Wat dat sign say", "mr_znakez": "🤡🤡🤡🤡🤡", "stangretathunberg": "❤️✊🏻", "ida.12308": "🤮🤮🤮🖕🖕🖕🤮", "jakelentfer": "Bit disabled", "that_specific_person": "Just a question, how many death threats do you get in a day?", "notsomagicmike_69": "Lil brainwashed weirdo", "dhdluuudluduldkzdkzdkzdcfggtg": "Who shit in your brain?", "tollylockett": "💖💖💖💖", "joepvietsch": "Yeah, you go girl!", "kellygawronskii": "This is making more waste for the plant congratulations for using more paper 👏👏", "d_a_n_a_e_l": "🤡", "_bb.9_": "For nothing 🤦🏼‍♂️", "hey_hi_sup_hi_": "👏Good job! Save the Earth !🌎", "lsilva64": "#TRUMP2020 #MAGA🇺🇸", "mmarijan209": "You should rather go to school than throw fits in front of millions of people", "killing_machine_swami": "Night Rider", "k0n5tan1n_c4375": "Alle debielen", "isadeltango": "come to Orlando!!!", "blowboy14": "FCK GRETA", "zekestopinbags": "I get your message but supporting truency is not good at all were I'm from if you didn't have an education you would end up dead or in jail", "mxxe17": "In Germany we call this: WER HAT DIR INS GEHIRN GESCHISSEN DU SCHULSCHWÄNZERIN", "sir_nigwurdagua": "@landyn.dugger next thing you know fucking gun shots go off and they’re protesting 😂 I have a fucked up mind just ignore the comment", "b0bbysins999": "Climate change is a natural part of the earth cycle, go back to school and learn about the great depression and hang out with ur friends or something", "wildebeest519": "If you're in America spell like it. Just sayin', Asbergers.", "ameliamorrowlikespie": "@esti.brady I love you", "quentchristensen": "🤡", "julliamoser": "You are awesome", "zavtraaaaaa": "How are you getting to all these climate strikes if it’s a plane rethink your hypocrisy", "ky10ma": "🤡🤡🤡", "allthingsaviation12": "This is fucking her own education up though. Not really harming anybody else.", "david_board_shop": "Amazing Keep up The Great Work 🙌🙌🙌For The Planet Future🌏🌎🌍", "daniel_christianson": "🤡", "josef___toprak_l": "Hahah du är i usa och har svensk klimat skylt", "confused_jam": "I love you Greta! Go sister ❤️❤️", "hikolay_ksehdzov77official": "Гретта, мы с вами вы все правильно делаете.", "lxthxr_sth": "No god. NO GOD PLEASE, NO🤮🤮", "noalaextincion": "bien ahi loca, con mas de esto vamos a salvar el planeta", "rosie_bud_7": "I love this , but what are we all doing ? To help , I am cutting down on waste and use mainly only public transport", "khh232": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "adamboijabarton": "#sotasåinihelvetemedd24an", "kompis_blatte": "@helenaamirzai FOTBOLLEN ÄR KL 10:45", "piyush_3699": "Insted of striking you have good followers why dont u encourage them to use eco friendly vehicles or not to use plastic or just tell them to plant trees . U should plant trees . Look as we are humans we survived the great war from all other specise and we have to shape earth for us but we are destroying it doing that. The earth needs to be saved from us, not pollution", "________steven________": "👍🏻", "_teacheralex_": "Siberia influences the 🌎 world climate. Save it!", "briseis54": "@wistfullywasted - well firstly - you do not know me and what I do and have been doing for the environment - so -please do not talk about it. As for the Malizia II - it is not Greta’s ship. She was invited to the USA to give a speech and wanted to go there without emitting CO2. The sailors heard that and invited her to bring her across the ocean. If you really want to know about the foundation which owns the ship you can read more here: @team malizia. And if you want to help plant trees like I did this is an possibility to do so : Some days ago I donated 25 Euro to plant 1000 Trees in Ethiopia - https://www.menschenfuermenschen.de - You could also give them a like on facebook. They will plant a tree for every like.🌻. Each and every tree helps us to breathe fresh air 🙏☘️🌷🌴🌳🐢🐆🌾🌿🌱🌲🌍❤️", "samuel.cantens": "Downtown lmao", "keyvan.sgn": "Go to school", "xc.ang": "How dare you", "_._renzo_hc_": "☢☢☢☢☢☣☣☣☣", "bluemchen77777": "Greta, du darfst in Zukunft immer meine Benzinrechnung und meine Heizung bezahlen 👍 Geld hast du ja sicher inzwischen genug verdient 🤬", "reis9045": "🙌", "sundays_for_future": "Wow!!!!", "jd_vm": "Sorry but ur strikes don’t do shit you guys just party and litter.", "eric.creis": "🤢", "chris.flemin": "No I just wanted to skip school didn’t u", "karsssyyy": "why does a lot hate her, she didn't even do anything i-", "sunceuv": "✈️", "gareth_honey2.0": "What in the f is a climate strike how does it work are just not using the sun the for a day are you not breathing. Somethins real fucky about this kid to who ditches school then wines and then complains about ditching", "huggle_": "shut the fuck up dumb bitch", "epic29nr": "Your strength and commitment are inspiring and beautiful. You’ve moved a generation to take a stand and awaken those of us whom have sat back and allowed this environmental tragedy to happen. Thank you.", "hkconstalize": "“I should be in school on the other side of the ocean” and then she proceeds to lead a school strike", "cudalibre": "#fridayforhubraum!!! Wir tun was! Ihr redet, blockiert und kostet ein haufen Geld! Schämt euch!", "spoltorsyt": "Nej", "bisonsfanpolska": "🤡", "abdulbaki.01": "You cannot defeat Islam, you cannot digest Islam! Only Islam will prevail. You are defeated and you will always be defeated. Look at the justice of the Turks. The justice of the Turks is no wonder. Those who promise the gold of the land to the Turks are always under the ground now! @gretathunberg", "un.random_n": "Fake bitch", "mikefla_tenn": "🤡🎪", "hhenryroquee": "Gay", "garrettcowart": "You took yourself out of school to do this, so don’t blame us for your problems.", "lilthomsss": "Fanculo le cannucce di plastica, viva le banconote per pippar la bamba🔥", "fsb_nikto": "Salope, grosse merde!!!🖕🖕🖕🖕", "freiplastik": "❤️", "ryxboyce": "Look at these people missing school 😂😂 they’re gonna regret when they have a shit job in the future 💀💀😂", "marou.aat": "How dare you?", "abbe.b8": "How dare you have more haters than fans", "sobasicallyimadeanewacc": "I established communism on a minecraft server", "mitchb_11": "Big gay", "lucyisobelfinlayson": "Come to Edinburgh at the next one!", "gurra_lundberg": "How dare you", "aliciamarie_villa": "We need more of this on social media!!! 💜💜", "reaperguy826": "Just get out from US. Go back to your school!", "maffyou1985": "Ffs just go to school", "gretahasdickinherass": "nobody gives a shit", "bikelifefe_offxcxal": "Take a braaaap", "tinnaaaaaa": "@bryantino.99 @tembi12 @simcard_g @chasehoward99", "sadiebodzin": "Not to brag but I was there 🤩", "k1ngdan1el": "Stay strong", "ben_walden14": "#whoCaresAboutTheAmazon", "charlottegripton": "go to school love", "desertcasino": "Let’s make the next step A CALL to ALL the WORLD’S YOUTH to FORGO vehicle ownership and only take PUBLIC TRANSPORT !! This will be the MOST POWERFUL CAMPAIGN U CAN OFFER!!! Let’s do this!!", "aniahelman": "These kids are amazing. They all gave such powerful speeches during this event. Good work kids...... change is coming!!", "sdhwmaha": "Go to school!!!", "caspar.29": "I love flying by plane", "finlay_mccrae": "Sket", "ail99s": "😍", "tropic.mango.spam": "Comment section is why we deserve extinction", "selimbozkurt61_": "Yer cucesi seni", "ilikedeadmemes12": "What do you think about all the memes about you?", "carl.ac": "Im Driving my car as Long as i want", "david_losxh": "go back to school kid", "louis.m_g": "I've got a new slogan : Make love , not CO2 !", "lilifee_2016": "😘😍😘", "adal0rtega04": "Me cagi en tu familia mierta", "nara9466": "🖕", "samuel_haggblad": "You should be back in school", "rebecamagalhaes01": "#adv #folowme #f4f", "jach.pixelart": "Retard girl", "adam_lennard_": "Climate change is a natural process ffs. I’m personally enjoying my summers getting hotter! ☀️", "badboiboris": "HOW DARE YOU? YOU STOLE MY COMMUNIST PLANS FOR USSR REUNIFICATION WITH UR CLIMATE. NO ONE GIVES A FUCK 'BOUT THAT", "lukas.buesing1": "Wegen dir werden SUV zerstört was dem Klima auch nicht hilft", "burgoss_daniel": "@realdonaldtrump @jairmessiasbolsonaro 😘😎", "hmagovern": "Boohoo, quit whining", "arran.brown24": "I shouldn’t be here", "oxikcz": "hOw DaRe U?!!", "thesaturnicgoat": "Going good. Great job. So proud of you Greta.😊", "aviromdro": "You're poluting, you have an instagram account and he is stock en data center wich actually polute", "hikaradag1": "11. 3", "vvrobrother": "Vibe check", "dabigchungusboiye_mexicanonara": "Disgusting🤮", "savetheheartnow": "🙌", "zcranez": "All the kids and Teenager only were there to Not go to school", "kaeli_swanson": "Isn’t sis home schooled tho lmao", "sadboiislife": "I bet she drives a car", "marti_leis": "🤡", "dyvatrivia": "Gurl look at you ❤️", "mafakcer": "Can u stop causing noise pollution first?", "j_gn1": "🤣🤣🤣🤣🤣🤣🤣", "priincessjxsmine": "Du misstiges misststück", "cembo26": "Report USA and China kid. Not Argentina or Turkey.", "_35h__": "I would actually fuck her so hard it’s unbelievable like I don’t even care ugh she’s so dreamy ❤️ is", "saramoh97": "#save_the_iraqi_people", "_nicorob_": "Aguante trump", "willis_delta54": "Kill yourself", "vitaeglass": "Love what you’re doing @gretathunberg , keep it up. We will support you all the way ✌🌏", "pablo_bourbon_official": "Your a meme! Lol", "unknown_by_many99": "🤡🤡🤡", "romanwelsh123": "No", "justinefriendly": "Keep going, you inspire me in so much different plans even if you’re more young than me 😃", "jobsonalex": "Slag", "_alessandrasantoriello_": "ce fatt a pall sorè", "cedge_gutierrez": "Punchable face", "putragiarta": "Soros love you", "nika.helin": "Dann benutz doch erstmal kein Handy 🤨Batterie bzw. Akku anbauen ist ja auch sehr gut für die Umwelt🤦🏼‍♀️", "mxhammed.m": "Shut up", "patrickiwinski": "Drill baby drill!!!! Build that oil pipe!", "joe__vickers": "Go back to school and come back when you find a way to stop climate change instead of just protesting about it", "_titan_of_memes_47": "Fuck u climate is dead", "_xxking_xx_": "How dare you", "waveydamo": "HoW dArE yOu?! We StAnD bEfOrE a MaSs ExTiNcTiOn! 😳🔥💯 @h4roin @fakegxx @k47shawty_", "friends_of_the_enviroment": "I am posting videos about our environments and climate change. Please take a time, have a look in our page, then follow us if you would like.", "burntdaddy420": "Look at all those signs made from paper and wood😂", "eddiemillerofficial": "Biggest lesbian and gay convention I've ever seen", "0lliew": "Look at you, you actually look live someone who was involved in Hiroshima", "saleena.aman.90": "Hai greta we support yo we arranged a school strike 🙌😍", "francis.gorgis": "Ja japp din mamma din kuksugare", "_dafurr_": "Who's joe", "raami.77": "Ja ska trycka din mammas fitta så hårt horunge how dare you själv @gretathunberg @gretathunberg @gretathunberg", "mikael__1990": "Fak you", "overlyfast": "Get a job", "liloffline__": "RANDSOM", "samkpatel": "Hey @gretathunberg I don't hold any grudge against you or not jealous that you are getting so much attention. Though, I just need to know what else have been you doing for environment and climate change on the ground apart from holding rallies and swearing at countries?", "jawin_rafael": "Dislike", "caim_04": "♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿♿🤡🤡🤡🤡🤡", "_juliancappuccio": "How dare you", "ivanovic__027": "Greta DA PUSI KURAC #jeridizel", "homeboy_tom": "No cap u the cutest girl in the jawn. U so hot", "antisocialleague": "Why don’t you actually invent something or pressure China to decrease their carbon output?", "beckham.argosino": "Imagine taking all the fame from actual scientists and ecologists trying to pose a solution.", "203.marco": "A 🤡 with asperger", "e7_niklxs": "@realdonaldtrump", "brycewhiite": "fuck you", "cew05127": "Kahba", "m.a.c._designs": "Look up boyan slat and you can see she is all for more taxes!!", "gabe_renza": "Oh shit it’s the CEO of Anger get down", "qtpasa.e": "muy bien greta!!!!!💗💗💗💗💗", "yungskeethoe": "cwybabyyy", "2004_fordexplorer_sport_trac": "Yes go on strike and dont get an education you clearly need", "notzafod": "Says that she should be in school, also doesn't go to school and makes other kids come out of school for strikes.", "66_daniel": "✡💵💵💵💵💵✡ only think u want", "masih.___": "No one cares tho", "martin_ivanov23": "You’re stupid", "powersurge._": "How dare you???", "iamthehelpman": "❤️", "james._.du": "your parents have made 50 million out of you eh?", "colinf34": "U look like Obama", "rikusuo": "☺️", "brennan.merris": "How do you travel over the world? By plane? Car? Train? All things that burn fossil fuels. #PracticeWhatYouPreach", "ramkumarjhen": "👏", "angelholmbloppis": "följ oss, vi säljer begagnande kläder! #räddamiljön", "mostafa_faruk": "Clean energy plant generates electricity is larger than the largest power plant in the world and the cost of building only one billion and need maintenance every 100 years and generate clean energy I invented it", "bakisarici": "Senin ben ananın kıllı amına kırbaç vurayım aq veledi", "nikita_scar0307": "Shut up no one cares", "beth.paulla.9": "Seja bem vinda para visitar a floresta Amazônica, Amazônia é rica em beleza natural, cheia de um maravilhoso eco sistema !!", "lettuceisbetterthencrack": "Y‘all should pay more attention to boyan slat he did something but greta was only talking and did nothing smh", "thedhacssseaviewconfess": "amazing work", "zacthecampbell": "Not to be rude.. but really how are you not in school? That actually got me pretty curious when you said that 😂", "matt_ercole17": "🥤❤🐢", "_fixoida_": "🤢🤢", "armula_king_": "Fuck you and live in the moon", "ginomaggiore_gw": "Respect", "jason_jou": "MY 2JZ GOES STUTUTUTUTUTU", "richard.edl": "How dare you?", "smartinacz": "Aspergers syndrome kids are very special and I know it very well as my son has been diagnosed too.. They have different way of thinking, they wont let go on ideas or when they believe in something they will make it happen, as we know many inventors were diagnosed with aspergers syndrome. But I also know how easy they can be manipulated or used and how vulnerable they are. I'm wishing her all the best ❤️", "annaluntis96": "U r awesome Greta... thank you for what u are doing!❤️❤️❤️", "smokestoneymonk": "Ya take kids out of school education isn’t important at all, YOU’RE A 🤡", "amberson_bauer": "🤡🤡", "diimanes.be.ch": "You are such a poor child being manipulated", "al___haji": "#save_the_iraqi_people", "collins_reid_": "Idoit", "freddymike_175_": "🤮🤮🤮🤮🤮🤮🤮", "rob.miln": "@cyrus._.l has a phat crush on u lmfao", "yagizefebodurr": "You dont know anything!", "333drek333": "https://youtu.be/7H9DL6RGkW4 Эту девочку после обращения к ВВ ПУТИНУ избили и спрятали в детский дом", "caittmagee": "Im starting a school strick at my college this coming friday!!! 🙌💯💯", "klauspilckmann": "👍👏👏👍🇵🇪🌞🚴‍♂️🍀🇩🇪👌😎", "smells_like_upgamer": "Shut the fuck up", "cxcaaine_": "Did you know about Italy, Rome that someone just...", "brian_hawl": "Well it’s not like she was very smart to begin with", "idkvay": "Butters!", "bostonreisinger": "Greta, you didn’t say anything people didn’t already know. you’re a puppet, you know things about climate change but not as much as you think you do. Please admit that you aren’t the second coming of Christ.", "faustandrey": "Climate is a problem because poor countries can't help polluting the planet, and rich countries like Sweden, Britain, France, and the United States don't want to pollute the planet. Only on the words of the fighters for the climate! I studied geography at the University and I know more about climate than all the people in the square in Stockholm put together. Let the EU give up coal and lignite, which are dust deposited on glaciers and glaciers are actively melting because of coal dust. And the pure white glaciers would reflect the light and not melt. Let the United States abandon coal, and the Tesla electric cars at least for electricity...but electricity is produced by burning coal and polluting the atmosphere in particular and the biosphere in General. The most environmentally friendly type of fuel produced is gas. Houses should be heated with hot water heated by burning gas. Electricity should be obtained by burning gas, and better of course at hydroelectric power Plants. There should be no electricity produced by burning coal or petroleum products!", "kaylavidovic": "Block all the roads and leave the cars running their fuel to pollute the air makes sense Greta keep it up 😀", "frdrc04": "hOW DaRE YoU", "milanka9129": "Зимой утром я завожу свою дизельную машину и вместо того, чтобы соскребать с неё снег я жду стоя рядом и куря сигарету, окурок от которой бросаю куда попало. А летом сразу сажусь за руль и катаюсь немного туда-сюда, засоряя окружающую среду. Бывает, выброшу при этом жвачку из окна или пластиковую бутылку из под колы. Грета и её сторонники могут в принципе бежать за моей машиной и собирать мусор, чтоб не пострадала вся планета.", "peter.snd": "Fotze", "dwaral007": "Do you now you are the biggest meme on earth?", "jxstin.062": "😂😂😂😂😂😂", "eoth.yt": "Hacker group Anonymous has something to say check your DMs", "lanaklickovic": "@jelena.t10 Greta Kreta", "tommaso_tagliabue6": "VAI A SCUOLA E NON ROMPERE I COGLIONI", "ethanhouse_": "If climate change is real, explain volcanoes", "wlanbitte": "How dare you", "ry_xn_016_": "You don't have good arguments. And what you want? Nobody looking for you klimatic things.", "anthonyzee2": "Yeo lowkey shut the fuck up", "matthis_16": "Boa bist du hässlich", "luke_leonard_11": "When u say u should be in school and do this what a joke", "marinarada2019": "https://youtu.be/EtMIygQYx_s", "prachtsieraden.nl": "🌟", "julian_ilinoja_34676": "🌎 the world will be Great how dare you greta thunfisch", "_marlon.bld_": "1 vs 1 Fortnite", "dennisfinsadal": "Du er en svart jævel", "karleon1337": "How dare you...not going to school 😂", "silvyabudiharti": "@lili_01_lili li, ini kan yg anak swedia itu?", "iheartlexx": "What do you and your parents have to say about your involvement in Soros ... you’re speech so over dramatic ... try being actually heartfelt in a speech someone else didn’t give to you .. trump will stay in office and you may stay where u come from.", "charlottehesling": "you have assburgers", "assxalt": "Døøø din hore", "ma.mv": "Hopefully we can reach to a real solution to this catastrophic climate change .. because I’m sure it’s impacting so many people’s life 💔 keep up Greta we are in desperate need to people like u in this world!", "_m_054_": "🤢🤢🤮🤮", "juqew": "Sksksksksksksksksksksksks", "connectyourjack": "Va' a lootà", "g_hustle_motherfucker": "🤢", "supercat40_8": "Why did the Obamas buy beachfront property recently?", "_jo__na_": "#freejessandruby", "shangool555": "Follow @commando8813", "blakebaran33": "You do nothing for the environment but complain.", "luk_251": "Greta", "ds.huncho21": "How dare you", "rairahtea_sailo": "How dare you", "alex032001ne": "Ich wünsche mir von ganzem Herzen das du elendig verreckst", "phillips13william": "Your childhood looks very stolen. I’m very sorry", "lem700": "Марионетка", "_friso_elting_": "How dare you", "nicobbolio_": "Yes chuky", "cj_wontstop": "Yes, take all my money and cars to go change the weather, that's definitely going to work wonders!", "rob_jonees": "How dare you", "feiktaksi.daddy": "Eww fuck u", "kanitofernandez_interrap": "💛💙💛💙", "bil5472": "You do alot of travelling for somebody who cares about the environment...", "clarencethecockatiel": "How many evil polluting cars did it take for all of you to get there? 😂", "marcountmba": "Chileans request @GretaThunberg 's presence in their city (Arica) due to serious contamination with Swedish metals since 1980. The Swidish mining company: Boliden https://t.co/Djwkjx52HG", "milovanovic_luka05": "#gretakurveta", "lhy026": "Look at most of your post and Do you really care about the environment? Or just show off # go back to school learn something before you talk # young people acting like you the world will die soon", "kevvvvv_th": "🤡", "khan_nida354": "👏👏👏👏👏👏", "itslancenot210": "That makes sense on why your scripted speech was horrible. You have aspergers", "samuel_muller1": "Vamo salva o planeta gurizada💪🏻 #salvetheworld", "arif118.96": "Go Greta,go ahead", "tulsi__goswami": "🙌🏽🙌🏽🙌🏽🙌🏽", "nexerasibe": "Кста, раз уж ты прям перевозбужденная активистка, приезжай в Уфу, наведи порядок #saveufa", "godless.cihat": "Ne diyon lan orospunun evladı ananı siker amcığını eline veririrm. Türkiyeye laf atma ebene balıklama dalarım", "1993shaima": "#save_the_iraqi_people", "ceciliiiiaan": "http://special.aftonbladet.se/blodsbatterier/ tell me greta how can you and all the other activist's support this? 👎🤔😡", "britt.k133": "Back to class and stop distracting students who want an education.", "bet_ur_crying": "Poo", "mr_lafleur01": "Even putin came out and said she is being used 😂😂😂 Only you idiota are buying into this circus 🎪", "rafal.sha": "30مليون عراقي في عزلةتامةعن العالم انقطاع الانترنت والقوات لقمعيةتواصل عمليات إطلاق الرصاص الحي #Hello_world #There_are_people_Making #Revolution_now_in_iraq #Show_your_Support_for_the #right_of_Iraqi_people_to #protest_peacefully #Sava_the_lraqi_people #HELP_lraq #savelraqipeopl", "patrikhaliti": "👁👅👁", "dava_be_lazy": "Алооо, русские есть?", "thijs_026": "Boeie ruurd", "ismaaaaaaaaaaail": "bitch", "519prvt": "@enessamed_35 du bist schwul", "l._.b._": "Du bist ein frosch der überfahren würde und dann in area 51 wiederbelebt würde und geflohen ist. Die sonne ist nämlich schuld wie die beste Partei der Welt die AFD schon gesagt hat .", "2jz.loris": "fUcK ScOoL 0______o", "plasticwhale": "Yay!!! We’ve been working on a project called @missieplasticvrijwater - various classes from Primary Schools are fishing for plastic!", "jakelanowy": "Go back to school ur wasting ur time", "iachkovaleksei": "Kys🙌", "jasko.4": "Today I smoked a cigarette and yesterday too, i now throw plastic in water", "antinatalism.persian": "Antinatalism", "josephloaisiga_": "🤡🤡🤡🤡🤡", "shahad_shoosho": "#SOS This SOS is sent to you on behalf of people who are being killed now without mercy for no reason other than they want to live a normal human life. On October 1st Iraqis started to protest peacefully with nothing in their hands other than their national flag asking for the simplest human rights like living peacefully and having jobs to make a living, the government responded by mercilessly killing and injuring them and shutting down the internet to hide what they are doing. The current Iraqi government is known internationally for corruption. According to credible sources they have stolen more than 450 billion dollars and left 40% of the people suffering from unemployment per the International Monetary Fund (IMF). This message is brought to you by a group of Iraqis living outside Iraq, we are struggling to bring YOU the Iraqi’s voices so their sacrifices are not in vain and to compel the world to action and save them. Please, share this message and tell your representatives that you support human rights for good Iraqis. For leaked videos and pictures click on these hashtags: #Revolution_now_in_iraq #Save_The_Iraqi_People", "lopez_oigres": "viernes por el futuro gracias por el sacrificio de su tiempo", "puuuuuuluuuuuup": "@rsnv", "jadensaidfuckoff": "literally no one respects you", "domonok_graham": "Ah yes, someone who things they know everything about climate change and is contributing to the fear monger it present amongst the young generations", "tizian10__": "@gretathunberg du willst Die Welt verändern aber hast selber ein handy Klamotten und benutzt Sachen die in Plastik sind", "xx.flx.xx": "Die Frage ist halt.... wen juckts?", "66deamond": "😡😡😡😡😡👎👎👎👎", "naveendraj": "If you don't care about any of this Greta Drama shit becuase we'll die anyways and planet will survive nonetheless give me a HELL YEAH..", "michael_wiskas": "Why are you guys liking this", "poppy420chulo": "You go against everything you stand for by having ur own Instagram account", "eduard.karas": "Ty picovina zabi sa radšej", "_petra_sunshine_": "👎👎👎👎👎👎", "nick.tunbridge": "Yesss burn fossils fuels!!!", "jamila_al_jaff": "#save_the_iraqi_people", "tuxedo25_": "So I’m all for getting out of the horrendous American public school system but what exactly are you doing for it? You skipping school isn’t gonna make your idea any less stupid and its not gonna make people care any more than they already don’t", "alexwright5594": "A strike on school because of the weather changing?? Lmfao absolute dumbass", "mp4ajdin": "How dare you to post this?!", "incinerationforthe": "Follow me", "stellanordgren": "(^O^)/ !!!", "tomas.milev": "Jeba😍😍😍😍", "_adrian_xi": "👏", "daniel_farrugia_47": "How dare you", "arr3n.mac": "Is that a straw", "lastnamehw": "Thank You for your hard work, I hope someday every person can see what you see, and understand what you say. 🌹", "sophiebeckettt": "Marching around the streets with signs isn’t going to fix climate change", "jesse_hakkarainen": "Perkelleen jonne", "buddha.zorba": "good idea to bunk school 😂😂😂😂😂😂😂", "mariadacunha_": "Get a fucking life! Stop try to change adults mind, that will not gonna happen! You are having a rich childhood please be quit", "ecoearthsupply": "Fuck Plastic 100% Biodegradable and Recyclable Daily Essentials in our bio link♻️🌎", "frank.nistine.3": "Great job. I wanna do it. Wellcome my city jiangsu.", "palmen_liam": "How dare you", "deepali.nadkarni": "Proud of u 💜", "biggiepoocxx": "fuck off", "anri_rus": "спасибо вам Грета за ваши движения защиты природы без вас бы этот мир превратился бы в каменный лес вот только один вопрос что делать с самолетами Спейс шаттлами ведь же они загрязняют атмосферу в большом количестве чем наземный транспорт", "zaryobi": "Jermey Clarkson is right just shut up your just drawing attention to you ypur not gonna do anything", "ollie.augiez": "I shouldn’t be up here", "_sungshi23": "We are all going to die anyways before the world is \"fixed\"so who tf cares. With 16 you should be in school not all over the world just to talk stuff geez. Let at Least an adult do this kind of stuff", "rycoworldtravel": "@gretathunberg let’s just say theoretically that our oil will run out in 40 years... do you think the world will end in 40 years? No ...we’re talking about a planet billions of years old. So, after 40 years we’re out of oil and we will have to come up with a new source for transportation which we’re already developing. 0 emissions will come no matter what. So, go back to school and live your life. Stop fear mongering and leaving the next generation in tears for no reason. You base your facts from things you’ve read. Your not a scientist. Your 16. Go back to school.", "1cp_ondra": "I have a great idea greta, lets kill some billions of people (doesnt matter how much, but lets say 2 4 billion) then trap 1 billion of the remaining people in redstone traps, and make them poop all day. Then scientists are gonna create car thats powered by poop, and we would solve 2 problems", "luicannn": "This is bs.You are trying to change the climate while you and your stupid democratic dumb friends are holding cardboard such a shame democracy has turned our youth into gays and anarchists.", "rappers2006_6": "I don't care if I die", "anna_1995j": "Du dämliche Stück scheisse geh in die schule die welt wird eh unter gehn da brauchst du dein Maul nicht so weit aufreissen", "jeeone_prod": "💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚", "mond.op.kont.beademing": "Some people horny for attention as environmentalists fuck the climate", "pythagorus_therus_maximus": "Shut up corrupted zoomer", "artti.g": "🤡🤡🤡🤡🤡🤡🤡🤡", "hayden._.lc": "Can’t wait for you to be assassinated", "foodordermemes": "Excellent 👏👏🙌", "history.memelords": "Go back to school", "joel_031704": "hOw DaRe yoU", "mosaic_dermis": "Literally this one girl will change the way we need to look at EVERYTHING! It puts me in awe to see someone that attracts so much unnecessary negativity, rise above, and take action EVERYDAY. Being positive and stern, even emotional at times (which by the way, look at the destruction greed and complacency have caused globally, aren’t you angry?!) to drive the point home that we all need to be thinking about, the greater good, the preservation of this beautiful world and the preservation of our humanity. Wake up and stand united! Keep it up @gretathunberg you are awesome and an inspiration for all of us!", "mettemarie.1909": "🤬🤬🤬🤬🤬🤬🤬", "mitch.denny_": "I’m gonna fuck you like global warming fucks us", "noorqusai": "@gretathunberg Please #save_the_iraqi_people Unarmed demonstrators are being shot to death.. the Government Riot control are violating the human rights using live bullets, heavy weapons and tear gas to break up the protest we have lost over hundred of lives and thousands wounded since the 1st of October..Internet is being blocked in Iraq for days .. government troops are killing journalists and human rights activists in Iraq .. we cannot reach out to our families..please we need you support . Please #save_the_iraqi_people", "m.s.t.d.g.g": "💩", "ghost718edward": "Lol", "jed_ei": "Where are the boundaries teenagers? If you all were really concerned for the climate, you would stop using your phones, do you know how much green energy is needed to charge your phone everynight?", "jakob.tillberg": "LMFAO", "johanstenqvist": "XD lol lmao", "habib.aghaee": "You are looking for deceitful people after the destruction of the land.", "finottifelipe": "HoW DaRe YoU 💅🏽💅🏽", "shshank._": "We r with u", "salverdahendrik": "How dare you 😡", "ostap_98": "Дури", "makoto.okano": "Welcome to 2019. Where 16 year old kids who ditch school to “save the earth” are considered the heros. Ranting about problems without any solution is the best she’s done. Prove me wrong", "oscarlofdahl": "Gråt i ett hörn", "zzzzzzz.zzzz.zzzzzzzzz": "Ur so pretty 😍 keep on rocking 🤘☮️", "mg_sikesv4": "How dare you, ecosystems are collapsing", "adam__robb": "How about going on strike you get all the school kids and get them to plant trees and plants, go on litter runs", "outdoorfanatic_stephan": "Climate change IS real. Change my mind", "piet.lk_l": "#fuckgreta", "aadityajaiswal_": "This is how desperate the right has become.they are now unironically arguing that climate change activist need to talk everywhere, otherwise they are hypocrites", "anasta.george": "Basically you can store and eat your own shit as you are full of it", "stolenmemes19_": "H O W D A R E Y O U", "verrucktyams": "Fetal alcohol syndrome", "christal._.mehra": "Want you to come India", "qwakhead": "The memes are funny keep it up", "doptidop801": "Meme", "radicalpresley": "That’s cool but did anyone ask?", "maestro_riga": "🎵", "zpeisit_mera": "du har fortfarand inte kommit med nåt förslag hur vi ska minska utsläpp eller hur vi faktiskt ska \"rädda\" naturen och vår \"mass utrotning\" du har enbart klagat över att vi inte gjort nåt när vi redan gör skit mycket, jävla pr propaganda av barn.", "corvin2604": "🚗💨💙👊", "isabelgirc": "$$$$$$$", "der_gerat.v1": "Diesel 👍👍👍👍", "itaintitpewds": "stop wasting cardboard", "kanehoon": "Anyone selling a tuner for a 2019 Ford F-350 king ranch , didn’t wanna tune it but now I wanna roll coal", "mehdi.babapur92": "Well done I will support Iran too👏👏👏", "rob.eijssens": "Damn bby gurl you lookin cute B", "maddengriffinn": "I love Donald trump", "alejandrol1426": "🤡🤡🤡", "umeshshah998": "It's too late, think about presant, than future., today for presant.tommorow for future.if you survive today, you will think about future. Think about people who lost their life & secrifice.", "_dxvqn": "\"How dare you!\"", "jonathanc_1017": "Ur gau", "ryanrosales234": "Damn they need to go back to school they forgot how to spell", "telowe10": "Your", "am3liav3lazquez": "Y DONT U ACTUALLY MAKE SOMETHING OR GO TO THE OCEAN AND CLEAN UP. STOP PROTESTING AND START DOING.", "dannysippinvintage": "What a joke. Bunch of delusional idiots.", "teomat_": "inquinate!", "yourdadsprostatespiders": "Thot", "_jadenking7_": "Thank you for actually caring about our future I would like to raise my kids peacefully and not have to worry about them not having a habitable earth to live on", "goodguydyl": "Imagine getting 7.4 mil followers for being an idiot with a big mouth 🤡🤡🤡🤡", "michele.serrato": "M’ha cacatu u cazzu", "xifu666": "Perkin klia te tienen de titere", "co.le.r": "That’s so sad", "jedai88m": "🖕🏻", "tincan.mp3": "Yall mfers sound like you starting a invasion in this bitch", "yohaydn": "greta", "efectnr": "#Böh burda mı??", "cantuarioandre": "Essa menina é Um atraso para o mundo.", "julian.2512": "How did she get there without flying. Isn't flying very bad for the climatic. The idea is good and I support it but I just wanted to say. @markus_schwarzl", "nils.schanze": "smart people : dumb people : believe in everything what‘s said in the media 🤞🏻💁🏻‍♂️", "y_i_jan_n": "dumme fotze", "this_a_meme_page": "Please tell me homeboy behind you is a teacher 😂😂", "soalexng": "yes, not getting any education for a full year or more will definitely help, yes", "bstraith": "Yes!!!! 🙌🙌🙌🙌🙌", "bobbypurp": "Tf is this doing 😂😂😂", "anton439": "@gretathunberg I admire your message but your claim regarding human existence living on the verge of a “mass extinction” is ridiculous. Where is your scientific evidence? You have zero qualifications to be making these public statements and there has been actual scientist discrediting you. You’re pandering so for has done nothing to solve the environmental impacts. Instead you’ve contributed to the political discourse already going on in the USA. Refocus your efforts", "laperse.fotografia": "@gretathunberg you and your friends love this, just more excuses not going to school. Hopefully one day you all will wake up and realise what a mistake you’ve made.", "jacksonbarinowski": "Until you acknowledge that China is the main offender of pollution and actually come up with a solution for it, I can't take you seriously", "jonath615an": "!!!", "moonset42": "Angela Merkel JR", "vibin_cross": "This is all wrong you should be on the other side of the ocean at school like you said you should be!", "northerncaligreekboy": "UStop letting yourself be brainwashed by adults, and letting yourself be used to promote their elite agenda, just be a kid and live your life, have fun, go to school, hang out with friends, watch movies, do kid things. We grow up so fast, your wasting your life spewing lies that adults are forcing you to say, enjoy your life while your still young, be yourself, dont be what the people forcing you to do all this wants you to be.", "davidcopley16": "Not funny, didn’t laugh", "granyt884": "#govegan for the planet", "nathan.c.s": "U look 8", "ashley_hadessss": "lol retard lookin ass", "curicandcuric": "Greta, everyone loves you! You speak the truth! ❤️", "r_howie8": "It would be cool if the protesting was for something we can actually change not stuff that happens because of other countries if it is even real", "wistfullywasted": "Instead of spending millions on a yacht, use that money to pull plastic out of the ocean you sailed on.", "jennabright": "y’all should really read up on aviation! it’s really interesting!", "jason_monger": "@gretathunberg how much do you charge for a pro Trump speech?", "xqueenofthemarss": "Keeping doing what you are doing. Don’t listen to the haters... much love!! ❤️", "its.nathan0409": "Please die soon", "jakebailey._": "I reckon half these kids don’t even know what global warming is", "joeyschick26": "🤡🤡🤡🤡🤡🤡", "evanhasig": "Fucking die", "animetiddies28": "Fuck the climate I’m looking to die", "paintings.by.parra": "I like how after all the projects, research from textbooks and scholastic sites about science, and all the blood, sweat, and tears I put into passing with an A in my environmental science class, a lot of older folks are telling us young people, \"Go back to school to learn basic science! Climate change is a hoax!\" yet, continue to make multiple misspells and grammatical errors. I love irony!", "damonn323": "Why is greta becoming popular for saying “I shouldn’t be up here” but yet boyan slat did more when he was 16 and is the CEO of The Ocean Cleanup", "ankitchauhan2209": "Come to India for once", "oolakashe": "How dare you!!", "ronilovestuna": "HOW DARE YOU", "filmac7": "thanks for defending our future!!! much love and admiration", "xxtdevinxx": "Sorry but those people aren’t recyclable. We”ll have to ban them.", "modargi": "Just like a play doll .the governers use you and finally too late for u", "frost.mp4.v3": "CEO of nature", "h2oguitar": "Puppet.", "tylerjakl": "No ones taking away your childhood, go back to school.", "notcoolusername": "#trump2020", "xerodigz": "How dare you", "cutlersnyder": "I want to unify in order to promote change. Please get ahold of me by any means. It’s my intention to enforce the cause !!", "quirkinessinprogress": "Just another hypocrite like Malala who doesn’t know her shit but is being propelled by stupid media and politicians. What’s your plan of action, if I may, other than screaming and shouting and travelling in million dollar yacht? Stupid girl and stupider followers", "hussainjaber_": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "joeneticfreak": "Go back to school and learn something idiot", "mathiasmarianodaroch": "Olha só que legal👏👏", "chieftain_memes": "You look like a 9 year old kek", "carl.pointing": "I am collecting all the plastic I can and going to throw it in the ocean, thank you for teaching me that NO ONE GIVES A SHIT", "aiden_6921": "How did you get there? Wait. Not possibly a private jet burning fossil fuels.🤔", "jfjeanfranco": "I never heard you talk about geoengineering or chemtrails, nor about HAARP. Why don't you talk about it?", "joe.u": "How dare you", "cringebaby.v1": "Bruh you are not fucking 16 you look like you’re 9 years fucking old. My sister 14 year old sister has bigger tits than you", "garrett.gurley24": "What a twat", "nike_nate2013": "Joke", "superkalito": "LA is waiting for you!!", "yourpublic.confusedkid": "I find Greta to be annoying because from what ik; she doesn't really do anything while other people are actually making a difference she is a protester? Tf", "gf_2nd": "Retarted", "darknight1078": "Joker what sick game are you playing? Brainwashing people into believing there is a global warming problem? This time you have gone too far.", "bobbymartin_": "U just don’t go to school, can’t present facts on climate change bc it’s NOT REAL and uve become the new pawn for the radical left congrats loser", "joseph.ko_": "How dare you", "jdm.noah": "cunt", "iamseancapps": "😂😂😂😂your a joke", "realethanpainter": "you’re a 🤡", "shelly_weinberger": "Let’s skip school , go on a strike , cry into the mic , travel all over the world , and cry that my childhood was stolen. Please. You have strong msg but you, the messenger , too weak.", "bigdizzay": "Nobody’s taking away your childhood. Laughable", "stu_legault": "NWO shill", "british_tea_drinker_": "Do u even know what u are protesting? Like sure \"oUr pLaNeT iS bURnIng\" or some shit but do you actually know statistics and other crap. Like stop protesting is modern developed countries with some of the lowest emissions and how about you go and protest in commie China or India with some of the highest you puppet of eco fascists.", "nathan1244456": "Oiii", "kuyajb_": "go to school", "jacob.horuczi": "Go to China now", "gracia5sevilla": "❤️🙌", "ruussuul": "#savetheiraqipeople", "asschassis": "Nigga u dum", "mackhurst209": "How dare you", "granadaamor": "♥️🎶♥️🎶♥️🎶♥️🌹🌹🌹🌹🌹🌹🌹", "hafizzarha_": "you did nothing", "nancyellen_55": "❤️", "tigredamian": "How dare you?", "luissaburton\nVerified": "Verified", "4n4.t4pi4": "@pleasedontbelong_ 😏", "ssxxddhaagffzahab": "Come to Cali you catchin this fade😤", "theodorekrentz": "♟", "atxtxtx_.12": "Tell me now greta the government handles you?!!!???!!???", "big_anus_famous": "Kys", "danmorton_12": "Your not a real scientist", "krogmart123": "Hey I remember u from that one boyinaband video. PewDiePie is my favorite Swedish person btw", "harman_be": "🦀 climate change is no more 🦀", "rxcky_16": "HOW DARE YOU", "_trudge": "🤡🤡🤡🤡🤡🤡🤡🤡", "ariellliee": "Justice too long delayed is justice denied...😢", "cornelion_goated": "Piece of shit nigga 🤡🤡🤡 yo ass look retarded on god 🚫🚫", "abdi.to.wavyy": "Homeless bums", "tudor__sitaru": "When you drive a 1999 VW Passat Diesel that smokes at every small acceleration😎😎", "emmanuelespinoza4": "ok", "hummus.exe": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡 your just a 🤡", "sammy_k112": "Go home you’re making a fool of yourself 🤡🤡", "theworldisy0ur": "Anda a dar una vuelta a africa, y ve a quienes realmente les han robado su niñez...", "jxrry__": "Haaaaa", "a_ibarguengoitia": "@gretathunberg hope to (eventually) see you in Mexico City ♥️🙌🏻", "reid_camp_bell": "No one caressss", "hurtin__albertan": "Go back to school kid, learn something useful, like the fact the climate change is NORMAL and global warming is a crock of shit.", "jan.ehl_": "#fridaysforhubraum ist das wahre", "mindestens_": "F??? you greta", "tylersheldon5750": "imagine blaming america for shit china does.", "marimend7": "I Love you ❤️", "lilkvmi": "She gonna die by climate change", "drake_bell24": "Big gay penny nigga", "ferrynooijenn": "Clown🤡", "erik.smv": "Greta tonno pizza", "evancoughlan20": "@craigmc99 how dare you!!! You shouldn’t be here!!!! You should be in school!!!!! HOW DARE YOU!!!!!!!", "weenies2006": "Clown", "mammyarts.s": "QUEENIE", "ohbreninja": "@derksa", "dylan_kelton": "My nigga @justicelabounty thinks your cute", "zekenoonan": "Hub tub or locker", "wavyfady": "People who believe her bs:🤡", "mangoandchloe": "Greta cut the bullshit and go play on ur jungle gym", "fiveaftertwelve": "Climate change isn’t real", "pxscxl_1508": "🤡🤡🤡", "ynsemretuncc": "dear gretha I have trouble understanding why it is so popular. Even though you mentioned the right issues, it hurts to sit without saying anything against accusing my country. Israeli Palestinian bombing of Palestinian children all these years. The last thing I care about right now is your speech and the world, when the Syrians are riding in tiny boats to save their lives. let all humanity drown as a child dies of war", "tomas_brezina.5": "Do everybody know that global warming is just marketing and no real proof exist right?", "jadonnnnn_": "@gretathunberg I have a question. Can Hemp help the climate change??", "luan_hmb_07": "GO TO CHINA AND PROTEST THERE 👋🏻", "owenjohnson05": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡 go to school", "ashleymarklanddd": "Coming from an aerospace engineer, i think you have aspergers cause your name is Greta", "akpiinho20": "👏🏾👏🏾❤️🌎", "jayuhs": "New Lil Tay, being controlled by parents", "a_man_named_trav_": "EAT THE BUGS", "eddie_a77": "🤡", "fryto1": "You don’t gotta put Aspergers in your bio, we already know you’re retarded", "nickdoyle8": "Donald Trump is your daddy", "kozodoyr": "Can you please stop burning gasoline from your private yacht? I care about my environment.", "brett.jackson7": "🤡🤡", "kushu743": "Puppet 's Soros", "basicliberty": "so tell me why this girl might get a nobel peace prize. when she’s done close to nothing. and the people actually cleaning up world oceans and our planets air are getting zero media coverage and zero recognition?", "brunitodibenedetto": "Que fea", "lil_bryux": "Marioneta de empresarios 🤡", "itsanthonyrey": "hOw DaRe yOu", "gilrobert25": "👏👏👏👏👏", "_.x1x.__": "Die Bitch Die !!!", "matteo.colla": "Sarebbe interessante studiare chi possa aver strumentalizzato tutto questo .", "erxn431.npk": "How Dare you 🌚", "fabiowaldrigues": "Maracaibo/Venezuela scream for your help!", "squadunk": "The more deeper you look in the comments, the less IQ that's being put in the comments", "zndvrt": "💘💘💘💘💘💘", "wurtz__29": "🤡🤡🤡🤡🤡🤡🤡🤡🤡", "scrulpergoshmollard": "All the people you see there are soy drinking fags lol", "gabriellasclosetfinds": "Your actually gonna win a Nobel prize", "clown.aids": "She dumb and small brain", "niklass3.3": "Now I want to drive some rounds with my diesel", "sietse_sv7": "Грета умирает", "kasey_watts142": "Man I love climate change it’s well sick makes me warm n that frick the polar bears", "_.p4trick._": "Please stay in the USA and never come back to Europe", "zarekaaron": "Would you like to sex", "veit.roe": "Pisssss offfff", "pimplegionaer_1731": "How dare you", "b_cart04": "🤡🤡🤡🤡🤡🤡", "finan_st": "The ceo of nature is promoting not going to school 😤😤", "unknownmadness26": "Eww she's a VEGAN thank God Isaac butterfiled made fun of her!!!", "andresclementediaz": "If you’re going to protest then protest in China, India or anywhere in Sub-Saharan Africa, the largest polluters in the globe", "sheikh_muhammed_ammar_al_i": "How much you got ? 💥", "jamestark907": "I hope ur dog gets aids", "conorwalsh32": "@chriskotars @ryko5446 Iowa city! Go Hawkeyes!", "dkzop": "Vie de moi for tu sers a R bouge couz", "frog_m34": "Nobody cares lmao", "thefoxhorse": "#jaguarking333", "itsquinn_haak": "TRUMP 2020", "saidkhardadi_": "Fuck you. You Lisa on crack looking ass bitch", "_lancy.pancy_": "Imagine thinking climate change only affects the United States...", "laurastrawbridgee": "this is so hypocritical omg", "conner.sharp23": "GET OUTA HERE STOOPID", "kris.d04": "Clown 🤡", "jordanbrown___alkn": "What's the point of a school strike like the kids aren't actually working so it doesn't matter", "eldirko04": "Fuck You", "benni_mock1966": "Fuck You", "ronblacklistll12": "Shit", "timvolanen962": "Jag kör cross", "najdymar": "All about this is big lie, she just talking what they want her to say!! Just little ugly actor !! Hate you !!🤢🤢🤢😡😡😡", "monicaschuett": "GRETA!!!!! PLEAAASSEEEEEE!!!!!! WATCH THIS VIDEO!!!!!! A VEGAN FUTURE IS HERE!!!! ⚡️⚡️⚡️✨\\\\😁//✨⚡️⚡️⚡️ https://www.facebook.com/complex", "gabrielopeez": "Greta Greta, cómeme la croqueta", "c.m_rail": "You can’t stop the fumes of the class 56 ✋🏻👋🏻✋🏻👋🏻✋🏻👋🏻✋🏻 MY LORDZ", "nathan_newcomb_": "🤡", "miripulido_": "Te estás saltando mucho cole tú ehh", "sal_va_tore89": "The length one child will go to get out of going to school!", "7l7l7l7l7l7l7l7l7l": "Gremlin", "kevin.b.r": "Assburger", "danny.hemel": "Greta eem", "smithy308": "Get back to class you wagging bastards pull ya fucking heads in", "jumpingpeaches": "@gretathunberg I can’t begin to understand what it must feel like to have adults write such terrible inappropriate things to/about you. I am sorry for it. I know you don’t need a stranger like me to tell you how brilliant what you are trying to do is. Ignore the ignorant and scared. If more of us were/had been/are like you the world would be a better place. Thank you for your dedication and passion. ❤️🔥❤️", "gm_jimmy": "Pls Strike in China", "_joah_carver": "Funny how she says she should be in school but she encourages other kids to skip school to strike for a myth", "lxca.__": "Niemand mag dich", "timothy.mejia": "Yoo greta hates black people?😳😳", "yont314_": "I shouldn’t be up here", "hellboyfeelings": "Sluta du skämmer ut Sverige", "melisabbyr": "autism speaks", "blakeeyang": "You're literally so iconic I love you 😳", "11zach11": "Mad at gas car", "snxw.liam": "👉🤮🤮🤮🤢🤢🤢", "yeah_jan_510": "Bring back the diesel yeehaaw🤠", "mohamedtalbi13": "Abônne svp", "shaawn030": "Geh mal lieber zur Schule yallah", "langenlisa": "have you learned that trees need co2 to live and produce oxygen? if not, you should better attend school lessons. not everything that happens in the world is right. but you should first learn and then act", "demonicvalkyriev": "Come to my school, let’s see how long you’ll survive there 🤣😂🤣 what a loser", "rustneversleeps4": "As Vlad Putin said, I’m sure you’re a young girl trying to make a difference, but you gotta agree that every nation has the right to be industrialized, Sweden had already done with your Industrialization does not give you the right to judge those nations that haven’t. You want to make a different, maybe you should start with your country, not travel with boats to America and have the boat air shipping back and makes even more carbon than just take a plane. It’s just my thought.", "carlos_bustylo": "Downie", "the_tom.a": "K", "cevarfe": "We have to save our world and stop using POLLUTION!! Or the world die!!", "lill_guwap": "BLAK ETETETETETE IM FINNA DRILL YOU", "arse.86": "Children are killed in middle east everyday by your countries soldiers.i wish they live just like you and depend something.", "therealcoochiedestroyer": "Swedish meatball be like Böll", "philip_booter": "Go to School", "karxm16": "How dare u", "nmbrelinsky": "Wtf is a climate strike", "gurglish": "Skolstrejk för att sänka bensinskatten", "caspar.george": "#fridayforfreibier", "nathann.seaman": "climate change isn’t real 🗿", "thicc_yoshi______": "🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚘🚖🚕🚗🚘⛽⛽⛽⛽🚕🇨🇫🏎️🚃🚋🚓🚠🚘🚖🚖🚘🚞🚠🚠🚔🚋🚋🚘🚗🚋🚞🏎️🏎️🚃🚘🚗🚗🏎️🏎️⛽⛽⛽🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🏭🚬🚬🚬🚬 ahh carbon dioxide", "meyers_24v": "i would love to dump some coal on you retarded fucks", "michihh04": "What you did is amazing. Stay strong in this world of haters and show them what is really important. Best wishes on your way from Germany", "maybe.sim": "Nobody likes u srry", "krisssyjhcamtv": "👍👍👍👍👍", "_mertozcn": "SHUT UP DOgg", "zyklon.exe": "So when are you going to mention Israel and Americas war crimes or Saudi Arabia killimg women ans children in Yemen?", "sebastianhulten_": "This girl is changing the world frfr ganggang no cap", "luca.oel": "Pens are plastik😂", "anthony_m__": "I hätt do wen für di @zehnfalke 😂 Der is a so schwul wie du @gretathunberg", "tovitoviic": "🚂🚗", "giorgioduma": "💚💚💚", "jordansalcito\nVerified": "Verified", "nick_11_becerra": "Good idea get kids to leave school where they’re supposed to learn and have them leave garbage in the streets as they “protest”", "niek.023": "Have some respect for the older generations, they fought for this world. Stupid child", "nicooxwagner": "i fucking love my benzin car😍", "johncrawford891": "Rott in hell you communist", "r.epstein1": "But I love school I don’t wanna leave best sticking to plastic", "fxnn.hanke": "Go to school", "eddie2271_official": "Fick dich fotze", "cammy13_": "i don’t fucking care that you stay off school and hold a sign, i hope the heatwaves grow legs and kick your teeth in", "justinz_page": "I consumed a small child after they got too close.", "mukimuki64": "Enligt IPCC smälter den antarktiska isarken inte vid tillräckligt låg temperatur utan snarare ökar snöfall, så dess produktion ökar.", "jstxn.44": "How dare you", "thebrowngurrrl": "follow @thebrowngurrrl for some amazing stuff on climate change", "showjumping.lifestyle.page": "@gretathunberg hey there, If you're worried about carbon, don't you think it would make a difference if your over 7 million followers planted a tree? What about if part of every climate march everyone planted a few trees along the way? How cool and may actually make a difference 😀", "italofaber": "Hahahahahahhaa", "caleb_milburn827": "Shut up no one cares 😂😂😂", "theposturewoman": "Incredible work!! You energises us to take some action. Come to Asian countries soon!", "vincent_husky": "#fridaysforhubraum", "juliechicstyle": "So amazing 🙌🏾🙌🏾🙌🏾", "brodee_thurston_15": "Don’t go to seattle please", "dalsmaon": "Nerd", "not_tarik15": "Who want some chicken nuggets?", "matejgregor": "V12 or V10 in car ? 😂🤷‍♂️", "i.am.shaggy.rogers": "I use plastic straws", "laughing.at.manutd": "No one cares"}