{"aleksandrfarneze": "Beatifull", "carlos.vilareal.50": "❤️❤️❤️", "renaa.r_15": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "rewnyx1": "Wow😍", "emma_87701": "Il coronavirus divaga...", "lengyel.dawe": "ja", "gurkan.deger.9": "🇹🇷❤️👍", "michael_mullen22": "WoW what a picture!", "sebass.urib": "😍😍😍", "lasallehugo": "👏", "idk.caramelito._": "🇨🇱🇨🇱🇨🇱🇨🇱❤️😍😭", "kramatorsk_coolphoto": "Пиздеть только умеют 🤬, а посадить дерево за городом так руки не дотягивается 🤬🤬🤬", "camilin32e2": "Get out fuking PIÑERA😡", "richard_jimenez_": "😍😍😍😍😍 @gretathunberg", "gigitis": "😍🥰", "rhasenbergb": "\"Very beautiful\", did you know that in those manifestations people have burnt a many things generating a really big carbon footprint? Not only they've burnt buildings, but they've burnt electric buses and big part of the metro network; both green transport. So, \"How dare you\" @gretathunberg", "nico.photography.zug": "👌", "xox_chloe05_oxo": "And please tell me if a ambulance needed to get through to save someone’s life how do you suppose they do that well done", "rawan.alzuhairi2": "omg hur mycke folk", "noambue": "Des Safe Fridas Dir Hubraum", "lifeofpettit": "It's regarding your vision", "paomarbi": "❤️", "wellingtonlucas0": "Tá igual o mengao", "jocyrios_chile": "🇨🇱 we continue to fight, we are still at the streets! The cops are blinding us, coz everyone opened their eyes 🇨🇱 #noessequiaessaqueo #nomoreprivatewater", "santanderximena": "👏👏👏👏👏👏❤️❤️❤️❤️❤️❤️❤️", "thiago_tattooe": "Querida @gretathunberg, apoio os ideais de que devemos preservar a natureza para um futuro mais sustentável para as novas gerações.. mas e se o caminho dessa revolução fosse matando toda essa gente tóxica?! A mãe nature agraderia a redução de CO2 🏞🌍", "_kruegerphilippp_": "Fast so viele Menschen als wenn Obama ne Rede gehalten hat😂", "florian.ruetten": "Fahr mal vorbei hier", "_.emilio_rafael._": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "luanscames": "Oportunista!", "biopielchile": "❤️🇨🇱", "kid_anyelo": "🇨🇱 thanks", "kathimv": "😍😍😍😍😍", "gorni_alex": "😂 theres no school in this country", "aj_van_vuuren_12": "Why don't you just plant your trees and keep quiet... lead by example they say", "mativelardiroman": "Greetings Greta from Chile, stay strong for our planet 💪🙂", "peguy_collins": "Thank you @gretathunberg for the great work you're achieving. 🙏", "m_olguita": "Eres Líder donde vayas 👏👏👏", "the_squirrelboy_32": "You are the best.. greetings from chile 🇨🇱☺", "djflowsensation": "🔥🔥🔥🔥🔥🔥 🙌🙌🙌🙌🙌📺📺📺 God blessed what you doing keep on doing what you doing the people gona follow you 🔥🔥", "zehanat_quadri": "🤩", "vnbarb": "Formigueiro branco", "v.valentina_a": "😍💕🇨🇱🇨🇱", "hematofilia1313": "😍😍😍😍", "mikey_the_viking": "Did you see the garbage left behind?? You idiots do nothing to benefit the environment", "willow_thorn": "💩💩💩💩💩💩💩", "sokolov_ronny": "🤘😻", "daniele_exposito": "Oh my GOD", "nicxita": "❤️🙌🏻🌟", "liliianasalas": "If all this people don’t eat meat that day ,, and reduce the gasoline use .. at lease one day a week 🙌🏼🙌🏼", "javibrandt": "Muestra a la gente quemando, saqueando y destruyendo !! Hipócrita !! 😠 Cuando te conviene no dices nada del medio ambiente.", "juanheadcrusher": "Piñera get out!!", "myriam1867s": "❤️", "johanna_draws_": "Woooow😊 #fridaysforfuture #saveourplanet", "anatolii2341": "While you and your kind of fools and cretins ride on yachts worth millions of dollars in poor countries people die without the benefits that there is in your rotten Europe, without light, without heating, without work in the factories that you liberal fascists want to close!You hate in most countries and listen to only those who is worth on the threshold of degradation, those who sleeping with its same gender, who changes gender ,the entire this abomination for such as you and corporations you pay for something to you turned people in a herd animals!", "sofiatenza_": "👏👏👏", "gretathunfisch_feminist_fp": "🦄", "gretaisameme": "🙌🙌", "iammarcellolust": "Sure we can 💜", "charlesrdasilva": "E as manifestações da bolivia??? Apoia??? Ou é contra um povo que cansou do comunismo e quer ser livre dessa porcaria de ditadura?!?!", "camelia.aa8": "🇨🇱🇨🇱🇨🇱🇨🇱 En Chile los militares y los pacos matan al pueblo chileno 🇨🇱🇨🇱🇨🇱🇨🇱", "palck.producciones": "Thank you @gretathunberg, from Chile.", "tito_amaya": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱👍👍👍👏👏", "guajardoemi": "❤️", "jefersondemoura": "💩💩💩", "juanmiguel.diazsaez.79": "❤️😍", "tripbicycle": "👽👌good humans", "kenneth_w__": "Pfff beim fanmarsch von eintracht Braunschweig sind mindestens 300mal so viele leute da 👍", "paubaek": "💚", "susanwadeweeks": "Would be more impressive if every one of those people started a new tree.🌳", "jacqueline.perez.m": "💕", "skogfilippa": "🌍😍🙌🌈", "homosapien1.6": "VAMOS chile", "sashasroad": "Thank you for this support much needed to appreciate those who have been killed without reason!", "denlangavagenhem": "😢😢😢 This is so sad. And Bolivia...", "lasser25": "Greta vo soy pulentaaaa 👏", "__.facundooo.__": "Soy de chile", "cceellnn": "@gretathunberg fuck piñera y chadwick", "teemutjt": "Beautiful sight? Do you have any idea whats happening there?!", "geodomesweden": "Sígueme por favor 🙏🏻", "vale_dubernet_": "You ruined the moment", "balanceislove": "☹️", "bajrw": "#karoldancedegenereichon", "cristinalabarca": "Thank you! And perhaps you should reconsider coming here, which is too bad because we would've been honored, but of course you can't talk ecology in a place where the government has privatized water, thinks of its citizens as mere consumers and shoots around when people voice their demands (and that's for starters).", "_thdn__": "Porcoddio", "benedetta_costa01": "💪", "noahgnw": "Nobody likes you little hoe", "_simon_79_": "DIE ATMEN ALLE DU SAU", "_haku.na_mata.ta": "♥️♥️♥️👏🏼👏🏼👏🏼👏🏼👏🏼", "miss.patty.p": "❤️❤️❤️", "elastic.fitness": "😍😍", "justkickit_09": "Please dont come to Germany!!!!!!!", "doctor_portergheist": "👏👏👏", "miley.linda.berisha": "it is not possible that in 2019 there is a wonderful state like Chile in a very bad social and economic conditions!! At the moment when there is a POWER ABUSE by the police and the military, that state automatically becomes a dictatorship! #prayforchile #chile", "f.arzuacikgoz": "💕💕 Love you🌾🍃🍀", "ellisjameshare": "nothing is going to change. Have a day off", "ridin_mywave_oran": "🙌", "jonacho1": "En qué bote vas Greta ?", "dennis.andasov": "ich hab gestern eine Plastiktüte gekauft", "vivisbsb_": "Shame on you and your parents! Supporting vandalism and criminalism 🤮", "slav_king_with_vodka": "Wow the fucking traffic must be horrible", "67.lisaa": "🌍🌎💕💕💕✊", "jxnis_sk8": "Bringet aui umm de gits ke klimaerwärmig meh amk", "michael_byjackson": "💕", "rose_bents": "@thomaskjaerrann", "zweirad_army": "Schon erstaunlich wie viele dumme Menschen es gibt", "moohammad666": "if everyone volunteered to clean up instead, or plant trees but instead..", "purplechicken_14": "F****** AMAZING", "karlamdl": "@geragarza", "bouffanais_sol": "🇨🇱💚👍", "molequebraboo": "Só posta merda", "lebaneseinbrazil": "Where are your thoughts with the Lebanese 🇱🇧👊👊👊", "cfifridays_for_future": "Thank you Greta", "hektorpedo": "Wow!!!! 1 Million?!?!", "axelfernandezleiva": "Thanks miss Greta, regards from 🇨🇱 😊", "hba2615": "Chaos means beautiful to u huh", "alobebeperu": "Fuerza Chile💪🏼", "mikkycahill": "@karl1archibald", "shipitcl": "🇨🇱❤️❤️ !!!!", "nessa_masiero": "Que Deus ao SENHOR JESUS CRISTO faça justiça por essas pessoas maldosas que se faz de boazinhas.Cada um cairão por TERRA.🇧🇷", "ellenaaaa_1996": "🔥🔥", "cortexbraintech": "👍👍👍👍👍😍", "f.dina2003": "Thanks Greta. Chile loves you 💕", "yuxin1026_": "@gonzalo_lcgan 文明观🐒", "frk.shm": "But look at the garbage all these Demonstrations have left behind this isn‘t helping cant change my mind", "estherdupont16": "👏", "noe.lle.kelsyee": "These deadass dont help. Donating, picking up trash, and other things can help. You cant magically change the climate.", "mr.amansihag": "That's the power of ideas ..... beginning of a big changement.....", "mm_021tt": "Amazing", "ichbinchilenisch": "Más weona que apoyar las protestas y no darse cuenta todo lo que contaminan las barricadas, pendeja manipulada", "fschiessler": "HOW DARE YOU", "zimgoldy": "HOW DARE YOU.......", "matteochiocci": "Pulisci la spazzatura dopo la manifestazione", "jirritt": "❤️❤️❤️❤️❤️❤️❤️!!!!!!", "mikodem": "i love you", "ammargv10": "Delfine sollen sterben amkkkk", "ronoqh56": "That’s a lot of tards", "lasectadelpan": "✊🇨🇱", "ignacioorrego_": "D E G E N E R A D A", "gonzalessanchez4": "@kiefer_esp olor a perro mojado", "__lehi21": "Ola Greta", "brandinlea": "@estherpaulk 💕", "carlalagosroa": "we’ll recycle our world🌱🇨🇱", "renanleitau": "1971 Chilean Pablo Neruda receives the Nobel Prize for Literature. Neruda reportedly was at home during a search by the Chilean armed forces. He points to the book-lined walls in his house: \"Look around---there's only one thing of danger for you here---poetry.\"", "shankar_blon": "Amazing.", "shattayute758": "If we can come together to try save the world. Why can’t we come together to STOP police brutality????? Is it cause climate change effects everyone an police brutality only effects a hand full of people???? @gretathunberg police brutality is all over the world we can’t save the world if we can’t stop killing each other. All lives matter person or animal.", "molinamayrene": "Por favor , una cuerda de vagos socialistas es lo que causaron destrozos en chile", "mariel_fran": "💪🇨🇱", "cataa_figueroaa": "❤️", "lili_peu": "@juancarlos.sepulveda.188", "munizagaandrea": "❤️❤️❤️❤️❤️❤️❤️", "aya.ffm": "❤️❤️❤️", "martinezsmanu": "Thank you for sharing this! I really hope Chile would change for the better, not only in the way to do politics, but also in the way to do environment. Because for being the country who was supposed to be host of the COP25 it was not a good example of a country taking care of the planet. 🌞 Thank you again!", "marco_dalmonte": "Sa dire solo \"my toughts are with the people of Chile\"", "javieragomezgreve1": "🇨🇱❤️💕🙏", "filippocrestan_": "La scuola nn ha più studenti...grazie greta", "moonshinegram": "We see u girl🔥 thanks for sharing our battle", "miguelcgp": "Q fdp @reif.guilherme", "jameschristopherhill": "I want to see THIS in Washington DC next year during the election on November 4th and call out the names of the President and what he has done to allow his \"buddies\" to have rights to destroy our environment and toxify our water, air and lands with carcinogens while vehemently denying climate change so that he can make billions from the big corporations. He an every congressional \"Represntative we have\" and Senator! Call them out for their sins. 2019/2020 should be the year of accountability as this should be the year where their past catches up to them and is exposed!", "jes_pereira_": "Fuerza mi Chile amado 🇨🇱💪❤️", "susan_acuna_villalobos": "💙💙💙💙💙🇨🇱", "matiascinco": "💕", "grethel.tapia": "❤️❤️", "ptriciavera": "⚖️⚖️ #renunciapiñera", "898anibal_alcatruz": "Ola po olvidona", "tbt.saldana": "👏🔥", "tali_nita": "💪💪👏👏👏💓", "clau_ithu": "❤️🇨🇱🇨🇱❤️", "pryshchepa.a": "There are not about climate change , why would your thoughts with them?", "josefaswinburn": "omgg", "j.ignacio2aaam3ktna": "🌺🎵🎩", "_jackson.cox_": "Damn she said March MARCH", "t.m.letters": "Blows my mind there r millions of vets who fought and died so this young brilliant mind my possibility we’ll have a future in changing climate control!!! What the heck have we did for them? Watch there platoon brothers arms blow off trying to pour them back into place but then needs to take to someone about it then straight out of his/his session they can’t get a job!!!! I know for a fact they say good luck and thank u!! 18 yeTr old does 4 tours 22 decided to list another two cause shit changing then comes home and country divided, wife left him, cause for many many reasons things like G idk? U were not around so I was slowly, court gave kids to wife! A young man with zero knowledge about the real work aka buy a house, first find the job that was promised!!! It’s sad.... so stop killing people over damn religion! News flash it will never end but it’s great to get bad people to sit down with god /arrange the meeting!!! Stop bombs and waste! Civil wars, killing black , white rhinos and elephants just for fun! Everything plays a parts /does something!! Destroy my lif", "natalieartstuff": "@lyubov_yakim_ponoma покажете папе, я ему рассказала ов том.", "dannitaelizabeth": "OMG thank you Greta for the support 💖😍 Don't come to Chile!! It is not safe now, many innocent people have been killed, raped and tortured during the state of exception. We have many evidence of this! This is real! And the INDH has the reports of some of the victims. Our government makes excessive abuse of its powers!! #renunciapiñera", "iamnotarobotyet": "You’re such a manipulative hypocrite!", "miezz_a_via": "Pensa quanti mozziconi di sigarette buttati per terra 😂", "aleaguila74": "Tack för ditt stöd för det chilenska folket.", "minna.reunanen": "Go Greta! If we all turned vegan, would have a HUGE impact also.", "bbbbcccxx_": "🖤", "teresita_bascu": "Thanks @gretathunberg for all your support", "arriolakatherine": "❤️🇨🇱", "lunarticasandia": "💙💙", "karlitamoramunoz": "🇨🇱❤️", "sakinaa.z": "Juchhhh", "ciel_amethyste": "Ven acá po conchetumare", "lalidonoso": "👏👏👏💕💕💕🌍", "quenitaoyarce": "Nunca visto en Chile !", "juliaamandaduncan": "Incredible ❤️👍🏻💕✊🏼😘💪🏼💪🏾💪✊🏿✊🏽✊🏻✊❤️🥰😘", "akashsharma1744": "Nice", "felipecardenas": "🙌❤🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "eddieriaofficial": "What were the horrific developments?", "ximenapinillapereira": "😍😊😊", "buhos.negros": "#RenunciaPiñera #RenunciaSandwich", "cris_fuentes29": "👏😲", "ble____e": "Esto recién comienza 🇨🇱❤️", "illmontone": "Ti amo", "projexxitx": "#renunciapiñera", "fabio.aiello.5": "The walking dead is real", "thedon.mma": "1 million stupid people ready to eat up anything they’re being told! Hop back on your multi million dollar jet and ruin the environment somemore! Show Pony is all you are @gretathunberg lol i know bitch", "naikovalski": "Você é maravilhosa 😍", "jamilabcamus": "Gracias Greta💚💚", "carolin1030": "Viva chile ❤️🙌🏻🇨🇱🇨🇱🇨🇱🇨🇱🙌🏻❤️", "vampillera": "@futunaaa_ @womantigraa ❤️🇨🇱", "0dks_": "💙💙💙💙", "alxss._.sv": "💕💕❤️", "v1c3nt3_.18": "Chupalo karol dance", "batoulbatts": "❤️❤️", "tomas_felds": "Yo estoy ahi chora! Un abrazo y buena onda pal planeta", "sariiquijano": "💖", "jurojasv": "❤️🙏🏼", "tiare.mendez": "Greta date cuenta 🤦🏻‍♀️ contaminaron caleta", "tension_y_caida": "❤️😘😘😘😘", "eleinedecarvalho": "👏🏼🙌", "perla_herro": "Te amamos @gretathunberg. Gracias!! Los pueblos de Sudamérica te esperamos!!", "colomb.a": "❤️❤️", "franciscanritoguajatdo": "#noestamosenguerra", "kinturray_way": "💚✊", "__fla_fla__": "Te amo❤️", "ms.vergaraa": "@laisavalenzuela Quick question: where’s been hiding your church all this days? If peace is what you want, why Your church hasn’t done anything about it? But instead, they defend an unborn child and not the life of those who are alive already 😂 a joke, just like you!", "xx_sphia_xx": "❤️❤️", "victor_el_xd": "Gracias Greta, por apoyar a Chile", "qpuff_stuff": "Imagine all the co2 those people are emitting! Horrifying!", "_marie_573": "If they were all farting, it would be like driving an hour", "gretat_fanpage": "State inquinando mona", "tdhs111": "1 Million!", "claugaratei": "😘", "maryaleherr": "💪💪vamos que se puede !!🇨🇱😘", "lea_delambre": "@eg.gregoire WHAT 1MILLION 😍", "carlos_fhs": "🇨🇱🇨🇱🇨🇱🇨🇱✊🏽✊🏽✊🏽✊🏽🔥", "chef__cancian": "Where are you, brazilian beach oil??? George Soros won't let you talk? 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷 #bolsonaropresidente", "imecologista": "This is amazing ❤️😍", "operationholmoak": "🙌🏼", "val_ibarra_": "💞", "karifercruz": "💖🇨🇱", "karenbezama": "Gracias Greta!!!! ❤️🌟", "mattiasglz": "#karoldancedegenerado", "mecargaminombredeusuario": "Yea my country 😍💪", "gisellaespina": "Ojalá podamos hacer lo mismo cuando nos visites , concientizar a mucha gente para ayudar a nuestro planeta ,grande gretta 💪❤️ seguimos en la lucha gracias por poner tus ojos en nuestro país te esperamos pronto 😘", "j.osephi_ne": "❤️", "ekoanthropos": "😢una lástima lo de la Cop25, pero necesaria para la reflexión interna y sobre todo propuestas.🌎 Lamentablemente hay quienes se confunden y se partidizan fanáticamente, son inconsecuentes quemándolo todo, sin respeto y consideración de las personas y nuestra Madre Tierra, incluso intolerantes al mismo diálogo y acuerdos. Fuerza y saludos desde el Norte de Chile🌵", "karen_sanchezz": "@isaiahstepter", "awsmballs": "Ahahahaa😂😂😂, the Americans are fucking stupid", "chinese_coffee_": "Thanks Greta❤", "tatianamalgenia": "No al #tpp11 en Chile!!", "solesin3": "❤️", "0per_an0": "Viva CHILE!!!!", "poly.way": "<3", "isisipedreros": "Aguante Greta tumblr", "cochogno": "🙏🏼❤️❤️", "laetiiiish": "❤️❤️❤️❤️", "yulizanicolvl": "❤️❤️❤️", "patrick70727": "Keep it going greta! I really hope change will come!", "bigojwhite0698": "하 이뻥 완전 훗 이뻐요 ㅇ.ㅇ", "pascualacuna": "❤️ 😍👏🏻", "paolib7": "Thank 😚🤗", "anchitkumarofficial": "5 trees each would be 5M trees. @gretathunberg please start encouraging others to plant more and more trees too.", "teatrizdepacotilla": "❤️", "romi_mikami": "VIVA CHILE!! 🇨🇱 NOS UNIMOS PARA LUCHAR POR MEJORES LEYES PARA NUESTRO PUEBLO... CARIÑOS Y BENDICIONES QUERIDA!! 💪🤗", "maryannsilvad": "❤️❤️", "_._kalashnikova": "2 millones, no le creas a la tv", "fco.seida": "Greta estan quemando neumaticos y contaminando con las marchas. Haga argooo niñita", "katy.valenzuela": "🇨🇱 🎈", "camaila": "#noaltpp11 🇨🇱", "richardo_richard_": "✊✊🔥", "nnnn_th": "#CHILENEEDSYOU", "private_secondaccount": "🙌🏽", "pamcarosses": "❤️Grande peq", "serendipia.____": "💜💜💜💜🇨🇱🇨🇱🇨🇱🇨🇱", "lloyd.cooke": "Fuck you greta your generation can’t decide if there a boy or girl", "4ndrom3__d4": "🇨🇱❤️", "dalai1.5barria.0": "🇨🇱🇨🇱🇨🇱", "jrocoo": "Viva Chile mierda💪¡¡¡¡", "maqui.dro": "Gracias, seguimos luchando 🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "francisca.rrr": "❤❤❤", "_raul_mindfulness_": "Gracias greta eres una niña muy valiente 🌹😘", "sndrita23": "💖💖💖 Gracias 🇨🇱", "vivirogers": "❤️", "gl1894": "<3", "clownuss": "ya y ken te preguntó ajjajajaja", "sukafkiana": "💚", "marife_f": "✊✊✊💜💜💜", "maudbouillon": "Cop 25 is cancelled in chile @gretathunberg", "paolo_d_d": "Fottiti nana svedese", "irahollway": "Billions of people on earth.. But lucky this is not whole world.", "constela.heather": "Greta, what are your thoughts on the president canceling Chile’s hosting of the COP 25? Thank you for your support. ✨🙏🏻🌸", "detallitosmagicos72": "Hola querida Gretathunberg...😘🇨🇱🇨🇱🇨🇱🇨🇱 Es triste confirmar que Ya no se realizará la COP25😭 😢ÉSTA era una de las alegrías que recibiría con fiesta nuestro pueblo pero en la actualidad nuestra casa se a desordenado y tardaremos un tiempo en gritar y gritar nuestro descontento social hasta lograr poco a poco bajar el tono de voz y comenzar a hablar uno a la vez con el fin de \"escucharnos\". Queríamos recibirte, mostrarte lo hermoso que es mi país ❤️🇨🇱y las infinitas posibilidades de hacer de él un lugar autosustentable y generar energía limpia de diversas fuentes. Chile es tan hermoso. ¡Pero nunca es tarde!... Cuando nuestra casa recobre el orden, la alegría, el calorcito y nos volvamos a abrazar para cuidar de nosotros mismos, entonces ahí espero ansiosa que nos visites junto a tu familia❤️. Un abrazo y fuerza para que sigas liderando la lucha más hermosa😘❤️", "nickiminaj.biggestfan": "The kids in my class hate you idk why cause you want help!", "pamegatic": "😍😍😍😍", "cristiantiradod_m": "Greta! No se en que parte del pacifico vas pero... se suspendió la COP25! 🤦🏻‍♂️", "lunaresestelares": "Greta come to Chile anyway 🙌❤", "venegasrock": "Our president sucks!", "j_burrows27": "Please don’t credit this match with your efforts, it has nothing to do with climate change but is instead against the Chilean President", "jennicamerottoo": "Faisxhido", "calumdh": "@alexeadie92", "moreeliife": "Karol dance degenerate", "felicia__alvarez": "❤️❤️❤️", "sofiaulfvin": "Jag önskar att jag kunde vara på sånt där", "gbm25589": "❤️🌼", "plantingnewearth": "@plantingnewindia you are amazing doing great work 🙏", "j.0hn91.1": "I Love you🌲", "karla_escoss": "👏🏻❤️🇨🇱", "sxmanthaec": "Everyone talks about this but no one knows about what is going on in Venezuela or what?", "krydesoficial": "3 million people in santiago, the TV lies", "beguipezs": "♥️♥️♥️♥️♥️♥️♥️", "_despedacitoderio": "😍😍", "fb.fabiolabasaure": "🌸🌷💮", "javi.sanhuezaa": "👏👏👏👏👏❤️❤️❤️❤️❤️", "sebastian_teitan": "❤️", "climally": "Why not publishing your climate ideas on climally? We just launched the first climate change App, climally in the Apple AppStore, a global social media and innovation platform that connects climate- and eco-friendly people ❤️ #climatechange #climatestrike #climally", "jeroen_schipper88": "Varför gör du detta dit ego", "yuanye92": "口嗨谁都会，为了环保先把帆船运到美国再做帆船回去，你这不是更污染？这小女孩的环保就是希望全地球人都住在山洞里😢", "nandi.14": "Wow😍😍😍🔥🔥", "nicolo1765": "😘🤩", "bennybcgbcg": "In der ddr häts das nicht Gegeben", "stoeza05": "Bring back the V12 engine 😂😂😂😂", "alelrt": "🤟🤟🤟🤟🤟", "andrudelosangeles": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱💕💖👏", "cuenta.muert.a": "👊🇨🇱🇨🇱🇨🇱🇨🇱", "camiiriquelme": "❤️❤️❤️", "joppia": "Somos el mejor país de Chile !!! 🇨🇱", "juansereyr": "VIVA CHILE", "xinaperkin": "🙌", "yoli_livehealthy": "💖💕Sending loving energy around the globe", "enzoivan.molina": "It was actually 1,5 millions and more. The government sent the limited info to the news... Kom och hjälp folket från Chile Greta. Jag är på besök där just nu och många undrar om du kommer, du behövs och beundras här❤️", "omaromar3163": "👏", "gonzasierramart": "💪🏼💪🏼", "ess.noemi": "Te amo ❤️", "javierapazzzz": "Siempre bienvenida y gracias por el apoyo. Eres un ser humano muy bello 💙💙💙", "pmazzee": "Oh my God ... this brought tears to my eyes 💫🌟💫🌟🌠", "valde._.ch4ma": "Ese es mi país po ñaña", "simonwalser9": "Vollpfosten!!", "greenpeace.araucania": "💚🙌", "98vibess": "🇨🇱❤️", "yoymisweas": "❤️", "valentinainm": "💕🇨🇱", "conymiauu": "❤️❤️❤️🔥", "is.frxncis": "🔥✊🏼🔥", "roderickgugo": "🇨🇱❤️🔥", "divaduvan": "Snälla Greta, åk inte till Chile i december. Markera att du inte stödjer ett land där barn och ungdomar misshandlas ,förföljs av staten, försvinner, dör.", "jaivitadelgado": "🔥💪💪💪👏", "francisca17_21": "👍❣️", "clau_olivasaldivar": "🇨🇱♥️👊🏼👊🏼👊🏼👊🏼", "tak_tak._": "Chupalo karol dance", "jessy_mommy": "❤️❤️❤️", "kazu_kanau_55": "🌏観測史上最強スーパーサイクロン「キャー」出現 アラビア海。海水温が高く勢力を増す。🌏紛れも無く地球温暖化がもたらす脅威が差し迫って来ています。", "ahmed210204": "🤡🤡🤡🤡🤡🤡🤡🤡🤡", "alex_lbrice": "❤️❤️❤️❤️❤️❤️❤️", "internalizada": "Ola po olvidona", "concholalora": "💕💕💕", "la.jackyml": "💪🏻❤️🇨🇱", "sigridferrada": "🇨🇱❤️", "cari.odalee": "❤️🙌", "paumaldorios": "💜✊🙌", "jessicavergarag": "❤️", "dianna_lizzz": "✊🇨🇱💕", "lil.chumchum": "🇨🇦🤡🤡🤡🤡🤡🤡", "_marie.katharina_": "❤️", "meliiimell": "💕💕💕", "maribelita_84": "United ❤️💪🏻🇨🇱", "saryfran": "🇨🇱🇨🇱🇨🇱💚💚💚😍😍😍", "imanol.caceres": "💜 THANKS", "camilo_donnari": "Aspergers", "pyro_dj140": "Frydays for Fireworks🔥. #Pyrosforlife #pyroisnotacrime", "charlesnowboard": "@melochat", "pellicanivivai": "ma sta zitta...w il governo del cile", "giulio_new": "Hurentochter", "jonte2468": "Hao date you😂😂🖕🏾🖕🏾🖕🏾", "s.hle19": "How Dare You!", "tejidosluna_": "Saludos desde chile❤️", "_panic_at_the_bts_": "💪❤️", "torge2605": "Hätteste wohl gerne 👉😂😉", "caamythu": "✊🌍💖", "prialvarezw": "😯❤️🇨🇱", "alephaant": "#renunciachadwick", "alleskommtan2016": "👍🌎🌍🌏💖💔", "walker.cj27": "👏", "multiversepoet": "😍", "maerodart": "What about what's going on in Brazil, with the oil that is killing animals? The oil comes from Venezuela, by the way... And curiously, no one is talking about it. Not even the ambiental activists.", "tommaso_tagliabue6": "ma andate a lavora va creeetini", "dana_may138": "Looks like an ant hill", "lety_sainatii": "Vabbè", "bernarditahenriquez": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "pcosmicgirl": "960 Shares Share Pin Share Swedish scientist Magnus Soderlund has come up with a way to “save the human race.” Don’t get excited just yet, it involves cannibalism. Yup, eating human flesh. This is creepy on so many levels; nevertheless, we should understand why this man came up with this idea, and why he thinks it could ever work.", "cabane.perchee.emmaetloue": "👏🙌", "tapjankson": "How come you don't support or comment the demonstrations in Hong Kong, Barcelona, Bagdad etc.? Glad to have revealed you're nothing but a LEFT WING activist who benfit from environmental pollution. Shame on you! How dare you🖕🏻", "planeta_musgo": "💚🌿", "cecilia.tilley": "HERO", "catii.diaz": "❤🇨🇱🇨🇱", "_kai______": "You’re the Swedish hitler it’s fucking atrocious", "the_eco_team": "👏👏👍👍✊✊🌏🌎🌍", "txmxtxsxygxxdbye": "We love you as much you love the Mother Nature ❣️😍", "northwestsurfer": "God this kid is amazing", "giorgia.de_stefanis": "I don't go to school", "whoof__": "🤡🤡🤡", "urbanpaleocenter": "🙏😍", "carolinaguila": "CHI CHI CHI 🙌🏼", "space_s_world": "Good luck", "uptheoz": "Love u!🙌🏻❤🇨🇱", "isabella_giorgi1": "Honestly I want to appreciate @deborah_henderson_ who has brought much light into my life and family after I invested with her, I was patient enough and after 7 trading days, I received a total profits of $6799 as my profits with an investment of $1000, I do recommend everyone out there to @deborah_henderson_", "negruri": "Y ti crees que marchan por el cambio climático??? Han quemado todo lo que hay a su paso, esto va cada día peor!", "catalinna_es": "😘😘🇨🇱", "avrilignaciaa": "❤️❤️❤️", "zv.prod": "🇨🇱🔥🇨🇱🔥🇨🇱🔥", "dnlgrgpvz": "Go Chile🔥", "subhadra_all": "Wow!", "cata.cisneros": "te odio", "fartoonah_": "Thats crazy wow❤️❤️👏🏽👏🏽", "sophia.williams1999": "wow weer een prachtige foto, waar komtge vandaan autismotown. gore hoeren autist ge zou beter over uw kkr vlechtjes struikelen en uw tanden kwijt raken, vuile pipi langkous wanabe sos hoer", "ewerk_luckenwalde": "wow !!", "shopaholicae": "Fantastic ❤️❤️❤️❤️❤️", "billsponsor": "👍", "as7778882": "❤️❤️❤️", "svillarroelmarquez": "🇨🇱", "mert_2003_31": "Youre phonetisch is mit Good for the climate too", "fernandalvear": "Un angelito ❤️ @ro_ortega97", "sofiibasualto": "❤️", "ginamarcelapomboyancovich": "✊✊💗", "jett_sto1p": "i shouldn’t be up here", "finazzibox": "👏👏", "acidpintadosamano": "Thanks Greta!!! If aprove the TTP-11, no @cop25cl !", "doramorocha": "❤️❤️❤️👏🏻", "master_scottphz": "❤️🌱✊🌍🌳", "alex_pley_graun": "👏🙌👍❤ 🇨🇱", "starzu": "If you really wanted to help the world. Then you would have poisoned all these peepz 😜😂", "rafacardemil": "Wena po olvidona", "1970purton": "❤️❤️❤️🌎", "_lot3k": "You're wasting air. Stop it, die!", "_konsuelo": "Thanks greta for your support ♥️ the tv said it was 1 million people, but we were at least 2.5 million ONLY in Santiago! they are not counting the other cities! I love you ❤️❤️", "alexhorowitzz": "amazing.", "ignaacia_santander": "💪❤", "tomw10166": "They're out there protesting against the government and NWO agenda", "missfatsonli": "❤️❤️❤️❤️", "moisesrsuazo": "❤️❤️❤️❤️❤️❤️", "gellerd.br": "Absolutely insane❤️", "adosruedas_": "#noaltpp11 💪", "evanpoole06": "That's just adding to sound pollution", "leader_of_sports21": "All the best greta", "hdwysyd.khlqy": "❤️❤️", "azinpour.lawyer": "Great geta", "culturehacklabs": "❤️", "nataly.lizana.3": "Gracias por tus palabras. 👏", "annahloucataris": "🙏🏼", "mariabelen.arte": "✊recistencia 🔥🙌♥️", "isiorams": "Te amo", "fibs_natu": "🌎🇨🇱☮️🕊️♻️🚯🚭👊", "karola_alvarez_": "👏👏👏👏👏🇨🇱💞", "patriguerrero.o": "Thank you very very very much 💖", "meleewodz": "Learn about facts and evidence before you spew nonsense", "eloise0714": "❤️❤️❤️", "pauvalenzuelaj": "❤️", "jeannettemorenorojas": "❤️❤️❤️gracias Greta!!🌹🌹🌹🇨🇱🇨🇱🇨🇱", "fionaogra": "Gracias @gretathunberg tu nos inspíraste a luchar por nuestro país", "nachaedwards": "❤️", "antoniapujol01": "😍", "francis.guajardo": "gracias por difundir.#chiledesperto", "alnitakt": "♥️", "yanktoextract": "1 million people trashing the street, holding up traffic, etc. All for what? You and your beliefs are a joke as is climate change as a whole.", "camila_magdalena_serrano": "❤️❤️❤️", "natalia_acevedo": "Chile despertó, que no lo vuelvan a dormir!!!! 🙏", "clautoled0": "👏🏽👏🏽👏🏽 🇨🇱 💖", "la_chichirivaslang": "💖💖💖💖", "maituliramirez": "👏🏻", "la_rojita": "❤️ 🌳🌎", "karenbrowncl": "💖", "vaniaa_g": "Don’t come to the COP25, the government is killing us #nuevaconstitución @gretathunberg", "p4scu4l4": "Arriba Chile ctm 👏👏👏👏👏", "n_lxx": "🖤🖤🖤", "conieorellana": "❤️♥️❤️", "fabahucam": "💚", "chaaaaiiii1994": "❤️", "frm_goop": "What dojo you think about mr beast", "moonse_bb": "🇨🇱❤️⭐️✊🏽", "lauralaurita36": "Thanks. We are with you too 💝", "ba.stet": "💜", "fernh27": "Now I love you more", "psicoquiller": "❤️❤️❤️", "mariajosediaz": "❤️🇨🇱", "croix_pa_cito_epic": "Dumb broad", "armaghedon_666": "Tdi potenza del mondo", "i.w.a.n_b": "it looks like an ant swarm there are so many people", "laisavalenzuela": "appreciate so much all the information you have shared with me to develope the ideas I want to express to you and the world. I want to apologize to all the people that have felt ofendend with my opinions, I know that there had been a lot of people who suffered with the militar gobernment 45 years ago and that maybe lost relatives on that time. We all want and need a change for our country, Chile, but is not healthful for our society show just one side of the story as most of the press, viral videos and some people have done. Thanksfully we do not live in a dictatorship, and the concrete evidence was the last march that took place on Friday 25 without hurted or burnt people or without freedom of expression. Nor do I want them to getting me up my bills, I yearn for a decent pension and for my children to have access to quality education, I share those same needs as the rest of my fellow countrymen. But it is also true that, just as there is talk of a transversality in this movement of change for Chile, we must be sincere and acknowledge that a lot of the attacks against the human rights and our security, not only have been from some wrong kind of militaries, as well as of some wrong civilians that have violented not only militaries but their own countrymen. And we should recognize that some of the people that unfortanetly have been hurted by our policemen, that apparently are pacific protesters, have been among violents and looters who have plundered and burned our city. I would greatly appreciate that those that said there are tortured people, women and kids raped, please send us the source of that news, the real news, not what you see on whatsapp, Facebook, Twitter or other kind of social nets, because that is really serious and of course we must not stay blind in front of that unjustices. Finally, to the person who sugested me to try not to wake up anymore because he doesn´t need people like me, I just tell him that the ideal of union for our country is latent, we need to merge our forces without grudges and fears of the past. @paupawu @caromayora @benjalopeznavea @cotadais @sinneuronas.exe @everything.is.blue @cat.oteiz @jojillajo @javiermsanchez @oushunki", "jotadiazeme": "🖤🖤🖤🖤", "veromargo": "So proud of my peeps. Sad 😢 but hopeful", "rickiups": "#SOSbolivia #democracia", "alan_moraga": "Fuerza Chile que venceremos!!!", "felpve": "❤️", "taloo.cas": "¡¡Gracias por el apoyo!! #chiledesperto🇨🇱 #destitucionapiñera devuelvan los recursos naturales al país. Dignidad para el pueblo. Pico pal que lee", "stalinvelasquez_": "😏🤦🏻‍♂️", "roseangelica": "🙏🏼❤️❤️❤️❤️❤️", "moipastrian1": "Metete en tus weas enana reqla", "pablozeta_": "💚", "danu_bonacic": "Te amo nena 💖💖💖", "hgutierrezguzman": "💚🙌🏼💪🏼", "happy_kathyn": "Ew ni vives aqui y andas defendiendo,vete a hablar bonito a otra parte mi amor.", "jolacora": "I was supposed to be there next week!", "fer_quirozsilva": "👏👏 Bien Greta!!!", "flickandala": "🇨🇱 💜🙌🏻🤘🏻💪🏻🇨🇱", "maiteebraga": "@axel_bzn", "angelmagna": "❤️", "carolalarau": "❤️❤️", "p_edro_a_r_": "😍😍❤️", "morning_folk": "@jorge_nef", "grisgry": "😭❤️❤️❤️😭❤️😍😍", "diegonorambuena": "How dare u Sebastian", "siggimaus_56": "👍👍", "ignaciaserranow": "💛💛💛", "ozaklanjsek": "Thank you for all you're doing @gretathunberg You can now check polution anywhere at this link: pollutionwatch(dot)cfapps(dot)io", "tigre_carol": "💪💪💪", "dania_carvajal_vilche": "👏🏻👏🏻👏🏻❤️❤️❤️", "paula.ayelen7": "#seestacayendo 🔥", "nayarethvasquez": "😍😍😍😍", "margapugao": "❤️", "extrux21": "We love you!! And we need more support!!😍", "damianedmm": "Greta! Blessing from Rosario, Argentina! Viva Latinoamerica!", "carlamusiqmusiq": "❤️❤️❤️❤️❤️❤️❤️", "mgr.rebelo": "What can make the change is not this girl, but change the mindset of the human being in general. I leave these sentences to understand my point of view: The mind speaks, the body listens. Change your thinking pattern and you will change your world. Stop being selfish and lazy and start having more humble and positive attitudes. Train the mind positively. After changing this, the world will get better.💛🙏", "aurora.aviiles": "❤️🇨🇱", "gideon_is_bland_v2": "Get this bitch out my explore page🤢🤢🤢🤢🤢", "woltron": "Te achoraste chiki.", "mario_retamales": "Que bien Greta pero.mejor.preocupate del.clima, ya tenemos bastantes artistas por aca. Saludos coordiales", "elimarquezcruzat": "gooo chileee❤️❤️❤️🇨🇱🇨🇱🇨🇱🇨🇱", "groupchatsofficial": "Anyone wanna be a in gc where we follow and hype each other’s up? Anyone can join, just be active", "svante_tengen_tengen": "🙌", "david.insta.acc": "👏", "elsis_ellen": "Your a great person Greta!🌎❤️", "abbasmollah786": "I think More than 1 Million , 2-3 Millon", "ailumandola_": "te amo greta sos inmensa", "lore.msgz": "♥️♥️♥️♥️", "mayabsound\nVerified": "Verified", "neo.elander": "Ring mig 0720377181", "florianthomassen": "Dienstag für Diesel", "phimarmoran": "8 billion people on earth sucking all of its resources. Five million species of fauna and flora extinct. Think Greta, think, Malthus was a genies before you were hanging out in your pops testicles!", "lf.herrerag": "Greta if you come to Chile denounce Piñera’s goverment for opressing the chilean people justified claim of a better quality of life and equal oportunities for all the population (including stopping the deforestation of our forests, contamination of industrial waste into our cities and the sacking of our natural resources for the profit of a few). With you all the best and keep going strong ✊🏼", "catalinagutierrezlueiza": "🙌", "lauren_renaud17": "Letsss goooo", "mystikah": "greta shishi❤️", "mashueonaquepelarpalta": "Please come here and help our government to notice that here in Chile we are in the inflection of a political representativity crisis and at the same time in the edge of extinction", "purelight1960": "Wow!", "unachilenaenmanchester": "❤️ Thank you", "exsertapple788": "DUMB LIBTARD FREAK GET OUT OF OUR COUNTRIES AND STOP INTERFERING WITH CANADIAN FEDERAL ELECTIONS YOU AUTISTIC SLEEZEBAG", "tarili31": "Wow! Just amazing! 💕🌍", "zerowasteworldshop": "❤️🌎", "mayanktarte655": "You can't bring millions of people on street. Plant trees and say'1 million people planted trees'. That would be good as hell.", "papayocv": "❤️", "tomaspearson": "🙌🌍🇨🇱", "cami_caffarena": "👏🏼👏🏼❤️", "saha_pubali": "I want all of 16th come in road for save the world.", "jonmattiaskj": "❤️❤️", "casromi": "💪💪💪💪💪💪💪💪", "till_lhr": "I ❤️ Diesel", "radiofelpita": "💖", "carol_de_cazorla": "🇨🇱❤️", "michellegriffiths88": "❤️", "catalinacf_": "❤️‼️", "uleawesemeyer": "❤️", "guillemdo_": "Guarra", "gildamartiniuk": "💜", "nation_klx": "I followed you so can you follow me back", "tm_69_xe6s24f13": "👏", "sherpon": "What do you say about Venezuela????", "tomasgutierrezc": "Wena po olvidona", "sonja.nct": "Wow👍", "celestemaryna": "Greta, please talk about TPP-11( transpacific \"partnership\") . An horrific free tarde agreement that could be aproved for politics in Chile", "gratefully.believing": "So I guess it doesn't matter to you that 19 people lost their lives during this protest as long as it fits your agenda! #howdareyougreta", "angelicapozo": "❤️❤️❤️", "sverigeshumor_123": "WHY are you gay?", "mariajosefrs": "😻😻😻", "sofinolia": "Here in Chile there are human rights violations, people killed and tortured in the subway stations that the police set on fire to have places of torture. There are women and men sexually abused by the military and you will come to #cop25 to tell us about global warming and the environment? ¡We and our ancestors are the Environment and Nature! This economic system of death is the one that has the world living as slaves and our land devastated by industries. PLEASE If you love nature and have faith in humanity you coud speak publicment about you are against PIÑERA DICTATOR and don't come to #COP25 because you support the people who are the true owner of the land, rivers, sea, mountains and glaciars. It would be beautiful ♡ Regards of Chile. #Chileresist", "valeriamgdalena": "💕🇨🇱", "manununezo": "💛", "marysantelicesaguirre": "❤️❤️❤️❤️🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "andreamacarena": "❤️", "unicorniandina": "🇨🇱🖤", "mariajoseyunge": "♥️♥️♥️♥️♥️", "martina.sivori": "❤️❤️", "ninabohmanfotograf": "OMG🙏", "tracey777poole": "🙌🙌❤️", "leungyanning": "And in many other countries in the world too. Love from Hong Kong", "fellinistyle": "💯❤️🙌🏾", "czsepulv": "@natinkii 💕😍🖤 @gabrielaspdv", "valegutierrezr": "🧡", "rober.quiroz": "1,2 millions", "rickhasher": "Bellissima!", "kurtacubito._.dubidu": "❤️❤️❤️❤️", "lifeeverlasting": "If only Vancouver gave you a welcome like this.", "amelie.cze": "Great Greta❤️", "javiera.chg": "♥️", "consu.comunica": "👏👏👏🇨🇱💟", "_rottenbabe": "COSITA SOS UN AMOR", "norbertolopeztattoo": "Tusen takk ✨", "mariapaz.vanc": "Thanks Greta for sharing this information ! 🇨🇱", "mdemercedes": "#piñeradictador", "julan.09": "❤️ U GRETA DU ÄR BEST🌎🌍🌏🌊☀️", "noeselisa": "gretaaaaaaaaa salvanossssssssssss tkm", "_fran.bp__": "❤️", "eveavi2019": "La lucha continua 💪", "misterministerpister": "We will plant a tree for every single follow💚💚💚 So check out our page and help the environment!🌞🌳", "caroldunlop1980": "Thank you!!! ♥️♥️♥️♥️✊✊✊", "amelimali_": "👏🏼👏🏼👏🏼👏🏼", "jacquelinne.26": "❤️", "carosawest": "Thank you Greta.", "kaif.energy.bebida": "Greta you are a liar!!", "angelo_luigi_gualco": "Brava Greta", "valitarojasc": "❤️", "poletia": "❤️", "flor_besso": "🙌🏽🍀", "schema65": "👏👏👏👏👏", "lorrainedelarose": "💚🇨🇱💚🇨🇱💚🇨🇱💚🇨🇱💚🇨🇱💚", "maggie.t_castro": "❤️❤️Gracias por tu apoyo", "seba.soma": "Thank you @gretathunberg", "moma.drid": "🇨🇱!!!!!", "7dvickybr": "❤️", "i.c.e.b.e.r.g__": "Aristoteles'in bir sözü vardır. \"Boş yapma\". Sen boş yapıyorsun", "joelalejandro_ruiz": "#HowDareYou the protests in Chile are sponsored by the Sao Paulo Forum an organization communist who supports the tyranny in my country Venezuela. That ins't about change climate behind that protest is many communists.", "abbihontas": "😍😍", "lucy_hancock_": "@alice.vl", "_rodrigo__ap_": "❤️❤️❤️", "rnanati": "Comunism devil", "valeriarentefcb": "👏🏽👏🏽👏🏽👏🏽", "antonio.ernesto1": "❤️❤️❤️❤️🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "seanguo2018": "Hi Greta, I wrote a book to educate 1 billion Chinese about Climate crisis. Your support can make a real difference. My email: seanguo2011@163.com. Million thanks.", "estoy_conlacultura": "@gretathunberg ❤️💚🌎🙏🏽🗣🌈", "melentidavid": "🥵", "vale.dini.bajas.canuelas": "❤️", "salma.atala": "💙💙💙💙", "margaritaansoleagarod": "😢 😢 🌻🍂 🍁", "jaime.iturra": "When people see the unjustice,st lsest", "karenbutti": "👏👏👏", "ale.leyva5": "@larissaleyvaa", "pausetoeat": "Tack Greta för att då står med Chilenarna och mer jämnlikhet för folket! 🥁", "jonathan.larsenn": "Duktig hjärtat❤️", "kysiaspam": "@cassie.cashea", "sonja_mb": "Woh💓💓", "thaovucbmama": "@duypidzzaslime hell yes:))", "alphalentina": "♥️♥️♥️♥️♥️♥️", "apoyo_achile": "Yo👏", "bamdad_rhm_": "Fake", "timjaggi": "Jeahjeah 🙌", "a.n.i.l.u.a.p.1": "💧💧💧🇨🇱💪😍", "juani_montealegre": "❤️❤️", "hellokitty.93": "😻", "deco_pieceras": "👏🏻👏🏻👏🏻❤️", "recyclingissexy": "🙏✨💛", "arif_demir8": "🔥❤️🔥", "clau_consu": "🇨🇱🇨🇱🇨🇱🙌 el pueblo unido, jamás será vencido 💕", "flolimonado": "❤️❤️❤️", "florabunster": "❤✊🏼🇨🇱 Thanks Greta!", "bboybenja23": "😍🇨🇱", "sofia.zap": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "ronniesep6": "💪🏼💪🏼🇨🇱🇨🇱", "petergk_thereal": "Not just for climate change. Mainly against social inequality they went out.", "lorri_lou_who": "@tour_de_spain", "asma_rahim11": "who is Imam mahdi? Imam mahdi is 12th Imam of Shia Muslims that that refered to by many titles such as al-Hujjah , al_Qaim and sahib al_Zaman but the most famous of his titles is al-Mahdi. The 12th Imam or Imam mahdi is Imam of kindness and Imam of all people in the world. He shall guide human beings to prosperity. His main aim is fight injustice ، fight inequity ، fight racism، fight violence and every other negative ideology and he act that widely spread across the world and to establish justice ، peace ، welfare ، kindness ، friendship ، respect ، sacrific ، generosity ، honesty ، loyalty ، Safety، progression and Evolution among all nation in the world. after the return of Imam mahdi ، world will be a much safer ، happier and better place to live. if you want better know Imam mahdi search in internet about who is mahdi? who is Imam mahdi?", "emmabmf": "👏🏻👏🏻😻😻😭😭", "dianadelirio": "❤️ Thank you Greta", "by_fradnand": "✊🇨🇱🖤", "ismayilovaelina": "Why do people like pollution", "ocampo.nino": "OSS", "lucivonbilabel": "💪💕", "lucifromlucifer": "come on and join us 😚", "bravocruzx": "Se nuestra presidenta 👸", "jenna.rose._": "🙌🏻❤️", "romaniaca": "💜💜💜💜💜💜", "scarlett_northbeach": "Wow😮", "asafthedog": "@rcc.ronaldo", "andreaqh": "❤️❤️🇨🇱", "paz.cita_": "❤️", "vaitiare.d": "@romyduranm la amo ❣️ 🇨🇱💥", "soldetardes": "❤️", "miravallechile": "Please dont forget #chile 🙏", "mayaxsugar": "💕💕💕", "javi_eguiguren": "YEEES!! CHILE!! ❤️😍", "nickdark0": "This not end yet, it's only the beginning #renunciapiñera", "stalnoi_muzhik": "Is just big siesta for lazy students.", "maria_radice_": "GRANDE, GRANDISSIMA ❤️❤️❤️", "masdeu_david": "Good morning, good number of the people in the street in Santiago of Chile 🇨🇱😉👍🏻", "rmatiasaguirre": "🇨🇱", "_jupiters_sanctuary_": "🌍", "yisleynoemigrez": "Gracias Greta,desde Chile.", "florales_gabriele_gaetjens": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "melarkeee": "❤️", "pau27_2013": "♥️♥️♥️♥️", "kebrutal": "❤️❤️❤️❤️❤️👏👏👏👏👏👏✨✨✨✨❤️❤️❤️❤️❤️", "hetsjulia": "@magditamateu har du sett att Greta skriver om det?", "atelie_elastik": "💕👏🏼👏🏽👏🏾", "alopape_14": "✊🔥🇨🇱", "clau_vm_": "💚", "ninni_i_mumindalen": "💚💚👏👏😍😍", "ivonne_cach": "Despues de quemar plazas, puestos de trabajo, iniciar los cambios en politica, siguen marchando por?", "jeisson_varela": "💪🏽🇨🇱", "eliza_westman": "🙏", "miradamaga": "Gracias Greta🙏", "sebailufi": "✊✊✊✊✊🇨🇱🇨🇱🇨🇱", "pinoyqueso": "wenaaaaa greta dando cara siempre ❤️❤️", "georg_kthe": "You are gay nigga", "itsalondrahere": "❤️❤️❤️", "jomusri": "🙏🏻🙏🏻🙏🏻🇨🇱🥰", "jamesadumbrell": "Trump will probably claim this pic as his inauguration ceremony 😂😂😂", "piagutierrezp": "❤️", "theroshniali": "❤️❤️❤️❤️❤️", "camidelsool": "💪🏼❤️❤️❤️❤️❤️❤️", "timmy_shaw_": "Ah bless", "_amirreza_bahrami_": "❤️❤️👏🏻👏🏻🌎🌏🌍✌🏻", "leen_moya": "💓💓💓💓💓", "valee_pinom": "❤️🇨🇱", "sobre_nube": "Desde Chile 🇨🇱🗻🙏", "virgilioangelica13": "👍👍", "petterross": "Stå på Greta👊🏻", "maria.ghaziri": "@clarissedebian @elie.ghaziri @nicolema3endainsta @daliabeaini @youmnageha_ @traceh1 same exact thing happening in Chile", "migomara": "❣️", "simonee.1.38": "Shut up stoopid ass", "dugtherobot": "We stan a queen like you", "jacintafariass": "Linda greta 💙🌻", "lnf_fox": "United we stand Together we will change #letsdoit", "nanihenriquez": "Chile woke up. Chile har vaknat. Chile despertó.🇨🇱🇸🇪", "kathyhinojosav": "😍😍😍", "esriiphaaphthrrmchaati": "#FREEDOM#DEMOCRACY#FUTURE#HOPE", "mansilla_con.ese": "👏🏻👏🏻👏🏻", "den.snns": "Fuck the Police!!", "carbonzerofuels": "👍😎", "vivkvintahs": "Fantastiskt Greta 👏👏", "marielagonra": "♥️💪", "__samurai_jack": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "nachacharocuant": "Greta te amo 💜🌷", "adamtaticek_": "Shit I just dropped plastic", "22gl0": "❤️🔥", "consu.flo": "Thanks for your words, regards from Chile. For a best live!!!", "suzanne.desmarais.3": "👍", "mahognydamen": "❤️❤️❤️", "nanogillmore": "🙌🙌🙌🙌🙌", "waynetech65": "Wtf do you know about that????", "mariliisaimla": "💖💖💖💖💖💖", "robertoandthetrees": "💚💚💚💚💚", "moschiiii27": "🙌🙌❤️❤️❤️", "pilarromanoff": "💕", "jeeone_prod": "💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚", "maggavicki": "😮 WOW Såå MÅNGA 🙏❣️", "pascaldiederich": "Wow.", "beestenindenbosch": "Let us all Tune in on Unconditional Love with our minds, so we will Be finally Truly Wise, United, Respectful, Joyful, Content, in and at Peace. 💖✌️🍀", "sebbe75": "❤️🇨🇱✊🏽", "just.curious.himanshu": "Amazing view ❤️", "missmegan2020": "❤️❤️❤️", "vannia.chavez": "Thank you for you support ❤️", "anyaedw": "🖤", "priscillaa_2019": "❤️we love you", "aidaamoli": "❤️❤️❤️", "rwalejandra": "❤️❤️❤️❤️❤️❤️❤️❤️", "helmimagdalena": "Save the world😭", "libertha_fotografia": "😍😍😍", "enjoy_your_life_s": "Greta tell to this people, what they must really do for helping The planet, The fast fashion, eat meat from intensive farms and more other things", "mmxtmx": "Civil unrest is becoming the New Normal. November 5th is coming and as V said, government needs to fear THE PEOPLE - not the other way around. LISTEN or we will REPEAT our message until you do (Hong Kong) « get it. »", "gretathunderburgers": "1 million people in hk: greta: no.", "brokkeboii": "Renuncia piñera", "everstag_official": "👍", "tacoicarspaghetti": "How dare you", "malkiatsingh9157": "👏", "hiswidness": "Many many people are ready to make a stand;-) you helped this.", "flutterby_things": "I'm proud to all the people with claustrophobia...😅", "coooonty": "😍💪🇨🇱", "rhmawr": "❤️", "biancalmv": "Thank you greta!! Your support is VERY important right now!", "elisabet_frisk": "Amazing, what a power!", "rebecca_mob": "Omg I wish it wasn't just a slogan", "sofi_eluani": "❤️❤️❤️", "pr1v3_l0u": "how dare you! >:( @yeetmuffin420", "lozzbro": "Viva Chile ❤️", "apinec.eu": "Very impressive account and its philosophy👏", "majakaras_inspiruje": "❤️❤️", "edgaritoavila": "Viva Chile and Greta ❤️💙", "stummkind": "i wish it was always so many people. so many and more.", "jessiicaewr": "@sm00th.potato", "susiilago": "Åk till chile för att visa stöd för de förtryckta folket. Vi är många chilenare i Sverige som är i just Sverige Pågrund av maktmissbruket i Chile i många år💔", "espinolajp": "❤️", "arize2hope_charity": "👌💚👌", "golden___________age": "Gracias Greta ❤️", "dmart.d": "Mind-blowing to think the powers that be haven't figured out we'd all be MUCH better off if we didn't constantly try to screw people over. This zero-sum-game mentality is the biggest farce ever sold.", "harmony_kingdom_108": "heard You have psychical disease, stop telling this shit, global warming is very positive tendence, frost is the most dangerous disaster in our northern region, and I very grateful that climate is becoming milder!!! I,m interested to increase co2 emission, and I will do! Shut up and study!!!!", "quinners.21": "@realdonaldtrump this is what a million people looks like", "a_coindreau": "❤️❤️", "michellehadad": "😍", "poli_lamartine": "❤️❤️❤️👏🏻👏🏻👏🏻👏🏻 🇨🇱", "andreus_94": "#NoJusticeNoCOP25", "dechilean": "✊🇨🇱🌎💕", "amrit_singh_777": "we are with you greta", "mrcringe_yt": "6,999 Comments NICE", "mybilliebeanie": "😍😍😍", "_igneo_": "👏", "nvalesesteban": "Tristeza ante lo que pasa en Chile; y rabia...😢😢😤😤😡😡", "dine7681": "Woah! 😱😱😱😱😱😱😱😱😱", "alexander.collins.7121": "🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱🇨🇱", "pflores67": "Tack!", "cory_cat93": "It kind of reminds me of fire ants.", "david_sk8000": "Hey ho lil Hoe", "paulvaros": "A big one 👏🏼", "josefinabarna": "♥️#♥️♥️♥️♥️♥️♥️♥️", "felicia_concha_": "🌎🌎", "karen_vera": "🇨🇱🇸🇪 tack Greta för ditt stöd ❤️", "tlgayildirim": "Ypg-ppk bir teror olusumudur ve sen bunu destekliyorsun cocuk oldugun belli ilk once arastir sonra konus ve ozur dile TÜRKİYE ve TÜRK halkindan.", "infinitasvecesinfinito": "💕", "danniemrchnt": "💖", "blaisebennefield": "Whole lotta people for something useless", "filipedealbuquerquecar": "❤️❤️❤️❤️❤️❤️", "mahyarnedaee": "Hey greta! Your thoughts are with people of chile and not with 60 dead and 2000 injured person in iraq protests? 💭 🧐", "zachwilson89": "I agree with you gretathunberg", "anthony_wyld": "Bigger than Trumps inauguration for sure!", "letyourheart.win": "🇨🇱🔥💖", "ravina_29_8_2_": "👏👏❤️", "silviatabanelli1967": "❤️", "mildredderestrepo": "👏🏻👏🏻👏🏻💪"}