{"gretaisameme": "wow ur doing great!", "leanhartmann": "And the trip to vancouver doesnt emit co2?🙄👎", "jmtazz": "New cAnera day thiS Camera suckS", "shane.brown75": "@sharkeys2018", "cornelisdeleen": "Check this movie on Vimeo https://www.normalisover.org/vimeo/", "mahsa_marketing": "😮", "eloigameleira": "Lideranças de comunidades tradicionais indigenas são mortos no Brasil. 😱😭😭", "colemanwilcomix": "Ew", "davidsinsta2020": "How did you get to Canada? Walking? 🤣🤣🤣🤣🤣🤣🤣", "_der_alte_lump_": "Photo shop bitch", "tanpreciosa16": "Art gallery. I wonder if this was the day there was a march", "helodada": "👏👏👏", "edgzzbloodz": "My dad disowned me", "gr.sdt": "I really like how you are doing this 💪😊", "prinzess223": "@linus.kunze erstmal wie alt bist du ?? Lerne erstmal dich richtig auszudrücken!! Dann können wir gerne auf das Thema Klima zurück kommen", "shewhowalksinpeace": "@steppytoll", "hrxsi_xo": "Wow", "haykehkoli": "❤️❤️", "erklinder": "Såhär har ett tal där alla slänger skräp på marken efter eller", "christianharris7": "Emery out", "ra02082002v": "🙏🏻🌎❤️🌤👼🌈🌟🎁🗺🌊", "mikeeerogersss": "How do you travel from country to country ? (Genuine question)", "ryos04": "Schwachsinn 👎", "andi14_": "Fck fridays vor Future", "keplerjohannes71": "you only know how to talk it's time to act", "abhhiinav": "Wasting time.", "admwoodwerks": "Political left wing interference in Canada’s election! Your visit was timed to affect a sovereign countries election the following week. Funded by Soros and fronted by the 16 yr old screech owl from a collapsing euro country- GET LOST", "armanabdollahi.official": "❤️👍", "tyler_hutzell": "That many people exhale too much carbon dioxide, that’s not good for the environment...smh", "ojas_sahu_": "It would have helped more If they would have planted trees. Instead of just standing there.", "wiamlam2009": "Wow is fantastic", "piku_aanderson": "Do you now how many people where there??", "slav_king_with_vodka": "Don’t ever come back", "illbandidoarte": "Trump 20 20 🇺🇸🇺🇸🇲🇽 Americana forever#kag 🗽", "apsley_j_wood": "This is ridiculous. You people don’t realise by protesting you cause traffic with cars buses and trains. These will now be pumping more pollution in to the air than needed. You are doing more damage to the earth than stopping it", "bogdanii_": "I", "htx_jmx": "Autisten", "moritz.fsb": "🤮🤮🤮", "dingle_.josh": "“How dare you” shut up you autistic fuck", "benezaire77": "Let's gooo. Tu puedes.", "smile_lil_bch": "just imagine the headlines if a large stolen cargo plane... crashing into the middle of this whole crowd..", "filippocrestan_": "Come il cristianesimo....una merda", "worldcow": "We’re all spots on the same cow", "bobby_zima": "All activists are going to do something that makes sense. You are still screaming in the streets and doing nothing. You go work better", "paramedicated": "United States  Sallie Baliunas, retired astrophysicist, Harvard-Smithsonian Center for Astrophysics.[116][117][118] David Douglass, solid-state physicist, professor, Department of Physics and Astronomy, University of Rochester.[119][120] Don Easterbrook, emeritus professor of geology, Western Washington University.[121][122] William Happer, physicist specializing in optics and spectroscopy; emeritus professor, Princeton University.[75][123] David Legates, associate professor of geography and director of the Center for Climatic Research, University of Delaware.[124][125] Anthony Lupo, professor of atmospheric science at the University of Missouri.[126][127] Arthur B. Robinson, American politician, biochemist and former faculty member at the University of California, San Diego.[128][129] Murry Salby, atmospheric scientist, former professor at Macquarie University and University of Colorado.[130][131] Nicola Scafetta, research scientist in the physics department at Duke University.[132][133][134] Fred Singer, professor emeritus of environmental sciences at the University of Virginia.[135][136][137][138] Willie Soon, astrophysicist, Harvard-Smithsonian Center for Astrophysics.[139][140] Roy Spencer, meteorologist; principal research scientist, University of Alabama in Huntsville.[141][142] George H. Taylor, retired director of the Oregon Climate Service at Oregon State University.[143][144]", "k.shohruz": "shit shit shut up😂😂😂😂😂👎👎🤮🤮", "zweirad_army": "Wenn dummheit wehtun würde die würden alle sterben", "stern.ryan_t": "More jet fuel and fossil fuels burned in your travel huh young hillary?", "the_life_of_camby": "You discuss me", "eman_brave": "🌼🌼🌼🌼", "thedon.mma": "So many dumb Canadians 🤦🏼‍♂️ wtf you guys listening too? Lol the same shit they told her to say over and over. You know the first step in brainwashing is repetition! Lol she literally came from no where spued out bs that actual Environmental Scientist strongly disagree with! Plus the Asburgers is skechy and her teacher is direct connection to the Rockerfellas soo i mean. NWO economic scare plan? Probably!", "restlessnights0": "Awesome 👍", "tiffanymarthin": "@xinyun___", "joongland": "WAS THIS TAKEN WITH YOUR FUCKING ASSHOLE HAHAHAHA", "kelowna71": "Ignore the haters.Grown ups attacking you shows how weak they are.You are an inspiration.", "alewohlgemuth": "✊", "annaluperdigao": "🇨🇦🇨🇦🇨🇦", "johnhung6969": "99% are thankful for a free school day", "chorizo_sausage_spam": "Ahhh yes, they day I tried using public transit to go downtown...greatest mistake of my life.", "mica461official": "#fridaysforcars", "rainbowbliss321": "schools destroy the lives of kids end schools schools are torture and produce trauma to induce the defective sick system on kids minds end schools now we don't need schools and teachers we can learn by ourselves and be together the same end schools now kids can't spend life time forced to be closed in schools schools make kids grow to be haters schools system ruined the environment", "venvsk": "Get the fuck out of my city reeeeeeeeeeeeeeeeee🤡🤡🤡🤡🤡🤡🤡🤡🤡", "imisswilson": "How dare I", "varunkrishna99": "So how did this help the climate, pretentious idiot.", "yellamob": "ah the rich who don'thave to work to live in vancouver are having so much fun .... love to see.", "muhammadafzal7133": "❤️", "nick_pishock17": "While people are planting millions of trees all over the world, you’re doing...what?", "reuben_waring": "I like climate change", "lapinazinaida1127": "Гыггыы́д.хьиио́о ::", "amylynn92578": "Unless all these people have walked here and are not creating any waste (trash), I don't wanna hear about climate strike bull!! Just saying. 😂🤣🤷🏼‍♀️🤦🏼‍♀️", "unclebensfriedrice": "Sausage", "noah4901": "Wenn deine scheiß Demos am Wochenende währ würde kaum einer mitziehen ! Die machen das nur wegen Schule schwänzen!", "jprjahroyal": "GretaThunberg please make the case for Incomappleux Range(Inland Temperate Rainforest: Yukon; BC; Washington; etc..) before it becomes de-forested. It is not getting the recognition it deserves. Thank you, my heart goes out to you. I forage mushrooms in the surrounding forests of where I live here.", "illmontone": "6 tt noy", "rafa_gsl": "Q mal me caes fea", "will016002": "She can see the carbon dioxide in the air? Wow! That’s something cool yet useless just like herself.", "pretty_w1se": "Fuck you 🤮", "vs_fanpage._": "Bist du noch Jungfrau ❤️❤️", "annwilliamson37": "YOU GO!!! WOW!!!", "emersonmancini2017": "Vai estudar....", "operationholmoak": "🙌🏼", "djthedj1620": "(((Berg)))", "lauraschyberg": "Oh that looks Nice! Please read my Dm", "i_batya": "Maybe pupils have to study not striking? How can they make new researches for saving our world if they really can't count 2x2?", "hestiyamb": "My brother lives in vancover", "_tim_hg_": "@swpewd", "henrykeith_glasscock": "@supersaiyanlewis swoosh", "itsss.jacky": "@swpewd", "ecoislogical": "Love your account! Thank you for spreading awareness 🙏🏽🙏🏽🙏🏽 we need more people like you. I too have an account dedicated to environmental tips and trics, how to help and with vegan meal ideas, too. Please visit my page!:) 🌿🌍🌿", "sar__toast": "I might listen to Greta when she begins practicing what she preaches. Jet setting around the world while lambasting people for their carbon sins. She takes the prize, alright.", "chriszilic_": "ClimTe change isn’t real go to school stop wasting everyone’s time", "karen_sanchezz": "@isaiahstepter", "liridon.kadrijaj": "Nuclear weapons testing is the main problem of the climate. Not humanity. Atomwaffentests sind das Hauptproblem des Klimas. Nicht die Menschheit.", "oliverpurdy51": "There here iiiiiiii😍😍😍😍😍😍😍❤️❤️❤️", "seawall11": "You inspired me to go out and buy the most gas guzzling truck I could find. Two lanes wide of American pride", "_gabriel_mariani_": "✈️", "damefastlife": "You are a worldwide inspiration!! God bless!", "cbauer905": "As my home is Vancouver I just wanna say time to go you have overstayed your welcome", "stevojovicic": "@slavik.ma4 haaaaaaaaaaa", "cecilia.sanchezv": "Greta tu que está tan preocupada del medio ambiente,no puedes apoyar la destrucción de chile y los incendios que nos tienen con una contaminación ambiental que ya no se puede tolerar !!! #fuerza Piñera!!! 💪🍀😍", "paolib7": "👏🤗", "young_vancouverhomes": "@gretathunberg Have you realized how brutal was the traffic in DT Vancouver last Friday? I sat in my car for 2 hours in order to travel for 2km.", "anchitkumarofficial": "If each of them planted 10 trees. It would make a great impact too.", "clapclap_deleted": "Ala akbaaa", "2001cowboys": "I Love Canada 🇨🇦.....Canada Loves Greta 🇸🇪", "andrew_salzman": "🖕🏼🖕🏼🖕🏼🖕🏼", "_josua._": "@swpewd", "aniketank": "Instead of gathering people for strikes and protests why don't you ask them for planting trees or channelize energy to something positive. #donttalkdoit #doitright #changetheworld 🔴🔴🔴🔴🔵🔵🔵🔵🔵🔴🔴🔴🔴🔴🔴🔵🔵🔵🔵🔵🔴🔴", "velix.m83": "ORUL ORUL ORRRROSPPUU ÇOCUĞU", "renanleitau": "Jean-Paul Sartre was the first Nobel laureate to decline the prize. The philosopher Sartre said that a writer should not become a institution. A critic of French society and bourgeois consumerism, his ideas influenced the May 1968 strikes in Paris. However, despite the near-overthrown government and the coming social revolution, the political outcome was not as expected. Two months later the government called for new elections and returned to power with parliamentary supremacy, the first time in French history. In 1968 Sartre was 63-years old. Preventing his participations in riots was attempted, but his imprisonment was not allowed. \"You don't arrest Voltaire,\" said president de Gaulle.", "xelf1je": "HOW DARE YOU", "ladyann_tarah": "travel?", "billylakey_": "Such a bad childhood I couldn’t imagine", "yodapancakes": "We just need to Ban Petroleum❤️", "dylan_riihela": "Android", "rima._.hmb": "@swpewd", "evanz_0327": "May I also add that it may appear as less than attractive for somebody to oppose a 16 year old girl and downright insult her just because you don't agree with her views. If you disagree, nobody is forcing you to comment.", "x.xrimx.x": "#teemtrees", "fabio.4123": "@swpewd", "jogro_wtw_9": "@swpewd", "albion_hh_": "@swpewd", "kathi_tb_": "@swpewd", "_moritzgabriel_": "@swpewd", "tomw10166": "How dare you to sail to America on a carbon fiber yacht that you didn't build which cost £15 million, that you didn't earn, and which has a backup diesel engine that you didn't mention about. Our generation gave you mobile phones, laptops and internet, we created a special media you use every day, we run the banks that pay for it all, so how dare you lecture us you spoilt brat", "thousand_fell": "👏👏👏", "amil.79_": "@swpewd", "patricia175632": "@swpewd", "julian.ulpts2314": "Swpewd", "pilot_p_2": "Go clean up a beach", "janina.bnk": "@swpewd", "kira.marie_.47": "@swpewd", "xantonx.15": "@swpewd", "itsmax.m": "@swpewd", "ju.st._.m.e": "@swpewd", "stark_belastend": "@sw", "laner44": "Lol ya take kids out of school and make them even dumber 😂", "bock.moritz": "@swpewd", "nichtdieamx": "@swpewd", "charly_johanna": "@swpewd", "tx_.jo": "@s", "nino.salomon": "always wondered how vancouver looked before christ", "lyonessbihearttt": "I AM from BULLgaria, and world wont end up in World War because of stupid shitheads like you, All People for All rights", "adrian_jnghns": "@swpewd", "waylon45": "@swpewd", "rxbn.65er": "#AGN", "jasonn_art": "@swpewd", "alex.davis.4": "L", "ktm_liebe": "Juckt kein", "_einfach_nika": "@swpewd", "rbs_fanforever": "@sw", "romina.866": "@swpewd", "mariuskikoe": "@swpewd @swpewd", "dominik.bangsi2005": "@swpewd", "s_i.l_vano": "@swpewd", "0.jack._.daniels.0": "@swpewd", "emtr050": "@swpewd", "vegans.unite.together": "Choose vegan for the animals for the planet for you", "finnsawitzki": "@swpewd", "xxnils_32xx": "@swpewd", "j1l1a9": "@swpewd", "dxnnyx_05": "@swpewd", "txm.2308": "@swpewd", "mr.marshmello_": "@swpewd hey", "_menac3": "You sure this isn't a #Trump2020 rally?🤣😂🤡", "niggowitch": "@swpewd", "julius_220er": "@swpewd", "johanna._klm": "@swpewd", "felix_0032": "@swpewd", "janne_pommes": "@swpewd", "jonte_hsg_12": "@swpewd", "dustin.0923": "@swpewd", "nerjis.k": "@swpewd", "kevgo1234": "@swpewd", "einfach.fxbia_n": "@swpewd", "069.till": "@swpewd", "fabify_mtb": "@swpewd", "lx_58_": "@swpewd", "plantingnewearth": "@plantingnewindia keep it up 🙏", "x.linor_": "@swpewd", "cxlin_29": "@swpewd", "jannis.reinhardt": "@swpewd", "cfifs_spc": "Nice Manifestation … https://soundcloud.com/comrade-90763698/katyusha-parade-instrumental?fbclid=IwAR3qBlLaTabEKn-R8O9J9v39g__JXQO9qyXM5pn2seFhUUeSmzb0RE9wLhQ", "273_anina": "@swpewd", "goldlacher": "@swpewd", "annika.vth": "@swpewd", "simsonsilas1_": "@swpewd", "___a.n.n.iii.___": "@swpewd", "jason.hsv": "@swpewd @swpewd", "s8tan_mo": "@swpewd", "jelzin_brk": "@swpewd", "_gregorykramer_": "@swpewd", "slingin_slag17": "Cunt", "big.dripshit": "@swpewd", "kevin.pxlumbo": "@swpewd", "_hannnes_": "@swpewd", "moritz.xgs": "@swpewd", "vaniluise.kch": "@swpewd", "emilia.krmla": "@swpewd", "robin_siegel1": "@swpewd", "fxbian.385i": "@swpewd", "mtb_leon_14": "@swpewd", "___fl4me___": "legalize cannabis to save the planet", "marv1n_k12": "@swpewd", "nils_81004": "@swpewd", "angelo123456789076": "@swpewd", "maxx_1908": "@swpewd", "hca_emily": "@swpewd", "xtdios": "@swpewd", "cptnjasper": "@swpewd", "nieeemand__": "@swpewd", "zarzer_tobi": "@swpewd", "emely___06": "@swpewd", "sfva2020official": "With all your involvement I would be interested to know what your compulsory education looks like. You can actively participate in the school and take an apprenticeship that will teach you exactly the things you are prog- ing and accusing. You are 16 years old and I mean that the Swedish compulsory education is 9 years primary school and there are still 3 years to follow. How is it that you do not go to school and your parents are in favor of that. Your actions may upset the politicians, but you do not have to make a living someday. I do not understand how your parents allow it, and do not put all those things you do on the schools, for example. Also important are all the things that make teenagers your age and also friendships etc ... Their parents have no education, but also the duty to take care that you are well. With your birth, you took responsibility for yourself and acted just as responsibly. I wish you all the best for your future.", "jxmie_sme": "@swpewd", "nxn0o": "@swpewd", "bailey.porirua": "@swpewd", "laraa.025": "@swpewd", "joke.clgn": "@swpewd", "a.lahib.l": "@swpewd", "markustheduck": "@swpewd", "fa.__.fabi.asso___": "@s", "infineetx21": "@swpewd", "ben_kmmk": "Hold my bier @swpewd", "marlon_schey": "@swpewd", "_lorenz_vlk_": "@swpwed", "_.patr1ck_": "@swpewd", "daniel_1505__": "@swpewd", "_realyszzlas": "@swped", "hugossindcool": "@swpewd", "clemi248": "@swpewd", "p__a__u__l___": "@sw", "_ant1fant1_": "@swpewd", "kevin_280906": "@swpewd", "kevi.n_2005bo": "@swpewd", "sbg_aubs": "@swpewd 🙈", "didi171103": "@swpewd", "x.alex324.x": "@swpewd", "tobias.1208": "@swpewd", "oxkun55": "Ich will nachhause @swpewd", "dean_gansel_4": "@swpewd", "airmaxboost.986": "@swpewd #AgN", "m_gebben": "@swpewd", "bremen_dockers_40": "@swpewd", "gasrider_girl": "@swpewd", "darius_807": "@swpewd", "chxrlie_wbr": "@swpewd", "_.fabsx._": "@swpewd", "aurin_05": "@swpewd @alaska.sw #AGN", "mfn_219": "@swpewd", "kxvxn.kxrnxr": "@swpewd", "anton.xv": "@swpewd", "so.raya.08": "@swpewd", "cola.crft": "@swpewd", "yasin__826": "@swpewd", "meista_bismarck": "@swpewd", "_fbodde_": "@swpewd", "dominik_q_2003": "@swpewd", "its_fabee_": "@swpewd", "l.u.c.a.s_m666": "Dienstag für DIESEL🤟🏻😤", "alex_sabov": "@swpewd", "mrcl.con": "@swpewd", "hannah_kon_": "@swpewd", "_.joonah._": "@swpewd", "salome_2410": "@swpewd 😂😂😂", "danflewin": "If only we could transfer the amount of jellyfish into energy people might be getting a decent education", "myopinnion": "FUCKING KIDS GO TO THESE THING TO SKIP SCHOOL", "notopaperstraws": "Check out my recent post about how the hockey riot after Vancouver had 100k people on the streets and she only had 10k", "haylothere_": "👏👏👏👏👏👏👏👏👏", "goatnoname": "Have they become VEGAN?If not,how to save the Mother Earth???", "jo.jo2708": "@swpewd", "davee.es": "this is all wrong!!!", "robin.vhm": "@swpewd", "dominic_301_schuetz": "@swpewd@swpewd@swpewd", "__lena187__": "@swpewd", "__f4lc0__": "#AGN @swpewd", "ajdinaljic": "@swpewd", "celine.sxph": "@swpewd", "lost_trash.06": "@swp", "lina_lixna": "@swpewd", "cane.r_": "@swpewd", "smithkimbo": "💙❤❤💙", "hm_noonecares": "Langeweile lebt😂👌", "girly_again": "@swpewd", "_max9575_": "@swpewd", "yousefarab.1200": "@swpewd", "patton.marisa": "how dare you", "asp.s_welten": "@swpewd", "adrian_pepsi_jr": "@swpewd", "lennox9007": "@swpewd", "kazu_kanau_55": "🌏観測史上最強スーパーサイクロン「キャー」出現 アラビア海。海水温が高く勢力を増す。🌏紛れも無く地球温暖化がもたらす脅威が差し迫って来ています。", "_christian_1_": "@swpewd and @swpewd @", "ahmed210204": "🤡🤡🤡🤡🤡🤡🤡", "ein.vincent": "@swpewd", "kxvfxhr": "@swpewd", "jajo1004": "@swpewd", "pilii_navone": "@gretathunberg you are a genius!! Hugs from argentina!! #fridaysforfuture @cospaola", "finn.653": "@swpewd", "jxnnis_0806": "@swpewd", "361.philipp": "@🔥", "jurian_el_boxer2": "@swpewd", "weberinho17": "@swpewd", "calles.dany": "@swpewd 😂", "ajdanmutschlechner": "@swpewd", "casey.jms": "@swpewd", "797er": "swpewd", "_ben.rms_": "@swpewd", "dxam1an_1331": "@swpewd", "xxalxx.0": "@swpewd", "elias.1337": "@swpewd", "linakeppen": "@swpewd", "greenpage___": "👍🏻👍🏻👍🏻", "max_goeppert": "@swpewd", "_.luki.k._": "@swpewd", "roman_.47": "@sw", "__lxcax__": "@swpewd", "49noa": "@swpewd", "emilia_nmn": "@swpewd", "_112_firefighter_112_": "@swpewd", "mxryam.xx7": "@swpewd", "n4j6k8": "@swpewd", "michlflips": "@swpewd", "yeosang_.atiny": "@swpewd", "issen__snickers_kc": "@swpewd", "gabriel_69214": "@swpewd", "malte.brl": "@swpewd", "jakob.hts": "@swpewd", "_esserfinn_": "@swpewd", "aland_.06": "@sw", "25leaa": "@swpewd", "daaaaana._": "@swpewd @swpewd @swpewd", "da_vi_de_pa": "@ swpewd", "mxlte_rgqt": "@swpewd", "timm.drs": "@swpewd", "dmrjulian": "@swpewd", "strauss.vivien": "@swpewd", "fruitiis.meme.resort": "@swpewd", "cuhl9631": "@swpewd", "romanius73": "@swpewd", "lil.chumchum": "🤡🤡🤡🤡🤡🤡 Fake", "bbm.flufix": "@swpewd", "derlouizzz": "@swpewd", "maurice.mht": "@swpewd @swpewd @swpewd", "marl9nn": "@swpewd", "akushia_ha07": "@swpewd", "_german_forces_": "@swpewd ⬅", "antonijax.xlc": "@swpewd", "_florian.15_": "@swpewd", "maurin.lang13": "@swpewd", "jxbx05": "10 mal mit @swpewd", "ediz4829": "@swpewd", "_just.niki_": "@swpewd", "_nk05_": "@swpewd", "xx_.stefanie._xx": "@swpewd", "yaankrauss": "@swpewd", "x_alessio_1926": "@se pewd", "offical_lxsx": "@swpewd", "lena.mehn": "@swpewd", "max_030_2005": "@swpewd", "rickvds01": "Kes lan bok", "loui_l1707wave": "@swepewd", "paulinee.tietz": "@swpewd", "sukhi_king01": "@swpewd", "lionkingamer88": "@swpewd", "abduu.53": "@swpewd", "frdrk_meiners": "@swpewd", "pn_104_": "@swpewd", "d3nnis076": "@swpewd", "l_rnx24": "@swpewd", "_carspotting_maniax": "@swpewd @", "cxssi.srt": "#AGN @swpewd", "pauline_14.07": "@swpewd", "yusufi_05": "@swpewd", "_noel361_": "@swpewd", "brz_lari": "@swpewd", "cedric.808": "@swpewd", "felix170.2": "@swpewd", "pvll.79": "#AGN @swpewd", "franz.lyd": "@swpewd", "_crazy_389_": "@swpewd", "torben_lol04": "@swpewd", "cordel01": "@swpewd", "philipp_luca_826": "@swpewd", "_best_of_cats__": "@swpewd", "_tomas_k_": "@swpewd", "jeremy.syma": "@swpewd", "fuad.gnes": "@swpewd", "qrasshofer": "@swpewd", "giiuuxx": "Zia ma inquinano più le tipe rifatte che in tutto il mondo porcodd fa qualcosa dio caro", "dj_marv_the_midge": "@swpewd", "sebi.__51": "@swpewd", "pyro__ke_vin": "@swpewd", "_lukas01alex_": "@swpewd", "nick.rchr": "@swpewd", "tina.dbi": "@swpewd", "tim.16s": "@swpewd", "bikeschrat": "@swpewd", "niklas_2551": "@swpewd", "fabiennew._05": "@swpewd", "pascal.wrb": "@swpewd", "sauceygarren": "Greta is sped", "eli_b_ali436": "@swpewd", "ben_051231": "@swpewd", "henri.glx": "@ferdinandwagner_ Gretathunberg Fan 🖖🏿", "luca.erfm1": "@swpewd", "lunas_dre": "@swpewd", "anas.yec": "@swpewd", "fabio.fsh": "@swpewd", "peterspanakos": "Also,.. please support🌊 🌊@Dolphin_Project 🌊🌊🌠🌠🌠🌊before Dolphins and Whales are driven to Extinction...", "jakov.bc": "@swpewd", "houbenceline": "@swpewd", "jon.ahmt": "@swpewd", "steffi.a.i": "@swpewd", "seib_manuel": "👎", "dusan3096": "@swpewd", "julian.srj": "@swpewd", "leipzig.moments": "@swpewd", "itss.domii": "@swpewd", "_olivia_abc_": "@saskiaknxss da kickt der Autismus aber ganz mies wa", "sidbutt42": "@swpewd", "jan.hrder": "@swpewd", "lxon_ac": "@swpewd", "noel_bdt": "@swpewd", "_de.rosee_": "@swpewd", "lmr._.7": "@swpewd", "malik.brd": "@swpewd", "felix23b": "@swpewd", "instaflx_": "@swpewd", "txpischalessio": "@swpewd", "louchamp5": "@sw", "umed.zi": "@swpewd", "leni.hsm": "@swpewd", "_luki_spukiii": "@swpewd", "fabio.ro04": "@swpewd", "ric_283": "@alaska.sw", "dennis.mgl": "@swpewd", "jasom_2006": "@swpewd@swpewd", "daniel_181124": "@swpewd @swpewd", "justxn.59": "@swpewd", "hagen___ste04": "@swpewd", "consi_05": "@swpewd", "l.eon2_9": "@swpewd", "phillip.brg14": "@swpewd", "amelie_lohr": "@swpewd", "tjorben_insta1402": "@swpewd", "finn_shr_": "@swpewd", "julius.wsl": "@swpewd", "obsessed.with.satan": "@swpewd", "formelo.jpg": "Stupid", "x.leahr": "@swpewd", "celio_beast": "@swpewd", "em_.1431": "@swpewd", "baby_yoda_offizial": "@swped", "dani57x": "@swpewd", "luisagonecrazy": "@swpewd @swpewd", "felixkongu": "@swpewd", "linuskahl": "@swpewd", "x_anouk.s_x": "@swpewd", "nickschoneich": "@swpewd", "_ma7x_0": "@swpewd", "maroanjurkat": "@swpewd", "da_zeitii": "@swpewd", "khxled_327": "@swpewd", "zoetler_junge": "@swpewd", "txm.ma4": "@swpewd", "jere187ers": "@swpewd", "mlwjason": "@swpewd", "alaska.sw": "@swpewd", "niklas.bmbr": "@swpewd"}