{"ivalutval": "Track?🎵", "denis.777ru": "SugarDaddy", "ignacio_527": "Time has changed every age for example: earth went from Cretaceous period (very hot) to the ice age (without humans) and from the ice age it’s changing and coming back (just like every time).", "rebecca.rupilli": "❤️❤️❤️❤️❤️", "ous.exe": "Where do you think you got that camera or the phone you are holding is it from a tree no of course its not its from the factories you want people to shutdown i can't blame you if you are recording with a peace of a leaf or the carbon air but i can blame you if you are using those cameras and phones cuz you are helping the factories grow bigger by buying their tech how dare you", "jarrydledingham": "@kayleighpinn wow", "vishal_fitness_india": "💗💗💗💗💗🥺🥺🥺🥺Ueeeee I love teers", "kealyholland": "HOW DARE YOU", "mel_callwrt": "🌳", "renat7159": "👎👎👎👎👎👎👎👎👎🖕🖕🖕🖕🖕🖕🖕🖕🖕", "julianamercado779": "🙌", "janak5581": "Great💕", "wladecypereira": "Hello greta you Love my N ame is. Wladecy Infrom Brasil!...Amazonas telefone 92 ) 991692946 ? Whatzap 92)994065279)", "yassino.hachour": "🙏🏽🙏🏽", "lisanniii_mnh": "@sanny40_lara", "jana_z27": "Very inspirational. Incredible! 💐", "emma_klukas_": "@tentree", "isabelgoodedeblanc": "So very true! It is happening now!!", "george.pl1": "Fuck off car industries would go down and so would car culture 🤡", "aresselfdefense": "You are a fucking retard.", "neonsparks5": "Well those children ain't getting a job lol", "craig_carter5519": "What a croc of shit", "canadian_conservatives__": "The climates fine", "fitjuella": "Thank you for spreading awareness. The woke ones understand. The ones who are asleep are looking for every excuse. People won’t do anything until it’s too late.", "jana.balsells.bru": "🌍🌍", "aguirre.rp2": "This is cool and all, but how you're just asking for money.", "schlutupfelix20": "I fuck you", "sirsnail1": "Man we out here supporting #teamtrees", "iranfernando2580": "\"The climátic coming worse and worse but how I dont know what I'm telling now let my friend say it\"", "mrhotdog772": "Your wrong u kid 12 year old.", "cristal.ny": "@raulmguimaraes01", "steam1961": "I must admit, I envy her that trip across the Atlantic.", "daisy_b.s": "Yes I get it ur protesting but an education is something hundreds of children do not receive. We should understand the benefits we have of living where we do.", "nishi_makino": "Great", "rbkkschndr": "Lohr this video! ❤@gretathunberg", "badassbishh101": "a fire drill??", "jgnegrob": "Anabelle.", "guilhermidealcantara": "Oddio @nesimo98 hai messo anche tu il like. Sono così contento. Anche se ovviamente si può sempre fare di più", "sercan.adam": "@kira_waeldele @la_tina2208", "elcucuydefense": "The money that went into making this could've been used to plant more trees", "lilivanfreitag": "Du bist die Hoffnung die uns endlich lehrt zum Umdenken..... Danke für deine Kampfgeist und die ordentlichen Tritte die du uns verabreichst, anscheinend und wie man bemerkt hilft nur dass uns zum Umdenken....♥️👏🏻👏🏻👏🏻👏🏻👏🏻", "raqriv": "@hector_zabdiel @canorodriv", "puravidasmile": "Powerful message!", "sofia2cute3": "😍😍", "staninindia": "Excellent awareness propaganda on preserving nature and protecting it 👌", "caden_casey": "I can smell the ass burgers thru the phone. Fuck u", "lil.mati": "Without education people would be stuck in one place, these who give up their education at the same time are commiting suicide; no education = no Future. How could the World come so far without the technology we have today.", "hot.bich69": "This greta bitch dumb on fucking jah this hoe probably never heard of a secondary succession", "antonio_monty_04": "Ľ ha capito una ragazzina di 15 anni. Quando volete svegliarvi voi altri?", "nihongo_71": "Greta, you inspire children like me to be defenders of the nature, and in my case, you inspire me to be like you, a so famous ecological influencer. Thank you so much and congratulations.", "soundslikekama": "@amuga.be, wacht je even met je project!!! ;)", "yingo187": "Wie wäre es mit E-fuel, daran denkt natürlich niemand", "rocky_mountain_racing_review": "NO WE ARENT STUPID. HAHAHAHA", "nanna_stark": "Uugghh i’m so dumb Greta me and my friend tough that you were weird and all but I understand now, I need to care 4 the nature and stop buying and using things I don’t need, recycle ♻️, bike more instead of “driving”, walk, I didn’t believe in you great but now I do I have to help the environment and everybody else to, the futures is ours we need to fix it before it’s to late, I believe in all of us, I believe in you great ps. I’m sorry for being mean even if you didn’t know but I was dumb and didn’t think, now I know all of the people that don’t like Greta thunberg are dumb idiotic people, love you Greta 💕💕♻️", "knisterniete": "Natürlich müssen wir was an unserem Klima ändern und das eigentlich jetzt aber e Autos und erneuerbare Energie sind auch nicht super z.b. wenn nur noch e Auto", "olsonbrooklynn": "Thank you !💚", "mrsjoannagust": "@mrmanfred @annehon", "__g0lden1": "@lauren.stolarski", "7.4_hauptschule": "Halts Maul klima gredel", "jamiekfrancis": "@alliejohnston4", "lottewalda": "🤍", "maxwindham": "I don’t care let the next generation care about it I don’t care it is not our problem", "xkvtie_": "@maleficent_megs", "ciro.btn": "Greta Tunfisch", "steven_taras": "Lol she’s copying@mrbeast", "magarte_astudillo": "🙏😍🙏😍🙏😍🙏🙏💐💋", "naiim_ij": "🇪🇸", "meemsie27": "@laurenchang302 some good words in the 4th video! 😂 🙈", "sara.vividnstylish": "Bravo Greta👍❤🌹❤💖✌https://www.vividnstylish.com", "tobi.84.9": "👏😮", "cariawatt": "@Greta thunberg thank you for making this video and growing awareness. People need to wake up. #courage and much love to you 💖💕🙏🏻🙏🏻🙏🏻", "vploetzkauer": "🤦‍♂️", "fledemir": "🇧🇷", "loudmouf.dj": "Let me copy mr beast real quick", "salsabilaauliareza": "@jokowi please don't destroyed our forest at kalimantan my president, it is the last hope, before the climate change, i hope you will only build a green city not a only smart city😢🙏🏻", "leonie.sgx": "@aylin.sbth", "windexenthusiast": "1) Skipping school doesnt mean shit when after a year of protesting this fad dies out, and you have to redo high school. This hurts everyone more than helps.  2) Trees release almost as much carbon dioxide as it does take in, in a process called “cellular respiration”  3) We can’t just throw away the fossil fuels, we depend on them for basic transportation like flight, driving, trains, etc. America’s suburbs, and other places are built in a way where everything is within driving distance (ex. 3-4 miles away) Plus, an eco friendly car like a tesla, a good alternative, will run you up $60K. Nobody except the super rich has throwaway money like that. It’s gonna take about 100 years until we can get eco-friendly energy to be normalized, and as cheap as fossil fuels, able to be cheaply used for mass production of cars, trains, planes, buses, etc. 4. You say the leaders only care about the money when the money is the root of all of our problems, but also these solutions. It is simply too expensive to be using electric energy/solar energy, etc, And if it’s too expensive, then the dreaded cheap fossil fuels will be continued to be used.  Otherwise I liked the video, great message, but you just need to realize these things, and listen to the opposition, take what they say into consideration, try to work out a better solution, because right now, you’re not very realistic at all.", "_cortezao": "@vitoriadicroce", "declanmast": "You need to find me another way to drive without buying expensive electric cars", "scottminge": "Except...due to photosynthesis , plants , trees etc... Release the stored co2. Basic science.", "m_schimmelbusch": "Okay okay okay, I respect the drip, but look the argument that Renewable resources only get 2% of the cycled money is true, but that’s not a problem with us. 1 Barrel of Oil is thousands of times more energy dense than a wind turbine being blown all day. The fact is Oil is more cash lucrative. Find a way to 1) Pay the Oil company’s off (Probably trillions of $) so they stop needing to drill. And 2 Find a renewable resource just as or if not more energy dense than Oil cause rn, I honestly don’t want to go out and chop wood to keep food on the table. It’s just impossible and nobody has the money for that. #changemymind", "lost_snowboy": "HALT MAL DEINE SCHEIß FRESSE", "ricotto.anita": "Ciao Greta sei fantastica è farò anch'io la mia parte", "maldaa51": "ly gretii", "fletcher.mckay": "Your a bit late mr beast did this", "c_cennerazzo": "@lynz711", "blip.__________blop_blip_blop": "200 species going extinct everyday? Sureeeee, whatever you say", "soeren.44.wave": "How dare you?😥", "giorgiabazzaro": "This is so scary. People don’t care ...they can do that little and yet so much. The way they live right now it’s just simple, changing costs effort. They don’t have time. Not even to stop polluting environment in their everyday life.", "jacob.gontjes": "Im sorry but how does protesting actually help? Would it not be exceedingly more beneficial for kids today to go to school, and study solutions to put into action instead of whining about it? Protesting was great when people debated climate change. But now pretty much everyone agrees that climate change exists. So it’s time to start actually doing stuff. Plant some fucking trees, work on clean energy, go to school.", "ogr_momo": "Greta Turnup!", "samanthahenshaw_": "@tenneale.blackledge", "isabelafernandes1": "Perfeitos", "jefersonluizamaro": "O que você está fazendo pra ajudar as queimadas a Austrália???", "ashley_tarck": "@jkimber08", "vladimir.bngr": "Go to school", "ooostefanieooo": "How can I repost this in my Instagram?!?!?!", "nallendem": "What about the cattle that is raised in Grass.. this is part of the planet solution", "tom.ktr____": "@july_grll das du das likest", "_.durchgeknallter._": "Hexe geh in die Schule @jstn.wbr", "kcabemoc": "HoaX", "valvanera.mt": "@lucasso.me we should join the movement", "angel.berlinnn": "\"You have stolen my dream and my childhood\" don't you know how people live in syria? You don't have the right to say this if you don't know what is happening in Irak or syria!🤢🤦🏻‍♀️ sorry for my english", "zachary_exists": "Yes! Stop getting education for the climate! That's totally good for our economy", "akun15i": "Stfu little shit", "pico.s_icecream": "Yes our queen Greta 💖", "who_me_be_": "Hold up is Greta joining #teamtrees. Cuz just so you know your late to the party they are over 20mil now", "deadenddadofficial": "@blackoniansaroundtheworld @adie_gm @manhertzd @katyjaneb77", "klemens.agostini": "holt deine frässe", "mariakonstantinidouu": "@andrea_k03", "_massimofamularo_": "@dylan__thompson_ what would @realdonaldtrump feel about this?", "eva_rose_007": "I don't understand if we have a solution wy don't they wan't to do anything about it?!?!?😟", "scrap_kittyz": "Ill do it!!!❤️", "markilo63_wdw": "Must be nice burning all that fuel and that boat hu?!!!!!!!!’nnn", "marclemarquis": "DU OPFERKIND", "patrick_sabathi": "😂your such an idiot", "knicklichtprinzessin.21": "Very good and interresting Video!!🌍", "baigorriajulioaldo": "❤️❤️❤️❤️❤️❤️", "lenyardvn": "Hello , you are so super 😍. The Natur is super the tree have so doll seine Äste lieb wie the Himmel the Sterne und you. Are the. Natur Lg Lenya I Love the Natur gefühlt bin ich da auch aufgewachsen. Aber you are habe so eine gute Leistung geschafft mach weiter so❤️😍 gemeinsam gegen the Klimawandel", "derancourtjudith": "@TreeSistersSeedingChange", "javier.garcialopez.9406": "👏👏👏👏👏👏👏👏🙌🙌🙌🙌🙌🙌🙌🙌🙌", "kealyporter": "@berniesanders @ocasio2018 conservation and ecological restoration desperately need to be a part of the Green New Deal. Conservation professionals are so up for the task", "indu_33731": "Thanks......for the information", "huub.vd_h": "Toppie", "anacueto7": "El calentamiento global lleva miles de años sucediendo no ahora 😒", "_lachy_davis_": "Get rid of Cole mines the global economy dies", "holdi_mtb_": "😂😂😂😂😂😂😂😂", "lemoon_acura_chic": "PLANTED 14 trees last year", "djrawlings1": "Show us solutions stop complaining", "panam.exe": "I dont understand greta... people in Africa can not go to school.. and shes just going into the town, and chilling her life while eating something surrounded by plastic!", "hoyce32000": "You do know that electric cars are worse than gas powered cars to the environment right???", "tillschrill": "👍😎🎞️", "roxanapadillat": "@vicmof", "benjjaminmarcus": "@kc_nels", "georgysalartsortyan": "Fuckin girls", "_____j.a.c.k_____": "Nd his name is mr beast", "baby.erfan": "👏", "coldsh3lls": "Mr beast lel", "felel_": "eres una zorra", "b.o.o.t.private": "#MakeEarthGretaAgain ✊🏻", "montialicee": "Fantastic❤️😍❤️❤️😍😍😍😍", "writerbyn_gold": "Why does this feel like the beginning of a zombie apocalypse. I'm scared. I'm planting a tree now", "kleberfdassilva": "🙌🙌", "_razvan_razvan_": "How does a girl who only read scripts about planting trees is the person of the year and the guy who actuali planted 20 000000 trees is not even mentioned", "ori_gina_l_gina_": "Restore the planet", "lucie_jasmine_": "@mrbeast planting millions of trees", "marialecalderonm": "Se dice que vienes del futuro. Que tan cierto es?", "madisonwalton.fueledfitness": "Yes !! Thank you Greta!! Restore the planet!", "nikiii_reiter": "Bruh Fu*****", "_k.m.b_10": "Nah imma keep rolling coal until the day I die", "ry.an_hop2020_69": "I really don't care eventually the sun will die and swallow the entirely galaxy so yeah we gonna die", "its_chappyy": "Mr beast can save the world!", "camillamathewsxx": "Have you seen this amazing girl @megan.a.walsh", "ddest1ny": "Yadda yadda , sitting like that gon hurt your back", "jerke_vermeir": "HAHA", "ariki12": "With no catalytic converter", "kyliann_nry": "😉 2🙌CD dssz v", "milosh_basketball": "shut up u cunt bag", "lucaa__niedr_": "Shut up", "guilhermeduran": "Bullshit!! 👎🏼", "leaaa._.aaael": "@michelle_ebby ohaa wia sie ihra nama usspricht", "_instaelvis": "U are geting stronger and i love it!!❤️", "jaiden_mc210": "How about u stop talking about it and actually do something", "vanillatrash420": "Wow a 16 year old person is trying to educate me please let s all die in peace", "edurne_polesport": "👏👏💪💪", "fc.syth": "Climate change is fake", "ana.cruz2211": "@luisagcr", "kspjonas": "hey greta dumburg why dont u go EFF off", "sepvfc": "lmao we’re all gonna die anyways", "robingnth": "Das einzige video was ich von ihr mag muss ich zugeben 🔝", "janneke.beckers": "@berryvbeek", "kalevorthmann": "Say what you want, but my truck is needed for my line of work. Electric cars do not have enough power to pull bales through muddy fields.", "bigboysanti10": "I hope we all die", "austin_irish": "Why the huge boat?", "daves_xj_sucks": "Such Bullshit. Piss off, Greta", "instal3o": "U actually used A camera to record this video?? A Camera with a battery?! Probably a Lithium battery? People are dying in Lithium Mines!!!! HOW DARE YOU! U used a PC to edit the video? When you buy a PC it is in a Box and it is mostly wrapped in PLASTIC... HOW DARY... with ur empty words... u Sailed across the ocean on a piece of PLASTIC... PLASTIIIIII!!!! And you uploadet this video on INSTAGRAM? Do u knwo how much electricity is needed to cool the Instagram servers??? DOW U KNWO THAT?", "storni0305": "If you are so well knowledge why do you even call it “fossil oils” there is no such a thing.", "leandrolsm": "So basically, we need to switch fossil fuel based electricity generation to nuclear based electricity generation.", "kruppa.brdy": "I like benzin an gas because i am Biker and my motor cycle needs fucking fuel and i love to smel it nigga", "_juliavirginia": "@dvsrt", "snowwhiteim": "You stop using fossils first and show it", "connar.j.t": "Wait what's a tree???", "dolan.flint": "Plant trees so she can make her book.", "animals.r.mypassion": "#teamtrees🌲", "trajanagnew": "Pure propaganda", "lucarnota": "🌳🌲🌴🌴🌴🌵🌱🍀🍃🍃🌳🌲🌴", "bella_gilardi": "The answers are so simple nature gives them to us yet as humans we are unconscious and the ego is our worst enemy.", "ucuqigocu": "I think that the problem of deforestation is very actual. Forests are cutting off not only in tropical regions. In Far Eastern Region of Russia, where I live work a lot of illegal forest industry. Nobody knows who owns it and local goverment do nothing. I found this by myself, just using Google Maps. Forests in Sihote-Alin range, that I was watching are speckled by tree felling sites, like Amazonian rainforests. The situation becomes worse every year. I am afraid that instead virgin taiga there will be bold hills in 10-20 years.", "madamesesil": "👏👏👏👏👏👏❤️❤️❤️", "keule20200": "I still say yes to atomic power and say no to coal power", "ebarroso_": "@marcos0b", "alexis405": "❤️❤️❤️❤️👏🏽", "makingubetter": "Bullshit made by European for not 3rd world development", "twsummerj": "Heja greta", "beezneez1400": "Cap", "amyt.r": "Y’all will get angry as hell claiming that climate change is a hoax, but what would be the worst case scenario if it was? The worst case scenario if climate change was fake, would be us breathing clearer air, less species going extinct, arctic animals having a home, and greener long term solutions.", "bronxfit24": "@jlo @ricky_martin compártanlo por favor 🙏", "llleeewwwiiissss": "So Greta won person of the year, for letting her friend George explain", "caitlyncurrie92": "👏🏽🌏💕", "gabriel.eva_": "#fridayforhubraum", "michi.trs": "folow me on insagram @michi.trs", "breaking_bbq": "Nice 450 dollar jack made out of petroleum products.. hypocrite..", "carlos_baroeste": "🤦🏽‍♂️At least mention Teamtrees.org", "david_klimt27": "Ha ha ha its a stupid", "rylans26": "@thebroomcasual @iamcouchsurf @bigreds___boardshop @mtboundatl @sk8boundatl @lupi288", "michaela_metty_10969": "Do u up load this video to youtube? I want to save n share this video to my Facebook. Thank u, @gretathunberg", "zacbarksdale1": "You’re living in fear my friend", "terryl8": "Funny how the entire message built up to one word... “FUND” that is the key to what she wants.", "feb.nazuar": "@plantenboi", "keiko_field": "I have watched with my 7 year old girl. I am thankful for your efforts. It’s great to see this change.", "brendas_pics": "💁‍♀️ Enjoy your Christmas-time with your family... Safe journey home. ❤️", "isisbastetisisbastet": "💩💩💩💩💩💩💩💩💩💩💩💩", "d.hich.kath": "پیرخرفتارو واس قانع کرد کلی انرژی پاک داریم چراکثافتکاری میکنین خو آشغالای بی خاصیت دارین کره زمین رو به گند میکشی کاش میتونستم از رهبر نوجوونمون حمایت کنم،اون قطعا در مسیری هست که همه دوسش دارند،i love you greta i love you greta i love you greta", "giovana_a.r": "Yess 💚", "emixrhxan": "Greta Tunfisch how dare you 😂", "annina_ciarli": "Honey, go to school and don’t be a politicians ‘ instrument . Ok? Only a stupid person will follow you. You ARE NOT A SCIENTIST and now you are not a student. Let’s see someone that makes all you said real. This someone isn’t you🎈", "apex21404": "Mommy and a", "__jadeja__star__": "we can make a great world", "iiiqlimaeto": "@mrbeast we meed yr help", "thebadmariachi": "Maybe don’t give up on your education. Just a thought.", "anemoneyoga": "I love you ♥️", "rafael.dantas.rd5": "Love you ❤️ o Brasil pede socorro greta", "ducrocqolell": "🙏🙏🙏🙏🙏🙏🙏👏👏👏👍😎", "nox4u_k1ant": "I don’t get this she wants people to live without cars ships airplanes and most of techniques is that right?", "riabbei": "Keiner mag disch", "ajwhanson": "@hansola67", "_blairrutherford_": "Greta Thunberg has only yelled at politicians, protested, and has told everyone they need to do all these many things to “save our planet” but, has she planted a tree, or actually done something about our climate? It’s actually a question, I want to know.", "llewnocekalb": "I hate to be the bearer of bad news, bit most modern societies will completely break down without power. It's not as cut and dry as it would seem. Also, than just carbon dioxide is changing the climate, so what do we do about the other compounds?", "delia_iacono": "@ignazio_iacono ci ha proposto la soluzione! E che novità!¡!¡!!!", "yung._drew": "Fuck off", "lee.fredrikson": "How about all the trees that are cut down to print your ugly little face on the cover of Time Magazine. I bet they could have helped fight CO2.", "pilottrox_official": "I think you have some mental problems.", "hwangeban": "@theblindfly", "futon.tk": "#naturenow 💙💙", "real_adam.and": "Now I need to buy me a big mac and drive with my Muscle car on the highway with 200 mph", "fabita5": "@jesus.alber30 sobre el cambio climatico que te interesa", "celestescapol": "😮😮", "ashyamaria": "So write a sign that says nature and go outside holding it ? idk what to do but I wanna help", "nitaaazzzz": "@cn_ristya", "kelley.reardon": "Incredible, love the focus on solutions and these tangible actions, thank you Greta and George", "martin_p1871": "Cringe", "jxcob.dtx": "Go back to school and let the world crumble in peace.", "ryand1234_": "Hypocrite", "kamyzilla": "GO TO SCHOOL", "therealmexicandude": "Mr. Beast be planting those trees, calm down, you guys ain’t gonna do nothing", "jasvrx": "G o b a c k t o s c h o o l a n d r e m e m b e r t o k y s", "lol.jude": "Aren’t we already planting 30 million?", "rach.land": "@st.pete.f_", "joemoneybagz": "FTP", "ashtreker": "❤️ agree.", "charlie_sketches14": "Your such an inspiration ❤️ I picked up scuba diving to help ❤️ I also want to make a change", "wildcat1287": "@ikeauk @ikeausa", "danikyaro": "They’re parents are making them protest just go back to school", "severinevuillermoz": "There are more plants than just trees that can sequester large amounts of carbon dioxide into our soil systems. I believe that if we were to change the type of crops we cultivate, and the ways that we manage our farm systems, we could/can/will greatly reduce the amount of C02 in our atmosphere.", "czupachup": "💚💚💚", "_ayesha_younis_": "💚💚💚⛰🏝🌋🏵☀️🌥🔥🌗🌸🌏🌲☘️🐿🕊🐫🐅🐡🐖🦍🦓🕷🐴🐺🐜🦎🐒💚💚💚", "luca926383": "😢", "katybeetson": "Go to school", "tomy.chaza": "I am going to go buy some ExxonMobil stock now. Good luck everyone!", "nkengaspeaks_life": "@jeniferlewisforreal", "cd_crecraft": "Oh no we gonna die! Sike u thought, acting like climate change hasn’t happened before us humans were here. Where did all of the ice, soil, and animals go? They ain’t j say aight imma head out", "potato_man_841": "Yes I want the world to burn plz", "max_mil1er": "👎🏿", "sckloop": "Ugly ass whore", "emma.vorpagel": "climate change ain’t real", "ashwin.vh": "How to download this video", "guavanic": "i clicked thinking the thumbnail was broccoli", "iranian_government": "All we need to do is kill of half of China and we’ll be ok frfr", "raduciochina": "DIESEL POWER, NO SMOKE NO FUN", "dwynn.official": "This is dumb", "ro.oliveira7": "Tio se so tem 16 anos tu nao sabe de nada", "kaekae.01": "When you realize Thanos was onto something...🤔🤔", "alessandrapeterlini": "@aliipeterlini", "saraomar6682": "Why don't you wear leaf instead of plastic clothes? Try your remind years of your life in the jangle .without car oil dear girl.", "markjjavornik": "Those towers you showed when you said we need to stop burning fossils fuels are nuclear cooling towers. They are releasing steam. Water. H2O. I wouldn’t expect most people here to know the difference though", "xiiiixxivi": "Lest save our Mother Nature!", "cintthyaaaa": "🌲", "sahir666": "@snehasaha16", "skateclimber": "I watched a guy explain that if we plant trees in all of the unused space in the world it will stop global warming...why isn't everyone doing it and talking about this. Welp guess humans will all die in 100 years instead.", "ritafreixopereira": "@joaninhadias 🌱", "vionarhofika": "@mk.fariz what have we done? 😭 Does Indonesia help abt this?", "marciabambiss": "✊🌍", "nadsx0": "@manur594", "nanethereluz": "👏👏👏", "_.charliextaylor._": "Shut upppp", "bilousapollinariya": "@annaverbytskayaya ❤", "mua.hanna.h": "The ignorance in the comments is hilarious.", "kissmodelsus": "@metamer_music", "cowboy5871": "👎👎👎👎👎", "dnl_5": "@cherry1ce @inkale.exkale @theevinnyp", "desiree.riveraa": "@amyy_assad", "simons.slime": "Mr beast is already doing this just stop trying to take props for his thing", "noel.bs_": "Den Klimawandel hab es schon immer", "patrickkernanz": "Shut the fuck up", "wxng.js": "you had me until you told me to vote for someone “because muh nature”", "riichh999": "Stawp", "cassaa.r": "@alessiolatour", "misch_pish": "@dana.zatocilova", "tomarundel_": "Pretty sure client change doesn’t exist but anyway", "sagedidntthink": "This bitch look 12", "taynara_avlis": "Vcs vao querer exterminar metade da taça humana?", "joeyjosue_": "This is dumb trees don't magically appear 😂 and if you want to stop the use of fossil fuels get an education and figure out a way to produce mass energy like a nuclear power plant that is better because right now that is the easiest way to get a lot of energy is from fossil fuels", "m_irri": "🌻🌻🌻", "smilie101t": "You need to look into the meat industry and it’s impact on our earth", "adventuresoundsfun12345": "This makes me wont to go drive my gas powered truck 😂", "debstravels": "Look at your facial expressions ~ unnatural 😳", "olfashionassassin": "As if we humans could destroy the earth 😂", "snehagupta493": "@tanushka.2.8", "sunseaunme": "Beautiful and powerful! Thank you for sharing and the eye opening experience. 🙏🏻💗", "prisgranda": "Ecuador’s government tried to end fossil fuel subsidies and indigenous people protested against it. Something I would never understand. 🤯🤯", "talithaferrer": "🤣🤣🤣🤣", "23gaudetk": "We watched this is school", "kcdavidss": "@jaket_kaufman", "ankita_agg_2016": "@sunshineconsultingllp nature now", "rosiani_twardowski": "@leticiatwardowski", "maric1312_": "Ma pusi ti kurac glupaco mala", "nute.gunrayfan53": "who else would smash", "jannip1410": "How dare you?", "nottodayduda": "i love you", "aaron_sullivan15": "Yes stick to the script", "dwightsrights_": "@life_is_rough19 Greta thunburg is a idiot", "laudimar_camargo": "Linda, amo vê-la.💖", "sarahchaibi": "@ademgaied @heres20buckskillmee", "davixd.flame": "🖕🏼", "ag05777": "😢👏💪", "ariannagallobarberini": "❣️@lucabarbeini❣️", "milan.sechsacht": "@just_lemi", "real_smh": "@cfbastiat where is she getting these statistics from? 200 species a day are going extinct?", "manat_18_": "For every girl dming me i will plant a tree. Dm to fight climate change.🌲🌲. @chetanxsharma @namit.mahendru18", "adriengorl_": "🤡", "josie.linsartist": "👎👎👎🖑", "olivurrr": "Who wrote the script? Certainly not you.", "m0ritz.hxxse": "@hanna.bct wie kann man jmd mit Autismus hinterherrennen", "twinsforfashino9192": "No", "nele.paint": "You know sb once said: \"as long as there is a problem with no solution, there will be smaller ones with solutions. Find it. And fix it\"", "_gerva_": "Tabbuna moc weld keba", "juanialmagroalmagro": "Greta en ANDALUCÍA está la recogida de la ACEITUNA vente a recoger ACEITUNA que eso no CONTAMINA", "goddess.lisa": "@themontrose", "_hectorcardo": "How dare you?!!!?", "amanda.suarezalvarado": "Greta i support you for you work at climate👏👏👏", "diegogg03": "Vete a estudiar", "tim.257": "@schnoerres1409 😂😂😂😂🤦‍♂️🤦‍♂️🤦‍♂️", "inestrillasgarciabenjamin": "👏👏👏😍😍", "josesotorivera": "I'm in Thailand and the pollution level is incredible. And so many people are not conscious about climate change, a lot of beaches are plenty of plastic, rubbish, plastic bags,... I think that countries like this one should do something or get some benefits to help the people to buy electric cars, explain the people how recycle,....", "adamj1905": "You should be in school I hope your parents are being fined for taking you out of school, or do they make too much money off you and your brand? HOW DARE YOU!!", "lauri_brn": "Ich gehe da nur hin damit ich keine Schule habe", "tocosaled_tocosaled": "Imagine if Greta went to school to LEARN", "thecoolertheryn": "who the fuck cares", "plaxsyt": "And that is why our generation is so stupid you fucking cunt", "danijel_kro_at": "Bitte geh im sandkasten spielem . Da gehörst du hin", "bass_si3g3": "It's a climate breakdown, tududuuh duh, tududududuuuh, tududuuh duh, tuduhduh duhduh duhduh", "guillian_939": "@maren.sndr_ Warum likest du die 😂die hat kein like verdient", "_j_mes_03": "Thicc @madladjordan", "maddiehailes": "We are living in a crappy world we are all trying to take a side based off the internet half are saying climate change is fake and half are saying it’s real I don’t agree with either pollution is definitely a problem but if u think about it it isn’t very hard to fix so we all go on about how we hate plastic blah blah blah but we just need to stop making it. Simple. This girls annoys me but also has a point I’m not a scientist but remember when they thought the world would go under water and it didn’t happen we thought the world was going to end didn’t happen so all this is very confusing for example Australia which is where I live has no pollution in our ocean and where I live isn’t effected by it so it’s hard for me to understand if this is all fake or not especially when I’m 11 but protesters are annoying politics are annoying greats is annoying no one like hearing about what happening to earth because it’s confusing and no one wants to put effort in to stop it, I went on a rant about multiple things throughout this so u don’t have to read it 😂🙃my opinion", "natesheridan06": "She can find it off the twat", "parker_william_moen": "Should be worrying about comets lol 😆", "lauutje__": "@maxvdboog", "vinnywindhorn": "The population growth and capitalism combined won’t allow for logical steps alone to be the solution. There are simply too many humans, with the population set to grow by 3 billion over the next 30 years. Yes i WISH planting trees were the answer but we have to be honest about the actual issues.", "kenan_akm": "Shut the fuck up and go back to school you hypocrite little cunt 🖕🏼", "baseballinspires": "🅣🅗🅔 200 🅢🅟🅔🅒🅘🅔🅢 🅔🅧🅣🅘🅝🅒🅣 🅔🅥🅔🅡🅨🅓🅐🅨 🅡🅛🅛🅨 🅗🅘🅣 🅜🅔 🅗🅐🅡🅓.", "marvin_knke": "When you really want to safe the nature, then we all have to die we cant help the ecosystems they help them alone. If help the forest, trees and so on, then we do something we dont want to do. The Earth is better without humans. She only can be what she was before when we all die", "manelvalmanya": "🌍🙏🏻🙏🏻🙏🏻", "marcellolobue": "@gabry.pulvi", "jacwithlove": "💚🌳🌲🌳🌲🌳🌲💚", "michelle_vsp": "australia has the worst bushfires out.. it’s spreading all over New South Wales for all o know and people are getting evacuated... I might get evacuated too but idk,it’s getting worse and worse and I know people who are close to the fires and how their schools are getting evacuated. when I was walking home from school with my mum ash went in both our eyes and literally it was painful for me,and it’s summer for us so it’s literally the worst thing ever...I wish I could change something but I know I can’t.", "kfrawlz": "@anita_frawley", "kubekherbaty": "I just want to say THANK YOU.", "mats7631": "🤗👍❤️", "elza.m.cunha": "👏👏💕🙏😘", "_space.whale": "Orrrr just let the human race die out. Cuz lets be honest here. The galaxy doesn't need mankind to tear it down more then it has", "dar.ciaax_": "Wow😯💓", "renee.hickeyyy": "climate change is fake, please explain how the ice age melted away when there was literally no one alive then??🤭🤧", "simmyvibes": "Why is it more important to visit school instead of “trying” to safe the world? School is something humans have invented but it’s not something “real” like nature. Without nature nothing will be left not even school. But more important - WE - humans won’t be there anymore. So tell me why is school more important ? Why is everybody so triggered about her, and other students not visiting school? I don’t get it. Everybody has their own priorities.. obviously young people realize that nature is the most important thing ever.. you visit school for your future, so you can apply for a job but how can you apply for a job if the nature is going to collapse.. there won’t be anything left to work for.. so what’s the point? It all comes back to nature.. #naturefirst", "andy87fcr": "👏👏👏💚🌲🌳🌱", "zahid1800": "Allah !!! very big because you can not change anything we come in the world unfortunately and then died but is like he died the earth must also ￼￼ The sky must also come down and people know but also a big problem I understand your side and Again, nothing can change and everyone knows that 😁!!!!", "julievaliquette": "@surfkar", "hiplikeemilyy": "@britnaaay_midd", "1burzan": "Kan du dra åt helvete?", "shitposting_memes_videos_": "Odio israel", "_tom.luca_": "Ahahahahhaha😂😂😂😂😂😂", "michael_ess_": "Rudimentary understanding you say the least. The reason we only spend “2% of our money on natural solutions like planting trees” (2 percent of who’s money by the way? Worldwide? Cuz I’m sure western capitalist countries contribute far more than say China or Russia) is because the liberals would rather tax people on gas, resources, and anything they can instead of offering sustainable solutions that don’t cost nearly as much", "catxx70": "Ridiculous propaganda all to promote socialism! Why aren't you in school young lady???", "idxtbh": "Einfach maul halten", "amy_xkelly": "@xxrubyburnsxx I can’t take her seriously 😭", "sienna.degens": "Yesss💋💋💋 I support you in every single wayyy! Please people help our world togheter!", "maxiboy081": "👍👍👍👍👍", "sxrrx_cxndy13": "❤️😉🙌", "sverre.tumkiewiczz": "TIMETRAVELER !", "xandrianoir": "I wish you can come educate Pakistani people especially in Karachi. Here people are cutting down one specific tree species that was planted two decades ago. Why cutting them? Because of a hoax that was spread that they suck all the ground water and bring mosquitoes. People are really stupid here. You need to come here and educate them. In general people cut trees here so their houses are more visible 😢 Help.", "bryan3569": "😂🤣", "dennismorales_": "@danieem93", "guerrero51262": "ALARMA POR SUBNORMAL", "sergio6638": "🤮🤮🤮🤮", "andreapaternoo_": "Si pessa", "barbarhoom": "What if i live in the middle east it is so freakin hot how am i supposed to protect restore and fund????", "angeloboyparm": "altra considerazione: tantissimi prodotti che servono per ricavare energia o che servono non per la nostra sopravvivenza ma che servono per poter comunicare più velocemente sono ricavate da pietre, basta pensare ai cellulari, computer eccetera. il materiale all'interno è ricavato da miniere di ferro, cobalto, oro, argento eccetera..come si può cambiare tutto ciò? come si può dire alla gente : guardate che fino a ora vi abbiamo dato dei prodotti dove all'interno ci sono elementi che per averli abbiamo dovuto inquinare??? il mio pensiero è: non sarà per nulla facile poter cambiare questo sistema. ammiro molto greta, ma i giovani prima di tutto debvono capire come funziona il sistema attuale per poter cercare di cambiarlo. moltissime case automobilistiche usano come carburante il diesel, benzina. in italia le auto elettriche sono pochissime. le colonnine per poter caricare queste auto elettriche sono poche sul terrritorio. non conviene ancora. lo stato non fa praticamente niente. le case automobilistiche ancora non fanno prezzi accessibili per tutti per poter comprare queste auto elettriche. capite che c'è ancora moltissimo da fare e questa settimana ci sarà un incontro in spagna per parlare ancora di ambiente. si è firamto il protocollo di parigi qualche anno fa ma la CO2 continua ad aumentare, capite???", "follnerm": "Geh Freitags lieber zur schule als so ne scheiße rum zu erzählen der Klimawandel komm und geht aller par 1000 jahre I LOVE DIESEL FOREVER Sieg Hei...🇩🇪🇩🇪🔥🔥", "jn_julian98": "Erstmal meinen Diesel anlassen 💪", "clemsimpson": "@hannahypagoaga", "littlesophxoxo": "Go back to school. what a JOKE", "_.m0ritz_": "#dienstagfordiesel", "thaishenriquezt\nVerified": "Verified", "angeredrat": "luv u greta", "silviaprcferreira": "💞💫😊 Thank you!", "_.davidkelly._": "i’m ignoring you 🤡", "spicydeluxeramen_": "T R E E", "kukic_ma": "Kysssssssssssssssssssssssssssss", "maja.dlk": "Hauptsache Alessio gehts gut.", "liloo_crochet": "I have been saying forever (it seems) the one thing we ALL NEED to do is plant a tree 🌳 so many of my neighbors are chopping down their gardens in favour of concrete or tarmac as they probably don’t like gardening (mine is like a jungle ☺️ ) but we NEED more trees 🌳 keep up the good work huni, you’re not even my child, but I am so so proud of you 💖💖💖💖💖", "livvy_pictures": "I just wanted to say that global warming is a natural cycle that repeats every 26000 years. So, you shouldn't be freaking out. Please, Greta, be careful, because you are merely a step from global warming fanatism. People can't survive without fossil fuels in long run, it would kill the population, people would be starving. I am an asperger too, please do not hate me because of these facts.", "dia_thompson_1010": "Ok so when I was in school, aged about 10, we were told that deforestation was happening at the rate of the size of so many football pitches a day (I forget the exact amount, but at the time I remember we were all kind of shocked by it) I’m now 50 years old (save me the beaten to death and not even remotely funny ‘ok boomer’ response, I am a boomer, and I’d take that over being an offended snowflake any day) so you’d think, if this information is true, that in 40 years the deforestation rate would have stripped the entire earth five times over by now... And I’ve travelled the world extensively, everywhere I’ve visited still looks green to me", "jonasgrashof": "Mir ist unbegreiflich, wie ein \"Mensch\" einfach so heraus alles schlecht schwetze kann.", "studiolouisepage": "❤️🌳", "lanearitter": "She has gained my respect", "blackwinner_photography": "How can I do in my country ??", "birdieflyfly19": "If you think about it, giving up your education isn't a big deal, the education systems think you need to know stuff like trigonometry or geometry or know how to make slime. Ok how will that help me know how taxes work so I don't end up in prison for tax fraud. Education is the last thing you need to worry about, what your doing now actually has a point", "dacri_topshelf_420": "Your name is what now?", "kenzithewind": "And I’m the lucky ones", "demenzeko": "those who not understand true pain can never understand true peace !!", "jhony._.boi": "Don’t get why y’all getting so fussy about all this shit if earths gonna be fine its a fucking planet it shook off the dinosaurs pretty easily so whats the big deal?", "john_weston22": "How old are you ?", "h_mosier2": "Imagine not going to school just to protest something that the government is trying to work on but you can’t seem to understand that", "dropibus": "greta my girl", "josh.radfordd": "fuck off greta thunberg", "babba_wagen_88": "Fuck you", "agandrupd": "@bloknar @gretathunberg the question is... HOW DARE YOU?!?!!", "adam_memes_slate": "You the dumbest person I’ve ever heard", "pxx_77": "🤮", "alistarhead": "stupid", "the_dima_v": "No one gives a shit", "williecwilson": "Gay", "sunceuv": "LOL", "fecfc1": "💙", "taranchula_scary": "❤️", "lofi_high5": "💞💞💞", "rimidubana": "Amazing video!!! 🙏🏼 You’re so inspiring!", "nebrohtv": "Und? 😂", "josh_dalfonso": "How about you go tell China and Indian to do there part first and stop bothering the U.S", "christian.lusis": "#teamtrees", "_fmzphotography_": "❤️❤️❤️🙌❤️❤️👏", "itsxdouaa": "Amazing 👏😢❤️❤️❤️❤️", "timmiboy200": "🖕🏻🖕🏻", "mjcmvillen": "Gran vídeo. ¡Bienvenida a Madrid (España) para la #COP25, Greta!. ¡Gracias por tu gran y efectiva labor de concienciación!", "xd_lego_darth_maul": "Ooo sorry hard", "strandbergglenn": "Lets kööl", "akyl_1505": "Молодец 👍", "eyupylmz61_": "Hdf hurensohn", "karakchai1": "Wear some clothes", "ali.kharsiev": "Nobody gives one just shut up you sid looking fatass", "kalejohnbomber": "I hope the earth dies", "lippelippe986": "Halt deine schnauze loli", "jylarniekennedy": "Bro the world has been around for billions of years 🤣 I’m sure it won’t be destroyed any time soon, you choose to protest and to give up your education, don’t make it sound like we are the problem Greta 🤣", "mrkrameryyc": "Let's focus on a real possibility of making a change! We need to #BanAtlanticTankerTraffic immediately to start a path to sustainability. North Atlantic oil exports must stop. Saudi oil exports must stop! Countries must use what they produce or ship by pipeline. Tankers are wasteful and destroy marine ecosystems. The Northern Right Whale is critically endangered. Belugas are dying because of tankers. Join the movement now!", "ggi__i": "@3lbin_809", "_ciannavei_": "Ok boomer", "kirillos.l": "@viktor_jarl Varför gillar du inlägget? är det bara för att hon ser ut att vara 06:a? Lek inte som att du bryr dig om klimatet din diseldrivna nacas", "ayo.riii": "💯💯💯", "lene.hdt": "@harman.kr03 😂", "_lixsouu_": "@dishaagokani 😂😂😂😂 je vois tu revises par ici😂", "mustis_twix": "I will help <3", "isabellebannert": "„People exhale co2“ Greta Thunberg: „how dare you?“", "piiggymarks": "Ok boomer", "richiiiiii_2007_": "😂", "jacobparkerr_": "Yes love the stuff u believe is real but allot of us don’t but keep doing it even though it won’t really do much at all", "philipp_kindler": "You‘re right 👍", "christian_coleman_tha_man": "Ok boomer", "justine_haze": "🤣🤣🤣", "coopsicle1122": "Tbh I’ve given up on humanity but oh well might as well try to get us out of this 500,000,000,000,000 foot deep hole that we’ve dug ourselves into", "nurkooocak": "@iitsjustme", "tatjbehringer": "😮", "basilemichael_": "Ever heard of IGTV", "villu_____": "WE HAVE TO BECOME VEGAN TO SOLVE CLIMATE CHANGE PERIOD", "luisa.4200": "@laraa_15.12 omg idol😍😍😍", "krlln2005": ".", "somernelson": "#lies", "jay.prada": "“Vote for people that defend climate change”, now you’re gonna tell me who vote it", "ellenbl12": "I can’t really quit my education cause when I’m older I need a good job??", "ipek_instagraw": "❤️", "itz_casie_": "I would love to help out with climate change in my spare time . But as student I don’t think missing school for more than couples days is the solution . Especially ur in yr10 or 11 rn GCSEs are important.even missing one lesson can set me back a lot .", "theforestcorner": "Get back to school little shit", "kobydelancey187": "Experts who believe in climate change have already said its too late. Embrace the suck.", "medsage_": "Gay", "mitchel_davis20": "You are one dumb ass child. Keep this in school for one of your projects. Leave the big problems to the adults. You uneducated scum.", "otiliarubio": "Jeg tror, at denne pige har brug for psykologisk støtte. Det manipuleres af voksne med personlige interesser, der hæver miljøflagget, men bag dem er andre interesser.", "senorchloe": "Bruh every 6 year old not understanding they won’t live on a nice clean earth or even a alive one. Thank you for trying to make people understand!", "overnewsed": "go to school little girl", "ben_xnnp": "It is not fair for the children right now, because one day they will struggle through this stage, We should do something about global warming now and for good", "andree_434": "How dare you😂😂😂", "really_tho._": "You know how expensive it would be to just stop using fossil fuels?", "joeflannery1": "🤡", "olivia.baumannlionet": "Omg are world is dying", "rollanxo": "😍😍Nice film👍👍", "nathaliemuller2911": "@fabienne.402 das war irgendwie...😅", "heybtchwhat": "\"Sucks machine\" lmao 🙌🙌", "lynn_rct": "I hope @gretathunberg is breaking down soon", "conner__richardson": "Boomer", "samwood543": "I thought it was David Attenborough 😂", "troy_battisti24": "😂😂😂\"I gave up me school education\" good luck after climate strikeing goes nowhere", "maysonite": "Liberal... using more than necessary. Conservative... using less or what's needed no more no less.", "__talentfrei": "We living in a society", "jaecny4": "Greta, you’re gonna change the world !", "alexander_dargel64": "Lol", "_l.u.x.y_": "🤬", "noahlinnebach": "Hi", "kira_trash_03": "guys the planet will never change spitting shit and swearing rich people to do something we should just change our bad behaviour start cleaning our cities and beaches and after all of that we can swear rich people to do something too", "tbridevaux": "our planet has been warming since the last ice age- NATURALLY. how is it that earth was entirely frozen at one point, and yet the burning of fossils fuels- that wasn’t even practiced until less than 3 centuries ago- is whats warming the earth? our planet goes through a cycle of natural cooling and natural warming. i can’t take your ignorance.", "cshaynes98": "Sounds like me when I’d tell my mom i was too sick to go to school glad it’s at least workin for y’all, that’s what we need another generation mentally inferior to all the ones before them keep up the “good work”👍🏻", "izann071": "Niggacat", "joeyvigliaturo": "I regret to inform you that you have been diagnosed with retard. It’s quite serious and we should have people monitor you 24/7 until your inevitable death. You will live with life support off others and will need to be put into a hospital as soon as 24 weeks. Once again you are retarded...", "mercharp": "Thanks for sharing! Let’s plant more trees.", "grace19992": "Maybe we lack faith in God.... he will provide.🙏", "hibikiliu": "🤡Honkers", "hayleyfox12": "@kayley_mayy", "keyyaboyy_": "Ok really nigga?", "joshuamichaeltm": "💚", "calvinwisaacson": "They’ve been saying this for 50 years lolololololol.", "rideitsick": "🤮", "zahiranajmah": "@fitriamaliap fitrii??? Udh kenal dia? Keren dia fit, lebih muda daripada kita, tapi udh ikut konferensi PBB menyuarakan hak buat masa depan kita", "itsmorgzxx": "Greta is absolutely amazing. Some of the people on this telling her to shut up, that everything she is doing should be illegal etc. Seem as though they don’t care. As if the destruction and plants and animals and amazing ecosystems that have been here since any of us existed does not matter. Well it does and it needs to be protected. It doesn’t make you cool to say these things it doesn’t matter who Greta is it matters what she does. She’s trying to save the planet, the world. If she’s so irrelevant according to some people on here then how come she’s the only one really trying. She amazing and I follow her all the way❤️ go Greta save the planet ❤️❤️", "joey.canale": "It’s fake tho", "beachboyfootball": "tell your bs elsewhere. Please and thank you", "_.chiaraurora._": "Nero", "tamziin.xo": "honelsty don’t like u", "elinkolmgren": "@emmabojadzija", "lalisaracl": "Aferim kızım bak şuan Dünya kurtuldu.", "track_hawk": "I feel awful that my Jeep Trackhawk gets 8mpg. Hopefully I can use track mode more often and get those numbers down", "eftalorhan": "Ulan greta yaşamak için düzeltebiliriz falan demişsin. Biz yaşamıyoruz ki be gardasim", "drews99": "Are you gonna cry again", "dima_bobrivnyk": "Ебать она тупая", "andresleonbjj": "I believe in you ideas😍🔥🔥🔥", "chrisdiaz6724": "Retard", "en_tff_kar": "U goddamn right fuck u thunberg hope u die in hell love u ❤️ love turnin up the dieselpump on the car love burnin rubber love to live life the right way. So yeah it is my money so i am still going to burn fossil fuel till i die. Next time get facts on the table before så saying shit like that electric cars are 10x worse than gas and diesel powered cars so maybe think about that next time", "maria.vinn": "😍😍👏🏼👏🏼👏🏼👏🏼", "floris_kruijf": "Shut the f upp you r just a fk kid", "that_guy_22": "We um also need to fix that plastic in the oceans that is the main problem", "strokinator": "Lol", "deololade_": "@maryy_olan @reigncollection_ng", "mmaxcarr": "how dare you", "lion.bkn": "How stupid can you be ????? How dare you", "22gl0": "I just spent 4 minutes watching a super good movie", "coacheilla": "@babayap77 @janebabayap", "jacquikr3w": "@hannah0d let’s go plant some trees!!!", "sunnyrashid81": "Good👏", "official_espen": "@mrbeast @teamtrees have plans on planting 20million trees. enough?", "arton.a_j": "Nucleair fuel is not a fossil fuel the smoke emitted is vaporized water. It is way safer than other ways of gathering energy from other sources🤔", "karell.keswick": "Hey Greta @mrbeast planted 20 or 200 million trees isn’t that amazing!!❤️", "debo._1006": "Bruder mus los", "shrekloverforlife": "So proud of you!!", "dancers.in.europe": "Very smart", "opistoswedes": "❤️🌲❤️", "milos.z23": "Go to school no hate", "auroratonks": "Ive watched it on youtube before", "paulababi": "the most plausible option which each one of us can do right NOW is right before our eyes. we must not wait for politicians to make the next step. we can start now quitting eating animals and animal products. animal agriculture is the leading cause of greenhouse emissions. try #challenge22 and #GoVegan - just do it 🙏🏽 so let’s plant trees 🌳 and eat plants 🌱", "mojiseinvaddi": "I love Diesel and you cant do this eco shit its illegal what you doing there", "lan_monarch_": "I share your ideas Greta, I hope the world understands your message and I would also like to meet you someday...", "georges425": "Lol i have my own problems and our protests in my country we don't have time have for such bullshit thats the way the people is leaving and it will always be like that and and the time of technically so suck it", "sygmuhehe": "LOVEE!!!!", "dazenhurd": "Все равно мы все умрем", "sarahmargarethill": "@michaelnguyen_31", "aj.demay": "How about you actually go and get an eduction so you can help create solutions instead of just protesting and bitching about them.", "snellyalater1234": "@stilllearningtosee @lizabethsnell", "tdvproductionsyt": "Go @teamtrees", "kite5725": "Isn't she a time traveler?", "2202.lukas": "🤯🤬", "_andreagemma": "cci tua quanto sei brutta", "jon.aasen": "Jævla autist, du fikse d me å pella deg tebage på skolen og lera litt om klima.", "dominik_kistler": "Let’s roal some fucking coal in this bitch", "laila.rxc": "Geh mal lernen🤨", "musicyuliya": "👏🏼👏🏼👏🏼❤️👏🏼👏🏼👏🏼", "giles_dxb": "Or you could just donate to @teamtrees", "mizuki._.s": "Wow…so much hate…Don't you guys see what she is trying to do for us?! Instead of hating no her,why don't you do something nice?And those who want to state 'scientific facts' just try to understand her.I love what she is doing💚💚💚keep it up", "da_ya_ella": "@carolina_9827", "gretaisameme": "great work 🙌", "jeeone_prod": "💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚", "vharpss": "@drewhunter00", "duweistgarnichts": "Wie kann man so einen Bullshit labern. Wir Müssen aufhören Fossilien zu verbrennen? Bin mal gespannt sobald die 18 wird wie schnell die ihren Auto Führerschein macht die kachi", "the_autistic_chikkin": "Or donate to team trees", "tethered.v2": "Stop telling us information we already know plz", "paigejames1": "@shayegrayy", "icyfunair": "🤦‍♀️", "la_ruta_cc": "Hey what about you go back to school and come up with some practical solutions instead of spewing retoric nonsense?", "t.q.queen": "@vani.lissa", "claw_u": "Thank you @gretathunberg for helping people understand helping each other and helping nature gives all of us more of everything and restricts opportunity away from people who don’t need it (e.g. fossil fuel billionaires, etc.)", "nik_teshi": "Cool )) 👍", "pryzonrean": "Youre English is so tired", "_.a.d.i.t.h.y.a._24": "I wish I could join u but make sure u visit India", "lavitickus_2004": "U showed a nuclear power plant🤡🤡ya that stuff coming out the top is vapor I think u shouldn’t give up learning seems like u need it", "mvstieditor": "HOW DARE YOU", "thomaslanigan19": "Did you know that we have enough trees in the world to take in the world’s production of carbon dioxide", "_gretagus": "@theunknownuseer mirs papi", "juliiaaan_wpl": "Fischlie", "lola_lysm": "@axn_krn @lns_horse_ @wollmayse @maxi1947", "timeforlvng": "🤔", "jecca_kitty": "Me emociona ver que cada día eres más fuerte. Con esa seriedad de niña. Y que hace que con sus palabras son cosas serias. Sigue así. ⚘😊", "lauraartcreative": "Good it doesn’t poluates when you bounce around the world with a yacht...that burns how much fuel? But you should know better no? Or your friends that orchestrate all this...Hypocrites...", "tehanibyhailijoaillerie": "George Monbiot 🙏🏻 My brother’s quoted in his book Heat 💚", "alicia.kilegard": "Hur kan man va så fin som du❤️❤️", "hugo__official__": "Grated thunderbird", "_hades_57": "Stop saying shut up, these are not important etc. Climate changing is a natural being for the nature. It is definitly going to be in the future like it happened in the past that caused many huge extinctions. But on that point that is important for us: How we can survive. Climate changing is real. If you want to survive; protect, restore, fund as Greta Thunberg said. Please do that for all of us and next generations, for your children.", "samet_erbil7": "Senin tipini skm pu", "movedtozvdocfx": "HoW DArE U?!!?", "gavboyy_1738": "Ya know, it is an extreme disgrace to have you represent my generation. You don’t represent mine.", "theforceiswithusorder66": "I love how kids are using this as an excuse to skip school, when they could use their weekends to protest.😂", "xchiarax.c": "Shut up 🖕🏼", "mar1a.dxp": "Als ob die 16 istttt haha @giada.sxc", "ccafs_carla_leituras": "Acorda vc aí! Tá dor👏mindo? 🔥🔥👏👏👏👏👏👏", "henri__.__": "Dis is al rong", "jpiggott1": "This is the dumbest thing I’ve ever seen. Fortnite is where it’s at. @connorslz21", "keohpatra": "use this as a dislike button", "enyedykaren": "Thanks so much for sending this video. Coincidentally, there's an email in your box from me that has some good Earth news inside. I sent it just before this one arrived from you. Grandma", "jaynelouize": "Why dont you mention animal agriculture???? 🤯🤯🤯🤯🤯🤯", "cohen_perdaems": "#gretta2020", "leodivinci1": "I love it how the educated people and the famous people with the blue check mark are encouraging Greta and the nobodies are doing the \"ok boomer\" and calling her a \"leftist puppet\" because she wants to live past 40 😂", "davidgichner": "@teamtrees", "shirleezz": "@pb_youthgroup", "kimon__17": "Hf", "beans_and_cars1": "@teamtrees go donate so they can plant more trees", "cceellnn": "@gretathunberg i love you ♥", "ammu2.003": "Obviously ,love the focus on creating solution.", "mustis_schoenheit": "How dare you 😡😡", "gaudi.grabowska": "Boah es klappt nie", "giupikox3": "Ma vattene a fanculo va", "danielliguerson": "Estamos colaborando com o mundo amor @leofavrin 😍🙏🏽🌳🌿", "grenz_luke1": "@lusor_enrico my Name is gsodffkiffbk tsjdkdvdodbkfbk", "kaj.bruin": "This comment section makes me think of something Filthy Frank said: ‘I hate people that argue online. Your opinion doesn’t matter. No one gives a fuck’", "julteddy7": "@0_5_luisa", "evanb_49": "TRUMP 2020💯💯💯💯 here come the liberals", "artr.msa": "i shouldnt be on your instagram", "vincentjohner": "He’s not even a scientist! He’s just a journalist following a mainstream platform like the rest of them", "khalejm": "How dare You!!", "hiding_away_couple": "It is going to be the pollution after water covering cities that is the main problem", "alwayssexyneverugly": "@livi.76", "plrchile.cl": "FUCKER", "thahxppy": "hOw DaRe YoU", "tiffsyums": "🙌💖🌎🌍🌏✨🌲🌳🌴🌱🌿🌸🌻🌊🌈🙏💞💕💗💚💙💛🧡❤️☮️☮️☮️☮️☮️☮️☮️💟", "carly.16x": "@__yazzie.04__ oi post a new pic", "geil_haft": "HOW DARE YOU", "_nahraf": "At the end, \"vote for people who protect the nature\" then i thought, it doesn't happen in my country. Our president just thinking about investors,money and profit. Cuz of that, some people calling my country as Republic of Investors not indonesia. Hehehe", "jeweettoch627": "Pay me", "sophia_lindemann": "Thanks for being such a great advocate for nature @gretathunberg 🙌 If people are motivated to help mother earth and want to get into action planting trees, come help us at @reforest.accion as a volunteer. 🌍💚🌳", "m3m3_l1gma_2": "Ok boomer", "asian_sushi_general": "What do you think me beast is doing", "keira_rose._1987": "We don't fucking care", "nathan_771": "Does this mean I should stop rolling coal on activists? I think not", "sai_shrinithi": "Nobody fucking cares hoe", "emerson.park_": "You are a disgrace. Making children miss school to come to this stupid climate change protest that is not even useful. Climate change has been going on for several years now and NOTHING HAS HAPPENED.", "kontratebe_pride": "You stole my Dreams 💩 Pro Patria Europa Nostra Greta 🐖", "kalle_vahalahti": "Honkkeli", "peoplenergizepower": "There is an additional amazing tool in the making - It is called #PEP. It will stimulate that CO2 soars to a much higher price to shrink the share of #fossilfuels by economy and to accelerate the needed expansion of #renewables. #PEPenergy", "ffioncampbelldavies": "@mutsolace3", "friendly_neighborhood_swede": "Din generation är den minst nyfikna och mest isolerade uppsättningen av individer som man någonsin har stött på. Ditt hybris sträcker sig så långt att du tror att du inte har något att lära dig av dina äldre.", "silvas60": "#teamtrees🌲", "johnyyyy33": "Greta go First and work a bit before talking shit .", "yo_itsnotjc": "ye OK guys go follow @coralgardeners", "youseefx_95": "Oh me jesus", "only.planet.earth": "❤️❤️❤️", "felicia.araos": "💙", "violet_2110": "@maya.friederikee @vincentsenglie ich hab das Video wieder gefunden", "tbone_playerj": "I’m all for protecting forests, but I won’t be voting people into office who will force their climate hysteria upon us.", "nora_aasheim": "This is pure gold😍", "c.ross94": "Wow ur dumb like kys u dumb cunt smoke oil like ur gonna get smoked in the head", "talendamberger": "Leave fossil fuels in the ground hey? I’m sure that would work. How would you like to travel from now on? Walk?? That boat, plane and all the cars you drive are from the fossil fuels that have made this world what it is today. If you guys actually paid attention there are plenty of trees in this world and they release fresh oxygen from taking in the co2 they don’t trap it 😂😂. Maybe we should take all these fucking ways you travel around the world to flap your mouth about this bullshit away", "itsskaylaa_": "Nice", "de.mr.koko": "Is that a supra", "ryan_bergen14": "I think u should stay in school you could use the education", "bxst_memes69": "Thanks mr beast :)", "williamnichols_": "lets burn all the fossil fuels so there are none left ❌ 🧢", "elizabeth.eichner": "👏🏻👏🏻", "_gthiggs_": "❤️", "marcelarubiagomes": "@peixotoaguimar to improve your English, master student!", "tashrodriiguez": "💛🙏🏼", "jojo_heyho_memes": "❤️", "ellenwinckelmans": "@walter.grandjean @nenamommaert @michielwinckelman", "cem_cimsit1": "Siktir lan", "keeegancountryman": "Ok boomer", "_http.michelle__": "How dare you", "julia.arrudaaa": "@realdonaldtrump", "01.a1eyna": "@cerenxglr safe the turtles", "lizzy_1419": "Our world is supposed to come to an end some day anyway!", "leightongravely": "you haters need to shut up. no matter how you feel about her, this video is powerful and it truly means something in regards to the survival of our planet", "brittakilian": "🙌", "weston.corbett": "Monbiot and I***", "artheoxd.exe": "@teamtrees", "lewis_roberton_": "🤡", "iconickiwi_yt": "Can we not forget that this girl is crying about climate change but yet forgets everything happening in Gaza , Me : bruh look at dis dude Putin, Assad and other leaders : stfu capitalist pig", "htaylor9": "Stay in school class of 23", "sheilaeriksson": "D24", "littleguy667": "THERE WILL BE 20 MILLION TREES PLANTED BY 2020 BY MR BEAST AND I BET YOU HAVENT DONATED GRETA.", "btackel": "What BS", "tyson_322_": "So ur dumb as a rock and you want to protest about something u clearly don't actually care about. If u really did give a shit you would take to CHINA about it", "hannaahbee_": "you chose to give up your education to protest.", "spotter_berlin": "Fuck off", "bluppy_the_baby": "I shouldn't be up hEar", "jerrytheclowm": "🤮", "alessioperrelli": "Mr beast is a smart man", "ecoasters.eco": "We need to save our world before it’s too late 💚💚", "vir_fernandez": "💚💚💚💚", "elisevanhellemont": "👍🏻👍🏻", "dmytorgy": "Слушай , ну ты это ,держись . Мы , гносеологические интернационалисты из россии с вами. Движение шуе вас поддерживаем. Но не стоит забывать, сколько древних шизофреников погибло в борьбе за экологию .", "kaif.energy.bebida": "Nobody believes you, you little foxy Swedish scammer!!! You have put thousands of students out of education and away from learning!! How dare you!!", "_zoechiereghin_": "Secondo me la pagano @lil_s0lm0", "filip_zek09": "I hope you die on your trip 🖕stupid", "lachlan_coleman_": "Can some kid please not just state the problems but give us a feaible and plausible method to make the idea of global warming non existent kids will stop striking when they find out the world will not end. Please actually look at the facts and not just self promotion.", "30_drake2": "No we are not clown", "kody_810": "Diesel and merican V8s that’s all we need", "meg.ripps": "@georgiarwarren", "everett_ony": "Ya stop Burning fossil fuels how are you supposed to travel and Drive into a car gets cell phones", "aisyaahdiana": "🖤💗🖤 Proud of you @gretathunberg #naturenow", "patricktyth": "Did I ask", "gray_fogarty7": "Okay boomer", "torque__rider": "Ganz kurz ? Sind Elektroautos umweltfreundlich? Genau nein Und warum ? Erstens um 1% lizium aus der Erde zu bekommen (Inhalt der Batterie eines Elektroautos) braucht man 1 Tonne Wasser ... und zweitens der Strom kommt ja auch aus der Steckdose nh", "denise.ldg": "@la237erz", "annaniaaa": "This was played in my art class.", "jakub.matura777": "Greta don't like ☢️. ☢️=🔥🛌. I🤔", "devynf21": "I love making big black clouds with my diesel", "da_blev": "Stfu bitch I'm trynna listen to the boom Beach original soundtrack", "aidan_brewington": "Imagine leaving school because it got 2° hotter", "os_kahn": "So how much of the energy demand can these non-fossil fuel and non-nuclear based solutions meet?", "opinionatedcyborg": "You know what trees need to survive? CO2. 😘", "tayloradams_": "@_.kyleee15 let’s set them up", "trevor301olson": "Your a joke🤡🤡🤡🤡", "xixacles": "idk if this will work, but did you know, when your charger is connected you waste energy and contaminate? disconnect it if you're not using it, it can help. (idk if it works but anyways)", "melinamellemusic": "Yes girl keep it up!!!", "daniel.ogier": "How dare you!!", "cata_mateosfc": "@cisiegas._ PUAJAJAJAJAHAHAH😂😂😂😂😂memeooo", "norielaborie": "@rooslysannede @officieel_job @dedmergildemacherr @steffenn_ @jeetjeeee @renske_hallema @silke_zeilen", "da_covid19_boi": "My mans really said 👁👃👁👀👀👀", "th_bier": "Why striking when you could’ve ‘motivate’ the same amount of ppl to plant trees per se?", "pedrms": "@julibtorres", "king_munt": "Fuck you", "chelseadezeeuwxx": "@heppierem", "dawn_villegas18": "Donate to team trees", "drawthebest": "This needs to spread. I'm with you Greta , we all are...", "super_dad_10": "@gretathunberg global warming isn’t real, go to China and protest @tnorrissg @tmguire #fakenews", "thomas_mossialos": "There is no solution it’s all bull crap , first of all if you stop fossil fuels you won’t get any electricity, and second this planet isn’t fucking Venus our clouds don’t turn black and cover the sky with thick fog trapping co2 . It’s all in your head Cliamte change is fake and I’d argue over it all day", "univers92": "🍃🙌🏽", "lukaskule": "@themidnightstoryteller @sheltonguitarguy", "kieranklausy": "fuuuuccckkkk youuuu, i’ll give u some coal for christmas", "l.nederlandsdefensie": "i'm glad Russia doesn't do stupid things like this", "cookveganwithbrooke": "Go vegan", "ayan_03838": "@_nickita.flk_ @imlev_4u @moritz6013 😂😂", "formisto_": "@lemuelwxx ei nää sun ilmastopäästöt ainakaa auta", "zele4real": "Lmfao this girl got so much attention for saying the basic facts about climate changes. If u want to be significant, actually do something, be a scientist, find a way to fix this. Your little protests wont change shit.", "evan._.fowler": "1rst support mr beast and 2nd OK BOoMer", "cinnamonn_girll": "@oxchanelxo11 ❤️", "playgirlzbarbie": "if anyone is against this, they’re a boomer", "sjobecks": "@davidvedder86 🌱", "buj_dv": "The destiny is allready written no 11 yesr old could save us from such extinction we need a real leader", "serenarodz": "@jaymi.s___ @hannahadam_ @arielthelittlehuman this is a good message!", "r.griffin": "“Up to 200 species going extinct every single day” ???? That’s means every living thing on earth will be gone in 43,500 days. you are FAKE NEWS", "devine__fury": "#teemtrees", "dan.militaru._.11": "Ok boomer", "landonscharfenkamp": "Your a retard💀 the world will be just fine what’s there to worry about we won’t be alive", "peanutmuffins": "IF YOU REALLY WANT TO SOLVE THE ISSUE, START FIRST BY ELIMINATING THE CAUSE- OVERPOPULATION. GET RID OF PEOPLE.", "maren.bxl": "😑🙄", "carlo_bagnaschi4": "Technically speaking we, our generation, cannot fix this so stop making much ado when not really anyone who isn’t in a corporate chair can do anything about it. It’ll take the work over numerous generations to begin to reverse what’s been already done. Relax child before you give yourself a stroke.", "sanne_lisa": "@buevoe", "hopkins_rylee": "I own three Dodge Cummins", "xyasmin.16x": "@carly.15x xxx", "cinder______": "And the only important thing is VEGAN LIFESTYLE", "kareemah_31": "No offence but shouldn't we be focusing more on human rights and rape and other things happening in the world instead of this. Climate Change has been happening for years. There is nothing you can do about it. No matter how hard you try nothing is going to help it and that's the truth.", "colin.s03": "We need to build a Wall around greta", "brian.e45er": "You have autism", "larsson__gustav": "Såja Greta", "glue_shii": "People aren’t aware of of what she’s asking, if you want it so climate friendly are you ready to give up your phone, tv, hospitals, cars, food, medisins, AirPlayns!!!!!! And Are you ready to give up theas things?????????🤣😂🤣😂😤", "reelsoulmovies": "👏👏👏", "sjd_teo": "Free iran", "iiemilix": "She’s has brain cells unlike some people", "grouchynebula2": "Trees produce about 2-4% of the oxygen on Earth, the main producer is our oceans. Planting trees is like putting a glass of water onto a forest fire. It will do nothing. In fact, you would produce more oxygen by putting that glass of water back into the ocean.", "hazyo30": "greta make sure my parents get their tax money back. Snake ass hoe", "tbon3_steak": "Perhaps if you hadn't given up your education .... Nevermind, I'm not going to say it"}