{"yanchizhov_": "Иди учись , митингует она", "_casparmainwaring": "And how are you getting around europe", "big_time_chitown": "Please go back to school. You are not too bright little one. 🤢", "darthjacensolo1": "Pathetic brat!", "duckillz": "Trump 2020", "parakhvyas_": "Using big loud speakers is noise pollution 😆", "emanuele.s.sclafani": "Yessss", "lasse_wrt": "Warum kannst du komische Sachen mit deinen Füßen? Ich mag das nicht", "artnbits1171": "And more carbon emissions here too ..", "esaias_privata": "Det va ett nytt sätt att skolka", "william.fairweather": "When ?", "tala_va_javahrat_yaghot": "آلبرده لیش", "bethlo1234": "This young lady is making History. I'm 66 and for the first time in my life I believe we can save this planet. She is bringing much-needed awareness. I look forward and see a glimpse of hope through this ambitious bright-eyed girl.😊💕🙏", "rufus.elr": "😂😂😂", "nico_p.e": "Sind deine Schuhe ökologisch abbaubar?", "lotte_wsr_10": "HOW DARE YOUUUU she wrote it with a plastic marker", "lavi_bhm": "🤮🤮", "klara_mz1": "Die Scheinwerfer die für die Bühne gebraucht wird, sind auch ganz schlecht für die Umwelt 🤣", "charlinder": "😘", "noeeliaxxz": "💚💚💚💚", "santmtrujillo_10": "H", "dirtlukas": "Hure", "gabriel_star19": "Amazing we can save the world save the planet, is time to do something better and better.👍👍👍", "karlawilliams_": "Go to school", "daniel.for.friends": "Spiritus oda nitro", "ringofishy": "How dare are you", "khalil_mit_der_galil": "Ağzina kapat kizim", "x.xdeadinside.x.x": "@elisa.o6 @xalina.249", "markhoijtink14": "Alguien te a preguntao", "vladkobzar24022007": "Gretta:You stole my childhood! Kids in Iraq: Seriously?!", "lukas.ab3l": "Viel zu viel energie durch lciht verachwendet 😒", "segers.victor": "Seut", "baigorriajulioaldo": "Thanks so much for your interest for the World. Newment Thanks.", "szybekalexandra": "#räddaklimatet", "angel_elcrack831": "HoW dArE yOu", "_alex.200": "@gretathunberg you are amazing. At school i did a project talking about you and how everyone should try as hard as you to make the world a better place because it is our planet and we should take care of it. You are a big positive role model and you are inspiring people like me to save our planet 🌎. Please notice me and keep doing what you do 👏🏆👍❤️", "saretta1306_": "devi stolkerare il clima? nn o cpt", "mt.art.o6": "u know that protesting ain’t gonna do anything, it’s a waste of time. together we can do shi to save the planet but protesting really the best thing u can come up with, bro ur stupid", "travis_parisien": "The sign is made out of paper and paper is made out of trees and trees make oxygen and without oxygen we won’t BREATHE!!!!!!", "lautnascimento": "@sara.dmf", "satan.hate": "Бездарность", "pinheiro.junior86": "🤣🤣🤣🤣", "amundbentzen": "Thats my liney🔥", "santicapote": "👏👏👏👏", "giancarlom89": "Attenta a non cadere", "naelsonpas884": "👎👎👎👎👎👎👎👎👎👎", "_morris_lpz_": "🤢🤢🤢🤢", "brugery": "Z", "malinkahlberg": "Duktigt❤️", "renatadominguesx": "Brasil loves you sweet heart💙", "santiprez1": "Q flipada, está solo quiere fama", "nmax_singlefighter": "👏👏👏", "__mxchl_": "Look at the boy in the wheelchair 😂 He just looks at her ass (if there is any) 😂", "officialjochenmezker": "Bauernstyle", "sergio_valentini_": "Idiot", "hayden.bromley": "Sorry when", "thiago_peruzini": "Du är liten i ålder, men jätte i karaktär och engagerad i en bättre värld. Varma omfamningar från Brasilien. Och kom ihåg att du är större än de mediokra, oavsett om de är Bolsonaro eller inte.", "_lufos_k.i.z_": "Man merkt das die 68 wochen nich in der schule war🤣🤣 @s50_johann @michaelmuller333 @_axtxn_", "optimisanthrope": "@503_parker getting people organized for a non-political agenda (AKA SAVING EVERY PERSONS HOME) is better than anything dumbfuxk trump has done", "milehighclub9890": "YOU GO GIRL", "shizuka74_": "Gracias Greta 😘💚", "happyjakdvagrepy_": "strč si tu ceduli do ass", "maddyy.mae": "At this point you’re just justifying skipping school for something that can’t be immediately solved..", "naiaguidialves": "👏👏👏😍", "jersey_majaska_ann": "This is why ppl are mentally retarded", "dancingreta": "woKEEEE", "owencarlson51": "Vote Trump 2020🇺🇸🇺🇸", "marionweltenbummler": "🤮", "bottinelli.09": "Fuck younfuck greta", "bearded_kraken": "That translates to hypocrite!", "alex.vie_": "Skolstrejk for Freizeit", "cavernnikki": "500.000 😂😂 please go back to school and learn to count", "lenix125": "Sign was made from paper.", "tuplug_zgz": "Cuanto imbecil junto", "hayden_hoffarth_216": "I like to drive to get 4mpg screw the environment", "luke_herbert": "You could use a day at school you dumb fuck", "lizzy_einfach_": "I Hate You", "perudor": "- Varför ljuger du så? Det fanns inte 500000., men 15000!!", "sigan_a_ncarrasco00": "Lo haci solo pa tener plata", "webbstermalone": "Climate change is fake", "starskyaki": "❤️😍", "jaymoss_x": "I’m surprised she didn’t get rocks to her face", "71muko": "#gobacktoschool", "walkingaplasticbag_cleannature": "Very sad that you had to share stage with @bardemantarctic who is part of the kind of people that pollute the planet the most! Rich & famous. They are all telling what to do and not doing what they say! So incredible that people like that can represent organisations that claim to work for our planet!", "mergallardoo": "tendria q haberla llevado a los toros @javiergallardo01", "potato_diamond_2005": "Wie viele Plakate werden nach dieser Demo auf dem Boden liegen ? 🙂", "sakinegurses": "❤️❤️❤️", "theosslg": "They are just happy to not going to school... are you @gretathunberg really do naive?", "gluecksrezepte2019": "Great👍", "annx11": "500,000 tails. Congratulations Greta! Just because you don't go to school doesn't mean you have to instigate others!", "radikaler.feminismus": "😍", "kerim576erz": "You stinkst nach bock", "actualjackjack": "Also that happened billions of years ago. Humans have o my been around for about 5 million.", "tony_quintanilla_art": "👍😄", "slick_taliban": "Worthless cunt", "marijesu73": "Espero hayas disfrutado tu corta estancia en mi país,España ;-)", "j0s3.uwu": "If i was there i would throw something at you (bad English i know)", "ivvyychills": "You are superb!!!", "avery_uwuzz": "IHATEYOU", "yoga_with_audrey_jane": "Wow! This is amazing! 🙌", "ok.rroobb": "So a school principal will bring the ice back?", "jilliantalbott": "I don’t like u", "iconicc25": "Fuckin tard", "franciii2777777": "#FridaysForFuture", "ammyjr21": "Shit", "natalia8902818": "🇧🇷", "vnbarb": "De preto só o amplificador", "annasmemories": "❤", "paty8261": "This is incredible", "officialwetewears": "This is so wonderful", "owens.81": "🤡", "relaxalex1970": "du är ett dåligt barn - om du inte vet vad Stalin och Putin är, stäng munnen och skäll inte !!! Stalin Putin och Hitler är DEVILJARNA SOM förstör HUMANITET OCH SÅLLA IDIOS SOM DU Också!", "sneakernaire": "Hey she racist", "therealraeroberts": "WHAT ARE THOSEEEEW", "dunya3855": "Воу воу, детка полегче))))", "_._karey": "No one stole your childhood and you’re influencing kids to skip school smh. HoW dARe YoU!!", "veggieponymom1214": "@gretathunberg most all of the crowd is corpse crunching planet destroyers, contributing to the main cause which is animal Ag!! Feel good knowing you could make ACTUAL change by educating them , but u choose not to??!!", "111gust111": "🖕🏿😠🖕🏿😠🖕🏿😠😠", "ns7_photo": "I wonder how many eat meat", "cesarramirez7992": "🤡🤡🤡🤡🤡🤡🤡", "joshuka_": "wonder how she got their🤣", "ben______0106": "Not going to school is not going to change climate it’s just ruining your chances in life and your education. You are in it for fame and money.", "galdri": "joder que de gente @blanca_medina_garcia", "_izzzanvc27_": "Go to your school and stop saing stupid things. Get out from spain", "mp22paris47": "If you read the first few chapters in Genesis it would help begin to ground you in truth...what you're doing only shows uneducated ignotance..sad", "andrearainekatz": "It’s great to see teens stand up for what they believe in but school is important. Go to school and university and study environmental science, get a job where you can have an impact and make changes.", "shet_smells_amazing": "Well guess they’re just as stupid as you", "lindsay.iannella": "translation-> sksksks for Climate", "vasco.r": "Exato", "katprete": "Linda!!!💞", "aracelisalvesda": "👏👏", "sementesdegramado": "❤️", "trishrbtrish": "Love that smile!! 💙💙💙Just think at one time you were sitting alone with a sign...now you have millions of followers and people who are waking up -standing next to you to help make a difference!! You are our world leader in #climatechange #climatestrike #climatechangeisreal 🙌🏼🤟🏼🤝🤛🏼", "azukinanana": "you stand up on a stage and it seems not eco", "filippocrestan_": "Spero che la CO2 ti uccida o noooo nn sai cos'è chissà perché nn vai a scuola stupida analfabeta", "ta_da_1512": "🤮🤮🤮🤮", "kai_smith7": "No", "_.ivan2554._": "Me cago en tu puta madre japuta tus muertos q caballo y a la binaGRETA", "a_jollygoodtime_": "Dare", "evajepson": "Heja från Rinkeby! 🇸🇪", "ramiro_paz39": "10.000 not 500000", "marganuevo": "😂😂🐐", "sandpaperwilly": "Priceless use of a Swedish sign in a Spanish country-very sad-where is your grade 3 colouring book?🤓", "ale_gallegoo": "🤮🤮🤮🤮", "ronaldomanzaro": "Atitude, informação, educação, ciência, tecnologia, religião, a família e os valores são fundamentais para garantir o bem estar e a sustentabilidade humana em um mundo que enfrenta cada vez mais problemas ambientais. Conscientização é tudo. Temos cada vez mais que desenvolver o hábito de compostar, reciclar, reduzir, repensar, recuperar, reutilizar e respeitar toda forma de vida, por isso não compre animais, adote, jamais maltrate e nunca abandone. Façamos a nossa parte também, ou pelo menos o mínimo possível. A poluição não conhece fronteiras, então para aprendermos a partir do que está acontecendo no mundo, pelo bem das gerações futuras, vamos ficar do lado da ação e da esperança, e apoiarmos uns aos outros em esforços coletivos pela mudança. Nunca jogue lixo na rua. Infelizmente nossos rios e matas estão cada vez mais poluídos. O lixo que descartamos de forma irregular, apenas muda de lugar. Vamos minimizar o impacto no meio ambiente reciclando mais. Estamos esgotando os recursos naturais do planeta cada vez mais rápido, destruindo o meio ambiente de várias formas, desperdiçando recursos naturais, como água e energia, jogando lixo nos oceanos e desmatando as florestas. Os danos comprometem toda a fauna, a flora e a sustentabilidade do planeta. Algumas dicas para ajudar a diminuir a quantidade de lixo: Produza menos lixo; Evite plásticos; Dê o destino adequado para os seus resíduos. Sejamos mais responsáveis pois não existe o jogar fora, o planeta é um só.", "di_potato_pelatorr": "No sé inglés", "dasilvalau_": "Sigue adelante 💪🌎", "marijnguijt": "Ok", "ivo.wrld": "😍😍😍😍😍😍😍", "m_i_c_k_i_b": "Of course, schools skip for the climate, as if that would change something. Only school then demonstrate I think.", "faaranak": "@zhiyanjavanmiri", "probert0628": "#weruntheearth", "mariocobos27": "❤️🇪🇸🇪🇸🇪🇸", "jonathan_nash_": "בואי לרמלה", "moelmiarisback": "Ignorancia!", "charlottelochhead": "Glad to see the boy rolling out Climate positive thoughts", "agnesnoreng": "❤️", "hannah_hld": "Soon it'll be week 69", "deliu.rina": "Haargummi ??? Häää @s.xmg @me.ekc", "iconproject": "Hi you are a great example and inspiration for many people we send you kisses from Madrid💋🎉", "eri_oliveira1": "😍😍😍😍😍", "cris_assef_lutif": "❤❤", "edgar_foo55": "Shoe game weak", "the_tx_conservative": "Go to school like the rest of us", "marycate.coyle": "go to school", "cannabisvarlden": "💚💚💚", "sam_haaf": "Nothing screams privilege like skipping school and going on a yacht to ‘protest’", "better_than_lif3": "We don't really need school we have the internet and more importantly self education. pointless class strike I say.", "fdezcruces": "🙌", "ohdosi": "Dumme Terror Nutte", "weeb137": "I've said before and I'll say it again, nothing more privileged than a rich white girl skipping school", "allen_nordstrom": "Diesel trucks and 2 stroke dirtbikes will save the whole planet!! Everyone needs these 2 things if they want to help!! #rollcoal #2stroke", "lucasnicolau8704": "Enhorabuena por lo que haces, pero boyan ha echo mucho más que tú y no va dando tantas conferencias", "susydati": "Bom exemplo. Não tens escola??? O tempo vestuário não condiz muito com o que falas...", "fyrvoktern": "💥💥💥💥👏", "nyboobookitty": "In America, we speak English", "davisnathan95": "@peytonsholly she seems pretty bundled up for there to be climate change", "vitorjonathan7": "@vemcomabruna já gostei dela só por causa dessa plaquinha. Tem Skol tem like 😂🤛", "rickammerlaan": "Dumb dumb", "laquinonero": "I was there!!🙌🏻♥️", "silvinadc": "👏👏👏", "lost_in_the_abyss_1": "Let's keep driving SUV's.", "043.marc": "Im going to buy me 3 lambs", "alex.hder": "Avant les gens se réunissaient par milliers pour voir les stones,.... maintenant c’est pour voir des handarr ( une autiste et un type en chaise roulante )", "warrenbeebe": "🤡", "copetti12": "Como brasileira que sou, peço desculpas pela postura infeliz do presidente !", "coochiejam": "Thanks Greta 😼", "gracagracamelo": "Deus te abençoe te ilumine sempre", "sherrystrong1": "Amazing ♥️🤗🙌", "_carolssz._": "💚🌍😍", "sad_boi_civic": "🤡🤡🤡🤡", "marina_fepuleai": "Stop hosting lil concerts", "w_clarckson": "Go Go Greta 🚨🚨 New Future .", "palomaredoli": "👏💚", "bobkipan": "Ойингни амигаскай сан куйдирги кизни", "nikolayfry": "Поехавшая малолетка с юношеским максимализмом 🤦🏻‍♂️", "brodoy1982": "Muito engraçado. Se fosse pobre queria andar o mundo disseminando a proteção ao meio ambiente. Lembrando que para ter todo esse dinheiro, os país gastaram recursos naturais. Hipocrisia danada!!! Aí está o mundo inteiro dando o que ela quer, mídia.", "incognitounknown4": "Psychopath!!", "ismailonaraujo": "Pirralha", "homes.annelise": "🔥", "wzayfy1": "like you! you are my hero!!! I hope every young generation could learn a lot from you and your bravery! really love !!!", "e.skoko": "U are sick girl", "cade_green_": "Take ur ass to school", "wolfpower888": "fan de ni sjalva som förstör eran klimat och du är dum du har hittler inne i dig", "siwanator_marty": "💖💖💖", "martagambarotto": "ESTA É A REALIDADE DOS TEMPOS ATUAIS Um JORNALISTA AUSTRALIANO deu a seguinte resposta, em relação à intenção de alguns ESTUDANTES do seu país de fazerem “GREVE PELO CLIMA ”: - \"JOVENS, vocês são a primeira GERAÇÃO que possui um aparelho de AR CONDICIONADO em cada sala de aula, os vossos deveres são todos feitos em COMPUTADORES, vocês têm um TELEVISOR em cada sala, passam os vossos dias a usar APARELHO ELETRÔNICOS... em vez de IREM A PÉ para a Escola vocês utilizam uma FROTA de meios MOTORIZADOS de transporte que entopem as vias públicas. Vocês são os maiores consumidores de bens de consumo de toda a História, comprando compulsivamente as ROUPAS mais CARAS para serem ‘trendy’. O vosso protesto é divulgado através de meios DIGITAIS e ELETRÔNICOS... Por isso, antes de protestarem, DESLIGUEM os vossos ares CONDICIONADOS, vão a PÉ para Escola, DESLIGUEM os vossos TELEMÓVEIS e LEIAM um LIVRO, façam vocês mesmos uma sanduíche em vez de comprarem COMIDA ENLATADA... Mas, como é óbvio, não farão nada disso porque vocês são EGOÍSTA, MAL-EDUCADOS, manipulados pelas pessoas que os usam, proclamando ter uma causa nobre enquanto se refastelam no LUXO ocidental mais DESENFREADO. ACORDEM, AMADUREÇAM e FECHEM a BOCA. INFORMEM SE dos FATOS ANTES de PROTESTAR ”.", "tristataborrr": "cute shoes", "kellychildsxo": "💗💕♥️♥️♥️🙏🏻", "marinablaup": "Madrid is on 🔥🔥🔥", "adrianagoncalvesbatista": "👏🏼👏🏼👏🏼🙌🏼", "rochavivi23": "❤️❤️❤️", "el_gerrman": "this is insane bullshit", "_chueyee_": "🤡🤡🤡", "purpletuna_eeo1": "💙", "nauraaparecida": "💗🙋🖤", "b.e.n.n.o.11": "🖕🖕🖕🖕", "arda.crc": "How dare you", "leoon.sc": "you have to go to school that makes no sense", "copperpot6439": "Hoax.", "same_same_tre": "Can u start promoting a work strike??? I’d love to not work and it be justified! Never mind, let’s just f*** up the kids!", "orendacreations_pl": "Go strong @gretathunberg 💪😤", "gautam.anant111": "👍", "paigeparsonsroache": "Yes! @gretathunberg Please y’all about veganism as a leading cause!!! 🔥", "leah.wgf": "Help @franz._.15", "erva_are": "🛳⛴🚢🛩🏍🛵🚘🚛🚚🚜🏎🏎🏎🏎❤️❤️💨💨💨💨💨💨💨", "its_pedroo": "I see paper", "ballesteross.s": "El cartel en Español ja puta q no se entiende el sueco", "isma_negreiros": "Vai estudar Pirralha", "magno.pazetto": "#Pirralha", "johanndobsai": "🌍🌎🌏", "fabio.feldman": "You are a gift to the world! #gogreta", "servant_of_oni": "It's a school night...", "carlao_dutra": "Pirralha😂😂🇧🇷🇧🇷", "leandrocleitee": "Faltou aula pra ir protestar né? Se fosse negra, reprovaria de ano.", "junior.medeiros803": "Pirralha, porque não se manifestou sobre o óleo nas praias do nordeste brasileiro? Você é uma piada...", "benditlikeburton": "Go to school", "joseph.candelas": "This kid legit convinced her parents to let her skip school for over a year to protest climate change in the countries that aren't causing it. Go protest in China and India.", "nailbender3.0": "Poor ignorant child, nothing but a naive political puppet @gretathunberg", "srasevero": "A pirralha mais linda do mundo ❤️❤️👏👏👏👏", "bobbybarber89": "You're amazing, and most Brazilians don't agree with what this worm says. Brazil's president looks like a quarrelsome four-year-old boy ... he doesn't represent me.", "diegoagro97": "😻👊🏾💚", "fowlielove": "Go eat shit you are not hispanic go away", "livesun19": "❤️Nossa Linda princess Brasil te ama ❤️🇧🇷👏👏👏👏", "tiagodiasharket": "You are the hope that was missing for this whole world to change!! Some world leaders seem blind... You are someone who has character, unlike others who do not measure repercussions and speak what they want... you're not a pirralha This world needed a person like you to teach character, with courage and respect Nature expects it ...", "renanservulo": "🇧🇷💛💚", "felipe_santooss_": "Pirralha.", "blakemiguealdavis": "Ok boomer", "lyalves3114": "Pirralha 😂😂😂😂", "jonesmachadobr": "👏", "girlkio": "Stupida,pirralha", "drikstew": "👏💙", "riley.m______": "School strike week 68? Have y’all not been in school for that long? Are your parents idiots? Y’all need to be slapped and put back in school to learn so real shit, climate change is real except for the part where we’re all gonna die soon, ever heard of the ice age? Remember the dinosaurs? Yeah the climate changes and yes one day the homosapian race will be wiped but it’s not gonna happen for thousands of years, you all need to do some real studying before you leave school", "tiagotsrock": "👏👏❤️❤️🇧🇷", "almirmachado10": "greta, where were you when the forests of Australia were on fire? Where were you when the oil spill happened on the Brazilian coast?  hypocrite financed by Geroge Soros, the people of Brazil do not have swallows.", "suellen.peixoto.56": "We need your voice in Brasil. I love you💚. 😍😍😍😍", "lindboss": "Over 80% of the plastics in our oceans and seas come from three rivers in two countries, India 🇮🇳 and China 🇨🇳. Let that sink in for a moment. This child is a fraud with an outrage based on no facts. Shame on her and the left politicians for using a confused, overprivileged little girl to push their agenda.", "fabricio.bike0007": "💩💩💩💩", "hannebrataas": "Uten olje kan du ikke få laget mobiler,datamaskiner, sykler, fly,tv,radio,internett, kjøleskap, komfyr,båter,seilbåter m.mere. Jeg anbefaler alle som er i mot oljeboring å tenke på konsekvensene at da må man gå tilbake til steinalderen.", "studiogueualkimim": "Pirralha 🤣", "zelda_dan": "Amazing!!!", "vangellis_hv": "BOLSONARO 2022 🇧🇷💥", "carmenadrianagome": "Não ao desmatamento", "eng_bruno85": "Pirralha", "angelborgesm": "We Brazilians love you! Thanks! ❤️", "renatta.rm": "Pirralha", "renatalopes1779": "👏👏👏👏", "romero.rodrigues.s.v": "Pirralha que ama aparecer", "jusceliasilva28": "❤️❤️", "beatrizcassane": "thanks 🇧🇷❤️", "cleuzacgon": "Muito linda demais parabéns", "juniormartins248": "pirralha", "tigra_guanabara_guepa_ventura": "🇧🇷🗣️ 📢 Do not come to Brazil! You are not welcome! #Pirralha ✊😠", "samiveloso": "Como admiro essa #pirralha ❤️😍", "prussianquit": "#climatechangeisfake #climatechangeisahoax #globalcooling", "sabrinnamunhoz": "Desculpa!! Sentimos vergonha do nosso presidente.💕🇧🇷", "diasdedrone": "A China é o maior poluidor de mundo e nunca aderiu à nenhum acordo de redução de emissões. Não seria oportuno direcionar esforços nos maiores poluidores mundiais?", "nikswierk02": "Complains about childhood being stolen, yet there are kids in the Middle East equipped with guns and bombs being forced to fight American soliders, and they’ll die if they refused. Also Ukrainian kids being taken prisoners by Russians, probably never returning home. Yeah, your childhood is stolen, ungrateful sweed. Oops did I offend all of you? Well it’s the truth!?", "diekeien": "that boy is looking at your ass", "adelmalosaraujo": "I adore you @gretathunberg! We Brazilian need you. Denounce our president, please!", "clarisse_machado": "Pirralha", "omar_aouita": "You have no school ?", "yas_f3": "Fui al mar a tirar pajitas", "maura_ramos2019": "Vai estudar e para de encher o saco do Brasil!", "joaomchagas_": "Pirralha", "evolution_of_the_revolution": "Start promoting veganism and address the causes not the issues aka address the solutions not the problems", "matheus.meneguette": "Minha pirralha favorita ❤️", "jana__costa": "Greta vc é gigante, parabéns ❤️🇧🇷", "marcosolintoribeiro79": "Heyyyy pirralha!!! 😂😂😂😂😂😂😂", "claudia.rentsch": "Aber von Lissabon nach Madrid bist du auch mit dem Auto gefahren, soviel zu dem Thema !!! men du åkte också till Madrid till Madrid med bil .. så mycket om ämnet!", "driamorim2": "You are an idiot! 🤮🤮🤮🤮", "rocio_kdiz": "Bienvenida 👏", "rene.rduch": "You are a fucking kid!!! Go to school!!", "as_donas_de_casa": "😂 humilhada pelo Bolsonaro pirralha", "sheltonbrower": "At some point your just a high school dropout justifying your existence 😂😂", "fernandocanavezes": "Ridiculuos", "alexvndra.i": "How dare you", "gabrieldaher__": "fuck u", "climate_for_the_future": "Amazing!🌱 @gretathunberg 👏", "akermanmonica": "Pirralha", "leandroisecke": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "carlaritatavares2018": "❤️🇧🇷", "nathan.abraham.1982": "🤮🤮🤮🤮", "svetlana260669": "👎👎👎👎👎👎👎👎👎👎👎👎", "hnsfilho": "🤡🤡🤡🤡", "emer_engpro": "you are a fake girl, your parents should be arrested for using you as a tool $$ talk about the expensive and polluting cars they have, among other things🤮", "aquecimentologia": "menina IMBECÍL que fala mentiras do Brasil", "renatamourato": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "roevora": "Greta, nossa notável pirralha!! Continue firme! Estamos contigo! Love from Brazil!", "allbuquerquevictoria": "Pirralha. Stupidet 👿", "nogueiralip": "Skol Beats é nois tmj", "antonio_izquierdo18": "Ponte a recoger mierda en vez de hablar tanto", "14629.611782036": "one more week boys", "levi.salespinheiro": "Hw can a foreigner girl who has never been to Brasil talk about Amazônia? U r a lier followed by blind people!", "euu__bea": "PERFEITA LINDA FADA SEM DEFEITOS", "andymacdougal": "Fraudster", "diegocarosa": "PIRRALHA", "wrgcareca2018": "👎👎👎👎👎👎👎", "aahern23": "You’re just bullshitting to skip school. HOW DARE YOU? You’re the textbook definition of white privlige", "_________rafael________": "💩💩💩💩", "jonavsn_": "Ich weiß nicht was schlimmer ist 500000 schulschwänzer auf einem Haufen oder mathe", "fl4cc": "Pirralha", "ednalva_fonseca": "Estamos com vc pirralha😍👏👏", "junior_felix84": "Love 🌹", "aka.ikeer.69": "Tus muertos tonta viva el etaa", "marcelo25vm": "Pirralha", "anabarrtos": "Pirralha", "manduca_rodrigues": "Tem alguém por trás manipulando essa pirralha!", "blutengel_gothic_fur_immer_": "https://www.deutschlandfunk.de/lithium-abbau-in-suedamerika-kehrseite-der-energiewende.724.de.html?dram:article_id=447604", "luanaemfotos": "🇧🇷 O Brasil se orgulha de você!", "ciaravalentim": "Brat", "piedepiede": "Ma nun ce rompe li cojoni", "magic_nando": "amazing bitch", "wcostaviana": "Greta, obrigada pelo seu ativismo. O atual presidente do Brasil não nos representa! GO Greta! 🇧🇷", "liberalsareaids": "It’s fake", "braddeters": "Brainwashed", "nik0lay36_9": "rabija", "maria_vegn": "Thank you 💖Brazil", "danedejour": "😍👽", "luisnuu": "Pta yonkii", "lopaa._": "Te huele el culo a pescao ajkerosa", "valentine_ramona": "Brazil loves you!❤️", "inigoj8": "Lo único que has hecho es no ir a clase , haz algo verdaderamente útil por el planeta en vez de enfadarte con la gente", "kioandradec": "Que a Deusa Mãe Divina Natureza a abençoe e proteja querida @gretathunberg", "schafermichelle": "Go back to school kiddo, finish your education, then go out and change the world. This is not a strike, it's a tantrum!", "albertoo.rodriguezz": "Dedicate a estudiar", "celina.meixner": "Piss dich", "karenkarolinapereira": "👏👏👏", "iagvictor": "Você é incrível continue assim, desculpe pelo nosso presidente, ele é um idiota. Vamos lutar pelo nosso planeta ❤️👏👏", "_jarcf": "E awe #Pirralha?", "xsuarez20196": "No inventes cifras", "alex__vale": "#pirralha 🤣🤣😂🤣 brava pirralha 👍🏻👍🏻", "_anna_a_n_n_a": "👏🏽❤️👏🏽💪🏽", "celsopinhoadv": "#somos todos pirralha. ❤️❤️❤️", "johauer": "Dumb Child", "_beng02_": "It is no longer a strike, it is a school dropout justifying her existence", "valquiriacarnaval": "👏💚", "annaalencar4": "👏🏼👏🏼👏🏼", "jaquefisioterapeuta": "Sorry for our president! Does not represent all Brazilians", "adricordeiro": "💩💩💩💩💩💩", "dragux05": "🔥I BELIEVE IN YOU 🔥", "aiman_maratkyzykz": "❤️", "doutorforest": "👏👏👏🇧🇷❤️", "terezinhaborbaelias": "Eu te admiro muito Greta! Você é numa guerreira! 👏👏👏👏👏👏", "talha.krslnoglu": "Pezefenk", "jovasbismara": "Greta, come to Brazil! We are lost, our president don’t care about Amazonia. We need to talk about that, before all the forests burn here!! Help us", "tyler_strandlie": "School strike... more like highschool dropout", "rodrigocarmo": "👎🏾👎🏾👎🏾👎🏾", "realmarcos_9": "Tks for nothing 👍", "rafamacula": "chata bagarai", "vinivga": "Fuck off... that was NOT the number... stupid kid.", "kenniabrant": "Vai estudar menina", "h.enry_m.artin": "Take notes this is how to get out of school 🤦🏾‍♂️😂", "edo.monzali": "Fuck you", "thiago.magalhaess": "Love for one pirralha ! ❤️ Bolsonaro os a piece of 💩", "elfodaluz": "O mundo precisa de pessoas como voce !! Obrigado @gretathunberg", "dani_levskaya85": "Bien , Greta! Pero espero que el dinero ganado de 8400000 siguiedores de Instagram van solomente para la lucha de Cambio Climático.", "striessdaniel_ds27": "Tschukslberg", "goodmorgonhotell": "How dare yo", "snevets16": "You're not on strike you're a dropout", "southern_california_deplorable": "You’re just a dumb ass who dropped out of high school. Climate change is a hoax. First it was global warming until that hoax and sham got exposed.", "n.barcoo": "Deja de hacer pellas payasa", "jam.ila2007": "❤️", "marcos_adrianom": "Förklara de dyra möbler du och din familj äger av djurläder! Cynisk!", "daniel.erwin13": "Climate isn't real", "casey__harrell": "Go back to school looser", "not.dqvid": "80% just wanna out of school", "edelsuitamendes": "👏👏👏❤️", "fake_cola_faebu": "🖕🖕🖕", "0punkz88": "Fuck you bitch", "jacksonbraisted": "This just sounds like and excuse to skip school", "catarina_italy": "Vai estudar garota 🤮", "sourav_sandhu11": "👏👏", "walnuss_tv8": "Hure", "lombasr": "COMUNISTA!!!", "ecologiquefriendly": "🙌🙌", "isakbazzeo_20": "Jävla noob ingen gillar dig din råtta", "sweet.escape.yacht.charters": "Amazing work 💙", "denali_34s": "Wish my parents let me skip school cause I cried about something 🤡🤡🤣🤣 YoU sToLe mY cHiLdHoOd 😆😆😆", "trubois.botman3b.x9_s5_6j1l": "Has she taken her pills for the day?", "wallanderbjorn": "Greta. GRATTIS till din mamma MALENA som har namnsdag idag 10 december.", "micha_maerz": "Gaaaanz schlimm... unfassbar", "unicefinnocenti": "Well done! 💙🌍", "valentina_medic.3": "Just geep going 🙏🙏🙏👏👏👏💓💓💓", "darko_canic": "political Marionett", "alejandrnx": "@sonia.ocg una polla era por eso", "ramzee_against_the_machine": "Retarded and a dropout. Very cool greta", "claudio_cc021": "Kkkkkkk", "axel_lubbe": "💚", "cleetuscortes": "🤮Ur a bot🤮", "jozelegabal": "When does this comedy ends?", "guard71832": "Insane people following a child with a mental health condition. #trump2020", "aiden_386": "Great job showing kids to skip school", "nachopardo_": "Amazing how people take a kid’s word as truth. It’s the economic/goods production/social paradigm established that’s causing climate change. And it is not precisely the west where most of “this” pollution is coming from. Might wanna head to China and India soon, Greta😂", "__.ashiiexx": "@cherrycurlsss", "hanson_shonfield": "How was your donkey doing?😂", "og.hyena": "ебанутая что ты делаешь кроме пикетов своих ебливых", "j_hotboy": "Inspire everyone to quit school!!! 😗🌍🌎🌏", "naeco": "💙👏💙👏💙👏💙", "himanshusahu__": "arre is ladki ko dedo yar jo chahiye sab jaga ba*****i fella rahi😂", "niall_251": "My man Greta spitting bars, knew you loved drill", "99alexsg": "Nini, vaga, y viaja en barquito...vete al colegio ya a estudiar de una vez! Y déjate de lloriqueos", "ipoy.liege": "Bitch", "joice__n": "Greta please go to India, China and other places that badly need you to lecture them about climate and POLLUTION they make.", "peke.10": "Follow @_hdehombres_ or share them in your stories please. They're a good account", "1mantruth4u": "watch", "flamur1896": "come to besiktas🦅", "nighttime.fireflies": "Omg I lurv that ❤️🔥", "daniiel_b19": "500k in your mind but the true is that just 20k showed up in Madrid💩🔥", "aaron_sullivan15": "Hey instead of marches how bout trying to plant 20 mil trees like mr beast and China and India are the worlds number 1 polluter why not go yell at them.", "elodiie.lachance": "Good job! 👏", "kenan.yllmz": "@pascal0501", "sannie_s": "🙌🏼🙌🏼🙌🏼 💚💚💚", "gabrielmoraoliver2019": "avoiding tens of kilometers every day ..! But as we, despite your nonsense remote control to masses idiotized by social networks, we wish you the best and that you can live according to your convictions and you can recover the childhood that you have been robbed, we have reserved a hole in the store number 1,587 from our refugee camp so you can rest for a while without contaminating, of course, as long as you are lucky and that night does not coincide with one of the usual visits of the hordes of drugged and drunk soldiers. If you manage to survive, in the morning, hopefully you will have the only meal of the day, which consists of flour porridge mixed with water from the only well that we have, of course from contaminated water, and if, as usual, you contract cholera, you can Clean your ass with dirt and stones. Another important thing, so as not to pollute the environment, do not bring the cell phone or glasses or compresses or toothbrush or since, in its manufacturing process, it has caused CO2 to emit etc., Oh and please try not to fall off luxury yacht in which you travel, since in the oceans there is already enough garbage .... That you have been robbed of childhood ?, do not worry, that all of us, to do you a favor, WE CHANGE YOU", "finalcutlovers": "Fridays for diesel 😁", "mafaldadandrade": "Olha nós ali @clauuc", "tommymedin": "❤️", "jere._l": "Los carteles, teléfonos, ropa y además de esas zapatillas que llevas dañan al medio ambiente👍", "willypickman_": "GO TO SCHOOL!!!", "fffrosetodegliabruzzi": "Go Greta!!!!!!", "alex_m_p_99": "Dejate de gilipolleces niña, q luego bien q llevas barcos escoltas impulsados por petroleo, luego como te vas a tu pais? En burro? Porque eso si q es no contaminar", "haze_of_baze": "💚💚💚", "jorgedominguez_17": "Si, para verte la cara a ti, una niña de 16 años con sillones de 7000 euros y haciendo el gilipollas. Patético.", "calbone_": "Greta ask me who joe is I swear you can trust me 🙂", "adamtrolin08": "Du gör igentligen inte så mycket nytta och förresten elbilar förstör också klimatet", "isabellajoaquina": "Y otra cosa,eres una mierda de mujer haciéndote la víctima, llorando,y todos cambios de ánimos qué tienes,es más caga de la cabeza,lo que tú se supone que tienes tu es Asperger no los es eres un perra mal criada y también eres de familia aristocra, por qué no donas alimentos a todos los niños que mueren de hambre en el mundo,hace el bien no el mal,así como vas te morir sóla, por ser egoísta, que sacas de tratar de hacerte popular si todo es mentira,a nadie tocas con tus palabras,sale del discurso,y andate a encerrarte a tu casa y ponete a estudiar,para que puedas tener una opinión que realmente atinada.personalmente y mucha gente ya no te soporta tu ipocrecia, mentiras,y tu familia con doble discurso después que te siestas en sillones de de animal, que está recorriendo el mundo esa imagen inmoral tuya y de toda tu falsa familia,y date el de traducir lo que te escribí, Por que voy a esperar tu respuesta mientras viajo a delatarte frente a todo el mundo.la verdad de quién eres perra egoísta", "elise_2mllmnn": "Go greta!", "natur.andy": "Soros, bill gates, bono are 3 puppet masters very pround of you puppet", "_francescofreddi_": "Va a studiar, organo fondamentale per il movimento della bicicletta😂 @_dabolef_ @michele.pederzoli", "jorgeniieto.alc": "Tu lo que eres es tonta", "pedropresident": "💩💩💩💩💩💩💩", "hectorandreszuniga": "https://www.instagram.com/p/B50sQ-SpHG7IsFB1ZxTV8G03me_BJBtt1lHEf80/?igshid=qial54a5wasu", "perrolobo27": "👏👏👏👏👏👏", "66_daniel": "The devil's face", "danielmesquida_323pl": "😂😂😂😂😂", "raphael.pape": "Was will das häslige Mädchen machen verpiss dich", "miiguelubeda": "Dislike", "boobay_langton_18": "Thot", "elya.muzheyko": "u wonderful 🇺🇦💕", "amida_official": "You are just a paranoia kid", "jxcknicholls_": "grow up", "anthea.gouws": "Go Greta you are doing a great job", "coolearthchallenge": "Just incredible! Don‘t stop!💚🙌", "danilostorelli": "Figurinista de nazista", "pablo.olmeda88": "Desde q existes intento contaminar al máximo", "radkokeleman": "your parents should be in jail and you should be in school your message is 100% 💩", "tamashii_mezame": "Lie lie lie lie lie, you're dangerous", "roberrpg": "Una pena que estoy quemando gasolina", "nasshitorivera": "Me parece vergonzoso que habiendo científicos que llevan toda la vida estudiando el tema, se le haga más caso a una niña superinfluenciada por sus padres, que han encontrado un filón económico con sus hijas", "lilianeearruda": "how much money are you making from this, are you and your parents?", "_rauul6": "You are manipulated", "daniel_radoslav_": "I don't like you.... I hate you I can't see your fu***face every where.. You said u didn't have a child life? Okay lets talk about the children in bulgaria... Africa.. India... Somalia... Argentina Brasilia Philippines... I don't understand you...There are the really poor children and not you.", "t.laidlawn": "Boomer", "pferguso": "68 weeks of no school. You have to be the smartest bunch ever!!", "slijepcevic": "Geh mal in die Schule", "lol.its.holly": "And how are u getting to these places?? By planes ors boats that let OUT EMISSIONS, YOURE SO STUPID AND HAVE ALL THESE TEENS BRAINWASHED", "yura_stetsenko": "Страшна шо піздєц", "gabriella.fraternali": "Con Greta 👏👏👏👏👏", "noah_cnn": "Hallo Greta, kannst du mich verstehen", "e.d.i.t.h_111": "U r doing a great job but u must aim at sustainable development rather than just stop using the resources completely. The Earth is ultimately gonna end one day and we connot stop it. No one can stop it. We need to find altenative ways of living to continue the human race. It's gonnacause pollution but we if we don,t we are ultimately gonna die.", "jerryteichmann": "Because all of them just don't want to go to school 😂", "_johanlindstrom": "Lägg ner nu för helvete!", "miguelmargar86": "Greta, go home 🇪🇸🇪🇸", "luca_coupal_book": "Hey my name is Luca, I’m 16 years old and just wrote my first small book about consciousness and would extremely appreciate it if you took a look. It’s completely free, the link is my bio", "bexmaudie": "Look at all that power being wasted.......I can guarantee solar power was not used. And you call yourself and environmentalist", "mashatherussian": "❤️❤️❤️❤️❤️❤️🌎🌎🌎🌎🌎", "maur.lilienthal": "N", "superlate28": "Yay for you, gold star, maybe go look at I don't know India and criticism them over the pollution, you know the second largest polluter in the world, but that doesn't fit your narrative right", "felux2004": "😠😔", "_xkatiereid": "Crep check", "antoniomar___": "Eres lo más estúpido!! No haces nada por nada, ¿Crees que con soló viajar ya salvas el mundo? Niña idiota", "konfliktenimali_glemtekriser": "Bra jobbet Greta❤️🙌👏", "chiropterasol": "Amazing 🌳💚 love u and your incredible courage ❤️😍", "mstpc1950": "VALLAH DU HUREEE !", "gabesteffan": "If you skip over a year of school while in high school don't people just call it \"Dropping Out\"?", "alfonsosdgs": "More successes #SDGs #agenda2030 #ODS #TeachSDGs #EliteSDGs", "ceramicaelespino": "❤️", "belleofthemeadows": "Lmao", "mvilagomez": "We can do it!! All together!", "pmmcalvarez": "És", "haci.d.18": "Go to school", "martijndwit": "Maak er 1 miljoen van jo, mischien wel 7 miljard", "cuentasolaporinactividad": "Greta hablas cosas q todos sabemos,el clima se lleva calentando desde el año pasado nesecitos más información algo que sea información buena no puras cagadad", "maximilian_muc": "👏🔥🙌", "tobiastuechelmann": "yes we can !! thanks to all you young people to wake up the sleeping mass!!", "artispud_emilee": "Greta you are out planets saviour honestly ❤️❤️", "gorni_alex": "She created fridays for future to not go to school😂", "nat11474": "👏👏🔥🔥", "fabiano.barbosa.925059": "Vá se fuder greta .", "mrc0aki": "wohoooooo gretaaaa", "franxo_vdg": "Ojo que 500000 son muchas personas e", "cadenwebb_": "Don’t y’all have parents", "majek.concept": "Madrid", "mika.apd": "Go back to school", "rantonio48": "👏👏👏👏👍", "marv6__": "Brainwashed!", "yungriglee": "Go to school", "aquafy_": "🤡", "_fvckluigi_": "Se ti ziccu fazzu cu dienti nu cartellu kskaba", "grivero1969": "Glad to see how much people are caring", "mukaj17": "Du hurentochter", "christine.vogt.2910": "❤️😍👏🙌", "bartolopi": "♥️♥️♥️", "sonoilverogesu1": "Dio inculato impanato", "david.gabriel.cst": "Penibil", "turbohoccey17": "Ох ты ж е мае. Красиво a phrase expressing admiration for what is happening, also indicating that the commentator likes the object toward which the phrase is said)", "jukukool": "Greta, You are certainly my smallest as well biggest hero! Many hugs to You! :)", "swefenborg": "@GretaThunberg Capitalism will eat democracy unless we speak up! A very interesting TED-talk to you, by the former Greek finance minister!  There are two mountains, one of debts and one of unused money!  I hope that you get inspiration to your press conference tomorrow! Kind regards Ken🌹  https://youtu.be/GB4s5b9NL3I", "olga_ekstrem": "It is just very very sick world, I mean all that hysterical reaction and hype about a little girl with neurological problems. Some people make huge money on this poor girl", "priskamayr": "👍🏻👏🏻👏🏻👏🏻", "magnusappelholm": "❤️❤️❤️", "kolbeysantala22": "Get in school. No one cares for your school strike. Do this shit at work, more than likely you’ll get fired.", "tayavanveen": "You go girl", "percoletas": "👏👏👏💖💖", "janisfleischmann": "Weil halt !", "verdmontacquit": "😉👏", "medine5332": "💙💚", "jorrrgeee": "300 MILLONES DE PERSONAS Y TODAS SUBNORMALES TIO ASCO DAIS ASCOOOOOOOOOOOOO", "n7.alex": "YOU ARE A CLOWN", "ryssesa": "Fel språk förfan", "jedi_marcus": "#YOUHAVEACHIEVEDNOTHING", "hopp_grasshopper_club_zuri": "💪", "khidirbaev00": "Its important to us", "swedenborgken": "@GretaThunberg Internationella klimatmöten har betydelse som inspirerande nätverk och som marknadsplats enl ny forskning.  Hoppas att du träffar många intressanta klimataktivister i Madrid!  Hoppas även att du vilar och kopplar av ibland, så du orkar! 🌹 https://t.co/c6uv9BWLW0", "thepoooooooo": "Don’t care", "9_click_nick": "School strike😂😂😂 your parents need to be locked up", "necgro94": "🇨🇱", "helenabrikke": "👏🔥", "alvaro_disa": "@isagarcias", "carvestone": "🌹", "piper.t.moulton": "they HAVE to listen to us ✊🌎", "vickeybroo": "They have stolen your childhood, greta I have to tell you this is all wrong.", "hogvallen": "🌹🌹🌹🌹❤️", "paul__garrison": "🤮", "sanch_ant": "You should be in school!!", "ryan.williams692": "Yo it was lit! Thank you Greta for bumping some 21 savage for the boys while crankin beers eh", "pausetoeat": "Så jätte fint att höra!! Mer steg framåt för klimat förbättring!! 💫✨", "helenamnash": "💚🙏🌍", "justin.ny90": "AISA IS THE #1 polluters and you haven’t done one thing there why is thatttt????? FAKE CLIMATE CHANGE ACTIVIST", "follyferg": "Y’all are going to have to do this Greta. My generation “Baby Boomers” have totally forgotten our obligation to our earth and our fellows! Thank you and all who march with you! Keep the faith baby!!!!", "zapper159": "False profit", "jv_amorim_viana": "Why don't tou go to an African country, greta?", "hellithr": "@luuk9195 man und du kleine umweltsau hast gefehlt 😅", "shabexz": "Dude in the back seems interested", "nxco_t": "How dare you", "ty.gaz": "LA VUELTA AL COLE CADA VEZ MÁS CERCA", "j.lopez_36": "One more week", "sine_mor": "@janhenningkleiv kanskje dere møter Greta der!", "andreyannick": "T’as pas cours toi ? @gretathunberg", "nyrvithrormrbani": "All of europe is already conscious of this issue and they are already using more environment-friendly measures to gather electricity. These conferences should be given in countries that actually have a big role in pollution, such as China or the US. I love the message that's being given by your campaign but there's not much consciousness to give in Europe, where measures are already being taken.", "tocosaled_tocosaled": "When Greta Thunberg finds out climate change is natural and not dangerous: 🤡", "ifitfeelsalright": "@haise.rulz.ok you can’t be more wrong. We know indeed but we are not doing it. We are the reason poor countries keep being poor - we make them produce our cheap fashion. We are far from being able to show these countries “How it’s done”. Exxon Mobil, Shell, BP are all western companies and the main reasons for climate change. Once they are clean, we can come and show others how it’s done. Only until we stop considering our wealth on unlimited growth, GDP and consumerism.", "poketgsaero": "Марионетка чья-то", "eto_artemka": "вы чё там ебанулись", "viioleetaalveeaar": "Very good job!!", "hlha_engines96": "In increíble", "1972kn": "Bringt eh nix", "jonifu06": "#fuckyougreta", "greenpeace_be\nVerified": "Verified", "amrx_312": "Omg why r u holding a PlASTIC sign", "javialfonso7": "Vaya cara seta tienes hija", "pattylete2015": "Saludos desde Chile @gretathumberg ojo con Endesa y otras Mineras, Forestales, y Salmocultivos que está haciendo el gigantesco lavado de imagen! mientras aquí no se tocan ni un ápice el modelito macabro! 38 Ríos Rematados ,de una importancia vital para la subsistencia de miles de especies nativas y las comunidades mapuches en el sur de Chile esto aún no termina seguimos en las calles exigiendo justicia medio ambiental, y sociales para todos y cada uno de los Chilenos ✊🏻🙋🏻‍♀️querida Greta ✊🏻🥰 Resistencia, Rebeldía y mucha dignidad y amor por la vida 🙏", "wairamaria": "Grande Greta😁😁😁🙌feliz de que estés aquí Amiga", "jrichied": "I wish we could immediately lower the voting age to 14", "evachuko": "I'm so proud of you girl🔥🙌", "s_kokoro_": "👍💚", "luciarus.so": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "instawindmillsandwoodenshoes": "Friday grill 🙌", "mar2gonzalez": "stop handling children", "linusschulz2000": "I think they are was 15.000 People", "kd.saul": "Instead of school strike, study and change things after. You that actually have that chance", "sophiebrannnstrom": "I engelska ska vi göra en pp presentation om nån som har andrat världen och jag valde att göra om dig", "jakobfant": "#freibierforfuture", "fquintner": "@thebushhouse", "denlangavagenhem": "Amazing! You made them come, Greta! 😍", "patodonati": "Estamos contigo Greta!!!❤", "stefanbaruth": "Nice...big biger..Nice Megaaa Nice..cool 😚😚😚👍😏😏😏", "nohainthecities": "👌💞🌸💐😍🌹🌹🌹🌹🌹🌹", "devid.sch": "Kachbar", "xoxoanchy": "👏", "psylle": "You've been away from home for so long... it's a lot of pressure on young shoulders. I hope you well in all of this.", "claraescal98": "❤️ Thank u Greta, you’re so wonderful 💖", "pl4ygirldreya": "THATS QUEEN SHIT🗣🗣🗣🗣😼", "parejamiengel": "Please a support message for Colombia's marchers who are also asking to the government better environmental politics. 💛", "malvarosa2019": "It is a minor used as a marketing article", "___emiillly": "🔥🔥🔥", "selline.ly": "Schicke Schuhe", "mrknista": "👏👏👏", "callum_sven15": "How did u get to Madrid?", "ruthgawler": "Our Joan of Arc... you are truly loving and courageous ❤️👏🏻", "elisaramosperal": "stop handling children", "donna_araba_senza__diritti": "Porco dio io sto qui a picchiare mia moglie", "m_s_t_e": "👏👍💓", "dorjeek23": "Go to school", "martakornelski": "Thank you🖤", "salmoona1001": "You go girl! You give me so much hope! Thank you for your resilience!", "nemat_a_r": "we old people cannot really do anything to stop our greedy ego to not continue to destroy the life of you younger generation, you younger should continue to fight for your right to live. Right is not given, it should be taken! hurrrrrra 500 likes for 500.000 fantastic people. up with Greta and her supporters", "el_viejo_06": "Imbecil", "ameliapethullis": "♥️", "rxm1893": "👍🏼👍🏼👍🏼", "anderskalneng": "Greta välkommen till Madrid, du är fantastisk.", "lilifee_2016": "💕💞💕", "marcosniara": "Beautiful🕉️😍", "ingalillolausson": "💚💚💚", "lara_lau_": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻♥️", "jan_4.5": "Hau ab", "quisquinn": "You are helping us see what is true - we are a global community and guardians of this habitat. Let's build a global collective to move toward what works and away from what doesn't. You know how twelve step programs build fellowship to recover from hitting bottom? Let's build fellowship and declare this moment, our world hitting bottom and with a sense of urgency, come together. Let's take a peer community and resiliency building practice from San Francisco State, which is such a diverse community, the university's mission is to build multicultural competency. I'm one of thousands who internalized a fun and meaningful small group peer practice we can spread through libraries, tea and coffee shops, pubs - and build social currency. It's a story telling practice called \"critical reflection\" - such a hoot - everyone is getting present and reflecting. It generates a sense of belonging while broadening world views - it builds deliberate thinking skills (resiliency!) and even drives volunteerism. I bet we can spin a World Wide Web made up of tiny groups meeting everywhere, supporting each other and developing partnerships.", "vasia.goblin": "Добро пожаловать в Европу. Доколе будет продолжаться судейский беспредел против российского футбольного клуба ЦСКА? Грета, а ты же болещица ЦСКА, как и все нормальные люди?", "inmaculada_rr": "Yo creo que lo que se está extinguiendo es la inteligencia", "cmchristy": "Special ed?", "philou.louphi": "🙌👏", "virrevirre74": "👏👏❤️", "emmapellingg": "We love you Greta ❤️", "greta.astonson890": "Det är ett väldigt fint namn😂", "linneahjaertat": "🤔", "treehuggerdean": "Awesome! 🌏❤️🍃👍🏻", "mikefla_tenn": "🤡🎪", "zuma_lua": "Excellent! 500,000 people is awesome! Thanks to @_nikkihenderson", "bucky_vlogs": "Come to India; Here people are very unaware about the Future & Nature", "chose_char": "U go grl!", "alexius_mars": "👍🙂", "shammasktpm": "u r great greta, living for us", "teph_jennifer": "❤️", "anneljohansson": "❤️", "itsmenatalya_": "Awesome work! You are an inspiration to me for helping the earth and taking action! I really love you and your work to help mother earth! Thank you Greta! ❤️❤️", "evama38": "The climate lies will never end as long as people are scary easy to fool! One quasi-scientist after another twists and turns on known laws of nature, which humans have no way of influencing at all! When a lie is repeated many enough times, it eventually becomes a truth! #climatechange #lies", "ulrika_svahn": "🙏🏻❤️👏", "marzhe": "👏🏽👏🏽👏🏽👏🏽", "havishzaincdl": "Amazing grettaaa🔥🙌", "mel7edwards": "❤️🌟", "wchart3": "Who are jumping on the band wagon, we need full participation for the next two to three generations. We can stem the tide, and with a lot of effort, we may be able to give our great grandchildren somewhere a little cleaner to live.", "fredrikmholst": "So emmencely done, dear Greta. All. 😃 / Fredrik 💚", "alber_webber": "Unstoppable", "esriiphaaphthrrmchaati": "#FREEDOM#DEMOCRACY#FUTURE#HOPE", "tapjankson": "@nh_offroad I wouldn't say liberal. Communists.", "jayla.rvz": "Inflated number, typical.", "emikarecords": "Greta you make power beautiful @gretathunberg", "labrujahippie": "That's unbelievable, look Greta what you do, we needed a voice and you are here to be this voice, I feel really proud of us, we can save our world ❤❤❤❤ THANK YOU GRETA, YOU ARE AWESOME!", "finsta_da_brunex": "Wooo you are right they need anderstend the change is now", "lacosmicaoficial": "❤️", "andrewhaan88": "https://m.youtube.com/watch?v=fDek6cYijxI watch this everyone. Such useful information about the butterfly effect for you from the YouTube channel, Veritasium, for every human out there", "conborras": "Genia 🙌", "kiltroaguileraa": "We need more people like you! Thanks for exist!! ❤️", "nounderscorehere": "YEAHHHH", "k6r0o": "🤩🤩", "bibina.welles": "Yesssssssss!", "kaleidoscopius999": "Bravo! Has reunido medio millon de personas greta", "gmorephoto": "👏🏻👌🏻👍🏻👏🏻", "colin_johnson1225": "🤩", "emergenciaglobalone": "Estamos vivendo o aqui e agora! Nada pode ficar para o amanhã, em ralação ao nosso Clima clima! @gretathunberg tem razão, quanto mais pessoas fizerem sua parte, nosso objetivo será alcançado..", "theactualbilly": "Your a filthy untcay", "eponina7": "👏", "mrlilboi9_08": "Go back to school bro", "madeleine.sligar": "Lisbon!", "innermehealthuk": "🙏", "diana_coralrr": "Such an inspiration!", "qdhfamily.428": "@xplayer20z5", "memes_4_iu": "Pero por favor una niñata q parece de 12 años le hace caso todo dios? No entiendo esto de verdad", "jak_blond": "Deva Maria , ,,, Ave Maria,,,,,,???", "lil.rreedd": "ASQUEROSA", "lis_mari_": "👏🏻😊❤️", "lordstarwise1": "Ahem fighting climate change needs money..", "j.eveleigh08": "One more week just one", "baran.17y": "😒", "vanhoornmarlou": "Not only the worldleaders: every one of us people, we all have to be mindful in how we live in this earth and carry responsability", "carmen.gaviria.374": "Con marchas y viajando de allá para ca y su cara ridicula y si vida burguesa no va ser nada los gobiernos nunca van hacer nada por el planeta no les importa es algo que no es lucro para ellos co dejar de ir a la escuela menos empieza por centrar limpiar las playas hacer que chicos en la escuela cuando tengan su tiempo libre vallan hagan algo por los animales , océanos, u bosques las palabras se la lleva el viento mocosa las acciones son mejores 🤨🤨🤨", "melendolop": "sigo sin entender quien es esta niña.en el mundo como ella hay miles. por que tiene que ser ella que alguien me lo explique", "gallardoeugeniatoledo": "👏👏👏", "gonzalesmarcodominic": "#YeahYeah !! SENSE OF URGENCY!! 🔥🔥#ClimateEmergency #WORLDWIDE", "riveraclaudiodiana": "😳", "_x_.clum._x_": "bruh imagine actually thinking that 'protesting' does anything CRINGE", "agressive_uwus": "Awesome news:D", "lovebirdsoflondon": "Fantastic 🙏🙏🙏🙏", "ttawfik": "Phenomenal. This is something to study not just for climate but for understanding crowd wisdom", "fieldbrass": "Thanks @gretathunberg. World in Danger - @frankie_morland is on your side. https://youtu.be/77DzQvJOvKI Please can you help UK wake up too and help Frankie to Christmas No.1 so people can hear the message? With thanks 🙏", "jorn.vriez": "🤡🤡🤡", "anamigueens": "ay por los madriles", "dianajkato": "Greta you’re incredible 🙌👏💙", "mateumir__": "BCN?!", "hectorthewlis": "❤️🌎", "v4v.a": "I Love the 4x4 Dodge ram 3500 Diesel😍 WhOeLsE?¿?¿", "lukesprouse_58": "boooooooo 🙄", "_____0.p4in_____": "🤦", "ilhamdieen": "so what the solution?", "dariodeangelis_": "Greta smerdeg invece de fa i libri de carta falli digitali perdona inutile", "kikefercam": "👏", "galaxiancreations": "At this point, I don’t think it’s a school strike, she’s probably been expelled", "villanifishing": "Dont stop Greta... We need you", "mary.bismark": "❤️", "scottsmith_38": "Ricky from trailer park boys has passed more grades than you", "lu_riga": "🌍You are the hope🌎We are with you! Thank u Greta!❤️", "fastpacho": "F", "nereaamateoo": "💚🌏🤯", "_francescapunzi_": "Zoccula", "yolsuarez": "👏👏👏👏❤️❤️", "georginaxbrainerd": "❤️❤️❤️❤️", "ernestoelc": "👏💪💪💪", "leonardooliveir1": "Greta I think your commitment to a better world is beautiful, nature needs people like you.👏👏❤️❤️", "johannespohlcom": "Go Greta!", "nesa.96": "Gracias!!!💚", "gustabss": "Älskar Dig, Greta!", "mrvmerino": "👏👏👏👏💪 Graciasssssss", "sylvanarikkert": "❤️", "j.enrique.v.c": "Congrats. #sdgculture", "jeajonasson": "Hejja dej Greta! 😍👍🏻", "helmo_60er": "Guck nicht so blöde und mach dich von der Bühne runter", "fffpodcastde": "We are unstoppable! 💪💚", "veronica.lusettii": "Sei sempre la migliore", "chieflarock": "You’re amazing Greta", "bappybappers": "You should honestly go back to school...", "mmmguell": "Icon", "ingridbagenholm": "❤️❤️❤️", "like_vir": "🔥🔥🔥", "_qveen.jvssie_": "WOOP WOOOOOP !", "tillertay96": "my only question is why aren’t you truant ? it’s illegal to be truant an your parents should go to jail how bout you shut your mouth an go back to school an attempt to learn something 🤷🏼‍♀️", "jana.gorgeo": "😘", "omar_bordon3801": "🖕🖕🖕🖕🖕🖕", "brittinraincity": "Fuck yeah!! 🤘🏼", "npop": "Thank you 🤗💚", "tyessia14": "👍👍", "mek2300": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "kew1ll1am5": "💚", "angeladcor": "♥️♥️♥️", "fabian08280": "Why you have a phone when you for klima?", "peppinastastna": "❤️❤️🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀❤️❤️", "cateringgourmetmilanosantiago": "Youth have to get involved parents, grandparents and neighbors to ask to have new leaders, leaders of people and not corporations. Climate change don't stop unless we change what corporation do everyday: profit on top of nature resources", "pcosmicgirl": "Planting more than 500 billion trees could remove around 25 percent of existing carbon from the atmosphere, a new study has found. What's more: there's enough space to do it. The study, published in Science Friday, set out to assess how much new forest the earth could support without encroaching on farmland or urban areas and came up with a figure of 0.9 billion hectares, an area roughly the size of the U.S., BBC News reported. That makes reforestation \"the most effective solution\" for mitigating the climate crisis, the researchers concluded.", "kirstie.hall": "Damn @nataliepayann @_jpott", "biocomunicacionsoledadsegura": "Bravo👏", "robintucker.co": "YOU DID THIS GRETA, all behind you %100!!!! Thank you on behalf of all the children.", "_.ourplanet._": "@gretathunberg your the best!", "gatto_lino": "La marina ti è sfuggita di mano", "nb.bethke": "Hört genau hin was das psychisch gestörte Kind ssgt🙄", "polpiris11": "❤️❤️❤️❤️", "cv.191119": "Nice Shoes🤡", "georgewjay": "You need a guitar https://www.youtube.com/watch?v=vbddqXib814", "double.dennyd91": "Who gives a fuck 💩", "daniel123272727": "Not only do I want to believe in us, I WANT TO BELIEVE THAT WE WANT TO DO SOMETHING, NOW! -ALSO!!!!! THANKS!!!! FROM A VOICE ON EARTH 💕💕💕💕💕💕💕💕💕💕💕🐬🐬🐬", "_rangrej_": "😍😍", "levi_p_mumps": "👍😘😘😘😘👏👏👏", "tplzzzz": "You should go back to school", "moamansson__": "Go greta", "jannemertaniemi": "❤️", "jirifrs6": "Fuck GRETA", "arty.lopes.31": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "benszucs": "At some point you’d think you’d understand that the world would rather you just not get an education, than change their ways. Maybe you should just go back to school.", "walxapp": "please never come to Venice", "_anezka_pav": "Ten obličej - zabiju tě😂", "jj_gonzalez3006": "Señora: Vender la masa de bienes que han venido a ser propiedad de la nación no es tan sólo cumplir una promesa solemne y dar una garantí­a positiva a la deuda nacional por medio de una amortización exactamente igual al producto de las ventas; es abrir una fuente abundantí­sima de felicidad pública; vivificar una riqueza muerta; desobstruir los canales de la industria y de la circulación; apegar al paí­s por el amor natural y vehemente a todo lo propio; ensanchar la patria, crear nuevos y firmes ví­nculos que liguen a ella; es, en fin, identificar con el trono excelso de Isabel II, sí­mbolo del orden y de la libertad. No es, Señora, ni una frí­a especulación mercantil, ni una operación de crédito (…); es un elemento de animación, de vida y de ventura para España. Es, si puedo explicarme así­, el complemento de su resurrección polí­tica. El decreto que voy a tener la honra de someter a la augusta aprobación de V.M. sobre la venta de bienes adquiridos ya por la nación, así­ como en su resultado material ha de producir el beneficio de minorar la fuerte suma de la deuda pública, es menester que en su tendencia, en su objeto y aun en los medios por donde aspire a aquel resultado, se encadene, se funde en la alta idea de crear una copiosa familia de propietarios, cuyos goces y cuya existencia se apoye principalmente en el triunfo completo de nuestras altas instituciones. Gaceta de Madrid. 21 de febrero de 1836.", "carr_christie": "WOW THAT IS AWESOME", "aidamoyano": "👏🏼♥️🌿", "its_wilma._": "👍❤💚🌍🔥", "edilsonphysics": "👏👏👏👏👏", "misstmeadow": "Amazing Greta 😍🌱", "jarimuri23": "Well done @gretathunberg 🙌🏻🙌🏻 Go go go! You’re The example to follow! Thank you for your courage and determination 💙🙏🏻💙", "janewik": "👏💚🌍", "livbeatherod": "❤️", "henriklundahl": "Dear God, you young, brave, clever you. Keep it up! ✌🏽", "ecoreskovic": "So you are skipping school for politics holy shit I should be an activist", "blaarrioja": "😍😍😍", "rvershov": "😂", "lunastepscoaching": "@jmork33 @sweet.simplicity @snbc05", "ccg2004_6": "VIVA ESPAÑA🇪🇸🇪🇸", "nadianadinka14": "Come to Poland Greta!😄😍", "_the_real_ale__": "Kittemuort", "davidefalchi.100": "H.A.A.R.P H.A.A R.P"}