{"frankduffau": "... I was there, what an incredible inspiration ....", "hanzlfkri69": "Hew dey yu BAHSHAHAHHASH", "al_hramoy": "Нахуй пошла, пизда ебанная, иди отучись, а потом языком пизди. Детсво у нее украли, ебашь в Африку и посмотри, у кого там детство украли, только говно можешь подбирать. Сучка ебанная, а Россию вообще не трож. А то вообще чет ты ахуела", "esc_elda": "Vete de ESPAÑA", "dylan___patel": "You should be in Skewl", "artnbits1171": "Omg so much carbon emissions are here .. this is a big problem. Its leaving more marks than sht she is trying to stop.", "susane.azevedo": "@gabriel_freitas_85", "ovsanka1238": "Они же воздух портят", "wealth_becomes_her": "I love this!!!!!!!😍👍👍", "mister_revolucionario_": "#fuckgretathunberg", "burcukaranci": "👏🏻👏🏻👏🏻", "jolzi026": "How are u going to change the climate for fuck sakes you cant control the climate the weather are you god no so sit down focus on school or actually do something instead of throwing a tantrum and looking for attention", "cl.brg2006": "C’est pas très ecologique", "vicentecrezpo": "A revolution is near...", "tyreed_": "no way greta!!!!", "cxcx.girlll": "@http.sarara", "isabella_allward": "❤️❤️❤️ ❤️🌏❤️ ❤️❤️❤️", "svyatoslav_simakov": "Боже какое большое стадо😮", "_chinda.vang": "That's only like a little bit of people compared to the population of the world😂🤯", "spoky_edgy": "https://instagram.com/boyanslat?igshid=1lzb9wkb4rloc", "stuynewy": "YOU TALK UTTER SHITE U FUCKING LITTLE FREAK", "lose_the_straw": "👏👏👏👏👏👏", "am61239": "Tu le mérites!!!!Championne!!!😍😍😍❤️❤️❤️❤️👏👏👏👏", "lavi_bhm": "🤮🤮", "santmtrujillo_10": "C", "beatricekeul": "G R E A T ...G R E T A @beatricekeul", "suwufluf": "Awwehh this is amazing 💗🥺 ty for fighting for this world 😔🤙💦", "_andrew_avazis_": "Damn those 500,000 people need to get a jon", "peytonwiese": "You say the world is heating but yet it’s snowing in California. Real smart🙄", "julesouz": "Já foi na Austrália querida? O negócio tá pegando fogo lá!", "ulf.larsson.1848": "You are fantastic🔥❤️😍😂", "ch4rly07": "🤣🤣🤣 so many brainwashed", "noambue": "Fuck climaactivist 👎🏻", "andersonharvey9": "Bitch", "_i5aak_": "My fatass thought this was mitochondria", "giancarlom89": "Gente malata", "sdhwmaha": "China india america and all the big countries except some in Europe are shitting on your climate🤣🖕🏿🐀", "asher_flame_1": "So amazing wish I could have been there 😮", "ellie_macbelly": "Oh my god", "yzasan": "Ok, y mientras tanto en Barcelona están quemando contenedores repletos de basura y destrozando todo a su paso por una \"protesta\" estúpida y absurda!", "khalil_mit_der_galil": "So much insan diese pollution und puši beaccoup", "memdmabstract": "That's 500'000 people who no doubt didn't walk to the March. But probly drove ect. Think about that little girl. Your a child. Go be a child have fun do things Kids do. You only live once. Marching isn't helping the planet. We are cancer to the earth it is What it is. Let it be. Go live your life.", "lt.ethan.bo": "#thepeopleareawake", "segers.victor": "Mag ik u vriendelijk verzoeken kapot te vallen ????", "szybekalexandra": "Legend", "kevin_norbert08": "Nice", "derancourtjudith": "Greta, thank you for helping wake the sleeping giant that America is. ❤️🌄", "amundbentzen": "Awww, don't crap😍", "piotrjasica": "Maybe a large % of those 500k just want what the people they are angry at have. If we were really honest about making change then we to start sacrificing and giving up stuff seems just as hard for every generation. Instead of following a cause in numbers, a lot of these people need to follow their cause/s as individuals.", "lukas_kieroth": "#Forlifewithhiv", "christinaelisch": "Mycket modigt av dig att stå framför en dylik folkmängd. Även \"hetsiga\"spanjorer var imponerade av dig, Greta! 💥💖💃💃", "jack_blunk": "I support this but u do nothing about it just bitch and protest and fly plains and boats around the world to give speeches", "menanena_katya": "Politicians don’t care about the science, they care about money. They make their decisions based on what’s economically beneficial for their country. They will never change their mind until it’s too late. AND THAT’S ON MONEY.", "luis.bernhofer": "HOW DARE YOU??!??!??!😭😡", "kailanianncarlson": "Keep speaking. Keep educating.", "enrii_2024": "Viva España", "yadel_u": "Ich hoffe die menschhiet halbiert sich und die tiere bekommen wider ihr lebensraum", "chulitoomamii": "T meo loka", "dianenighswander": "🌟🌟🌟🌟🌟🌟🌟🌟", "bendyamomover": "BETTER SAID PEOPLE ARE WAKING UP TO YOUR BULLSHIT AGENDA!!! STOP THE LIES!! THEY MUST BE STOPPED AT ALL COST!!", "saretta1306_": "non si sono mai visti tanti coglioni insieme", "duarteleal2460": "People with plastic", "reuben_oag": "And why didn’t instead of marching you got them to plant a tree??", "idaojamal": "Inspirasjon❤️God Jul❤️", "lil_rat_king_": "I’ve seen more people line of up for Obama", "ivaaan.18__vdv": "A plantar arboles", "frikkyndead.inside": "only european kids are stupid as fuck and are fighting for their own death", "kunze.ok": "So stupid idea", "eonfe": "@jeniadett чисто подруга влилась в каталонский митинг с плакатом про океаны и черепах", "velosolaire": "Very beautifull ! You can see : Midi Libre Le passagerbdu soleil", "hansolsson1": "För ditt fina arbete vill jag tillägna dig en musik video speciellt komponerat till den underbara värld vi lever i - så skör och bräcklig - och ändå fortsätter förstörelsen. Jag är glad att det finns människor som du. https://www.youtube.com/watch?v=he1FCOSAGp0", "op.rem": "👏", "jamie_os10": "They’ve all been brainwashed", "markjasonwalker": "Carbon tax. Oh fuck no . Read a god damn book about money and how they turn this kinda kiddy crap into profits... SO DUMB", "charliegilluly": "Let’s go TRUMP!!!", "barsoca_jr": "Oye puerca por que no te bañas", "frases_indirectas.spain": "you know, just marching around isn’t going to change anything. just making posters or speaking non-stop isn’t going to change anything. to make the change people have to actually do something...", "joaqsal": "Craziest mosh pit ever doe", "sergio_valentini_": "👎", "_unterwelten_": "👏👏👏👏👍", "jariksons": "free my nigga tekashi69", "hazelgracebusbyfp": "I was in there! I live 7 hours far but I had and i will have time always for this", "imanhussain20": "🔥", "milehighclub9890": "💯🐾💕", "blo0bie": "lisbon", "kubiineecc": "Едрид Мадрид🤦🏽‍♂️", "just_a_brother_giving_love": "You have no science to back your claim. If you had of stayed in school you might know what natural science is and does.", "sophierecurve10": "Amazing 🤗❤️🌎", "s_x_p_x_i_x_": "Wie viel Müll die Leute dort will auf der Straße gemacht haben", "bajram.01_": "👍", "stopsatan_stopilluminati": "👈💪✊", "crisheinsius": "🙌🙌🙌🌸👍", "lydiam_orf": "😍🙌🙌🙌🙌🙌🙌🙌🙌", "veganstevenmusic": "iconic picture , changing the world 🌎", "darenshilt": "All bullshit propaganda", "edamutluoglu": "I WAS HERE!!! amazing", "cernoia": "DISGUSTING.", "perudor": "- Varför ljuger du så? Det fanns inte 500000., men 15000!!", "hermanbolling": "@maddebolling", "ariaman40": "I could hear you from my house", "joleen._.jrg": "Disgusting 🤮🤮", "chadmypadwack": "Crackpots United 😂😂😂😂😂😂", "sakinegurses": "👏👏👏", "jules19_lol": "I beat after that march the streets were littered with trash.", "paccolorenzo": "cazzo", "catherine_stonestreet_purcell": "I am a scientist and I call you out on your BS", "shantihl": "Who pays for Greta and her family to travel the world??", "bondiology": "@riley.whitelum I often wondered how much of world news you guys follow. Thought it must be nice to live in an ocean bubble. So was soooo stoked to hear you guys sailed @gretathunberg home!! Just love it when great people, inspirers, and goodness comes together. Awesome 🐨", "diducthat": "❤️", "sleepy_panda420": "This is amazing 🔥💚✊", "underground.aus": "Lol but the next day they probably drove to work", "bearded_kraken": "You burn more fuel traveling with your lies than the 500,000 people do!", "crrtianxx": "Viva franco", "cenyrasilva": "👏👏👏 isso aí Greta essa palavra é de mais para uma jovem lindaaa chamar você pirralha eu peço ajuda tirar esse presídente do poder.", "birgittaholmadurell": "There is hope", "ivvyychills": "You are impeccable 💚", "simmeeeeeet": "What did this achieve? Absolutely nothing.", "leo_luego_pienso": "👏👏👏👏🇨🇱", "g.pat": "Loosing votes its the only way politicians will listen", "unionderecha": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "rochelllezerbst": "Awakening @el.diablo.gazelle", "bestfriendbiscuit": "❤️❤️❤️", "winterpumpkinspice": "This is great!!! The more people the better! More people their is, the less the government can stand down & ignore this critical emergency", "simply.m.pr": "Wow 😍 Keep going to inspires the generation of change!", "webbstermalone": "500,000 communist", "erikamfoto": "@safarianna__ we were there!!", "wiseaudra": "We have to start a movement - NO SIGNS. Those signs end up in landfills. I reuse my signs and have reused my Trump pinata at various marches. I was saddened at the endless piles of signs after the Women's March here in LA. Maybe we put the messages on our t-shirts?", "owens.81": "🤡", "shuchismita9": "Congratulations Greta! I have a small poem for you,. Thank you Greta for the contributions you made, we will never let your contributions fade. For a teenager just like you,this is possible for a very few.You are a inspiration for millions , may your voice lead to a planet very new!", "morivimalba": "Dear Greta, Its not about marching, its about action. We need to take actions. Planting Trees is the best and the only idea to save the world.😊 Regards from India🇮🇳", "imoveisdeportugal.mf": "👏👏👏👏👏👏💪🍃", "caioal_10": "Go back to school kid, we need education to live, then in class, you will know that the green peace is wrong", "gunner_bliss": "Die cunt", "renswonink": "Boerennn", "j_anastasio352v": "Wonder how these people got there? Probably burning your “beloved” fossil fuels", "dejurf": "Ga dood", "_kasim2.0_": "🙌", "caitlinnn_grace": "Maybe it's just me not knowing much about this stuff, but imo there's nothing anyone can do about climate. You can't change nature and natural causes", "adriluciamar": "😍", "cinnamon.ttoast.crunch": "wow the definition of autism", "dalaimama13": "🌟🌟🌟🌟🌟", "tharianechar": "❤😊", "daisyyelms": "ok boomee", "andrewthromart": "You have more people here than he had at the paid for inauguration! You are force in the world and your persistence will have rewarding results! You are special.🌎", "eliceciliano": "👏🏻👏🏻", "jasonellingsen": "Those streetlights are using electricity. That’s bad please stop ruining the environment", "domvegano": "💚", "franciii2777777": "#FridaysforFuture", "vnbarb": "De preto só a roupa", "paty8261": "Ser emperador de si mismo es la primera condición para imperar sobre los demas", "kai_smith7": "No", "bencampbell_16": "We need to get this happening in Australia in the cities", "enza_bagni": "👍❣️🦋", "elisabethedenfotograf": "👏🏻👏🏻👏🏻❤️", "dunya3855": "Юхууууууу🔥🔥🔥🔥🔥", "hassehagman": "Jösses vad folk 😊", "herreraeduardorodriguez": "anda que pareses una marca comercial marioneta de circo", "dazaisenpai_osamu": "Oh my god guess what the world ISNT ending in 12 years THATS CRAZY.. 🤯🤯🤯🤯", "jojomartinezzz269": "@gretathunberg YOUR SCIENCE YOU PREACH SO MUCH IS FUNDED BY THE VERY SAME CORPORATIONS AND POWERFUL PEOPLE YOU HATE SO MUCH. YOU SEE CLIMATE CHANGE ITS ABOUT BRINGING CIVILIZATION TO STONE AGE AND CONTROL EVERY SINGLE HUMAN. AND YOU ARE SO NAIVE AND STUPID THAT FOLLOW IT LIKE A SHEEP", "jake_gies": "This is fake and u have no purpose on earth", "cesarramirez7992": "🤡🤡🤡🤡🤡", "miamirealtorchic": "Stronger together! 💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼 Thank you Greta! ♥️♥️♥️♥️♥️♥️♥️♥️♥️", "pha3ly": "You’re making such an amazing difference Greta❤️", "zehanat_quadri": "superb", "aranghanizada": "Madrid is a shit place they accept the climatestrike but don't accept the Catalan referendum", "anabernique": "💪🏽💪🏽💪🏽💪🏽💪🏽", "trishrbtrish": "💙🙏🏼🙏🏿🙏🏾🙏🏽🙏🏻🙏🌏This is so amazing!! Thank you God for this little girl making a difference to our world!!", "filippocrestan_": "Stuprata morente trans", "goral462": "Yesssssssssssssssssssssss lets Save the 🌎 God Bless all you people from every corner of World", "benn_nunan": "SKIIIIIIDS FOR GRETA", "griff_booton1206": "OK BOOMER", "ivo.wrld": "😍😍😍😍😍😍😍😍😍", "__lupita__serrano__": "🙏👏🙏🙏", "thomastansey123455": "I think I just fell asleep oh wait to sleep I have to be awake and I can’t wake up I’m watch Hong Chong protest not this shit", "edwinchezg": "What a joke 😂", "markus15524": "They prob threw trashs..", "shawn_kamps111": "We are not asleep we just know that what you are doing is stupid", "brasilresistente": "😂😂😂 falar MENOS coisas óbvias ? Fazer mais! 🇧🇷🇧🇷🇧🇷", "mac_flower.nd.yum": "@dups6996 🙌", "mila.cristal": "❤️", "sementesdegramado": "❤️", "jacksteinfort": "@rhyannonsmith", "v_fac3_1": "<Lo0ks lik3 s0me humAns ne3d t0 repAir th3 w0rlD iN wHich th3y liv3 iN/>", "mariepatrice3": "La folie humaine, suivre comme des moutons", "a_jollygoodtime_": "How dare", "fernandod.valenzuela": "Vergüenza que eso sea en mi ciudad", "thesummermama": "So proud to have had you here in Madrid 🙌🏻", "hamandmegs": "Hong Kong out performed your narcissism 10 fold. You’re a vapid, self indulgent zero. A skid mark is being generous.", "sandpaperwilly": "Lots of unemployed Spaniards with nothing to contribute🐑", "srg_ach1za": "Not only climate", "swampsnyper": "Do you know what’s hurting the planet? All these goddamn people crammed into one spot like Madrid. City dwellers are like a cancer on the planet. Do nothing but consume MASSIVE amounts of resources and land while producing MASSIVE amounts of waste. All these hypocritical city dwelling Liberal voting idiots are a scourge on the Earth and always will be no matter how many times they vote Liberal. Is normal people are tired of hearing these scumbags talk as if they have the moral high ground. #liberalhypocrisy", "setmatchpoint22019": "MOI, LA SCIENCE M'A EXPLIQUÉ QUE: A L'ÉPOQUE GLACIAL L'HOMME A TELLEMENT JETÉ DU PLASTIQUE PARTOUT ET QU'ON A JETÉ TELLEMENT DU CO2 DANS L'AIR QUE, LA GLACE A FONDU.", "huegerection": "Those 500,000 ppl all went home in their cars making the climate worse going about they’re daily lives not changing a thing just wanting to go on strike bc it looks cool and makes them seem like they believe in something ur fight is completely hopeless and stupid bc ur so young and don’t have to pay for shit I’m sure if u were all those adults out there who don’t care rn who have to pay taxes and take care of kids and families u wouldn’t be too worried ab climate change either bc what exactly can u do what are strikes doing everyone already knows ab climate change if ppl rlly cared they would have rlly done something ab it but they don’t sorry move on listen to trump bc he is actually smart when he talks", "alex.paul03": "It’s funny how 500,000 people let a 16 year old decide what to do with there lives. Your all a bunch of sheep waiting for food to be handed out to you. Grow up", "l.eriksson_": "@passartompa", "ohdosi": "Alles Hurensöhne. Werft Tränengas in die Mitte 🤡", "probert0628": "#weruntgecountry", "sudjad": "anything happening ? :) what's the use then ??", "jonathan_nash_": "🐳", "u1200k": "Det vore en bra början om de 500.000 demonstranterna ser över sin egen konsumtion för jag tror det är många sölpellar som gnäller på industrin och ändå köper deras produkter. Köper inte konsumenterna de saker som ej är klimatneutrala och hållbara så finns det ingen anledning att tillverka de sakerna.. 🙂", "moelmiarisback": "I didn’t know there were so many ignorants in Spain! Gosh!!", "callumbishop___": "Crazy 🤯", "charlottelochhead": "Marched with her in Vancouver & sang in the streets.What a rush", "agnesnoreng": "❤️", "flitboyfl": "❤❤", "fsvanalstine": "Wow that's a lot friction", "gato.jazz_": "Just PROUD of my city.", "abelladangerofficial1": "Credit : @Castro_Willi Sure and legit ...mine your bitcoin directly with the Antminer s9 . I have mine with him and I earned a lot", "_marky__mark__": "Clean up the trash please", "v___s___08": "Merhaba @gretathunberg her zaman @nazimhikmet tin dediği gibi “yaşamak bir ağaç gibi tek ve hür bir orman gibi kardeşçesine \"", "cannabisvarlden": "💚💚", "duda09clara15": "We love you", "jl2dr_slayer": "Look at all those tards", "aaronmavila": "You Fucking Europeans put a comma Inthe 500,000", "patriotcanuck": "Hahahahaha everyone knows you’re a globalist puppet!", "americanrightists": "Wonder how all those people got there. Couldn’t be by... by cars!?", "philipberkley": "Technically you build heat by all that movement. You are causing global worming, better not March anymore", "tellez.12_": "Maja pero no me liaria", "rafalevila": "I don ť like greta", "michael_71_72_": "What about the religion of it all? I have more trust in God than I do in science", "afcamarotti": "👏🏽👏🏽👏🏽👏🏽👏🏽❤️", "cristal.ny": "@lucasdtolentino", "robertasat3": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "weeb137": "What about the thousand women and children that are going to work for the electric cars you want to build? What about their futures?", "thiago_schoeffelp": "Europeu não tem nada pra fazer mesmo sksksksk os caras estragam o mundo e querem fazer greve pra ele melhorar", "nanut_veri": "👍", "avriil.98": "Proud of my country", "dikadandodica": "Você é uma enviada de Deus!", "__.guto.__": "VAGABUNDA", "luanneryribeiro": "💙🌎", "alexorpion": "Yo me quedé en casa", "mati.deva": "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷❤️❤️❤️❤️❤️❤️❤️👏👏👏👏👏👏👏👏", "joana_david_24": "Amizing🙌🤤🙏thank you", "smileysmigs": "@sammysponer were you there?", "jairohbonilla": "😍😍", "patito27575": "Wow amazing...cant wait to see south america more awake 💔🙏❤️", "sharondelevie": "🌎💚🌍", "imperialecharli": "Is no science", "shredthefrets": "Uhm they will too lol", "rufetrehmetov": "Duxun çatır gəl bu mitinqi Azərbaycanda elə😏", "maalteh": "*15.000 ☺️", "sad_boi_civic": "🤡🤡🤡🤡", "sagogalpa": "This was the walk for Real Madrid and not for you.", "alphawomanco": "You have single-handedly awoken them @gretathunberg 💪💪💪💪💪💪💪🙏🙏🙏🙏🙏🙏", "joaoanaruma": "@jvmnog por que você nao foi palhaço?", "ma_.rco_6": "You Van do amazing", "terral.mapas": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻😍😍😍😍😍😍😍😍😍", "mikefla_tenn": "🎪 Lunatic liberals", "gloriabrinkmann_9": "This girl is phänomenal 🙏🙏🙏", "sonaa.me": "Change has arrived 👍", "matthewwelchh": "🗿", "adeline_de_oliveira": "🇧🇷", "luisiba31": "Te crees en serio q haces algo por el mundo jajajajaja", "gypsy_lorii_": "We have trash washing up on the US shores!!! China is a huge polluter!!! We clean it comes back.. overpopulation is a huge problem. Too many people!!", "homes.annelise": "🙏", "casasanmiguelitoab": "#manifestacion 💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼", "jordanncoee": "This does nothing", "nauraaparecida": "💗🙋🙏🙏🏽🙏🏽🙏🏽", "choosetheplanet": "So proud 💪💚", "patriciacostaa._": "👏👏", "carolcaliari": "💩💩💩💩💩💩💩💩💩💩💩", "beachboyfootball": "Just go home and stop crying like a 4 year old to politicians", "an_son.hk": "🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️", "ismailonaraujo": "Pirralha", "hewasmurdered": "𝕁𝕖𝕗𝕗𝕣𝕖𝕪 𝔼𝕡𝕤𝕥𝕖𝕚𝕟 𝕕𝕚𝕕 𝕟𝕠𝕥 𝕔𝕠𝕞𝕞𝕚𝕥 𝕤𝕦𝕚𝕔𝕚𝕕𝕖‼️⚠️", "traute_lust": "Go Greta go! 👍", "kauazim_45": "Bitch", "rochavivi23": "👏👏👏👏❤️❤️", "_chueyee_": "🤡🤡🤡🤡🤡", "chinyu_tc": "❤️❤️❤️", "katemariecarter": "@nikolodeon", "purpletuna_eeo1": "💙", "mariateresavinhas90": "Ridícula", "_bbbboooommm_": "come to TURKEY", "kacar00s": "Bi git lan", "renatadamaceno": "❤️", "marlizedass": "Amazing!!!! 🙏✨🌎", "dhemissongaldino": "SOMOS TODOS PIRRALHOS!❤️🇧🇷", "tariahbaldry": "Seriously a bunch of brainwashed cult followers being absolutely lied to about climate change. The scariest part is these morons think they're 100% correct. Fuckin kids will be proven wrong eventually, but only after they are psychologically damaged from all the dumb ass drama they have created for themselves. #fridaysforbrainwashedmorons #climatelies #getyourfactsright #illinformedchildren #gretaisfarfromanexpert #sciencewillprovebrainwashedkidswrong", "mimmi.larsson.77312": "❤️", "aldinhahnrtz": "Ah,, se \"gente grande\" tivesse a visão dessa \"pirralha\"!!! Rogo a Deus que essa nova geração segure as rédeas do futuro. Essa \"pirralha\" me representa, me enche de alegria, orgulho e esperança!!! Quando o adulto perde a sua criança, perde sua essência... Aldinha", "fidi_widi": "Grita tu verga", "elizabarreto__": "TKS Greta!!! Love u 💛💚🇧🇷", "marjoriespires": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼🙏🏼💛", "valdirenerodriguesleite": "Vem pro Brasil🇧🇷 aqui as pessoas estão precisando ter consciência ambiental. 😘", "sinistrosalles": "Não da nem um por cada árvore que tirei na Amazônia", "iracifh": "Uauuuuu❤😍🙏", "kellychildsxo": "My God. We are awake. There is hope. 🙏🏻 We have reached the critical point of collective consciousness to stop the greed, the lies, the pummeling of our Earth.", "redhandedjill": "💗", "iamliamlarsson": "Why do wastes time?", "strother.3": "High school dropouts are the best", "ein_account_lol_": "🙄", "brikiwik": "all these people supporting the use of coal, i am proud", "akaminipasa": "Do acts like clean and plant trees and not manifestations!", "volchebyque": "El cambio climático que hay que hacer es dejar de agredir a la especie humana y a la naturaleza bajo el sistema capitalista. El clima capitalista es ruidoso y sucio. Y apesta. Ese es el cambio climático que hay que hacer. Apoyemos el cambio climático. El cambio contra la alteración acelerada que desde la industrialización capitalista está alienando y entristeciendo a la humanidad y al planeta, para lucro y egoísmo de una élite minoritaria, cobarde e inhumana. Javi Gómez Jiménez The climate change that must be done is to stop assaulting the human species and nature under the capitalist system. The capitalist climate is loud and dirty. And it stinks. That is the climate change that needs to be done. Let's support climate change. The change against the accelerated alteration that since the capitalist industrialization is alienating and saddening humanity and the planet, for profit and selfishness of a minority elite, cowardly and inhuman. Javi Gómez Jiménez", "phil_doglet": "Kör hårt Greta! 👏👏👏", "i__akash_137": "greay", "margie_097": "Vai ragazza sei tutti noi!❤️", "gabriel.marin.castro": "❤️❤️", "desautelsnadine": "❤️", "luanafr_s": "Pirralha !", "e_sinclair__": "Rip juice wrld 😐😐😐", "haroldskogsberg": "Congrats Greta!👏", "seanrogers555": "Puppet", "aluparisi": "so sorry for the stupidity said by the sitting president of my country. he does not represent the thoughts of all of the brazilian population. stay strong 👊🏾 your fight is of utter relevances", "adeyemiemmanuel.a": "Good day earthly friendly, i want to use this medium to share my innovation with plastic wastes in my region . Few months back, I pondered about how our daily lives could reflect and contribute to the reduction of plastic wastes, plastics which is now a global threat to humanity . Through the outcome of my thoughts and creativity, I have created a concept of  fashion line that incorporates an awareness of the condition of our eco system with a trending mood of dressing that mirrors a “ready to go” , “on guard”  outfit appearance. With this innovation and your support, everyone could be an advocate of a plastic free planet.", "davidnavetu": "The best cars are the diesel cars. Inculta", "copperpot6439": "Hoax", "2001philip": "How dare you?🤒", "normasemprenorma": "#tmbsoupirralha", "same_same_tre": "Talk about extortion!!! Who r her parents???", "lisa_enarsson": "Tack för allt jobb du gör och allt bra du säger! När och var ska du prata idag?", "erikjanvankleef": "Thank you because of your hysterical actions our economy is going down the hill 🤮🤮🤮", "juancaa.23": "Hija de la gran puta", "marcelo.elopes": "Why don't you go to communist countries to protest? Very easy when a company sponsors your travels for you. Brazil was 16 years presided by bandits(Lula and Dilma Rousseff) and now we have a good president(Bolsonaro🇧🇷), so stop criticizing Brazil. Pirralha.", "workoutandeat4": "How dare you 🤣", "olgunsezerr": "KeSkE AmiNI siQsEM", "michaelschoettle_": "?", "_joelmcmanus": "Well actually if you were a true environmentalist you wouldn’t be using your phone seeing as it needs electricity to charge and making electricity is bad for the environment", "fernandodejesusoficial": "Pirralha 🇧🇷", "fcesarcrf": "Congratulacions for your fight my dear Pirralha!", "lilivigui": "Pirralha!", "maximiliano_2j45": "Mocosa", "malu_lins": "Rainha ❤️", "averdadesincerity": "👏🏻👏🏻👏🏻👏🏻👏🏻", "michael_mayol_a": "This is bullshit", "yoli_livehealthy": "You made it just in time!! 🙌🏽🙌🏽 #fridaysforfuture", "ayreau": "Ok boomer", "bobbybarber89": "You're amazing, and most Brazilians don't agree with what this worm says. Brazil's president looks like a quarrelsome four-year-old boy ... he doesn't represent me.", "diegofelix.89": "PIRRALHA😂", "marjorie.vogel.7": "May I suggest passing the mic to these intrepid activists? https://www.cbc.ca/news/indigenous/first-nations-youth-oilsands-madrid-cop25-1.5389633", "truemape": "VELETT", "macorn.ly": "Du bist 15 und willst der Welt über klima erzählen willst du uns verarschen alter die Welt lebt milarden Jahre und du willst erzählen das du sie retten willst alter hast du schon mal an das Wasser gedacht wir werden alle sterben wegen dir weil es kein Wasser mehr gibt du kann mich am A*****Loch lecken. Du hast nicht mal richtig Ahnung du scheiss miss***urt wenn du anders leben willst dann vergab dich meine fresse💔😠😠😡😡😡😡😡😡🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬", "nikesophxe.486": "@annschy_ Was macht Laura in Madrid😂", "robson_ferrazfilho": "Pirralha", "nicklas.w_112": "How dare you", "vinifmmagalhaes": "Sugestão: vai andar com algum caminhoneiros no Maranhão para ver quantos pedágios clandestinos de índio você irá passar.", "fosterx01": "Pirralha", "rory_oconnorr": "🤡🤡🤡", "xuunim": "@jairmessiasbolsonaro ela é foda! Não faça o nosso Brasil passar vergonha pela sua falta de educação! Obrigado!", "eniompjr": "Pirralha.", "bren.english": "Yeahhhh, love your header! You are such a pirralha, lol! Not. 🙄😁", "gavrelvon": "Eae pirralha! Tá boa ?", "ehsan19861986": "go on", "davidbegno": "You're an absolute idiot", "vitavelnex": "Go to school little girl", "gatolik": "https://youtu.be/RSBZMYxYyFU: Greta's last speech.", "globaltreeproject": "1 follow = 1 tree planted 🌳", "darcyfeet7": "🔴🔴 HELP...BRASIL...GO BOLSONARO...", "gcfnoir": "destruiram meus sonhos oh 😭😭😭", "matheus.gui10": "#Bolsonaro2022 🇧🇷🇧🇷❤️", "_gheebuttersnaps_": "don’t care gang", "malachib_": "Brat", "leandrocleitee": "Qual a capital da Bélgica, não sabe né? Tá faltando aula demais.", "junior.medeiros803": "#gretapirralha tamo junto @jairmessiasbolsonaro", "andrew_silvia": "I read this in your voice", "maryhiggs": "Thank you ♥️ 🇧🇷", "gglunardi": "Pirralha..😂😂", "ethan_caudill69": "I purposely smoke and let my heat run in my car to spread pollution dumb bitch🤡🤡", "fabianarkabral": "Pirralha", "annddresa": "😍💙", "cbatella06": "Pirralha.", "rafconde": "Estamos com você Greta ❤️🇧🇷", "josafajrchokinho": "Pirralha 😂😂😂😂🇧🇷🇧🇷🇧🇷", "carlao_dutra": "Pirralha😂😂😂🇧🇷🇧🇷", "diego_gentill": "😂😂", "rafparruda": "💓💓💓", "julielavina": "PIRRALHA RIDÍCULA", "paulinho_sgarbi": "Pirralha 🤣", "israelkiatcoski": "Pirralha", "moosesweden": "Fantastiskt ❤️❤️❤️❤️❤️", "emmanuelvera._.03": "Science was man made", "analuhoro": "#impeachmentbolsonaro Help Brazil!!!!!!!", "oheyrick": "GIGANTE 😍❤️", "juaomzinhu": "🇧🇷", "lissescovaexpress": "Brasil acima de tudo, Deus acima de todos 🇧🇷🇧🇷🇧🇷🇧🇷", "analufl": "WE SUPPORT YOU!!! BRAZIL 🇧🇷💛💚", "kaleucarlo": "👏👏👏", "jaaview": "I love u pirralha 🤠❤️", "aaron_jamesneto": "Olá Greta você é muito pirralha, achando que sabe algo sobre meio ambiente, vai cuidar da sua mamadeira que está vazando!!", "cesarmatucheski": "👏👏👏👏👏👏👏👏👏👏", "lhjacobmalta": "Tomou um esculacho do Bolso 😂😂😂😂😂 vai trocar sua fralda Pirralha!", "the_conservative_closet": "Climate change is the most genius hoax ever created. Best money making business ever, wish I thought of it... darn you Al Gore! 🤡", "carolina.guerrero.g": "Bella, gracias! 🙏😘", "james_andradre": "Respect to Brazil @gretathunberg 🇧🇷👎👎👎", "adi_lalith": "#metoo", "johanndobsai": "🌍🌎🌏", "alinepereira.debarros": "Piralha 😂😂😂😂😂", "brunohead_": "Marionete 😂😂😂", "cristianonascimento1": "Nutelinha 🤣👉🇧🇷", "mateusgoncalves_o": "Pirralha👏💓", "dxveyphantom": "Maybe you should go to countries that actually contribute to the worlds carbon issues, such as China, India the Middle East etc. Countries without effort or technology to do better environmentally. You’re a joke. Get up and do something and stop preaching to nations that are at the fore front of combatting climate change", "nilsbalm": "Stop, Little Puppet #BOLSONARO2022", "lukete.e": "pirralha", "pietrodaluz08": "Pirralha", "hugocipriano": "A tal da marionete", "nale.oliveira": "Go to China! USA, your country! In Brazil, you don't have space! You don't understand anything about Indians! Go back to school!", "trulylaker": "Your mentally ill", "mrnascimentoandre": "Pirralha", "drikstew": "👏👏👏👏", "cowboyup_passarinho": "🤮🤮🤮🤮🤮🤮🤮", "realmarcellocm": "E aí pirralha, quanto o George soros paga pra vc bancar de paladino da ecologia?", "blake_mcleod._": "Lisben", "amadeugomes2": "queria vê ela disputar geopolítica comigo, tenho dó", "sandromkturismo": "Pirralha ❤️❤️❤️❤️❤️", "jpfarias2014": "Lixo", "billsponsor": "😀", "rafaelcrosscg": "Marionete de comunistas, a china que polui a porra toda você não fala nada né pirralha.", "mayrealnatamind": "@gretathunberg @alicebraga_oficial @charlizeafrica @nicolekidman @margotrobbie @sleepinthegardn ; @gretathunberg hey lil Cousin/Fam; you’re okay; is there anything you needing before you arrive back home in Sweden also to celebrate Eco Christmas! You underway to MY ALSO Country #Switzerland; to then to MY ALSO Country #Germany to then finally arrive safely in Our Country city #Malmo #Sweden to the to your parents in #Sweden! Endulge bit Swiss hospitality ; before you return back home!Your Cousin/Fam; SPONSOR #MAYRILVABREGITHAWALLÉ #ARR", "yancafonseca_": "Conte comigo pra tudo, pirralha ❤️", "jrbrgs": "Heil Greta✋", "renanservulo": "🇧🇷💛💚", "larsthehumble": "The CO2 emission of your clothing  60% of all clothing that is developed is produced in developing countries. All the clothing produced there is transported by boat. These cargo ships are very polluting and there is little regulation about what these ships are allowed to emit. In addition to CO₂ emissions, other toxic substances are also emitted, which leads to increasingly poor health of people in adjacent coastal areas. CO₂ is also emitted during the production of clothing. This happens in the factories where the clothing is produced, and if the materials are made from an animal then they also emit CO2. After you bought the clothing you also need to wash and maintain the clothing, this also costs CO2.  All this CO2 emission comes down to an average of 1 ton of CO2 per person a year. To put this in perspective, an average Briton emits 1.49 tons CO2 a year for heating and 1.39 ton CO2 for food. So there is a lot to win when it comes to clothing!", "lyalves3114": "Pirralha mimada 😍😂😂😂", "liebs138": "Why dont you go back to school and enjoy being a kid. You are not educated in how the world works and are just a pawn to some very powerful people.", "ofc_guilhermeparana": "Coitada dela", "eu_rafaprado": "❤️🇧🇷", "jonesmachadobr": "Viva os pirralhos!!⭐💛👏🌞", "alanroque": "Thank you. 🇧🇷", "maikymoreira": "🇧🇷🇧🇷", "girlkio": "Pirralha mesmo idiot🖕🖕🖕", "theoalvesperfil": "LovU PIRRALHA!! 👏🏼♥️", "logan__medina": "How was your childhood stolen??!", "ma_acmmm": "Pirralha e marionete!!! #eusoubolsonaro #bolsonaro2022 🇧🇷", "freddymike_175_": "Pirralha", "issapatricia": "👏🏼👏🏼👏🏼👏🏼👏🏼 🌱", "hgs02072016": "🇧🇷", "worldrecord.babyyoda": "Hey! I’m a student who is making a project about global warming and how to prevent it!! So do you guys mind dropping me a follow? That would make my day 😁", "blacklivesshouldmatter": "Look at those carbon producing humans blowing more carbon into the air to support a hoax their low IQ brain can’t understand", "izaaaramos": "sorry for having such a hypocritical president in Brazil, you're not a brat, you deserve the world! 🙏", "duduxdx": "Perdoa nosso presidente Bolsonaro, ele é uma pessoa muito estúpida.", "zilda_taddei": "Amo voce❤️❤️❤️ love you", "nayra_fraga": "Pirralha mimada!", "marcosfernandesaguiar": "Pirralha tem muita criança morrendo no mundo mais q se foda certo!!!", "andersom_lemos": "PIRALHAaaaaaaaaaaaaaaaaa", "citizen_wrong_think": "Climate Goblin is a better fit", "arab_mike_84": "Pirralha 🇧🇷 Go Bolsonaro!", "saavedraligia": "Por favor, nos perdoe pela grosseria do Presidente do Brasil! Ele não é maioria por aqui e não me representa.🙄", "david_afonso7": "🤮🤮🤮🤮🤮", "gilsaovilares": "Perdão !!! Bozo e seus beócios seguidores são legítimos apedeutas...", "lefty_business8187": "Dont let this girl do drugs", "adriana_pierin": "Que vergonha do comentarista da @tvcultura sobre a greta. Que vergonha. #tvculturavergonha #jornaldacultura uma midia que não se posiciona contra o agronegócio lógico que não entende.nada de meio ambiente e ativismo!!!! vcs são patéticos.", "titatity": "#lutecomoumapirralha", "wanyaalmeida": "😝😝😝😝", "chaudondaniel": "The best PIRRALHA of the world!!! 🙌🏼♥️🙌🏼", "vaniacleonice": "Uma pirralha com mente GIGANTE, HUMILHANDO um adulto com cabeça de...", "morrowdjproducer": "💓💓💓💓", "eng_bruno85": "Pirralha", "inmayastrid": "VIVA GRETA!! MADRID LOVES YOU!!!", "rmoraes89": "#bolsonaro2022", "willschweinsteiger": "Estudar que é bom nada né?", "aldofontes": "Pirralha", "alinelinescotti": "Maravilhosa você, cheguei pra te apoiar! 😍", "lucasvssilvaaa": "❤️🇧🇷", "sofyacristiny": "Musa", "edsoncarmo_": "Pirralha😂😂😂😂😂😂😂😂😂😂😂😂😂😂🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "chriskellen12301": "Essa piralha como ele disse, está lutando pelo bem do planeta e para o nosso bem ao mesmo tempo💓💓💓💓", "cidagregoriosantos": "Australia 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥and nobody says anything 😡😡😡😡", "tomlorenzetti": "Fuck you brat 🖕🏻🖕🏻🖕🏻🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "zelda_dan": "We love you!", "ricosblues": "Te sigo porque en realidad te admiro, Bolsonaro hijo de mil putas!!!!!! Basura", "j0nantha": "I love a \"pirralha\" ❤❤❤❤ fire on bolsonaro", "vangellis_hv": "BOLSONARO 2022 🇧🇷💥", "jaimeamanzano": "Vete al colegio anda, o ponte a plantar árboles niña rica de mamá", "emagasichg": "Vali mierda", "gabrielcostarios_": "Pirralha 👍", "viniciusbittencourt__": "Roubaram a infância da menina que só anda vigiando kk MDS chega a ser cômico", "nandamelina": "You are the best \"pirralha\" in the word!!! 👏👏❤💪🍃", "henrique_eloy_": "PIRRALHA", "misobocinski": "Pirralha", "ocarloseduu": "How I wish is there supporting you. I admire you ❤️", "jeancesarpasquini": "Piralhenta. Menina chata do cacete. Porque você não vem morar no meio da Selva Amazônia, seria uma boa para você fazer um MBA para posterior falar em meio Ambiente. Sabe nada inocente", "studiogueualkimim": "Pirralha", "vivyanhurmez": "@feroebraheem", "m.curess": "The people are dumb", "tacyana.amorim": "Vem ser presidente no Brasil, estamos carente de gente inteligente e séria.", "___matthewss": "Somos pirralhos!😍", "andreasouzafernandesmendes": "❤️❤️❤️❤️", "adryelcepellos10": "Vai otaria", "kaue_mendz": "Uma boa vista", "priscila.roland": "Huge hug from Brazil! 💚🌳🌿", "gerin.f": "👏🏻👏🏻👏🏻👏🏻👏🏻", "thiagorealoficial": "Pirralha. Kkkk", "almirmachado10": "greta, where were you when the forests of Australia were on fire? Where were you when the oil spill happened on the Brazilian coast?  hypocrite financed by Geroge Soros, the people of Brazil do not have swallows.", "faupeters": "Pirallha marionete", "kaii1118": "🖕🖕🖕", "ro_kapifiribee": "É pirralha mesmo que não sabe o que fala hahahahahah", "lindboss": "Over 80% of the plastics in our oceans and seas come from three rivers in two countries, India 🇮🇳 and China 🇨🇳. Let that sink in for a moment. This child is a fraud with an outrage based on no facts. Shame on her and the left politicians for using a confused, overprivileged little girl to push their agenda.", "sabrinnamunhoz": "💕🇧🇷💕", "x_.noemi._miss._x": "Wow very much people", "deisy_ane16": "É isso aí Greta segue em frente você é maravilhosa e pode saber o presidente Bolsonaro não representa a nação brasileira, nos te amamos e admiramos", "nonikursch": "O gado tá nervoso.", "marcia_cris1": "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷 Dear Greta, I am so sorry for our President's ignorance. Unfortunately he represents us, but we do not share his ideologies, his attitudes, his rudeness. Pray for us Brazilians and stay firm on this mission, because despite your 16 years, you have more to teach than the illustrious President. Be with God! A big hug! 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "mimis_milena": "Piralha👊💛💚", "anayrpcgmailcom": "Ei PIRRALHA, cresce primeiro pra poder querer se envolver com gente grande!!! PIRRALHA FEDELHA!!!!🤣🤣🤣🤣🤣🤣🤣😂😂😂😂😂😂😂😂😂😂😂😂", "telma.fonseca": "@gretathunberg vc é Brasileira? 🇧🇷", "liananunes1": "16 years old and has done much more than the current president of Brazil in 30 years of politics", "jgbr02": "I'm from Brazil... I like you! !!! 👏👏👏👏👊👊", "miryanmoodie": "Sending good vibes to you @gretathunberg from Japan!!!", "manuelagenicio": "🇧🇷🇧🇷🇧🇷🇧🇷", "adrielson_batt": "You are spectacular,@gretathunberg ❤️", "c.sousa.xp": "we need to save the planet .", "danksuperheadmemes": "If you want to have a good time while waiting for a change. I can offer some memes", "badgalnuzi": "♥️", "ingridbennemann": "Greta,💚💪🇧🇷", "fadsimoura": "Pirralha marioneta marxista kkkkk talkey", "mudecoworkingeselfstorage": "👏👏👏👏❤️🙏", "carlosrossi60": "just have speech, do nothing effectively to improve the environment, pirralha.", "angelicalouisee": "Pirralha amada no BR 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "lauretelaurentino": "🌷🌷🌷", "camila_aprado11": "Pirralha ❤️❤️", "gueba.silva05": "Oh a mina debochou do Bolsonaro namoral kkkkkk", "rosy_moreira2": "Você é sensacional!", "tigra_guanabara_guepa_ventura": "🇧🇷🗣️ 📢 Do not come to Brazil! You are not welcome! #Pirralha ✊😠", "victor_deassis": "_!_", "romkauan": "Brazil loves you ❤️🇧🇷", "alinemdrs.s": "\"Pirralha\", Brasil loves you. Sorry for that crappy idiot and keep on making fun of him, that's the best he can get 🇧🇷❤️", "mateus.sestari": "pirralha you are light ♡🇧🇷", "marirochacamargo": "Pirralha.........😂😂😂😂", "matheus_sk17": "Pirralha fuck you", "jana__costa": "@gretathunberg você é gigante, Parabéns. #ninguemsoltaamãodeninguem ❤️🇧🇷✊🏼", "juliano_.borges": "Take care of your country your brat.🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "filipemedeiros13": "Pirralha ❤️", "noelma_nascimento_": "👏👏👏💚💚💚Parabéns por tudo \"pirralha\" o planeta agradece...", "adrivescovi": "😄", "tulaclayton": "talking is easy .... you do not have to talk, you are manipulated by cretins ... Indians are not saints, you do not know anything ... in Brazil always had burned ... many by ong bunch of vagabumdos .. .", "lachesismuta.oficial": "Pirralha. Pirralho. Pode ser descrito como metido. ..", "lu__a_pereira": "👏🏾👏🏾👏🏾❤️🇧🇷 Sorry! The president Bolsonaro is stupid !", "juniormartins248": "pirralha 😂😂😂", "eliastrindad": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "madeludevieira": "Parabéns, \"pirralha\". O ídolo de barro nao entende nada de meio ambiente.Sucesso para voce.", "meyrecarvalhofranchi": "Você não representa o Brasil. Nem sabe o que a gente significa. Infelizmente seus pais te tiraram da escola em benefício próprio😮😮", "lueidiax": "Presidente \" vergonha\"!🤦", "paularobertavasc": "😂😂", "bianchinijoseaugusto": "I love you..... From Brazil", "oseiasemerick": "Brava", "maarcelo_bastos": "P I R R A L H A", "drzanini": "🇧🇷🇧🇷❤️❤️❤️", "danizinhachaves": "Pirralha!!!", "natan_d2m": "Vai trabalhar menina.", "marcelotedim": "Pirralha babaca... só quer aparecer!!!", "riobrasil_oficial": "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "pedrobatera022": "Pirralha 😂😂😂🇧🇷", "ghustmaldonad": "Estamos juntos 🖤", "leidna_vieira": "Piralha 😂😂", "apsalviano": "grow up and appear🤦‍♀️", "logannfortierr": "Go to school", "desouzamichellealves": "Pirralha!", "neto_santus_": "Pirralha capitalista, a serviço d...", "filipe_frh": "Sabe de nada inocente 😂", "ffatima.pereiraa": "Pirralha jamais, está mais que certa. Aliás obrigada por usar a sua palavra para falar o que muitos brasileiros não falam, e sim apenas se calam!.🇧🇷♥️🙌", "valdeciineto": "Hi pirralha, 💣🇧🇷💣", "rahiim.k": "How dare you!!😂👌🏻", "glacieneafonsooliveira": "Não estuda não!", "roseli.mtz65": "Pirralha !!! 🇧🇷🇧🇷🇧🇷", "ivanet0": "Va-Ga-Bun-Da vai estudar desgraça", "_gioannitassoni": "PIRRALHA", "ritabeatrizreal": "EU TE AMOOOOOOO GAROTAAAA🇧🇷🇧🇷🇧🇷", "lucas08b12": "Pirralha", "alexsandrodiego15": "💙", "cacorox": "Pirralha 😂😂", "matheused": "STOP TALKING SHIT, kid...", "brittojpkilmore": "🌎 my diva 💚💚💚💚💚👏👏👏", "baarbaraguerra": "🙏🏽💚🇧🇷", "lucasgirardellol": "VAI ESTUDAR MENINA, DEIXA O BRASIL EM PAZ 🇧🇷", "thallesr8": "Fuck you mentally ill", "mahsun.uc": "How dare you", "memelord196969": "Climate change isn't real lol XD 6969 666999", "jtattoo8": "Enquanto o presidente jair bolsonaro apóia ditadura,tem um dos filhos investigado por corrupção e facilita a posse de armas para os caçadores aqui no brasil que matam animais silvestres que estão em extinção, à greta corre o mundo em defesa do meio ambiente,greta você tem apoio das pessoas inteligentes que existem no brasil, quem não te apóia com certeza é contra a natureza 👏👏👏👏👏👏👏", "lucasfester": "Fett!", "javiperez.14": "Tu lo q no tienes es ganas d estudiar", "monicamodesto.e": "Rainha😍MAIS MADURA E SENSATA QUE O VELHO IMUNDO QUE SE DIZ presidente do Brasil", "felipearcuri": "Pirralha!!!!💩💩💩", "v3_ma": "🇧🇷", "edsonpazoficial": "Discutir de forma sadia e sempre bem vindo 👏👏", "patriciabassad": "👏🏻👏🏻👏🏻👏🏻❤️❤️❤️❤️", "thomaslint0": "Pirralha", "biankabozzi": "@gretathunberg Brazil love you! You're incredible. Thanks for all!", "joaolorenzini": "Fantoche", "alcyrsouza1": "Guardando alguns ovos podres pra quando essa pirralha que não sabe nem limpar a bunda vier pro Brasil encher o saco....", "wagnerpteodoro": "\"science\" HAHAHAHAHA", "zipzuppizops": "Brazil loves you", "ab.msr": "I love you, Pirralha! 💚", "stellamtavares": "Sai pirralha", "kenner_tt": "A #pirralha mais competente que conheço!!! De um coração generoso e bondoso!! Gratidão por lutar pelo nosso mundo. Desejo muita luz pra vencer todos os desafios!!!! Te admiro.", "marcusvgd1": "Pirralha", "crazy_man_12222": "How are you going to say your childhood was stolen when you live in a first world country with nice things and there are kids in Africa having to do hard manual labor while you skip school and yell at people to change the weather for you", "brunaferreira.blog": "Brazil is also with you ♥️ our president @jairmessiasbolsonaro doesn't represent us.", "elianeavolio11": "👏👏👏 Yes Greta!.🆙🆒❤", "audriuskaz": "Get back to school", "mmartinssm": "Your are the best pirralha in the world! ❤️", "lipaoh9": "🚀🚀🚀", "hugooluizz": "Pirralha", "clarisse_machado": "Pirralha mesmo", "jose_geraldo0o": "PIRRALHA", "tio_patinhas2002": "A menina vá tomar no cu", "monica.a.r.m": "🇧🇷 Salve a Amazônia. Presidente louco quer q Índios morram para dar terras para empresários. Índios estão sendo assassinados. Floresta sendo queimadas.", "bigbo_otyboy": "Faggot", "ederr_backstage": "Inventando números kkkkkk", "heywood_claxton": "i love this moment it means so much❤️❤️❤️❤️❤️", "poetnsen": "Always again a: wow! 👍😊 We will make it, lets go! 😁👌", "aurora_gomezcuetara": "I was there!", "run_schimi": "The superpopulation is in China and India", "dokedoyle": ". . . go back to school @gretathunberg", "sam_brenard_": "At some point, it’s not a climate strike. It’s a high school drop out trying to justify dropping out.", "arantesadriano": "Great news. Go “pirralha”. We love your work.", "maurelimdr": "👏👏👏👏", "psychxkz": "Which sciencie? A corrupt entity aka IPCC makes a hypothesis without evidence to prove it, when experts, not fakers like you denies SCIENTIFICALLY your hoax? Poor sheeps following a kid without arguments, that's the society we really live in", "liliancmpos": "🇧🇷🇧🇷🇧🇷. ❤️❤️❤️❤️❤️", "abstractisneverexact": "Yes but was it 500k vegans or ? That is the question", "el_lord45": "Vete a t país anda vete a estudiar y dejad d tonterias", "lucasluanduraes": "We Are pirralhas 🇧🇷😍", "aleksandro_reis": "Sorry Greta. The president of my country is a fool.", "jose6x3": "This whit franco dont hapend", "akermanmonica": "Pirralha", "kelly.cris_": "We Love You in Brazil, “pirralha”! ❤️ #weareallpirralha #savetheworld 💙", "maaatt_22": "No", "clowndioeduardogulla": "Pirralha do nosso💕💕💕", "davidgonzalez_cupra": "Mientras unos se manifestan yo voy cambiando al corte 😂 así contraresta", "jacob.ziolkowski": "Idiot", "luciagaldocamelier": "Great Job Greta! Hope you can come to Rio, you are very welcome! ❤️🇧🇷", "semmokhalil": "I hope next time u're on a boat it sinks.", "fernandocanavezes": "Brat", "fer_gregorio": "Desculpa a ignorância do nosso \"presidente\"", "bernardoboris38": "come to brazil plz, because everyone is going to call you pirralha besides bolsonaro", "marianakotscho": "#somostodosgreta", "walberthll": "💛", "pablopalumbo_artibiza": "👎", "fernandabouchardet": "#weloveyou #brasiliansAgainstBolsonaro", "claudiaberkhout": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "as_donas_de_casa": "Pirralha", "marcellonevares": "PIRRALHA", "rodriguesadm88": "🖕🖕🖕🖕🖕", "alegsorato": "#gretapirralha", "sousadgb1": "Thank u! From 🇧🇷", "svitoriarocha": "💚", "leouxhoa": "Rainha!", "salbat0209_no": "Al gulag", "kevincsantana": "PIRRALHA!!!", "voitionisback": "Denize izmarit atmayın la", "jjavivz": "Piralha", "saitdemir262": "heil hitler", "brenoulian": "Pirralha", "celestescapol": "Nosso Excelentíssimo Presidente Jair Messias Bolsonaro!!Definiu a palavra PIRRALHA segue algumas palavras que definem:FORTE!!CONSCIENTE!!GUERREIRA!!INFLUENTE!!PRESENTE E FUTURO !!PUREZA!! INOCÊNCIA !!INTELIGENTE!!E VENCEDORA!!Desejo que TODOS NÓS SEJAMOS PIRRALHAS E PIRRALHOS como GRETA HUNBERG!!EU ME CONSIDERO PIRRALHA E VOCÊ??Sem mais!!", "tars_3001": "Love you from Brazil", "xgabijax": "Amazing work and achievement hope we can all come together to fight climate change 🌍❤️", "marcos_almeives": "Do you think people are dumb to see that your speech doesn't sell! #GRETAPIRRALHA", "heyandersonferreira": "🇧🇷", "solkuroda": "@azucastrot este es 2 🔥", "luisar__": "Obrigada por mostrar ao Brasil quem é a “pirralha” da história. Love uu", "reagle2373": "Hello. Ms. Greta. I support your activities, but one suggestion from me. In recent years, eco-fur has become popular worldwide. I think eco-fur is one of the causes of environmental pollution. Eco-fur is a material derived from plastic. Many people don't think about the environment after the real fur is abolished from the viewpoint of animal welfare. Animal protection is important, but eco-fur is also hurting animals. I would be pleased if you could make a statement about eco-fur. Sorry for the sudden contact and I am very sorry. We will continue to support our activities. Please do your best.", "txtbruno": "❤️❤️❤️❤️❤️❤️", "bowhunter0162": "Just STFU", "marveltman": "We love you, pirralha 🙏🤩👏👏🤘", "filcyrne": "We all are \"pirralha\" w/ u, Greta. 💜 (That guy don't represent us, ok?)", "sirleneasxsilva": "THE MOST ADORABLE “pirralha” OF THE WORLD!!! LOVE YOU! DON’T HEAR #JairBolsonaro, BRAZIL’S PRESIDENT. HE HAS PROBLEMS 💩💩💩", "raphaelvieirabh": "Pirralha hahahahahahaha @jairmessiasbolsonaro você é o caraaaaa", "wanessa_via": "Go girl 👏", "carolscia": "You are doing an amazing job! Keep going! Our dear \"pirralha\"! 😘 🙏🙏🙏 Thank you so much for the suport and courage! 🇧🇷", "_santi_gutierrez": "Un asaito ? @joaco_pobletea", "rnanati": "Pirralha end idiots", "j4vis4inz_": "Apaño al asao", "_gabriellinhares_": "You're amazing!!!! Bolsonaro is a dumb!!!!! @jairmessiasbolsonaro", "marcopereez": "niña al colegio", "driamorim2": "You are an IDIOT! 🤮🤮🤮", "estudio_artii": "Greta... I love you... excelent.... just like this...", "angela.vdc": "Haber tú fantasma a clase como todos!", "violetlunna": "You go girl", "adam_hoult": "🤡🤡🤡🤡🤡", "lopesbrunobr": "Pirralha", "gilmoral": "thank you for doing what you’re doing.", "pombeando": "please readd my message on direct❤️!", "nacer_v": "#freebobbyshmurda", "rosaliavdm_14": "Espabila", "thaliapaulino_": "Oque tem escrito aí?", "jplachi": "PIRRALHA KKKKKKKK", "mclaramat": "Ícone ❤️", "sandro_cipriano": "#somostodospirralhos", "yumi.mih": "#Pirralha#", "renatamourato": "CRAZY💩", "marcelo25vm": "Pirralha!!!! Kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk", "aquecimentologia": "IMBECÍL!!!", "johnbrilhante": "Pirralha", "leandramachado2007": "You’re the BEST, “pirralha”🐚🌺", "giovanidelano": "😇😇😇😇", "juliasarmentop": "Pirralha perfeita ❤️", "je_ross": "Go pirralha ❤️", "wilhanrbll": "Vai estuda piralha", "daniel_1204_": "You are a liar 👌🏻👌🏻👌🏻", "anadeborauchoa": "♥️ Pirralha ❤️", "espaco.casa.azul": "VENHA PARA O BRASIL, VENHA PARA A AMAZÔNIA 💚", "allyolivrs": "Nós te amamos 🇧🇷🇧🇷🇧🇷", "jadsondesa": "#pirralha", "sarahs_santoss": "You’re amazing", "belu_gorobsov": "No dejemos que nuestro planeta siga muriendo😢", "luisamericohp": "Sua idiota", "arturobernard_": "♥️♥️♥️♥️🇧🇷🇧🇷", "niklas.zlxg": "Halt einfach dein Maul du Drecks s******", "swisstinyhome": "Soon the people in power will be no more. The people in power will be conscious, selfless, intelligent and kind 💫", "rauzitow_kkj": "Que tipo de fantoche é esse, tão realista", "francofranciscoxix": "We are so proud of you !!! Lets make a HUGE noise !!! Like they NEVER hearded before !!!!! 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻✨", "mmuss86": "Greta you are awesome!!! Thanks for being our voices ❤️❤️❤️", "camilamonteirox": "BRAZIL LOVES YOU. THANK YOU.", "raphaelakamigashima": "💚💚💚💚", "gabriellelsouto": "💜💜🇧🇷", "s.barrosn": "❤️❤️❤️❤️", "nathan.abraham.1982": "🤮🤮🤮", "pedropauloav": "Thanks. We love you \"pirralha\"! 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷❤️❤️❤️❤️❤️❤️❤️❤️", "1mantruth4u": "GRETA CHRISTMAS EVE BE HOLY. HEAR ME TRUST MY WORDS. 3 SPIRITS OF CHRISTMAS EVE FATHER SON HOLY GHOST OF CREATION LOOKS IN. TAKE MY WORD IM THE ONLY 1 THAT KNOWS IT.", "analaurajepereira": "Brazil are with you #pirralha", "hnsfilho": "Pirralha, bebê chorão, 🤮🤮", "filho.terceiro": "😢😢", "floris.bd": "Sukkeltjeeee", "vicnarcisoo": "pirralha", "gracidornelas": "💚🇧🇷💚", "chefgabrielmartins": "Terribly sorry for the captain's attitude towards you, but very happy you took it in stride. Your twitter bio made me laugh. Keep fighting the good fight!", "ciceroaraujo.neto": "Thanks Pirralha ❤️🇧🇷♻️", "myrnyamona": "💖", "franturro_": "@cristinavb98 dame una G dame una r dame e dame una t dame una a, Greta oe!", "jonavsn_": "🤦‍♀️", "maduismo": "World needs you❤️", "oh_dear._1": "How dare you greta ur a fuckin joke go back to school and fuck off", "carlaritatavares2018": "❤️🇧🇷", "thekadefreitas": "#somostodospirralha #weareallpirralha 💚💚💚💚💚💚🙏🙏🙏🙏", "arman_ortz": "Vamos a hacer una manifestación para q la chavala esta deje de pollardear y se vaya a clasd", "oops_joaoo": "Pirralha", "borgeserickson": "Talk about China’s pollution!!", "led.ledson": "This is incredible, congratulachion!!!", "milly__8_": "Fada sensata🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "maycon_hisley": "Brazil's with you! Bozo (Bolsonaro) RUBBIIIIISHHH!!! #pirralha ❤️", "adrifilmmaker": "Angel! 💕💕💕", "weskleymartins1": "we are all #pirralhos", "veragoncalvea": "Pirralha 🇧🇷", "claudellamo": "Greta...I am from Brazil....I don't like Bolsonaro...is Man bad...Greta we are togheter...we loved your job 💕💕💕💕💕👌👌👏👏👏👏👏👏👏👏", "louiseferri": "We love you @gretathunberg 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷 Thank you ❤️", "jrlipeval": "Corre que ainda vai dar tempo de salvar os 🐘 da Amazônia kkkkkkkkk", "_florian_be_": "I love Diesel❤", "_stephaniethomas_": "So you telling me u travel the world without polluting it at all? You dont take cars or planes that pollute? Go back to high school little girl", "svetlana260669": "Pirralha .....respeita o nosso presidente Bolsonaro ele sim nos representa.", "pauloonery": "Brazil loves u 🇧🇷🇧🇷", "matheusmenta": "Pirralha", "aahern23": "Why haven’t you gone to china or India? Oh bc you’re a partisan leftist hack? The world isn’t ending stfu and go back to school.", "big_gucci_chris": "Even if you’re Jesus himself demonstrating against climate change, OPEC will stop you and that is guaranteed", "deeise.carvalho": "You are amazing! Greetings from Brazil 💛💚", "maycon.almeida.773": "Olá Greta vem para o Brasil, visitar os índios. A Amazonas te espera de bracos", "bea.gommes": "MARAVILHOSA GRETA ❤️", "_________rafael________": "🐽🐽🐽🐽😂😂😂💩💩💩💩", "loyalerrr": "go to school, bitch", "pedrow_pp": "Você não é uma pirralha! You represent me, you represent young Brazilians. #outbolsonaro", "onatdolekoglu": "1v1 yüreğin varsa gel.", "escandaloso_kaco": "Me habéis quitado mi infanciaaaaaaaaaaaaaaaaaa🔥", "alessandracassapula": "👏👏👏👏👏👏 angel", "original_phoenix_": "Greta Super weiter so ❤❤", "cristian_pressi": "You is amazing! Brazil loves you 💚💛💚💛", "danielessantos1": "when someone says that Brazil loves you .. don't believe me .. Brazil is too big ..", "eddieasics": "Volte 500anos para defender a natureza", "bimatarazzo": "Pirralha 🇧🇷", "matues_felicio": "Pirralha do caralho", "jakeline_souzaaa": "Ja gostei de vc \"pirralha\"ops garota 😂👏👏👏❤️❤️🇧🇷❤🇧🇷❤", "rafaell.portela": "Garotinha, você precisa crescer um pouco mais para suas declarações fazerem um pouco mais de sentido.", "gustavomarxz": "Pirralha😍", "sheeeshitsadrian_": "Stfu we need money", "m0kyr": "good job lil sis, soon it will be over 😊😉", "nogueiralip": "Bora planta um pé de café ,cambada de vaga", "lzedualves": "Pirralhaaaa tu é fodaaaaa", "meire_rodrigues11": "O Presidente Jair Bolsonaro chamou a Greta de Piralha.Não liga não. Infelizmente ele é o presidente do meu país. O cara só fala besteiras 😤", "joanadarclua": "💗🇧🇷", "vixtorw": "Powerfull ❤️❤️❤️ 🇧🇷🇧🇷🇧🇷", "williameyokel": "wondering if you could be any more stupid", "_annasilvestre": "I’m so sorry Greta! Still fighting for us! We are with u! PIRRALHA WE LOVE YOU! Kisses and hope from 🇧🇷", "cano.prltz": "Go back to school", "natha160588": "Pirralha", "akerstromelisabeth": "Den lilla tjejen från Sverige,öppnar ögonen på miljarder människor,🙏🙏🙏", "andymacdougal": "You’re a fraud. Go preach to China, dunce."}