{"sol_celia2010": "I love you💕", "smell_before_rain": "Is you really 17?look like you are 12", "enchantress_emogirl": "Hey teacher leave those kids alone 😂🎵 #pinkfloyd #anotherbrickinthewall", "hendrikeriksson": "@jpagander", "tofflan_2.0": "Du är så modig!!! Jag vågar knappt säga något i klassen", "michael.e.kraft": "You really are getting dumber", "patricks_poop_lagoon": "The fuck do you think not going to school is gonna do for climate change", "allthingslinear": "I know she didn’t say anything about the fires in Australia but give the girl a break at least she has the courage to actually go up there and make a change and for those people who say go back to school mind your own business ok? Happy Birthday Girl and good luck 🤗🥳", "queenpv3": "❤️", "diana_j.x": "u shudnt be doing this...", "_.iinniiggoooo._": "Aver niñamk eso es de plasticomRECICLA", "can_._sir": "lol little kid go back to the playground", "hxnnes15": "Will trotzdem einen V8 Motor haben 😊✌🏻", "ruby.backup0": "HoW dArE yOu", "muklewicz.ryan": "@c_porter_3_", "squish65": "🤢🤮", "ardeiudz": "bonne fete ,happy birthday or la mults anie, its in tree language", "michelangelomonici": "Bella topa", "juusohelosaari": "🤣🤣🤣🤣 vitun pelle", "kreinesttim": "Go to school", "felixboee": "Ist Schule nicht Pflicht. Vor allem für dich.", "ayazrash": "@guymwheatley", "giannazi_": "🤢🤢🤢🤢🤢🤢", "badassbishh101": "english?", "joe_murray666": "Sub 2 @willne", "edan_ww2nerd": "We have the same birthday uno", "kgb.comrade": "U just wanna skip school lol", "caden_casey": "🤡 Jesus fuck", "andre.rodini": "Vuoi ancora 3/4 sciarpe? 😂", "dave_spratt": "We have 5 years", "duckillz": "Trump 2020", "gang_abstinence": "I cant speak Mexican", "auropii": "go to school", "__stefano_salvetti__": "Go to school end romp mia I coioni", "hrknstmull": "Go to school", "zz95uu": "@amelie77._ die schaut aus wie 5 muahahaha", "lleollimainsta": "Imbecilzinha", "grom.christine": "Happy Birthday", "silvan_28": "Fire on Babylon. 😅😅", "rylee.flynnn": "translation please?", "stffn.16510273849": "Dei eltern sollten lieber mal zuhauen bei so ner tochter wie dir", "riancryer19": "This has happened for a year and a half?!", "v.l.x.c.a.s_": "Die sollte man über den Zaun werfen.", "gabrileceresara": "國家公園綠地時尚館藏人士官方", "daniilbarinoff": "Aren't you ashamed to use paper for your protests ?! Paper is made of trees, and trees give us oxygen. So you support the felling of trees ?! There will be no trees, there will be no us !!!", "sophia9j": "@neal2156 this is what we walked past!", "nikitoshka_": "How about trees, that were destroyed for this poster?!👍🏻👍🏻👍🏻", "farve456": "Look pretty cold out there. Stay Warm.", "rmuser234": "Greta save paper )))))", "sergey_devil999": "Конченая блять", "chelino_09": "Calloa", "jeeva17rathinam": "👏", "johny_drama_": "Lies", "dr_al_ny": "Moron stand like this in China u fucking coward", "_emir.06.55": "Bruder ich hab 4.1", "pedroramirez8474": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "bas_ti13492": "Gott sei dank gibt es ein so tolles Mädchen wie du es bist🙏🏻 ich werde nie mehr Auto fahren mit dem Flugzeug fliegen oder mit dem Bus fahren, die Erde keucht aus dem letzen Loch.... jetzt müssen wir es tun sonst sonst WIR an allem schuld!", "alexchorltonwilson": "@gordzki", "catalanderlust": "Happy birthday! Together we will change the world! Go for it! We love you! Josie and Francesc from Java (Indonèsia)", "olapeterwas": "Nice way to avoid school", "szymon.peplonski": "Greto, you got into the fight with politicians, you insulted Australia, you \"destroy\" the US president, you make large demonstrations, unite students - who leave school for you and do you do something besides it? Are you 17 years old My friend looks better and is more active than you in the field of ecology. And you? What are you doing. You collect praise and rewards. Man of the Year Time? Nominee for the Nobel Prize? Think about your life, because eventually someone will stand for you and your Darwinian theories and you will be as a threat to the realms of the land.", "michaelfrance12": "Go to school dumbass", "sam.mot.123": "✈️✈️✈️✈️✈️✈️✈️✈️", "cor_ona.luijt": "HOW DARE YOU", "vini_pnovello": "Skol é boa, mas prefiro Brahma", "hannah_leonie2001": "Hoffentlich erfrierst du", "danieledwardlevy": "This is our generation’s slavery. This is our generation’s Holocaust. The Meat, Dairy, and Egg industries engage in unending Rape, Torture, and Murder!!! 3 Billion animals are Murdered every day!!! Take to the streets, and become a Vegan activist!!! We must end the throat-slitting, and bloodshed. We are better than this. Be the change you wish to see. Watch Dominion, and Dairy is Scary, on YouTube. 😇🌱🙏 Message me for more info ❤️", "_wilmasssprivata_": "You are so strong❤️👏🏻", "kattakala": "Very happy late birthday - I hope your day was wonderful! Always stay amazing!!", "mattiashagy": "Lata jävel gå till skolan", "ilovechristmas61": "Happy birthday", "isabella__odea13": "Yay one more week dumber", "andrin_meyer": "@raphael_ilusor du fuchs", "lorenzolollii": "concordo pienamente", "david_huwiler06": "I hope you die", "nathan773250": "I’ll start my CuMmins and my 7.3 powerstroke see how you feel", "a_hole_boater": "Looks kinda cold. Is climate change not happening there? Why are catastrophes used to point out Climate Change, yet normal weather patterns are not. You can’t have it both ways.", "milan_almozani": "Downie", "armiin207": "send nudes", "mstfzynpsvm": "Cüce", "xx.leon.xxc": "Gay", "adriannilssonjarvandi": "Skolk för kvarsittning", "vlaming_voor_altijd": "🤡", "reese347": "Go back to school dumb dumb. You are the result of what happens when people don’t go to school, they turn into idiots", "sara.mst8": "Kindergarten y’a kahba", "jmllr45": "Jeh in die schule man", "bigbrainphotos": "Bruh your out heat with your bitch ass paper intro looking sign do work for once oh wait your rich and you can’t do that. Well climate change is fake you have zero proof", "rami.361_": "You are a hoe", "anthony__the__gas__biker": "Jump in that lake bitch", "emerson.damasceno": "why don't you talk about the fire in australia now ???? Is talking about Brazil easy?", "fathergecko": "*climate", "pigeon_man_69": "You spelt climate wrong", "j0an7": "Vai te comer", "arkaaaadius": "Why don't just shut down the schools, fck it, let all the kids be as dumb as you - uneducated clowns 🤡", "primoiannarino": "💘💘💘", "rajankalb": "@andersssonwilliam", "xryouth.santiago": "Amazing", "dianakicia82": "Happy birthday brawe girl💪🏻 👧", "edoardo065180": "Ma non caga i maroni madonna mia mica sei una santa tu e noi semo gli inquinatori perché la carta per terra almeno una volta l'avrai buttata pure tu oppure il rubinetto aperto quindi basta co sta storia!!", "truth_word1": "Hi I have new account and it going to be about the truth about earth, you can follow me @truth_word1", "expertparaguayostudio.cl": "Greta estas feliz mañana no hay clases BAILA", "richbennett82": "❤️", "_emmaamendola": "@zoebergerson", "justealexis2004": "Happy birthday greta", "apstein9": "🤡🤡🤡🤡🤡", "tho_pie0052": "Geh mal zur Schule du Alde🤢🤢🤮🤮", "hiv____aids": "Happy birthday🌹", "yanickbrennwald": "Dislike", "kaif.energy.bebida": "Start planting trees, cleaning streets and beaches instead of striking in front of the Swedish parliament!!", "riosdelucasoficial": "N podia ser uma placa mais bonita? Kkk😂😂😂😂😂🇧🇷💕", "bri_young.17": "Please just stop and help. Stop your stupid protests because they aren't doing ANYTHING you're letting everyone down. Get off your ass and stop slacking off school and HELP US #prayforaustralia #prayforaussiebushland", "__matthaeus__": "Surströmmig", "aaron.bm12": "Wapa😘", "zuerich.tatijana": "Happy Birthday i forgot it sorry buddy", "_gabrielholgado": "How dare you", "eskilshill": "❤️❤️❤️❤️❤️❤️", "sleepyjag_": "Its bullshit, everyone else in the entire world has to go to school to get a decent job and make a living. But you just make money because of who you are. I think you should sail off the coast of Somalia, pirates of the Caribbean live over there dont you know. Go hang out with them.", "lau.malo": "Greta, Would you Skype with 400 student leaders working on developing strategies to combat climate change at our Summit for 5-10min on March 17, -Montreal region, Canada", "captainfinest": "Parents paid by Soros to pimp this naive lil witch", "2.6md": "@g6kkkkk ma pote", "giuliano.ysz": "Stylerin", "nathalie_laaa": "Deutsch sollte gelernt sein 🤣", "braeden_clements": "Fuck you bitch", "william_450": "She do be thicc though", "jhathorn309": "Skipping school ain’t gonna do shit😂😂😂😂lololololol", "tklouser": "Go to school", "tyler_strandlie": "Nice job dropping out of school", "x_ae_a_12_the_second": "Nice way to skip school", "iluysha__": "Соси хуй биоразлогаемых людей", "lopezgabbriel9000": "🤡", "tomek.ts33": "Lass dich doch mal von einem Psychiater untersuchen, vielleicht ist es noch nicht zu spät .", "gnunesx": "sai dai retardada", "frederik.fast": "Greta the great", "_nh7_": "😂", "tessprag": "💪🏽😍 Du gör en stolt över att vara svensk Greta! Hörde idag att det finns ett uttryck för aktier i företag som satsar på förnybar energi - Gretaaktier 😍 Bara det! You go girl!", "noraadj": "she litteraly left school", "warrenbeebe": "🤡🤡🤡🤡🤡🤡", "detlefvonludwigslust": "Go to school !!!! If you not want to work in getränkemarkt !!!", "ivan_kukhoreff04": "@gretathunberg good job skipping school and not getting anything accomplished in life except being a BITCH👌🏼", "kauazim_45": "Sinic", "y._axdre_.y": "Klima aktiv fisten", "pipo.pavia": "Ya me joderia puta LLORONA traga POOIIOOOLKA", "__daymo___": "Is this what dropping out looks like just with extra steps? 😂", "cowboy5871": "👎👎👎👎👎", "dxn7016": "School skip week 72 *", "_jamessenetto": "Dis lil bitch finessin her way outta school to “fight” climate change😂🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️", "tommaso.cuttica": "Stai zuttq", "bigpapabou": "You cant learn anything if your never in school", "_offixial.eric_": "Fuck you", "eugen_klogin": "Fuck you", "m.vrubel_": "Блин мне бы так школу прогуливать, что бы потом левачки и хомячки всего мира слушали и верили всему этому бреду", "ianroldanp": "You are a fake person, you have a life of luxuries.", "teodororomerotenorio": "olé guapa!", "zeth.beng": "Min fkn broder", "merte.sert": "Fuck you", "hello66557": "Obama bin Biden", "manuel.hrvat": "und du bist 17?", "washics32": "Fake, #makron #Georgesoros #lies", "nawinspi": "@luethi_simu", "erickgoncalvesleite": "Skol uma das melhores cerveja do Brasil.🍺", "valeen028": "te calles", "fresh_nutrition_lifestyle": "Hope you can still have a happy birthday🍰 even though the world is on fire🔥 Greta. Maybe skip the candles this year?😂 Only teasing 😛 being 17 is no joke for you, keep up all your hard work. Hopefully you get to do something you enjoy for yourself soon😪, instead of having to save the world all the time 👏👏👏♥️♥️♥️", "vlarcher19": "Dear Greta! You 're a man from the future!", "jacobstang13": "u a drop out at this point", "iamnuriddin98": "Go to school, spoiled fool", "timo_2109": "Love you💍", "trash_man_daniel": "Skolstrejk for klimetet man 👨", "globetrotter_steff": "Stop talking and finally do something. Get your hands dirty and help in Australia instead of just marketing yourself more and more every day. 😡", "d.a.n.i.e.l.official": "How dare you !", "veggiestraw_meme_page": "You are overrated", "m_r1t.2z": "You Reptiloid", "tysonloveyou": "How dare you", "goar.66": "how dare youuu", "nicolai_kjeoy": "How dear you!!", "hasimo_privat": "i also strike the school but not on frieday on every time", "diogo_hassan": "Pirralha", "paul.stl06": "@leoonn___ Schule schwänzen nicht gut si hässliche", "jaajungs": "Boah du siehst echt aus wie meine kleine 6 Jährige Schwester kack Autistin", "sascha.393": "Fucking slut I love V8's", "jan.soeder": "How dare you Greta Thunfisch?", "bosto_t": "Climate change is bullshit", "markus_hochfelner": "🤢🤢🤢🤢", "englagustafsson4": "👏", "alieva2654": "❤️❤️❤️❤️❤️", "kelvinkrug": "Wow this child is an idiot", "alejandrofullana": "Que pone ahí?", "mauricio_cunha_mk82": "A PROPAGANDA DA NOVA ORDEM MUNDIAL - Partiko Quem controla Greta Thunberg e o movimento #fridaysforfuture? Algumas reflexões e fatos sobre o movimento de propaganda de crise climática # Grid Thunberg ... A mudança climática / crise climática / aquecimento global é uma farsa e um encobrimento do que é realmente feito pelo homem e está mudando nossa atmosfera: geoengenharia e décadas de programas secretos de modificação do clima (ainda assim, quando você tira a cabeça do óbvio) . Greta Thunberg e seu novo exército juvenil de ordem mundial de crianças aterrorizadas e abusadas mentalmente e propagandizadas estão pedindo uma ação que, se você procurar, é a legalização da GEOENGINEERING, financiada por impostos. Quem é Greta e quem está por trás das sextas-feiras para futuros movimentos? Greta está relacionado com Svante Arrhenius https://en.wikipedia.org/wiki/Svante_Arrhenius, que teve a ideia dos gases de efeito estufa em 1895 e que é primo da avó de Greta. Na página da Wikipedia: Com base nas informações de seu colega Arvid Högbom, Arrhenius foi a primeira pessoa a prever que as emissões de dióxido de carbono da queima de combustíveis fósseis e outros processos de combustão eram grandes o suficiente para causar o aquecimento global. Em seu cálculo, Arrhenius incluiu o feedback de mudanças no vapor de água, além de efeitos latitudinais, mas ele omitiu nuvens, convecção de calor para cima na atmosfera e outros fatores essenciais. Atualmente, seu trabalho é visto menos como uma quantificação precisa do aquecimento global do que como a primeira demonstração de que o aumento do CO2 atmosférico causará o aquecimento global, sendo tudo o resto igual. Quem está por trás do #fridaysforfuture? Siga o dinheiro do movimento #fridaysforfuture e você encontrará um cara chamado Frithiof Finkbeiner, membro do Club Of Rome (Rockefeller) e da German Marshall Plan Foundation. https://www.clubofrome.org/member/frithjof-finkbeiner/ e quem fundou a Fundação Plant-for-the-Planet \"para capacitar crianças e jovens\". Suas agências estão financiando e ajudando todos os tipos de operações envolvendo jovens que têm medo das mudanças climáticas. A operação que controla G", "finn_.lunter": "Ben je helemaal van de pot gerukt", "clemensmaier99": "Du stinkst", "ester_frennberg": "Jag älskar dig och att du kämpar❤️", "monikitarpm": "Austrália Greta please", "scott.b55": "Looks hot there", "bredfordzz": "Fuck Greta", "ben_10g": "Go back to school you bum 🤡", "veech05": "why not stop and watch as the greatest president in American history takes out the entire country of Iran in 15 seconds with the snap of his finger, put down the fake global warming sign and watch.", "_mikeizzle": "Girl can’t even finish the ninth grade and is trying to be a world leader", "shitgnawone": "@gretathunberg looking for people who asked 👀 lmfao", "ctp.20_4": "GO BACK TO SCHOOL, you ain’t gonna do nothing if you don’t get an education", "chuprin_live": "ДУРА!", "jasnparker": "Happy birthday Greta .hope you get spoilt.👑", "lydslgw2": "ever try.. idk, going to school?", "stallsmultronen": "@tindra_tisbe hon e engelsk", "alex11_8": "No", "jake.norman.2": "All that winter wear from global warming!!!", "rodrigoasensio22": "Hoooolaaaa mmmmmm", "tyranus3367": "👍🏻", "bitchimleaningheavy": "doesn’t go to school yet still talks politics. greta when will u learn? u continue to be a puppet for the socialists", "c.h.i.r.a.g_k.e.d.i.a": "I also want to strike in school...for climate change...what can i do?!", "c17_h19_no3__": "Грета математичка ругается, когда в школу пойдешь?", "kiw_______": "🙄", "crazycrxnch": "Fuck you.", "dufdufeliott": "I like plastic", "0li_ww": "@brendanlcl Sorry dont speak inbred, shave your downstairs darling", "jxrvxs_walker": "👏Climate 👏 change👏is👏natural👏stop👏clowning👏the👏earth👏", "maxip.ru": "ICH FAHRE V8 FÜR DIE UMWELT", "cookie_n3": "Greta dej kotleta", "alessiascatta": "Greta fammi imparare a fare la raccolta differenziata!!! @ishika_ramsurrun", "lordjohn612": "👏👏👏👏", "ambriajustyne": "GO BACK TO SCHOOL!!!", "joeyverkleij": "Grapje ly", "_mat.jr00__": "W the co2", "nicholas_starling": "Your 72 weeks not going To school? Kkk", "ana_rita_font": "😠😠😠", "loryp97": "I’m with you celebrating this strike against climate warming. I’m going out for a journey with my fabulous 2010 BMW 325d e92.", "_piter_on_tour_": "Donald Trump has shown you a place in the row that has plunged you like a regular nip, you and all those pseudo-ecologists really mean that. THREAD !!!!", "costimuntean": "\"Respect !\"", "omar.elshafeiii": "@gretathunberg all I need to know what is your fuck'n message.", "ifyoumadstaymad": "girl, get your butt back in school 🤦‍♀️ absolutely ridiculous. I don’t feel any better about the condition of the world because a 16 year missed over a year of school 🤦‍♀️ you’re going to have to do more than that.", "revil_esports1": "Hure Greta geh sterben", "adelinerookstool": "Your missing out on a lot of education and you dearly need it", "gjcszn04": "Go to school", "k_shields22": "Your parents should be in jail like anyone else's parents who keep their child from school. Truancy officers should nab them up.", "j.pierce42": "oh wow yo ur skipping so you can be even more stupid! You don’t have to be fighting “climate change” you should be in school. We have only been observing weather for one hundred fifty years about we can’t tell if this is a natural fluctuation. In the seventies it was global cooling. 🤦‍♂️", "alex_shedden45": "That sign stands for shut the fuck up", "atmtms": "Рпараатвиаповлддввиыврвддзв", "refinery_specialist72": "We can tell you didnt go to escuela.", "me.against.uu": "Greta go and get fingered", "goncalofdelgado": "Vai estudar", "tarr.cait": "Can I just ask.....surely you flying around the world doing speeches and protests is not good for the environment???? I know what you are doing is for the greater good but think about it??", "micha_primera": "😂😂😂😂😂😂😂😂😂😂😂", "windexenthusiast": "Skipping school because apparently I need to to save the environment, week 72*", "jasmine_glitta": "Lol why does she have like ten scarves on", "_madihouston": "go to school", "tyessia14": "👍👍👍👏👏👏🔥🔥Amazing", "just_1_robert": "Mmmmm yes skipping school is going to change the climate back so smart for some one who’s no longer in school", "iria_love10": "I love what you are doing to save the world from climate change I love you", "carlosaugustusii": "Flanked already pirralha", "charlie_go_fast_66": "HAHAHAHAHAHAHAHAHAHAAH. @rickygervais handed it to you strait. That shit was funny", "ali_lebanese91": "You are nerving on my gets 😂", "ivan_cb15": "Que jefa", "weed.bond": "🍀💚", "ddevv": "Like for mr beast", "joil666": "Пиздуй в школу,а потом на завод хуярить", "_geminix__": "@gretathunberg WWIII should not happen. Our earth has already suffered a lot. And Amazon has lost its trees. Greta you ate the voice on the large scale. Please help.", "ig_home.vp": "Really love what you do 🤘🏽 as i followed a similar path, but no one listened.", "jzhbknnmkbh": "@offical.lea.t", "ignacia_antoniac_19": "Caeza de pichi", "not_animebit": "Грета ты тупая сука, не говоря уже о том что ты быдло ебаное, чтоб ты здохла", "andrew__strong": "🤢🤢🤢🤮🤮", "bauer_max_476": "Du schwänzt ja schön die schule kleine öko pippi", "franz.cls": "@sonya.hct", "alvingustavssonnn": "@alfred_rosenstagnell", "opal_jindawong": "Happy birthday", "yujjthc_": "Hahahhahahah what the fuck you are 17 ?", "jpgrandi1910": "Só pra não estudar se eu faco isso no Brasil kkkkk @henrique_delvigna @rafaelvinolo", "mahharam_eureas": "Ебанутая🤠", "vicente.1989": "Clothes made with slave labor", "imperator_und": "Go to school", "georgiyanisimov_": "Stupid autist👏", "kingofallthe": "😎🌟💕", "m.tranquility_": "STOP GRETA!!!", "estutzman2": "Go to school!", "oscarthewise97": "The climate has always changed thru the planets history with iceage and tropical climate . This is just propaganda shit to earn money. No such thing as we're the problem to global warming", "marcus_cruz_automation_tester": "Går till skolan", "samongenae": "Greetje, @stafdewulf ziet u zitten! 🤫🤫", "oxygenshade": "Животное", "einfach_nur_rene_361": "👎🏼", "iamherrdanil": "Oh du Thunfisch", "jp_den": "Go to school fucking asshole 🤬🤬🤬", "kumin.n": "To people that don't know she has Asperger's", "janas.gr": "Little dumbass", "hassananjum895": "bra kämpa kämpa kämpa", "luukvrijt": "Dikke vette huts muts", "camilo_tel": "Bruh she really gets to skip school just for talking while everyone else around the world might be trying to make a change but they still have to go to school", "nigga_inc_": "Ist das etwar Mikroplastik😂", "benemg": "@frank_neuwirth", "tyray1961": "HBD🎂Greta🌸🎆🌺🎇🎉🎏🎊💐✨🌷🌟🌼🎀🌻🎈🌹🎁💯♑️🥳.", "lilliestevensonx": "I’ve. Been on strike xxx❤️❤️❤️ you inspired me too x I hope everyone sees how amazing you are", "hannah.rose.says": "Seeing as China and India have no plans of changing any of their habits, are you just never going to finish high school?", "niconielsenfendt": "Kokosmilch", "janainarodrigues291": "Tanks you salved the wolrd climated", "joshiii.backup": "zieh dir erstmal was an was deinem alter entspricht", "ross_bellis": "Stop fucking about and go to school your head teacher must be bouncing 👍", "hmmjoelhmm": "Sotar gött", "sandrinha_kuhner": "Greta, don't listen to people that waste their time talking bs here. I believe in your cause, your beliefs resonate with the beliefs of millions of people!!! Keep going, girl!! Wishing you the very best!!! Many blessings from Brazil!!! 💖💕😘", "markplimsoll": "We all need a CALL TO ACTION, Greta. You waste your fame on bitching, complaining, pointing fingers, riding catamarans. Change human habits, economies will adapt! Save the Afterlife.", "stevendeherdt": "❤️❤️❤️", "ogonkansligaforgront5": "Grattis!", "rosendobonafont": "El cartel será recicable", "roberto.valenzuela.5283": "Boyan Slat :3", "greetuu_": "Che, como q tenemos el mismo nombre NO DA", "reichermartinez": "They're probably glad your gone, don't have to listen to you sputter complete nonsense", "good.fcking.memes": "Go to school", "rob.vandresar": "Product of bad parenting", "emmal_74": "YESS GRETA THANK YOU", "katiaaltoe": "Pirralha", "cafoplaza": "e hai risolto molto", "thefabiodias": "@gretathunberg Austrália??", "meaghanokeefedouglas": "Happy birthday, Greta!", "who_what.lasagna": "So cute!! Keep up the good work, Greta!💝", "riccardo.gaggiani": "Vabbene vabbene", "thankfulfortrump": "Trump 2020🇺🇸🇺🇸", "jordan.rahn": "@lukebone_923 @_grantfloyd_", "sex_degenerat": "убейся", "_nikigiannarelli_": "Greta i am with u", "_.n3p_tun0_": "Happy brirtrday", "strangerthingfannnn4": "How did your test go? Oh wait never mind you were out saving the planet instead while others learned how to spell ‘action’ you actually took it 👏", "kiiliian.priiv08": "Mañana si hay clase", "wiz.erd": "Where can I find people working on solutions, specifically a forum for input to discuss solutions", "sunnycat54": "Happy Birthday Greta🌷💚🌞🌷💚🌞#keepfighting👍😺🐾", "saretta1306_": "sei una stolker?", "funny_handle": "🖕🖕🖕", "saussyzach": "@gretathunberg link in my bio to a petition for the U.S. to send Austrlia aid to help combat the wildfires. Please share this and spread the message! You are a voice that we need!", "luna_jack_russel_": "Buy an ice cream from. 😢", "_x.alinax_": "😂", "lewis.inside.lidl": "Right hang on u haven’t gone to school in 72 days hmm just sounds like you are skipping to just right speeches and do random weird things to me but yerrrr i might join you school=bad", "_yungsean_": "Just go to school", "fardyalam": "Hey hey monika", "feind.yeee": "Sie tut so als ob das richtig viel Schnee liegt und es -10 Grad sind 😂 scheiß Autist", "n0_red": "💩💩💩💩💩", "dominik_z0": "Diesel is Good", "melindi.koekemoer": "Yes Greta ! Go Greta !", "derikpompilio": "👎👎👎👎", "ps4_sign_out": "You don’t even go to school", "sankalp_since_2002": "Well we have to sacrifice present for future........🙂a better future for us and for our future generations..........,so stay calm.......dont talk walk the talk...", "its.jordan_upton": "Happy birthday Great😃💙❤️", "rainbowgirl2540": "Happy Birthday 🥰", "job.swt": "FUCK NATURE", "six256": "https://www.queenslandcountrylife.com.au/story/6485447/climate-change-doesnt-cause-fires/?cs=4726", "demonicvalkyriev": "Go back to school, what an idiot", "lifewithluise": "Hast du dir das Fairphone 3 zum Geburstag gewünscht ? 😍😍- ihr könntet eins sein uhu", "ttononx_": "Kahba", "fagner_sm": "where's global warming. You are feeling a cold cold!", "yashikov.99": "Can you beat team trees no then stfu", "ilya_mitrich": "🤦‍♂️", "01clbrian": "🤢", "_cristina_andonie": "Happy birthdayy💕💕", "kasper_bergman": "Kan du sluta säga att det är en skolstrejk snart?", "grantgarman0703": "Go to school and get educated", "fandarust": "Как ты запарила уже. Актриса", "echoselman": "girl ur just not going to school LMAO", "egor_a.kondratenko": "эпоха лицемеров", "davidfbarreiros": "Vê se atinas oh vaca 🐮", "massarellivasconcelos": "Cala boca pirralha Greta", "finnj3": "Why u got more layers than my grans lasagne", "maartendrost": "You think not going to school will fix te climate?", "jaandiwana": "I think you should use those people which follow you to do more than protests around the world you should use them to meet with them and make actions like cleaning beaches, forest etc cause every person take just one piece of plastic will be thousands out pieces out of the ecosystems and all the politicians will react more than just protest with slogans", "rebecca.d12": "she cute @emmadavis282", "adriannn.sh": "Fuck your Klima", "ryan_evangelist": "Pirralha", "tyreed_": "72 weeks in on the strike guys!!! let’s do this!!", "litvinvlad96": "Коли ти вже угомонишся?", "botshelo.magomola": "@melindi.koekemoer", "s0rc.ha": "Murder with my mam after I missed 20 days", "daviid.izq": "You're simply a business asset", "victor.patrizzi": "Semana da pirralha de sofá falar merda", "kyle_elias_": "YE GRETA LETS GO, GO VIKINGS #SKOL #SKOL", "gianelo84": "🇧🇷#Bolsonaro!!!!!!", "mrskelsedgy": "I respect people who are vegan, but I will always be a meat eater. Let the haters come in 3...2...1....", "frankreilly15": "Go to fucking school u fag", "saltbmx72": "Блять тупая мотемотичка наругает", "carol_a_spiros": "Happy birthday Greta! ✨💛✨", "ricks_life_reality": "Ur social media addiction because I am already forgotten all the comments u posted before because u made no impact on me for some reason maybe your point was way to weak. But just seek help man. This is not healthy. I am gonna finish my day here maybe I got time for you in 4 hours. I got a life outside social media try it also. Maybe you get balls anough to put some real photo of yourself on the internet or are you such a big troll that the even the flash of your phone can turn you to stone?", "kunal_yelne": "How Darr You!?", "rpretto": "Mina chata do caralho", "vniciusmartins": "Tradução: @skol desse mais redondo.", "adri_____12345": "What is wrong with you😱", "arthur_bcardoso_oficial": "👏👏👏👏", "vilgot__kling_": "Usch", "ccdemps": "Accomplishing nothing! How badly have you been taught if you think the weather can be changed by giving governments more money.", "orkidea.hida": "I can't help but notice the fact that there's still night 😍 friggin cool", "_clickxau_": "GretaTuberga", "emcostapujarlacosta": "*how dare you", "lisa.basicz": "HAHAHAHHA", "amoral32_": "Пиздуй в школу", "julia08sh": "🤮🤮🤮🤮", "gertrudkull": "Gratulerar kra", "much4c05": "Ditt jävla Äckel", "julien_der_deigner": "🙌", "bravsss": "Your a little worthless piece of shit.", "rudi202": "17 and lookinh like 10 what the fuck", "yehudit.golan": "Ok Gretchen skip out on your education you will be sorry?", "gabrewzin_": "OI EU SOU A GRETA PIRRALHA QUE A ONU BABA OVO!", "ryan_peel9": "Wasnt she saying she should be in school not half way across the ocean? And now she's on a school strike?", "l_ev__i": "Sex", "__.andrex.__": "Ahahal🤯a", "sinjas.world": "💚", "mayapradeeep": "FUCK YOU!! GO BACK TO SCHOOL", "magalinobrega": "https://www.biggreenshow.com/ följ deras video!", "amy_stoltz09": "😢😢😢", "eh.0001": "Kallt", "jaffajanne": "Laiska", "brattericc": "Thicc💦", "michaelmx66": "Alles gute zum Geburtstag 🎉 ❤️❤️❤️❤️❤️❤️❤️", "markkendler": "This will save the planet for sure, great work greta", "memes.top_ok": "Что с еблом?🤡", "shivler": "@girling.james Look where she is 😃", "juniabelfort": "You are an inspiration to the whole world!💕🙏🏿", "__raul14": "Bitch", "tillyobssuth": "No one cares that you’re not going to school. You are just progressively becoming more stupid. go back to school Greta. #trump2020", "djurnatur88": "👏👏👏👏👏", "arnau_nogues": "Fuck you puppet!", "nikter_": "Nobody gives a shit Greta go to school", "lexi.golder": "yessss u tell em greta girl😘", "ferozrosli94": "Trump shit..m😂", "jo3ltju": "greta im your biggest fan👋👋👋👋😍💪", "tommasotoschetti": "@ludobi.ci", "mayako_hdv": "ANOTHER CLIMATE SUMMIT WITHOUT AGREEMENTS  Another climate summit without agreements, Another piece of us they murder.  At least let's have the courage of spitting indecorous poems in their faces, every time they want to make us feel bad because we didn't buy ourselves an eco-friendly washing machine.", "glennliddell52": "As usual thank you so much Greta, if only Coalfinger aka Scott Morrison, our commander and chief had your courage and backbone we could have some kind of hope for the future for Australia but sadly he says he won't be intimidated..jack ass!", "gghzjhgvgsn": "Torna a scuola e impara a scrivere...non si capisce un caxxxo", "samuel._youngofficial": "I’m going to laugh when your dumb ass is actually dumb", "tomasstratta_13": "Go back school and dont use paper", "andreabaronaa": "@marianamanriquezb @macusrodrz", "marthagenevois": "💕💕💕💕", "ijbwashington": "✊🏾🙌🏾👏🏾", "i.cataalina": "hb❤️❤️❤️", "mrbibop\nVerified": "Verified", "nihil_liberum_est": "KLIMA JUGEND", "madisongrace.allen": "why you look cold for i thought it was getting hotter", "tommy.stagna04": "🙃", "emergency666666": "Dear Greta happy birthday and hope soon coming out from boxes maid by tradition.", "thenest_melbourne": "Love you Greta ❤️ you are amazing", "yashicalol": "Happy birthday and thank you", "drake.dash13": "Stop letting adults manipulate everything you do", "jrp61005": "So sick of niggas fake protesting to get out of school 🙄 just stfu and learn", "lililililililililililililiwx": "I bet she and her crew goes to the parliament. Takes their picture and then leaves immediately.", "carol_lab": "You are amazing and don't ever let others think you are less. 💖💖💖💖💖you + we all do+!", "emilkroghnielsen": "Fuck yoi", "g.g_a_n_g": "smol", "vania_matos2013": "Do something for Australia", "dykessol": "72 weeks get a grip of yourself", "grandma.jo49": "Belated birthday wishes to you Greta. Good to see you striking even on your birthday. Commitment!", "ethandunlop": "I drive a mustang that guzzles gas and I love the hell out of it", "lil_diggity14": "U don’t even know hot to spell climate retard", "sabina.brobeck": "Hoppas soc tar dig för att du inte går i skolan", "wichael_wessing_332": "Go to scool to geit smert", "tenalaing": "Happy Birthday, Greta!!! 🎂💗", "j0yceguo": "Happy birthday ❤️", "swansong_007": "HAPPY HAPPY BIRTHDAY TO AN AMAZING YOUNG LADY❣️", "nigel_st.jean": "💚", "neila_st.jean": "💚💚💚", "andru567": "💛💛💛💛💛", "grassstraw_official": "Please let us know when You’re ready to try our straws. They are truly the best alternative to plastic and paper. Thanks www.Grassstraw.net 🐢🐢🐢", "qtr.nxn": "B*tch would take any excuse to skip school", "harry_want_to": "disgusting.", "_i5aak_": "I don't speak italics", "smoothflying76": "Maybe not being in school is the reason you don't understand weather. Kids this is why you stay in school.", "kkumli7": "💙💙💙💙⛵🌊💙💙💙💙💚", "luke_stein1234": "I believe you miss that much school with how smart you are", "juann2008": "Happy birthday!", "karinlippert": "Keep going! We are with you! 🌊 #bluewave2020 #voteblue2020 Vote from abroad. www.votefromabroad.org. Register Today!", "dyhamaral": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "dampneynadja1957": "👏👏👏✌❤🌎", "jxrnoo__": "remember you shouldnt be up here", "thebongoman91": "Well done and cute z", "selena_de_ath": "Hope you had a fabulous birthday!!✨", "andresdlh.1.0": "DO SOMETHING", "lulihernandezv": "More than ever! I am with you Greta", "fabricioliveira92": "Prefiro a brahma", "albarracintropiabastos": "😍", "follow4holo": "At 500 subs i will visit greta", "molly_mgk": "You go Greta", "andjoh346": "Greta for president!", "aaron.gardelin": "hadde jag setat mig på ett torg å skolkat i en dag så hadde jag blivit ut sparkad från skolan. men du måste inte gå i skolan nej", "michaelfisher_61": "Maybe if you went to school you would be able to learn about methods to stop climate change instead of running your mouth about a topic you know nothing about.", "allybbulloch": "Thank you Greta! You are wonderful!! 💕", "blondish\nVerified": "Verified", "arya.owo": "Thank you for speaking up!!", "neosimpson1": "yes Sharon!!!", "aaaa11": "💐🤗", "cami_monteir_o": "Parabéns", "arooks0": "2 kap. 7§ skollagen (2010:800) 2 chap. 7§ School Law (2010:800) this law basically says that school is mandatory for all children in Sweden, meaning that she has been breaking the law for 72 weeks. #polismyndigheten", "dekkermo78": "hai un Po rotto il cazzo", "this_v4ll3": "DISLIKE", "will_debie": "Good way to skyve you twat", "xenofontecida": "Happy Birthday Greta!!!", "mocharocky11": "You do know that your going to have to do school in the summer... then all the students are going to be pissed", "angelina.carnet": "Happy birthday", "byediss.17": "😂😂😂😂😂😂😂😂😂", "oskar03carlsson": "om alla stannar hemma från skolan kommer ku klinatkatastroferna bra försvinna👎", "mayaliliscott": "You. Are. Incredible.", "christiianscalia": "Carta sprecata e pennarelli sprecati🤬🤬🤬", "balint_bacso": "climate change is 99% natural humans have a very little effect on it and its very far from being life threatening", "sue_brasier": "💚🌍", "feni333": "😎✌💖💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞", "love_my_life_1978": "⭐️⭐️⭐️⭐️⭐️", "dayalanand": "U r not helping", "rickreedhowbowdah": "Happy Birthday", "lisapure": "Happy Belated Birthday God Bless You For What You are Doing 💜🙏❤️", "wille_angel101": "Köla d24 för klimatet", "mariacristinaavila__": "Un ejemplo para la humanidad", "valx_15": "mal amk", "yuls__01": "Has talado un arbol", "kd_10604": "imagine trying to fight climate change by not going to school", "chriswwise": "Imagine thinking you are making a difference by encouraging kids all over the world to stunt their education to prevent something that’s inevitable", "williaam_engstrom": "Hahahahahah skolkare", "levin_gz": "@enis_gz", "m_s_t_e": "💓💓💓", "marce_marshall": "Happy birthday @saguillo_22", "matiloco214": "te banco afafafafafafafafaffafaffaffa fuerteeeeeeeeeeee @martinpdisalvo dea", "katja6192": "Tak🙏🏻🇩🇰", "kings.right": "great excuse to miss classes", "tuttylinda": "Você é uma farça!!!", "hooniefeltham": "Happy birthday Greta❤️💕💜", "bulle_barcelona_love": "👏", "magic_archere": "Don't you wanna go to scool to learn? My opinion, fosil fuel dos have futere. The result for the problem of Co2 is to plant more trees and to cut less.", "maritanilzon": "🎉♥️Grattis Greta på Födelsedagen 🎂🎁♥️", "gusttavo__duarte": "Australia calls for help, do you only help what suits you politically?", "uleawesemeyer": "❤️🙏🏻", "danii.ftck": "Du bist Behindert 😂", "gs1905arena": "❤️", "laboratirio_supreme": "no hablo Frankfurt :(", "salty_pisces_mermaid": "You are AWESOME 💯@gretathunberg", "hndc_wln": "Alles gute nachträglich zum Geburtstag... es ist alles schön und gut, dass alle protestieren und nicht zur Schule gehen....(gefällt nur denen,die nicht zur Schule gehen müssen) aber was bringt uns das?!? NIXXX!!!! Da die nächste Generation nichts auf dem Kasten hat!!(weil sie nicht zur Schule geht) da alle steiken und zum z.B. ihre gerauchten Zigarretten liegen lassen oder sonst irgendwas...bringt das NIICHTSSS . Geht in die Schule achtet immer auf euren ökologischen füß abdruck.!!! Räumt die scheiße von den 40%(keine genaue Prozentanzahl) der Menschheit weg, die ihren Müll im Wald oder auf die Straße verteilen ohne euch zu beschweren. Wir werden in der Menschheit nie soweit kommen das wir die Erde so rein bekommen das wir alle drauf Leben können. Ich bin zwar selber erst 21 habe aber solangsam kapiert worum es geht(das wir unsere Erde retten wollen, worauf wir leben). Und ihr denkt alle das wir das schaffen wenn ihr nicht in die Schule geht... lächerliiiiiiich!!!!!!! scheiße", "reneerollpalamara": "Happy belated birthday! Yesterday on you birthday my 12yr old daughter danced in your honor! Her dance was titled “how dare you” and it was to your speech with music put to it:-). Hope you had a great day!", "maddekiwi": "Skolan har väl inte ens börjat än? Det är fortfarande jullov vad jag vet.", "tijs_.0134": "Burn earth burn", "goiabada_de_maracuja": "Adm furioso", "__.will16.__": "How u striking school, it’s Christmas holidays😂😂", "blueheron999": "Happy birthday Greta 🥳", "lionell.spocky": "Happy Birthday liebe Greta👏👏👏❤️", "felipe_marquwz": "Maybe if you went to school you wouldnt be such a puppet", "anna_kriista": "👏👏👏", "axtx.7": "Cestá con un cartel que probablemente termine en la basura", "_.ele_06._": "Auguriii 😍😍😍😍❤️", "josete10_": "HOW DARE YOU? YOU HAVE STOLEN MY CHILDHOOD GONORREA", "joaoclaudiojr": "Skol é ruim mesmo kkkk", "sheep_in_w0lfs_cl0thing": "Happy birthday💕💗", "vwnla": "❤️", "rafadrcarvalho": "The Savior working 😱 👏🏼👏🏼👏🏼!!!", "chris_tian_le": "Now it's time for you to get out of the public eye...", "genotv63": "WORLD ON FIRE 🔥 ‼️@stickfiguremusic", "ellie.maira": "You go girl #strikeforclimate", "madocatkinson": "Go back to school", "hikolay_ksehdzov77official": "Love you greta Thunberg ❤️❤️❤️🇸🇪 you my hero", "camilamazzade": "Vai pra escola caralho", "mkatemcgowan": "@jasmine_axx", "i_l_4_r_i_4": "Happy b-day❤️✨", "petervaneden33": "👍", "inge.steinbach.5": "🙌 💟", "monagarciaaa": "Come to Puerto Rico!", "ecookskis": "Isnt that illegal", "matovlck": "just go to school kiddo you'll need it..", "supervladicksuper": "Пиздуй в школу, ёбаный позер", "pierce__johnston": "72 weeks!!😂. Sounds more like a vacation to me", "dar_hemma_darb": "Din mamma knullare", "marked_banner": "Usch greta", "aidan_beck": "Go to school", "melis.aroni": "I start laughing while seeing this", "daniel.anghel.988": "Fuck off beach", "maimatos_": "AUSTRALIA NEEDS HELP", "gorannordstrom52": "Som vanligt på samma underbara plats med samma underbara helt vanliga skylt. Ändra aldrig den", "sacchi1977": "Where are you @gretathunber to help Australia? No chemical company paid you to protest and cheer for a better world? Or are you wasting your time practicing rifle shooting like you always do? His gaze already knows that it overflows with hatred, but his hold on Australia spoke louder than his sordid expression. And you @emmanuelmaceon still think the Amazon is the lung of the world? Both first-world jerks.", "west_virginia97": "Where is your make up?", "elinorehanssonboe": "Hejja😍👏👏👏👏", "cosmic_lilywhite7": "👍👍👍👍", "_lucas_pdc_": "FALA SOBRA A AUSTRÁLIA", "gabrielsampp": "Let's talk about the fires in Australia?", "aigner_annalena": "🤮🤮🤮🤮☁️", "alepiresoliver": "🖕🖕🖕🖕🖕🖕🖕", "guedandan": "School strike??😳😦🤭", "karen_chvlr": "On lâche rien❤️!", "united_liberty_paper_contact": "Do you have actually a life?", "jetlagged2": "By the way...Are u Vegan????", "maadurante": "Why don't you talk about burning in australia ?!", "alex.amorim12": "🖕🖕🖕🖕🖕", "ceci_yunga86": "👏👏 desde Ecuador 🙏👏👏", "papillonbleu3005": "Happy birthday!", "sylvieisthejam": "Happy birthday you glowing light", "renatamourato": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "rtmailson": "A Austrália ta pegando fogo! Não vai falar nada? 🤷‍♂️", "valderio_quirino": "E a Austrália Greta? Vai falar nada não? 🤐😩💩", "isadankers": "Good job Greta! 👏🏻 U mean a lot for the world! 👏🏻✌🏻", "purplefoster": "És tanulni mikor fogsz? 😮", "andreeperezgonzalez": "Avec un peu de retard Greta, je vous souhaite un joyeux anniversaire. Si je puis me permettre, je vous embrasse très fort ! 😘", "mafernandama18": "Hello pirralha, won't you say anything about Australia? Only speaks when it is in Brazil. 🍪", "edneydenis": "Australia🔥🔥🔥🔥", "saurabhh999": "I don't know what have I learned from this enthusiastic girl @gretathunberg about climate change..but one thing I have definitely learn- consistency.", "thepeckishbunny": "🔥👏", "luccadenardi": "500.000 animals were burned until death in Australia!!!!!! What do you have to say?", "helo_1981": "🦘🇦🇺🔥", "karin_reis_reis_": "devastating fire in Australia and you shut up, Amazon fire and you protest. its sponsors are keeping an eye on the niobium and gold of the Amazon, something that Australia does not have. Your intentions are good but the people who use you just want money. Australia matters", "ingegerd.forssen": "Grattis till dig och oss❤️🇸🇪", "sherryteach27": "Happy Birthday ❤️❤️💖", "raimundo.neto.silva": "Única coisa que vi de bom foi skol🤣🤣", "junymona": "Happy Birthday!❤️", "klintcharlotte": "poor child she doesn't know any better I think it is child abuse :(", "ecrinyesilgul": "Go go go bestie💪🏻💪🏻", "casadocurioso_": "About Australia nobody talks right @gretathunberg ?", "bubblegum_and_cigars": "score streak for climate, noice", "genesisms1981": "Pq não fala nada sobre o incêndio na Austrália????? Ou sua revolta é seletiva????", "silmaraoliveira4": "E a Autralia precisa de ajuda", "serenohh": "🇦🇺?????????", "andreas.kratzke.90": "I love you", "sahramohammedhali": "❤️❤️❤️❤️❤️❤️❤️❤️💋💋", "taranewhole": "YES!!!!!! 💙🌈", "gustavopbarros": "🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿", "mylenadratcu": "Where are you regarding the bushfires in Australia !! The bushfires are 7 times bigger than Amazon fire !! What are you going to do ??", "signepingne": "Grattis greta❤️❤️ hoppas du hade världens bästa födelsedag❤️❤️", "ivveg": "Grattis Greta och kämpa på! ❤️🎄🎆", "brennansuski": "Such a great role model. Happy Birthday!", "ejilaaaaa": "happy birthday!", "maxfuchs_": "Hur fan kan det vara strejk när det är lov? Vilket jävla skämt du är", "mxflr.my": "How old are you now, 8 ?", "moattalla83": "@ayla_krb", "cami.llica": "Andá a estudiar pendeja", "reezyd": "Way to go Sharon", "politerebel": "Bravo you and thank you ❤️", "texmexrosie": "Happy Birthday Greta. 😊", "juanitoeltontito3000": "She’s doing all of this just to not go to school", "carinacborba": "australia is burning! and you don't care! fake girl! just want to know about Brazil! Money money always this! fake girl! disgusted!!!!!!", "fridaysforfuturesantamarta": "Our best wishes to your 17th birthday Greta❤ We hope a marvelous year to you and your love ones @gretathunberg", "soledaddelreal": "Happy birthday girl!!", "_diogobotelho": "Now I want to see you defending Australia! Take your eyes off our Amazon your opportunist.", "bambinofromindia": "School strike ?..................you son of a b***** , I'm in .", "sayjelvijaypatel": "You are a legend! All the best", "frau_nascto": "What do you have to say about fires in Australia?Are your dreams in danger from the fires in Australia?", "williamcarvalho_sjdr": "🇦🇺 🔥 🇦🇺 🔥 🇦🇺 🔥 ??? #hipocrita!", "georgialandree": "Happy birthday queen", "peopleforfutureleipzig": "Alles gute zum Geburtstag. Bleib gesund und munter. Und pass auf dich auf! Was würden wir nur ohne dich tun? 🍀🐞 Wir lieben dich! 💚", "karenschiavinato": "#SOSAUSTRALIA Nao entendo esse silêncio", "kiki_blaah_blaah_2712": "Hi Greta👧", "thiagoo.albuquerquee": "Muito mimimi, só quer IBOPE e algoritmo no instagran!!!!", "amtedefjord": "FANTASTISK FLICKA", "jannes.wzm": "@leonxwue", "vareniyhuy": "well done! you're a walking condom ad! the fewer creatures on earth, the greater the benefits to nature", "hannahnordeide": "💯", "ldl_nunes": "Riquinha, mimada🤣", "milans.04": "Allahu akbar", "brassboi61415___": "72!!!! That’s crazy. How have politicians not taken action!!!! 😤", "vote4climate": "Happy birthday 🙌🔥", "marco.holschuh": "Scheiß Klimafotze halt dei Maul😡", "freehiker22": "You have inspired millions. You are changing the world.", "vlcvn": "Y no vas a defender tbm a Australia títere se mierda", "oliviayeo_army_bts": "Hi, Greta! This Olivia from South Korea. I got inspired from you about your courage and how you fight for our Earth. Now, I am fighting for climate justice too. I researched about global warming, big fires all over the world including Amazon and Australia. I am very concerned and worried. I want to fight it! Together we can make the world a better place. Watching animals(polar bears,Coala ..other endangered animals) I think human should be more responsible about this. I am now attending on a campaign and also sending a curious and significant message to the world. Let’s fight for our Earth together🙌We can save millons of animals and our home👈🏻We should figure this out and stop it immediately. No matter what others say, I am going to fix it", "joaomarc0sr": "Australia", "6c.english_coaching_institute": "Jag hoppas att alla dina önskningar går i uppfyllelse. Grattis på födelsedagen 🎂🎉🎈🕉️🌍🙌😘", "javadharati76": "Iran wants peace but defends hard And it takes hard revenge #ghasemsoleimani 🇮🇷🇮🇶#Hard_revenge usa is trorist 👎 sorry for them", "jk18701": "#dienstagfürdiesel Die Welt geht eh zugrunde !!!", "renatakopsch": "And what about Austrália... what do you have to say???", "eng_civil_paulogiudice": "Ando Austrália? Hypocrita", "manusgerhardt": "and the fires in Australia? will not manifest ??? only care about those that happen in countries ruled by the right? that's weird!!!! just for your science, the fire in Australia is incredibly larger than what happened in the Amazon! 🔥 🔥 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "monicatam01": "Happy Birthday Brave Girl!!", "_jauharghany": "Happy birthday❤️", "noahforsberger": "quit! 😎🐑", "felipehmkt": "AUSTRÁLIA ???", "weslei_brendo": "where is your outrage over the burnings in Australia", "rocionanclares": "Happy birthday💚", "dr_richardb": "❤️❤️❤️", "evelina.fsh": "Chicken leg bis", "fun_vanallesxx": "Happy birthday❤️❤️", "victor_estrozi": "Are these clothes because of global warming?", "hasegawacamila": "Austrália pegando fogo ... Mas o que importa é a amazônia né ? 🤔🌎🤦", "v.akeesan.v_14__": "Happy birthday🎊🎉🔥", "01mirkan": "@memox_46 😂😂😂", "johnsonwelton": "Austrália 🇦🇺????", "niclas331": "Scheiß auf dich Silvester ist BESSSTE AUF DER WELT!!!!!!💪🏾#mrpyromanager", "valentinanversa": "nice! and Australia? :/", "politics.news.atm": "Go back to school and learn some basic knowledge. I truly feel so sorry for the brainwashing your parents have put you through", "rafisa": "Hey?! What u gonna say about the australian fire? U told so many things about the Amazons fire, and now, u say nothing about Austrália? Where do u live?🥺😔 shame!", "gustavoalmeidagomis": "🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺?", "10izocean": "кырти бермеш", "leandrotfb": "What about AUSTRALIA 🦘🇦🇺???????? Speak only about BRAZIL 🇧🇷 . POLITIC GIRL. Only money, only politc!", "rafaelhachem": "You're full of shit! Go back to school and stop being a pawn in the globalists games!", "pooriyariyan": "Perfect 👍🏻", "mogwai1401": "Und rate mal aus was das Material von Schlafsäcke ist womit sie im Winter unter der Brücke schlafen. Schon mal nachgedacht aus was die Einweghandschuhe und Equipment ist womit in arme Länder die Ärzte arbeiten ?? Hör bitte auf Demo‘s zu veranstalten, weil die einzigen die Müll produzieren sind die Menschen und Touristen die den Müll nicht sorgsam versorgen . Es würde schon allein helfen wenn alle ein bisschen bewusster leben . Keiner will auf Kleidung und Sneaker und Handy verzichten aber alle schreien bloß die böse Industrie . Schon mal darüber nachgedacht das die böse Industrie Arbeitsplätze besorgt und was würde passieren, wenn alle Menschen Arbeitslos sind ?? Bete nicht um die Welt weil sie hat ihren eigenen Circle. Die Erde hat schon einmal gebrannt und Dinosaurier und Bäume und Blumen starben, glaube nicht das es in der Zeit der Mensch zum brennen brachte. Auch die Eiszeit wurde nicht von den Menschen verursacht . Und trotzdem glauben alle das den natürlichen Circle der Erde der Mensch verhindern kann. Die Erde wird noch einmal brennen aber sicher nicht deshalb weil die Politiker und die Industrie so böse ist und Sachen produzieren die du Tag täglich verwendest! Was glaubst du sind die Glanzmagazine gemacht auf denen du abgebildet bist ?? Bitte schenke deinen Preis an die Menschen die nie Aufschreien wie böse die Welt ist und tatkräftig in der Welt freiwillig helfen . Hör auf mit Luxusyachten auf deine Meetings dich wie eine Prinzessin kutschieren zu lassen, wenn du umweltbewusst leben willst dann schnapp Dir ein Rucksack und geh zu Fuß!", "hansi_8070": "#shannon 👍", "sad.shyy": "ok sharon", "micheledepoli": "E a Austrália??? 🇦🇺🔥🔥🔥🦘🦘🦘🐴🐴🐴🦜🦜🦜🔥🔥🔥🔥🔥", "zorkoo97": "Bacaj te smece u okolisss koga boli kurac za okoliss lal", "felippe.canale": "💜💙💙💙💙💛", "monalisa_santiago": "E a Austrália @gretathunberg 😠?????", "felieto": "Да заебала ты уже", "alessio_marius_lupu": "Happy birthday!", "admilson_monteiro": "Já foi visitar a Austrália ?", "laryoliveira.24": "Já viu as noticias da Australia ? ou vai fica se fazendo de cega?", "juh_fany": "And Austrália ?", "fabian_j.b": "Schulstreik wegen Faulheit sollte es heißen, was die schon Schule geschwänzt hat ist abartig aber ja solche Leute ohne Schulabschluss sind ja dann immer die die befürwortet werden nur weil sie Fame ist, jeder andere hätte schon lange Probleme bekommen", "brunomilk10": "É facil falar do Brasil né? E as queimadas na Austrália? Nem se mexe para falar nada, você é uma hipócrita.", "delegado.antonio.carlos": "🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "ch.ar.mi.an": "Wow that sign has been through a lot.", "lucasvieirabjj_": "A Austrália está queimando vamos se pronuncia4", "diggi122": "Anscheinend geht die klimma erwärmung doch nicht so forwärts. Scheint ziemlich kalt zu sein 😂", "peppo.198": "A scola vatinni", "gentlebluesky": "Happy birthday Sharon you are doing awesome! 😍💖💖💖💕🌸😘", "jvfreitasdg": "AUSTRALIA??????", "whiteaidaa": "Love you, Greta", "tina_mendes": "we are awaiting your protest about the fires in Australia", "ayonasson": "🙌🏼🙌🏼🙌🏼", "assinoe": "Australia em chamas e o que você diz ??", "grill_mark92": "For she...idk actually ever do anything to prevent climate change? Or just make paper signs? There’s people planting millions of trees, discovering bacteria that turns plastic to harmless enzymes...but she holds a sign and skips school and is person of the year lmao. Y’all are brain washed and clueless. A horrible combination", "letibham": "Happy Birthday", "kikee.420": "Kahba", "hionaragalvao": "Desocupada", "moritz.kummel": "😂😂😂", "erikarvidssooon": "Du har inte ens skola idag", "max.sb162": "Ich tu an meinem Geburstag gegen dich streiken du olle", "nixmhstxphens": "Happy birthday and thanks for what you do for the planet❤️", "io6843": "Ma quante stronzate", "maximiliano.acosta92": "Australia 💔", "m3lih_ktc": "Happy birthday My sunshine😍", "quailhunterr": "Happy Birthday, Brilliant , Amazing , Inspiring Girl 🌍😊🌍😊🌍", "_raphaelrusso": "Nothing to say about Australia? Only Amazônia? Idiot girl...", "docholiday513jg": "I love her idea but its logically imposible with she has a plan but no tru way to it", "pedromartinezguedes": "You are on permanent school strike .... it’s not a thing to ask for other children, they need the school, go for a weekend strike ... it’s getting sad and boring your way to address the climate subject, ACT instead of talk and crying ... ACT, find solutions, everybody already knows the problems ... and quit asking people, specially children to strike", "kayzmitchell": "Does she even go school", "lucas_95lima": "nothing about Australia?", "alextasse67": "Oh Man U spelt that awfully wrong.. whatever it was.... ur far off.. but u can kick the fuck out of a football I’ll give u that barb", "bernardostrauch": "Hey! What's going on in Australia?🔥 Are you going to stay quiet? For sure! Australia isn't interesting for you! 🤖 You are a marionette.........", "ricardo_folly": "https://m.facebook.com/groups/1647653995476942?view=permalink&id=2683631685212496", "fe_teixeira": "Maybe you could talk about the half billion animals dead in Australia due to the fires. I believe it is as important as the fires in Brazil, since Australia has been burning for weeks and nobody cares.", "treintadoblesetenta": "How dare yoj", "dimafuckingfriday": "Шаболда", "o_antiesquerdista": "Dear australians: This useful idiot doesn't care about your country. The fire in Australia is 6 times more than in the Amazon and we are not seeing any support from this asshole for you. 😠😠😠😠", "nazimzeddour": "🌳🌲🌾🌿🌴🌁🌞🌊🌏🌍🌎", "emel__erden": "Happy birthday sunshine. 💫💫", "lucascosta3301": "Australia???????", "hallbarabraas": "Stort Grattis på födelsedagen @gretathunberg Hoppas du fick en fin dag ❤️", "jackytaylor_": "@gretathunberg Australia needs your help. Please can you post about our fires? Over 5mil hectares gone, estimated 500mil animals perished, toxic air, carbon spewing into the atmosphere. This is climate change. This is horrific 💔💔", "cristian_rmcf_": "Sisi mucho clima pero a Australia ayudar no vaya a ser que te manches las manos. La gente es tonta en creerte si te la suda la contaminación y todo solo quieres el dinero", "mariekireeva": "Greta, first happy birthday, secondly, you might want to go to school so you can change the world, not just say beautiful speeches. The school is designed to make us better!(I apologize in advance for possible errors in the text)", "melvinmartin4258": "Thank you for standing up for this planet 👏👏👏👌👌👌👍👍", "lucaslundinjonsson": "Men ge dig nu för fan Greta", "dilsemarie": "Happy birthday!", "zilskerobert": "Happy birthday ❤️", "wallacechavees": "Austrália pede socorro", "chiara_dierfeld": "Happy Birthday ❤️", "probably_lewis": "i hate u greta suck an egg", "dazzlingfev": "❤️❤️", "edvaldoveiga02": "Parabéns pelo seu empenho e por defender o meio ambiente.", "mihailescu63": "🔥🌎🔥🌍🔥🌏🔥🇸🇪⏳🇷🇴", "pinnyisms": "@gretathunberg Happy Bday Sharon! 🙌", "joaorsjunior_": "Aren't you going to talk about the fires in Australia? Hypocritical.", "brunoo_lcn": "Happy Birthday Greta !", "atlantidae4": "LOVE this photo. I just read you had a difficult time in the pass, and see how far you have come, so I admire you, you inspire me a lot. Best wishes dear Greta.", "jon.moura": "Vai estuda garota,vão invés de fica fazendo esses protesto de merda ai!", "rosiedesilva": "Now more than ever.. Australia is burning. Asia is flooding.", "tunnuz": "Happy birthday 🎈", "lke46": "Happy Birthday and THANK YOU, Greta!", "aidantroucan": "Din mamma hund", "hanne___x": "Happy Birthday !", "johnywoody444": "Do you have any idea how much electric power was wasted in order to make this photo? And how much electric power was used by millions of people to see it and give it a like? #saveenergy", "deluxe_cereal": "Yoh Greta have you been drafted for WW3 yet", "luke.gaww": "Cause the board is spray painted it can’t be recycled 👀", "laura.roth123": "Happy Birthday, dear Greta. All the best for you", "davirochz": "AUSTRÁLIA", "knight.nina": "Happy birthday ❤️❤️", "lennartforsell": "❤️", "jaimeloves": "Any interest in the Australian fires???", "deltaman68": "Keep going.", "superevas_": "👏🏻🌸", "intergalactic__soul": "I need it to do this ,cause the cyrcle of life,am in this plqnet, yet am not from this planet, a belief relegious system teaches you that is either hell or heaven, been in both in hell i fougth next to a clone of electro #electromarvel and we deal with the humans politics ,races,etc he train me ,with other i fought ,punched ,got punched, got stabed ,and learn the rules a man follows,there was no smoke ,cigarettes or smoke in general,and got along with all ,no smoke,and now am experiencing heaven theres bunch of smoke,cant walk in peace cause the vipers and Shapeshifters, smoke.humans know what they are doing cigarettes and smoke in general ,is a weapon and yet you keep using it against each other,you deserve the suffering you going trough, i choose to not stabing with my claws, i got out of hell,cause i became strong in the mind .if i had killed someone in hel i would just gone to lower floors of hell,ones you do it you aint coming out, and am not going either hell or heaven am going trough, my own way ,my soul escaped once and i will do it again. People cry cause banks ,climate ,meat plants and rocks thoes are not the problem ,are some of the old generations and youngsters, cause blindness. My war is not over we still in second world war.i figth for whoever wants to survive. @iamjamiefoxx. Jarvis let know scott lang that i snatch the hardware and software of the Shapeshifters mansions base ,in cali and to venom that he has to learn to hold his breath ,i talk and work with the #moonknight , i understand him well,we went through  similar staff  and theres others pretending  they can be him and #angelsalvadore Shapeshifters , we are just one of a caind. #exercise #setups #chakrahealing #chakras #xmencomics #xmenblueteam Lets just say that this days people are being send after me not with guns but cigarettes.  after biking all day making money and surviving against the cigarettes  smoke  holding my breath and not stabing with my claws all does petty  assassin's who dont even know what they doing,not to mention the vipers. Dont come to me with a cigarette, @marvel @marvelstudios @thehughjackman @robertdowneyjr @chrishemsworth", "lucianonavespgmail.com8": "Um dia os governantes vão ter que diminuir há poluição no planeta terra, no ritmo que vai cada vez mais o nosso futuro fica mais frágil, a resposta virão com catástrofe tempestade terremotos e inundações, Greta pode até ser uma pirralha patrocinada pelos seus cumprisses, más o que ela fez em prol da despoluição climática não foi em vão, parabéns Greta 👏👏👏👏👏👏👏👏👏👏👍", "virvapaloviita": "happy birthday!💕", "danielwerneckmiranda": "Aren't you going to do any public demonstrations about the fires in Australia the same way you said about Brazil? Or was it just media buzzwords because Australia doesn't have the same wealth that Brazil has in its subsoil?", "marciasantacruzoliveira": "Happy birthday Greta!!! U r so amazing!!! We love u!!! ❤️", "oliver_law0901": "u are so poor 🤮🤮🤮 go back to your school🤮🤮🤮🤮🤮", "lauraa.ktt": "Happy Birthday ❤️❤️❤️", "mircovarotto77": "🎉Klimateten!!!!🎉", "guus.vd07": "Fuck you", "le0n.brn": "Halts maul", "erytnicamttocs": "@shonaknight91", "cheeetoenugghut": "What’s 3x(5-9)", "janewik": "👏💚🌍", "y.o.l.o.xx": "Happy Birthday 🎈", "saxon108": "Help us in Australia! Let the world know what’s happening here 😔", "gunnarfjohansson": "❤️", "neelamminhas09": "❤️❤️", "vova_shkaf": "Ты какашка", "krazykittylover": "Happy birthday ❤️❤️❤️", "vr1crazyfamily": "Happy Birthday, dear Greta❤️🤗🤗", "niccolin1": "👏👏👏", "tiffant63": "🌺🌸Happy Birthday 🎂 💐 Liebe Greta 😍", "samuelsilas.s": "Austrália?", "mickey_madra": "Happy Birthday Greta 😍 So greatful for all your hard work and determination 💗", "franciii2777777": "#FridaysforFuture", "gloriaggatti": "Greta come to India 🇮🇳", "vogelwiesenwalther": "loooooooooooooooooooooool", "jen_sharman_": "Thank you Greta", "sheryldcornell": "Happy birthday, Greta.", "saltypcorn": "I love what you are doing and support you and want climate action taken seriously. But you should be in school. I only say that as a teacher who knows the importance of an education.", "sartibjj": "Go help Australia 🇦🇺", "mirellart65": "🌷👌💕", "cals1000": "Go to Australia. Its hot, very hot there 🔥🔥🔥", "galinushka21": "#helpaustralia 🙏🏻", "evandroteodorodasilv": "PARABÉNS GRETA 👏👏👏👏", "dnl.gimenez213": "💯👍💪👊🏼", "ingergosohav": "💕 jag gratulerar dig Greta. Du är fantastisk. Var rädd om dig så du orkar!", "dickinsonlupe": "Happy birthday, Greta! Thank you for all you do! Sending you a big hug from Orange, CA!", "lucky4.clover": "Happy Birthday", "asaventurasdepaulocosta": "Your dreams are being destroyed at Austrália. Where are you?", "mayakikko": "happiest birthday Greta thank you for all the work and inspiring things you do for the betterment of our planet 🙌🏽", "jovan___jankovic": "Hau der ju!", "rollo_pollo": "I hope you still get education while on strike. I’d hope so cause what else would you do doing besides climate speeches?", "olegvolodumurovuchgmail.com_": "🌎🌏🌍", "cocodebruycker": "Happy Birthday, Girl! Keep shining & speaking your truth even when they aren’t ready for you!", "buds.adventures": "@gretathunberg 🔥 🇦🇺 Please help Australia!! 🇦🇺🔥 We have lost 6.3 million hectors so far. That is more than the California fires and the amazon fires combined!! Please use your platform to raise attention to the matter so people can make donations to those in need! If not donations at least some more help with resources to put the fires out!! We need to draw attention to the matter. Please help Australia is burning, wildlife is dying! :(", "maateuscarvalho": "austrália is on fire", "harrygilchrist": "Complaining about the climate rising while wearing many layers to keep warm cause it’s to cold", "ediesverse": "🥺", "davidwilsoneso": "if your wearing a fucking coat and the earth is \"heating up\" that defeats your point numb nuts", "mrlemones": "When drake texts her the day later🚨🚨🚨✝️✝️", "original_mad_magazine": "I've got a great idea instead of going to school you can just hold the sign the rest of your life, when you get older it'll say will do anything for food 😂 🤣", "swaymo15": "We need ' We need Greta people'"}