{"cockdestroyazzz": "🌲🔥", "ulisesbiaggin": "🇨🇳🇨🇳🌪️🌪️⛈️⛈️🤯😭", "hanna.augustynska.tennis": "💔💔💔", "miamariepersson": "😮😢", "yeehaw.conservative": "trigger warning: the fires were not caused by climate change", "_.iinniiggoooo._": "@lilpump este tío se pone abrigos de piel de animal 🦕🍼😭😭", "leonschwab.05": "wir müssen die Klimatemperatur einhalten, sonst sieht es bald überall so aus", "bettymariaparker": "😢", "juanmadasilva.20": "😭😭😭🌎🌎🌎", "gabisavingtheglobe": "I can’t believe after all that we’ve been through, no one is accepting change. No one even wants change! What will be enough? If humanity doesn’t act RIGHT NOW, then they are letting down our generation. And our future.", "zoe.bella.12": "This is so sad that our world has come to this we need to change @daniela_muhammad", "sweettreatsislandweddings": "Shut up . You are full of shit. Australia has always had fires you fool", "xoxprincessashbiexox": "Hey Greta, you probably won’t see this but your such an inspiration, me and my friends done a fundraiser about this and we raised £567.39! Our goal was only £300", "n.d.2007": "🖕", "radojica_tomovc": "👏", "ivan_kraus_": "F", "patricks_poop_lagoon": "Burning Bitch", "_leraorlova": "😢", "chochippi": "F", "neuza2935": "MDS🔥", "skuri.02": "australian partys are on fire", "katiedoveyy": "how can a fire start from climate", "maximilienkenji": "🙏🙏", "ashleigh__2002": "For those asking about arson and all other things These fires started back in September or August they started because teenagers thought it would be funny to light a fire These fires then got out of hand not because of climate but because the politicians refused to back burn because we might hurt one or two animals There’s also a theory that children were corrupted into lighting these fires as people wanted to build a train line that went through farmers properties and they said no but the fires burnt where the railway was supposed to go Stop blaming climate for everything fires similar to these happened years ago and we didn’t blame climate then so don’t blame it now", "collins01234": "Tell me what we can do then", "savetheearthak": "😢😢", "ovsanka1238": "То чувство когда у тебя на местности летом +45°С в тени", "stephen304_": "The fires were deliberately lit.. but nooooooo climate change. Fuck off", "br.ody81": "Bb", "wtl1213": "Why don't you put out the fire?", "alex3463786": "😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢", "gizzmo.the.hammie": "This makes me sandgry", "minaabaszadegan1397": "Falotin2020!!!!!!!!!!!", "naomi.vallon": "Greta, currently reading \"No one is too small to make a difference\". Thanks. Really appreciate your efforts. Another book I have read entitled \"The Rules of Management\"; page 72 suggests: \"Train them to bring you solutions, not problems\" - Margaret Thatcher. All the best, Naomi", "latwerkingqueen": "😢", "hellishmraz04": "why no one talked about fires in Siberia but everyone talks about fires in the Amazon and Australia¿🔥", "laurence_mcdonnell": "Do you want a Bush fire to happen 🔥", "karli.schweiger": "Schaut voi geil aus", "__cdub__3": "#ItsNotClimateChange #ItWasArson", "lucasjothy": "🙊💔💔💔💔💔", "elstonblackmate": "just cause yall pussies dont have water bottles doesnt mean u have to pull a canada cosplay", "yudharifkiyawan": "help dear tree a lot ...", "toby_3e": "The only reason the fires went up was cause the green said we couldn’t back burn the bush and the when it’s goes up In flame that happens", "miles_of_style70": "Um arson anyone?", "gary_willis_paint": "😢", "vera_altay_lenskaya": "😪", "__________1x_____________": "😂 fuck australia fuck NATO AND USA", "dusakzdenek": "Najdi si radši práci, a přestaň se srát do sraček", "_polarbear_chp_": "How does the Australian feel smacking you right in the forehead😭 bitch", "nora_knows_": "#ourhouseisonfire", "winstonthehuman": "Leave Australia alone, go fight climate change in the countries that are most contributing. You are parading around some of the world leaders in climate conscious energy production. The irony is getting to hard to bare.", "evankettle666": "I hope the animals burn", "davlatbekov_shamsulloh": "@nature_vait 👈🙏❤️", "lman.17": "😢", "nick.sharma123": "😢", "quaputzi07": "Hallo, Das Foto hat mich erschreckt. viele Grüße Frederick", "yourlocalannoying11yearold": "💔", "josephs030407": "He do be lookin fire do", "jesse.lai": "🤣", "pionneer16": "💔💔💔💔", "konradgerhart713": "🇦🇺🇦🇺🇦🇺", "real_laro": "Well I know lots of people dont like Greta and think she is only good at talking, but i really edmire her and I think it's really brave to talk about things like climate emergencys because (at least from where I live) not a lot of politicians talk about these problems and (in my opinion) she has the right to say \"how dare you\" to people that ruine our future by not helping out in this \"battle\". THIS IS JUST MY PERSONAL BELEIF AND WITH THIS I WOULD NEVER INTEND ON DISSING SOMEONE🙃🙃", "evankuzava": "Arson", "lilswick25": "Caused by arson", "oliviasarat": "😢", "mgm_inc": "@gretathunberg it was caused by 183 arsonists not global change. And it’s currently raining there... stop spreading fake news. And go back to school.", "mikeindabay": "The fire was started by 183 arsonists, and is being put out by rain. Climate alarmists are crazy and causing an unnecessary amount of fear and panic 👎🏻", "dopey_jorgo": "When? WHEN DID WE FUCKING ASK!!", "the_hummus_queen": "Just an FYI. The fires were started by arsonists and as an Australian, that heat is reached in Western Sydney’s suburb of Penrith where it is constantly one of the hottest places on earth. The hottest day in Australia was in 1960 (50.7 °C). Not trying to undermine anything stated, just presenting some statements that do not exaggerate or make everyone extremely worried. We are still the best country to live in 😉😉", "michae1.gerges": "You did it just to focus attention on you just embarrassing", "iguanabacana": "Before", "sethwvandyke": "Not true. you're not here in Australia experiencing anything. Go to highschool and learn something", "aresselfdefense": "The fires were started by an arsonist.", "i_bims_1_robin": "Lecker Grillen", "tristan_thehunter": "The fires were started by arsonists you need to go back to school and actually do some research.", "brennan.myers": "Arsonist started these fires 🤷🏼‍♂️", "esconceajajjaaj": "k fuerte yo ya no aguanto mas con sto dio mio ay que me muero aaaaa me mori", "rat_o_tat": "SHRIMPS ON THE BARBIE", "i_a_m_batman": "Please note this is not true it’s estimated only and holds no value once you repost it as you have no education or understanding, you merely copied and pasted.", "5629ghi": "The poor animals", "rohan_lewis_99": "Mate Australia is doing heaps for pollution. We have heap of electric cars. Cutting down on fossil fuels. Australia is playing their part so you can't blame us. But you people want electric cars, how do you get electricity without a diesel motor.", "jpoliz06": "So we should give up our money for something that doesn’t even effect us", "ichbin1ehrenmann": "Hilf doch du affe", "mspargo07": "Dat kangaroo flying man", "photographer.xiaoyu_": "It's really heartbreaking", "yougooff_": "Ey greta du fisch Kopf hilf doch!", "maciowawa": "The roof is on fire", "swampadocious": "Actually these fires were started by climate activists like you...How dare you 🤦🏻‍♂️", "enesb_3": "That’s the corona virus", "wadesullivan_": "People started these fires not global warming🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤯🤯🤯", "grace_flora_g": "yeah and how are you gonna help this greta.", "cameron.slee": "Fuck off you little piece of shit. If you want to save the planet do everyone a favour and get the fuck off it", "_martin_da_gamer_": "The Australian fires weren't caused by climate change, it's been reported with hundreds of cases of people deliberately setting small fires in different areas of the forest, with climate change only contributing a minuscule amount to the continuation of the fires. Before you go on spreading a panic about a country being destroyed by the climate, research the truth. You are an activist, not a buzzfeed or TMZ writer who needs to spew out content every couple days.", "black_caviarr": "it's cus of stupid greenys like u that there wasn't enough back burning and prevention done before the summer, can thank yourself for the devistation little germ. fake news", "margot_arte_povera": "Thank you Greta.. 💚💚💚🙏🙏🙏", "pame.fox": "@gretathunberg now is flooded just week after Fires, part of NSW Are being flooded 😔😒", "ahegao.dank": "Australia esta en fuego y tu te la pasas viajando jsjsjj, robaron tu infancia y nunca te ah faltado nada, callate un rato maraca qla pasa a pico", "marco_garzelli": "😖", "bs_alexo": "🐨", "cashpbruce": "You do realize that these fires were caused by arsonists, right?", "kaeganoreilly": "And you thought it was hot now? How a 24-DAY heatwave on Australia's east coast in January 1896 saw temperatures climb to 49 degrees and killed 437 people.............Did they have climate change back in 1896.", "sassasjostrand9": "😢", "bunniesnrl": "What about the rain we have just had here in Australia. Bloody Climate change 🤦🏼‍♂️", "jessika.tigre": "vam se fude ela não apareceu as custas do brasil caralho a garota só tá tentando salvar o q sobrou do mundo", "iriaariass": "We must save the planet earth, our home 🌎❤️", "_imxgen_i": "We need to do something very quickly ❤️🌎😤😫💔", "gossmonika": "The lack of any meaningful political action from the Australian government to address the climate change is appalling!!!!!! 😡", "booby_auntmole": "HOW DARE THEY", "yia_kirkwood": "this is so sad, we will do our part.", "tmtrampzz": "Lol", "isabelle_maria04": "None of what you say is true, you do not get into the matter of climate at all. You probably do not know the past stories of the climate and what solutions were used in the past to avoid, for example, forest fires like in Australia. First, examine background data. It may well be that 2019 has beaten heat records, but is it within the last 30-50 years? Because there have been as hot years as 2019 just 200 years back and also before humans existed. At the same time, I fully respect that you do not want to eat animals, but it has nothing to do with the climate at all. I also respect that you really think about the climate and you want the world to make a change now, because I also want it, it go too slowly. I hope you investigate a bit more before you just panic because they say we only have 10 years to save the earth.", "lucy.elwell": "💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔", "erememevisie": "Krijg corona", "taivalmaki_": "Nice", "davemeaney": "These fires were deliberately lit! Nearly 50 people arrested! Australia has had bushfires for 100s of years, but the bush and national parks were better managed before green activists got in the way to stop hazard reduction burns", "sandiego49": "You people are so delusional, that was more then 100 people that started the god damn fires 🤣🤣🤣 lmao it makes me laugh so damn hard that all of you watch mainstream media like good sheeple", "heywood_claxton": "Come to Alberta see how we do it up here", "marizecomz": "Muito triste", "mikeoxlong_7": "Who tf cares about the fucking environment if people are dying bc of it then it’s an issue. Basically you just said fuck the people all I care about is the environment.", "ma01007": "This year Trump is crazy about it", "susie_janes": "Don’t use Australia as your platform 😡", "am.y.hi": "IT WASNT GLOBAL WARMING. The government in power during winter didn’t allow farmers to back burn leaf litter like they do every year. A small fire or even the regular summer heat caused a flame and because there was so much dry bark and leaves it all caught. Drought and shitty government decisions caused it", "haley.choww": "💔🥺", "ianarcher727": "The fires in Australia most were arson.... jesus who buys into this climate bullshit...yall are idiots", "turbosorcery": "Make arson more illegal?", "julielardner": "😢", "klaramelania": "excuse me, but there will be a fire in australia in 2009, it was 80% times worse than the fire that is there now, and there is nothing to do with global warming but with the theme temperature in australia being high and always will be!", "robert_fogph": "Ceusientjes int vier", "ich_sein_maxim_lol": "Oh gott", "amypics1122": "💔🖤💔", "mmm.benian.mmm": "Kokot horiaci klokan 👌🏼", "the.volunteerhub": "Heartbreaking", "carlosesquivelcabell": "😢😢😢", "that_guy_3.4.7": "People set those fires. They’ve arrested over 100 people for iy", "smamancio": "#Gretathunberg você fala muito e não agirá! Vai lá ajudar a apagar o fogo 🧯 já que não vai na Escola.", "noonejudgemybooks": "😢", "juusohelosaari": "sytytitkö ite tin vitun paska", "ellenhuddd": "But a people started this fire... not climate change.", "diercks.christine": "Stay strong 💪!", "sofia_bertolazzi": "How can we stay strong", "mike.kaminsk": "It was arson", "c.anna.05maria": "🙏🙏😢", "a_sandtrooper": "Let’s be honest here, Greta, these fires were deliberately lit by arsonists. Not mr Sun", "raphyo_6.36": "Hahahahahahah 🤣🤣🤣🤣 Vivement ton spectacle", "littlewoodenshoe": "Everyone here is in denial! You see nothing on the new only small articles. When it got to international news than people started to see more about it on tv and try to help. The government only stated to do something when international news agencies started showing up. Australians are baring their heads on the sand and the economy here is run my mining companies!", "poyrazhasimogluu": "😭", "william_dick_bow": "Fake", "rebecca__40009": "Ho messo likes solo per il canguro", "claudia_huszti": "😭😭😭😭", "_.v._.a._l._.e._": "Ceh lo avete fotografato al posto di aiutarlo", "alex200929": "What a beautiful landscape, I gonna go there to take pgfotosfor my gradp", "_sandy_2009_": "😭😭💔💔🖤🖤this is so awful", "katie___huff": "THANK YOU FOR YOUR WORDS... for raising awareness about where I live with so many others... thank you", "emilia_2007_0508": "Im so broken 😭💔", "ls_gamer_simon": "🤣🤣", "ronkaeser": "👍💪", "kilianus107": "😭😭😭😭😭😭😭💔💔💔💔💔", "paytonomanian_": "💕💕😭😭", "arionguyon": "Fake news", "kody_storm18": "You do know there are convicted arsons that started these fires right? I mean I’m all for going green as soon as possible but I mean it seems like they needed Smokey the bear more than solar panels", "emerald_sisters_": "💔🙏", "alfredo_dini92": "Australia is only a colony", "hrp2016": "When she’s not scripted she can’t answer shit", "spsteveo": "What a load of crap it was agonists that started the fires not the fairy tail climate change you are so wrong and a fake there is no such thing as climate change it's all natural the world is not getting hotter why don't you think they don't call it global warming anymore because the world isn't getting hotter I live in Australia and we are not getting hotter the hottest days on record was way back in the 1800s so get your facts straight and stop spreading your propaganda around we shouldn't be listening to you your just a child who knows nothing🔥", "__stefano_salvetti__": "@_.giordy_grassi._ brusa anche te scema de merda", "alice__berggren": "We need to to someting💔💔", "tedbowker": "I thought Australians were fire proof, I guess not 🔥", "anna_.1607": "💔💔💔💔", "matildeocchipi": "😢😢😢", "till.e.y": "IT WAS ARSON DUMBASS", "tri.druga": "Страшно смотреть на все это, а наши слуги народа про Сибирь забыли", "braydensinclairrr": "Wish I was in Australia.... I’m experiencing all time lowest temp recorded winter out here...", "arxn_89": "😔😖", "lucaspriv16": "It’s weird cuz I didn’t hear nobody that asked", "anitalee.68": "😭😤", "ulysse_2007": "HELP Australia", "houseofbrady": "This wasn't caused by climate change", "duckillz": "Trump 2020", "kimbo_pas": "Eine solche Katastrophe für sein eigenkapital zu missbrauchen ist eine schande😞hab schon wenig von ihr gehalten, halte jetzt noch weniger von ihr", "javon_mg6": "Ok nigga. And?", "jake.wil11": "Then go fight it oh wait ur a women", "7iwonka5": "💔💔💔", "gang_abstinence": "Myth no evidence that Australia exists", "daniel_mark25": "Did you know that idiots also started those fires? What are you doing to stop people like that?", "rodrigocerpa9": "Y cuando les conviene es culpa del supuesto cambio climático y otras veces de bolsonaro o del ministro de Australia", "vpn2580": "The bush fires happened because environmentalists wouldn't allow clearing of brush, not because of global warming. How dare you!", "sofiiii.solanet": "The Australian fires were caused by arsonists. Not climate change. Arsonists.", "lukevd11": "PEOPLE set Australia on fire to make it look like climate change is happening😂 climate change isn’t happeing", "redram_jp": "Maybe if you stayed in school, you'd be able to form proper sentences.", "lil._.slit": "Donate every penny you make to Australia", "professor_lance": "Are we just going to ignore the fact that it was arson?", "ojstarkey2004": "Quite ironic how Australia is flooded now", "ryan_mailman": "Oh and people say australia dont exist i live here", "ketochris86": "1. INDIAN OCEAN DIPOLE 2. CLIMATE CHANGES ALL THE TIME 3. THE LEFTIST POLITICAL PARTIES BAN FARMERS FROM CLEARING THEIR OWN LAND SO THE RISK OF FIRE IS MUCH HIGHER.", "_lando_24": "Literally the fires have been set off by humans, over 200 of them. That’s not the CO2 emissions lol or even climate change’s fault lol😂 @gretathunberg", "idk.eamons.priv.ig": "Ngl the ash cover hear in new Zealand from the fires was nice and kept away a very hot day", "agnes_akerlind": "Stakars djur😢", "alex.dr1p": "How dare you", "itstiggytime": "That’s confirmed 183 arson cases by the governing officials... how dare people with a large voice misconstrue this as their climate change tool... I’m sure the people setting them up on a stool are also #climatechangeterrorists", "meltslikeice": "Arson is a terrible thing, so sad.", "sean_the_farmer": "Fucken scomo", "sergey_devil999": "Шашлык бля медиум вел сука", "ocean_.avu": "Oh no😢", "charliemm_13": "😍😍😍😍😍😍😍😍🔥🔥🔥🔥Litt fam", "yoona_bts_07": "💔💔 I cried alot after seeing this 💔💔", "caden_casey": "🤣🤣🤡 Wtf", "nana_bx_": "😭😭😭😭", "bronsascha": "It certainly does have to change NOW- not next year even- NOW", "livedontexistbook": "God bless Australia 🇦🇺 god bless our planet &!humanity. You’re on a huge mission 🙏thank God you’re here @gretathunberg we’re are fighting along side you 👏", "peterrothgens": "😪😪😪", "iain.j.martin": "These fires weren’t from climate change", "teca99": "😭😭😭", "lydiapeacock325": "This was started by arsonists, and politicians ARE doing stuff", "viniciuscdelima": "@davidson_dk", "leone_ctr": "💔😭", "http_theresa16": "😢", "blazinggunz": "Do you feel stupid now knowing this was started by arsonists and not climate change? Go back to school, little girl. @gretathunberg", "ippoliti.silvia": "Desidero che le cose cambino 💔", "awxkxn": "that kangaroo must be pretty HOT 👀🥵", "radee_04": "Look how happy he is", "alx_l_": "Save the turtels", "baroninhase": "😥💚", "edwigemorille": "😓😓😓😓😓😓", "martin.kot.art": "👏👏👏", "colefambrough": "Wow. How rude can you be to use this horrible thing that’s happening to push your agenda? Make America great again!", "thelifeofelorah": "So what about the people who were arrested for causing it? 👌😅 not gonna talk about them", "lukemjordan": "You don’t know anything it’s not because of climate change Australia has had fires and drought before stop blaming people for this and maybe if it’s so bad do something about it", "daniel.cowardin": "Do you not realize the bushfires were started by pyromaniacs......?", "cmfreckleface": "It was arson.", "adnanapaula": "@gretathunberg How dare you lie like this??? I live in Sydney and we did not have 48.9 degrees, in fact today we are hitting 39 which is pretty high. Stop spreading lies about my country which you haven’t even visited. You have no clue what’s happening in here. Go back to school, you might learn something. @donaldjtrumpjr @realdonaldtrump @m.a.g.a.phone @jfk35 @satanel @zuluone_a.i.p16 @davidjharrisjr", "tullioperformance": "💙", "andygj33": "Arson doesn’t have anything to do with why these fires in Australia were so horrific and devastating, and so widespread and out of control! These fires are still happening right now, we’ve had rain but they aren’t out! Our climate is changing, speak to the ecologists, climatologists, scientists - they will explain why our climate is changing! It’s been happening for years too, we are so far behind in thinking this is something new, that’s why we need to be concerned! Climate change is real ! 🐨🇦🇺💔🌍", "jana.24.10.83": "In Germany was in 70s over 40 degrees ....In Februar 1998 was in Stuttgart 20 degrees but now is alleged climate catastrophe🤷‍♀️🤦‍♀️....🤣👍it's all about money. Thats it...and around discration...about refugeescrises in europe and Germany....😑", "romyred1010": "C’est horrible", "tormodkravikoste": "😢 We must stop this fires over Australia now.", "jesssmarshall": "climate change isn’t real love xxxxxx", "odogthefed": "nobody cares about Australia", "lilivanfreitag": "😭😭😭🙈", "saxton_lockwood": "Ha okay clown, they were all intentionally started, fool, can’t wait until you grow old and realize the world isn’t over yet 😂 but have fun skipping school 🤡", "sandramarisapaladino": "😭😭😭", "ximena_.cortes": "😢💔💔", "roshoman": "Did you hear 200 people got arrested for bushfires.....! Dumb ass no climate change in your brain", "love_to_draw_horses_that_dance": "😭😭😭", "__peach.custard__": "Most fires were actually started by arson.. over 200 people have been arrested for starting fires. They’re only out of control because sillly climate hippies like you were chaining themselves to the trees a few years ago preventing controlled burn offs but you wouldn’t know that considering all your arguments are scripted and uneducated.", "burak_maasoglu": "Australian kills camels. God punishes them. look. sandstorm, hail of rain and overflow of water I'm waiting for an earthquake .", "axel_oury": "@mattabbottphoto 🙌🤙", "annacross16": "You do know that some of the fires were deliberately lit 🔥 one of my family members were fighting these fires and he told me straight from his mouth, also summers in my country (Australia) are always hot 🥵- Gold Coast where I am is always hot too, but this summer has been a little cooler then usual which is great 👍 I am not a scientist so I can’t comment on weather climate change is happening but Australia 🇦🇺 (in my area) has been cooler then last summer", "siwan1941": "🙏🏼det enda rätta för landet ❤️", "sienna_plt_": "Sad reality 🥺🥺", "cliffbrown36": "187 people were arrested for setting fires It was not climate change that caused it 💯 🤯", "meduzza369": "I think you started the fire , or you're followers #fbi #trump #dea #cia #australia", "big_country77": "If you had an education you would know that clear cutting and controlled burning would prevent this. You are an idiot. Just go to school and shut your mouth orgo to Australia and do something to actually help.", "tedbailey20202403": "We need to do something about this mess", "12085anon": "Come on these forest fires isn’t caused by climate change u educated fuck go back to school spoiled brat", "adamfrick_": "Så fint)", "milkshxaebear": "God is with you", "formiga_meirelles2017": "Agora vai dizer que o Jair Messias Bolsonaro , foi por fogo na Austrália ?", "celine_rosa08": "💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔", "_fanside_avatar_germany_": "❤️", "like_bot_37193": "The Australia fires were literally products of arson, not climate change. Do your research.", "bailey_milligan7": "Are you retard do your research you are wrong", "sarah_plaque": "🔥🔥🔥", "lucimara4751": "E o verao aí \"acabou de começar\"...", "marques._.englishman": "A beautiful photo caught right before the death of a kangaroo this truly warms my heart", "hektorpedo": "Boing Boing Känguruh", "thetranquildog": "Australia is on fire because people keep setting fires not climate change", "deisejordaoc": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "diana_william_harry_scrapbooks": "I live in England. We are having one of the warmest winters ever. The snow is usually here by now and the heating is usually on full, but it's so mild.", "antkaszwagrakobitymezabratasyn": "Why dont you come there and douse the fire ? Talking banality is easy.", "eunicereads_ya": "@im_annnaa omg 48.9°C... Can u imagine 😭", "naoha_planeta_b": "Podes seguir saving in the planet? Please", "alvinkavestam": "@liamstralin", "kill_me_17_": "haha bye bye kangaroos 🔥", "steffburger": "The fires were started by arsonists though", "mega_hase_": "😢 Oh", "torukoishi.helsinki": "😢😢💔", "archanauzagare": "It's just like a terrible dream is turning into dreadful reality.😢😢", "zyonentertainment": "Looking at the seriousness of Australia's wildfires every day, I thought maybe we could use our heartbeat-sharing app to create a \"Heartbeat of Australia\" program. When an influential person wears a smart band and executes an app on a live show, viewers are moved by the passionate heartbeat of an influencer and are reassured by the vivid heartbeat of the rescued animal. Like the Ice Bucket Challenge, it seems like a good idea to create a Heartbeat Sharing relay campaign with celebrities. If you could start this project, this campaign would be a worldwide movement and a touching moment for everyone. We are confident that this campaign will be able to make sustainable donations in the strongest possible way and will have miraculous consequences for Australia. Let me know your opinion. Thank you.", "gracelombardo": "👏👏", "jack_petersen_": "Shut up", "kirra_outback": "I live in Australia 💯🔥", "brock.godfreyy": "Shut up it’s you idiot greenies that won’t let us back burn ya dawgs", "abbeysherlock_": "😭 This is frustrating and very very sad to see", "biancasjolund": "Stackars lilla kängru 😭😭", "yarin.gali": "Hope you succeed in stopping global warming and preventing amimal extinction👏?🤞🙏", "wyattlewiss": "did u know the australia fires were started by over 100 people", "gian_marco.j17": "😓😓😓😓💔", "qween_shy": "😔🙏🏼💔", "itsaimeecatherine": "Climate change aka arsonist", "debestemeiden_tekstjes": "💔💔", "simvid76": "Great we stole your childhood is your claim you know how to fix the issue then lead by example no mobile phones, laptops, tv, give up electricity, heating, running water , air con fans anything powered by electricity. Give up anything powered by batteries fossil fuels nuclear power. Give up the clothes you wear some potentially made in third world conditions. Go back to growing and hunting for your own food which you can't cook as you can't burn trees and live in a cave. You scream at us and what we've done but you enjoy all the benefits and you can't have it both ways. You want to save the world lead by example much more effective than screaming your hypocrisy to the world using the very technology you cry is destroying the world", "we_can_save_the_eart": "😢😢😢😢😢😢😢", "whyz_photography": "Australia burns every year because of the dry and hot weather.This time, we can only blame the politicians for not making a decision fast enough to stop the fire from spreading. It has nothing to do with climate change(if it really exists) :)", "paulalny": "Pirralha!", "samdwarikarawlings": "Save the wildlife!!! 😢", "ryan_penney420": "It might help if the little fucking arsonists didn't light the fires in straya", "alexsukhenko_": "Wasn’t climate change 🤡😂", "dario_3053": "😭", "hi_i_like_school_live_no_judge": "I unfollow", "keziah_1712": "Hoffentlich stirbt das scheisteil", "authorshaunchapman": "This is very sad . . . 500,000 animal lives lost due to man's idiocy and failure to get to grips with reducing carbon in the atmosphere . . . SHEER STUPIDITY!", "ysabelrose": "75% of the fires were started by arsonists. It's not climate change", "turkeymustach": "🎉", "marszalek_guillaume": "Je suis triste 😭🥺pour ces animaux ( koalas, kangourous... ) mais malheureusement, si ça continue ils vont disparaitre😱. Sauf, si le monde entier veulent que ça s’arrête, il faut trouver un moyen radical pour que ces espèces survivent.", "jerseyrack_": "People did this 🤷‍♂️", "andre_3183": "😭😱", "oscar_is_lad": "I live hera its fucked mate", "darthjacensolo1": "NOT caused by climate change!!!! Arson caused these fires and they were set by climate change hoaxers like yourself.", "skraps76": "😂😂😂", "xxmemesxx345": "Wasn’t this caused by 90 People involved in starting this?", "alsander35": "Shut up you damn fraud.", "_.daisyjaj._": "cool The worlds gonna end one day so get over it retards and quit getting upset Were not gonna live forever.", "keilatatiane15": "Por que não tem ouro nem nóbio, tu não foi defecar aos gritos no microfone. Tampouco agrediu o Presidente daquele País #pirralha", "haverorsavas": "💔💔💔😢😢😢😢🙏🙏🙏🙏😢😢😢😢", "anthonybb53": "Thank you for sharing", "jarrah_gardiner": "🤡", "icyfunair": "arson is unacceptable", "marcelbriesi": "😢😢😢", "jeeva17rathinam": "😢", "isabella__odea13": "Ok u live in a cold place not everything happened because of climate change go back to school walk there to stop car fumes", "morgz_is_gay": "Do something about it then", "_5xschx_": "This girl is on fire", "mybiocase": "You want to act against climate change? Visit our profile we have a solution for you! 🙌🌿😍", "blackpantheer": "😭😭so sad, but only for animals dies...😭😭", "val.24.01": "😭😭😭", "soc32": "🦘❤️", "szachmatttt": "Why dont you help with yourself?? 🤦‍♂️", "bb_big_bird_": "Love you energy and enthusiasm all you do. However in the case of Australian mega bushfires more of the cause goes to the fact that post settlement here, the lands original custodians the aboriginal people use to control the total environment. Only when they take back control/orchestrate a systematic national management program will these fires be preventable. Climate change has a contribution now doubt but it’s a case of this giant garden lost the wisdom of a people who for thousands of years understood the limits and potential of the land like no one else could. Keep up you good work. I posted a snippet on some facts about Australia’s custodians from a great academic if you want to see know more . All the best be safe be strong be happy. BB", "dru950": "What about the fact that 183 people have been charged in connection with starting these fires??", "mi_fiofueeg": "💔💔💔💔", "rndprsty": ".", "tomsaywer_travels": "Arsonist isn't climate change stop feeding people bulshit lies more than 200 people set fire in Australia those were natural causes they went to somewhere during the dry season and set it on fire on purpose", "__zaseev_": "😥😥😥", "danieledwardlevy": "Try a plant based diet. There are delicious, healthy plant based options that are great for you and the environment!!! DM me any ???’s or comments. Watch @gamechangersmovie on @netflix ❤️❤️❤️🌱💪", "andiemac22": "Please help us Greta - maybe a global bushfire solidarity sit?", "romantula71": "А когда Сибирь горела что же ты молчала!?", "keaton_thieding": "I can’t believe a group of people intentionally started this fire! What morons", "lm.happy.jadouu": "💔💔", "bayanabohle": "This is sad 🙁", "espaco_mulherdeverdade": "Hipocrit. 😒😒😒", "thisisourhome_ourplanet": "People are dying. Animals are dying. Land is dying. This is our planet and we have a right to live", "bocddu": "UR POSTING ON INSTAGRAM AND IM PRAYING FOR RAIN WHOS HELPING THE MOST???ME", "melvinjarlesater": "Den rymmande förra veckan", "joseliamenezes17": "Terrible!", "tim17967": "Сама то хоть что то сделала для этих пожаров?? Только и делаешь что сидишь на жирной жопе и строчишь текст. И что то лялякаешь про то как все плохо", "tntstagram": "While the generous response to the bushfire crisis is brilliant, would there be as much international generosity and news coverage if this crisis was happening in a less developed country that has less resources to deal with their own crisis?  Cyclone Idai smashed into south-eastern Africa, killing thousands in what some called the worst weather-related disaster ever to strike the southern hemisphere. Food donation left to rot in Zimbabwe. A month later Cyclone Kenneth hit the same area causing another 50 deaths. There was an international response, nothing on the scale of the international attention and generosity currently directed towards the Australian fires.  Having actually been here I can’t help but wonder why the disproportionate response? Or dare I ask, what is the difference between the people who live in Australia and the ones who live in Zimbabwe?", "bernardoschwengber": "Pirralha", "____allmight____": "Her dad runs the account", "alexandroziogass": "Then do smt sweetheart", "themanvirdhindsa": "What do you mean that there is no political action? Australia has been trying to protect the animals and put out the fires as much as they can by getting help from other countries and contributing themselves. An Instagram post isn’t going to help anything. @gretathunberg start donating or start a fundraiser campaign instead of actually trying to show you care even though you aren’t doing anything.", "ceci_ferna": "😭", "naturalurbanforests": "So much sadness with this news....", "robertojefferson_77": "How dare u", "ecology_clan": "We will do something about this we love australia❤️❤️", "vale_breccia": "💔💔", "michelelphotos": "💔 💔 💔", "seleenfrieden__": "It’s legit arson tho lol", "makaveli020701": "People causes the fire... just saying", "tanechkazlata": "💔🐨🔥🌏", "songbird_._": "Except 150 arsonists were arrested for these fires. So it actually wasn’t climate change.", "lcpl4life": "What about the 180 arsonists that have been arrested? Or is it still climate change?", "evama38": "LIES LIES LIES...AGAIN!!!! Get nauseous by these lies! No one but the climate liars have the \"information\" they come up with !! It comes from the #UN #IPCC pathetic lie organization! How is it possible for people to be brainwashed? Are people so scary stupid? But the truth is that many people have been arrested for these fires! The Green police discarded temperatures all over the board and manipulated early temperatures lower!!!! Nothing in nature stays the same forever!!! In nature change is the normal condition, equilibrium is not!!! We suffer under the yoke of the tyranny of democracy!! while management decisions are made by people who won a popularity contest!!!", "edisonandrespg81": "😭😭😭😭😭", "k_boyer04": "Wanna know the best part? Australia government admitted to the fires being lit by actual people and almost 200 citizens have been arrested for doing so", "a.safford99": "Do you know climate change isn't real?", "ayselonerzm": "😔😢🙏🏻", "adinanayzgi": "😱😱😱😱", "jando66": "Go away, we in Australia don't need to read your crap", "nuriaespinosa5": "❤️❤️❤️❤️❤️ #Earth#natgeowild", "_moa_l_": "We will fix it together💓if everyone helps... we will make it❤️❤️if everyone does something, it will be easy💓thank you for everything you do to the planet, you have a heart of gold❤️💛#savetheplanet", "brenden__powers": "Yep, caused by global warming... not the arsons that were arrested. Get back to school and get a grip on reality.", "drakedickey": "To start, this is arson, but what political action can be taken?", "sinaaaa.20": "Dieses Känguru so fotoshop omg 😂", "stalindad7": "The wildfires are caused by arsonists not climate change", "gabrielsarmiento_04": "😟😟😟😟😢", "errolspence123": "I had kangaroo one time. Shot it, took it back to my cabin and Lit a fire and roasted the shit outta it. Ate it and it was good.💯💯It had babys so i ate them too. Yum yum mate!!!🍗🍗Climate Change Hoax. Trump 2020🇺🇸👏", "lilyklopstein": "imagine preaching on how climate change started this fire when there have been 200+ arsonist arrested for starting these fires...", "diego_falcao7": "YES yes. 😂😂😂🔥🔥🔥🔥", "nathanpage918": "Bitch u don’t know what ur talking about", "c.estevezjr": "What are u doin about it?", "banuelasmaria": "Es lamentable ver la destrucción del planeta", "i.bondarchuk23": "😢", "b_trebell2018": "we gonna talk about how climate change had nothing to do with these fires and over 150 arsonists were arrested? oh that doesnt fit your agenda and therefore you're going to lie? oh okay", "eliel_costa2020": "Não recebeu o dinheiro pra chora dessa vez, a Austrália ta chama chora agora pirralha,", "rinaldo_araujoadv": "@karlasoliana", "joshbridgman_68": "Australia is always burning in summer. It is just the warm dry climate. Also arsonists are a major problem", "ttusk4jc": "YOU KNOW THEY HAVE ARRESTED THE PEOPLE WHO STARTED THOSE FIRES?, RIGHT. WAKE UP.", "skye.whitcomb": "This is not because of climate change!!! It’s because people started bush fires. And if y’all didn’t know fire spreads", "hutsevalentijn": "Nee🔥🔥🔥🔥 stop het", "berit.svensson.311": "❤️", "thorsthetroll": "Why are you NEVER in school lmfao not only are you uneducated at your age you are literally being deprived of an education so that you can one day go out and make a real change.", "oksana__schastlivaya": "Продолжай свое дело🎁🙏", "medic_bdraw": "Charge all those arsonists. 👌", "vlaming_voor_altijd": "🤡", "reese347": "Lol this is funny...because im pretty sure 24 people were arrested and found guilty of intentionally starting brush fires. Sure sounds like climate change to me lol", "caarmeennibbee": "🌱💚", "flp413_": "LUKE 21:10-11 10 Then he said to them: “Nation will rise against nation, and kingdom against kingdom. 11 There will be great earthquakes, famines and pestilences in various places, and fearful events and great signs from heaven.", "nightwi1derness": "#BeLikeGreta: Learn #ClimateScience 🔛https://www.ipcc.ch/ @ipcc=\"Intergovernmental Panel on Climate Change\" via @UnitedNations🗺️ #ipcc", "_secret.rachel_": "I hope this stops cause global warming is the most dangerous thing we have ever experienced it must be stopped right now!!!", "vntoniv_valentina": "😢", "marissa._williamss": "Awww", "ruthpix": "Seriously!!! What kind of “Political Action” was supposed to happen during these fires to stop the fires!!! You are hoping for increased taxes and unrealistic behaviour. Australia is a land of bushfires and yes, this is bad, but there have never been this many arsonists and then it just so happens that it’s a dry year (as happens in Australia) and a@hot year (as also happens in Australia) and it’s been windy (as also happens in Australia). Combine that with a record number of arsonists. Which would make you start to wonder if there’s a “Climate Change” agenda behind all this.", "mandyhackshall_art": "Thank you Greta for your courage to speak up. Seeing the forest and town's around where I live burnt breaks my heart and the fires are still burning. The kids can't play outside the air is so bad. This is climate change and we need to act now. We all need clean air and water.", "wazuuuh": "Något bör göras här o nu... ändå så tar det presidenten av australien (som tydligen är en sengångare) september till januari att ens nämna orden ”globalt uppvärmning” i samband med bränderna. Om mannen hade tagit det på allvar ifrån första början så kanske hade allt en annan resultat nu. Hade jag bott i Au så hade jag protesterat och krävt för hans avgång.", "advogadocesar": "Vc Greta,daria um bom filme olhando queimadas em outros países...Filme seria O silêncio da ipocrita.", "callumbrenn4n": "Hampden in the sun🇨🇮", "jarlie__": "This was done by psychos not climate change", "clausjannis": "Känguru fleisch", "bruno.greco74": "What a disgrace to Australia 🇦🇺", "schafer8474": "😭😭😭😭😭😭😭", "jakervanover": "Funny that it’s not because of climate change", "shermybob": "THE FIRES IN AUSTRALIA ARE BECAUSE OF ARSON!!! “Climate change” has absolutely nothing to do with it.", "louismoss5": "Greta go back to school for god sake🙄", "alex_holley33": "I thought the Australia fire had nothing to do with climate", "nicolasrothschild1806": "Who cares about stupid humans who only destroy everything they touch but POOR animals 😒", "cujones50": "Greta, Would you please consider signing and RT my petition for climate policy action in Australia at http://chng.it/KvRx8HMj #bushfiresAustralia #climatepolicyactionAustralia #AustraliaBurning", "ri.4276": "💔😓", "lindsey_bounds_": "it’s not climate change, you 🤡!", "juniorjunior_jr": "I am from Brazil, I fight for a better world that everyone thinks about the environment, not first of all the money, the animals are the least guilty, my biggest shame is the president of the country. #impeachmentbolsonaro", "vanilza.oliveira.3956": "🍀🌳🐿🐿🐪", "fufupat": "Your Dad Writes Your Posts. 🙌", "ewanchan2": "is that a dinosaur", "zacr28": "Hi Svante", "milan_almozani": "Thrash", "luismrz62339": "Its sad with Australien and its too sad with the animals but i don't like you", "misterchiccocat": "😢😢😢", "thecarlossoria": "ever heard of uh.. arson?", "jorgemiguelortizresendiz": "bery sad", "lene20072019": "Ten thousand camels are being murdered and the world is watching this silent holocaust! Not even the tragedy in Australia is capable of turning those people back from the brutal genocide of our camel brothers.", "vis_medicatrix_naturae": "Veganism is the single most significant change we can make to stop contributing to climate change. Please let's keep demanding that governments take proper action but also let's not neglect what we can do ourselves. Also the amount of animals dead in the bushfires are killed every couple of days just so we can eat their bodies", "doritacarmelita": "😢🙏❤️", "angad.yadav.96592": "😮", "tobi.84.9": "😢", "matt_tadeo": "Climate change had nothing to do with it. People were actually arrested for arson (burning shrubs) thus spreading the flames across Australia.", "hewwo.viola.shade": "nooooooooooooo the kangaroo", "exoticphenohunter": "Your people started it", "jupi_jones": "You forgot toentionthe 284 arson arrests! Not global warming.", "brian.ptak": "If I heard right over 20 people were arrested for starting the fires. Nothing to do with weather or climate change. Yes we have a problem with pollution, but this is of human design.", "diegoig9": "Y publicando esto a cuantos salvaste?", "l.jonezy._": "Kys", "domonick_coleman": "Yeah too bad it was 138 people who started the fire. You’re looney as hell", "tarziermonica": "Thank you, Gr e", "it.s.__.alex": "So actually climate change is something quite normal we are moving towards the end of an ice age. BUT (and now the important one) we humans are speeding up this process, which normally takes several hundred years, and because climate change cannot be stopped just slowdown and thus reduce its degeneration!", "chacalcarambolla": "god", "theworldaccordingtorosie": "1 billion animals have died. More are still at risk 🙏💛🙏", "sussies_foton": "🖤💔", "danny_bri_": "I'm going to kick this Guys Ass who prefers to Take a fuckin' picture.... Instead of safing the cangaroo", "maarc.baarriach": "F", "adolfo_ctr": "Fuck the kangaroo.", "bmdubs_": "The fires were started by arsonist... 🙈🙊", "the_real_elijahclelland": "The fires aren't from climate change", "mika.w04": "IM SOMMER SKI FAHRN", "catyb2003": "And what have you done, have you even tried to raise money to help, or just post about it. Your so fake", "nystrom.vincent": "Vad Greta gör🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "oguimaria": "So sad!! 😢😢😢", "_natashagareeva_": "😭", "the_pride_of_sparta": "Another uneducated jackass who knows absolutely nothing. Climate change started the fires?", "rjlbossman": "Bahaha what a Moron. The fires were started by arsonists. 😂😂", "griffynv": "😮", "veganscasa": "❤️keep you fighting", "madivs_": "This is our fault! Littering, polluting our only source of oxygen, abusing animals! All of these things that we did...our fault! There was a estimate of 480 million animals were killed during these devastating fires that are happening all around Australia! When you see videos here on Instagram, or on Facebook of Wild Animals running to people, that should not happend! These fires...our fault! Now we get the bad karma for doing this!", "bossladyara": "Yea it's on fire because over 100 human beings set it on fire but not to worry they are getting locked up left & right. So far over 150 people hey I've been arrested for deliberately setting the Australian fires", "deafranger77": "DUMB AS A BAG OF ROCKS!", "arkaaaadius": "I must disappoint you but these fires have nothing to do with climate and temperature but were set up. You would know that if you had at least basic education but to get it you need to go to school 😉", "daniel.arteaga99": "You do realize it was 11 people who started these fires not climate change lmao. #puppet", "mathiaseggeling": "We are in the 6th mass extinction 😢", "sweet.gamine": "Deliberately not mentioned in the OP: Almost 200 arson arrests have been made in Australia.", "jodijn": "It is over 60% ARSON!!! Jihadists have called their people to set devastating fires wherever they can! Do you people keep up with any news source, or do you enjoy being hypnotized by celebrity endorsed puppets who are clueless and uneducated.....literally?!?!", "eu_pablocarlon_oficial": "Maldito @jairmessiasbolsonaro capitão motosserra! Deixe os cangurus em paz! Ahhahahahaha ei @gretathunberg go fuck yourself!", "luisemoralesfalcon3": "The people are setting fires to AU, are they your followers?", "clintrisner_": "it’s arson", "mariannenegreiros": "@_renataabreu_", "linden.drafts": "There are 24+ people in jail for starting the fires. How do you figure that in to your climate change theory?", "chlorine.goalka": "Go out and become a firefighter and burn out the fires, actions speak louder than words", "fabianotchampion": "💩💩💩💩💩💩", "bobhennesseysd": "It must include ground mice Greta, 500M is a big number, after the 45m kangaroos that are said to exist in the country , 500 Wombats and let’s throw in 5m squirrels and rabbits, then that leaves 480m, that’s a lot of mice", "onocicikew": "These fires are man made it been proven, arrest have been made and ever since, the media has switch to something else to focus the bogus agenda", "leapingimpala": "☹️☹️☹️☹️☹️☹️☹️☹️☹️☹️😭😭😭😭😭😤😤we have to get more people to care", "mr._shahriyor": "Its our problems 😢", "vincentberonbasile": "😌", "sir_adam_weaver": "Climate change has nothing to do with this. Fires were started by people not climate change. Stop being a keyboard warrior. I dont see u helping all u do it talk and accuse people but u do NOTHING to help.", "katharina.wanda": "💔💔💔💔😭😭😭🙈🙈", "mikefla_tenn": "Stop spreading Junk science lies Greta", "oneanatolia": "Eng: Where' s United nations for Australia fire?! Some cruel Australian people killed more than a thousand camels by hunting them from helicopters;  Why, just because they drink water?  Crazy, cruel act;  but true !! In such a large fire, assassins may have deliberately burned forests, assassins must be found and executed in order to make money from some circles working in private fire extinguishing companies or exploiters.  They may have set fire to make more fire and earn more money !!! Tr: Avustralya' lı zalim bazı insanlar o binden fazla develeri helikopterden avlayarak öldürdğler; niye mi, sadece su içtikleri için? Delice, zalimce hareket; ama doğru !! Böyle büyük bir yangında, özel yangın söndürme şirketlerinde çalışan veya çıkarcı bazı çevreler para kazanmak için suikastçılar kasıtlı olarak, ormanları yakmış olabilir, süikastçiler bulunmalı ve idam edilmelidirler. Daha fazla yangın çıkarmak ve daha fazla para kazanmak için yangın çıkarmış olabilirler !!!", "ikenivlife": "😪", "beperes": "A pirralha está sempre atenta @ricardocorretorautorizado 🤫. VIVA A GRETA!!", "bambinihappy": "when are you sailing to Australia to help out with the climate crisis?", "di11onm1nk": "@greta_thumberg you know this fire is this big mainly because of legislation introduced as a way for Australians become more eco friendly. They were prevented from burning leaves as it released CO2 into the atmosphere but because they were not burnt the just acted as easy fuel for the out of control fire.", "_anapaularibeiro": "👏👏👏👏", "victor_baray12": "Stupid fuck the fire was started by arsonists it has nothing to do with climate change", "_beccacuriel": "The arsonists responsible for this fire were arrested this is no connection between this fire and climate change 👎👎", "rinayisrael": "😞🍀", "richard_victorian": "183 people arrested for starting these fires...", "raito.mp4": "you are too young to do nothing", "ida_b08": "😭💔", "macromidget15": "Sadly the number of animal deaths has risen to 1 billion in such a short amount of time. God bless Australia", "ypxoxoxo": "Fires set by humans not climate change", "bentalandls6165": "💔💔💔💔", "part.time.alcoholic": "Hey Greta why dont you address the Australian government selling all it's water", "ayye_cedd": "You realize that there were 100+ people arrested that were responsible for starting this madness? Yes the animals that lost their lives due to these fires is heartbreaking, but at least tell the truth and quit beating around the bush saying that climate change is the reason everything that is bad happens...", "jessieaaustin_02": "Well the Australian Fire Department said is wasn’t climate change. 183 people have been arrested for arson as well. The drought may not be of help, but it wasn’t the cause.", "paraskevopoulouge": "🙏😞💔", "carad10": "😢😢😢😢😢😢😢😢😢 💔💔💔💔💔", "jules_winnie": "This shows how bad people \"climate activists\" are. The people who started the fired were your people!!!", "_emil_941": "Hope you die bitch", "redandwhite777": "Try and fight a cause that good my nigga", "kiquax": "“For nation will raise again nation and kingdom against kingdom, and there will be food shortages and earthquakes in one place after another...” “...They go out to the kings of the inhabited earth, to gather them together to the war of the great day of God the Almighty...And they gather them together to the place that is called in Hebrew Armageddon...” “...And this good news of the Kingdom will be preached in all the inhabited earth for a witness to all the nations, and then the end will come.” (Matthew 24:3-14, Revelation 16:14-16) If you wanna join God in saving the planet feel free to come and help 👉 https://www.jw.org/en/", "diasmartinmaria": "💔💔💔💔💔💔💔", "ahmed_kebabstiaens": "Bitch, i'll get some grilled beef outta there", "moniqueurio": "@colosimoarmando", "kiralee.rose": "Also while 48.9°c is bloody hot its not the hottest we've seen 😉 we're okay sweetheart. Did you know they hit 49.7°c in 1939? Woooowwww you mean 81 years ago before \"climate change\" was this massive thing we were still hitting record highs? What the heck? No that doesn't fit with this storyline now does it 🤔 do you want some more temps across Australia and the year it hit? Doesn't align with your story though. We're talking temps over 50°c shall I continue?", "emmuccia.09": "😭", "ca.itli.n": "The bushfires aren’t climate change, they happen all the time in Australia and yes, climate change may be apart of it but it isn’t a big factor. Australia has stopped back burning, which increases the fires. People light fires on purpose, a small piece of glass on the ground can start a fire.", "katyching": "@scottmorrisonmp Do something.", "emmabear1502": "Tell the arsonists to stop starting the fires. Problem solved.", "29m31rb": "mi fa male vedere quel povero canguro,gli hanno distrutto la sua casa.", "pakhomov1381": "😢😢", "scuttleguns": "Black ops 2 severs are up", "vluccas_": "@porumpaismelhorparatodos era isso q tu queria?", "conor.meyler": "Lmao someone lit the fires dumbass", "jasper_.geary": "My grandparents back fence burnt down", "gerdniemi": "Det gör såå ont att se hur illa djur och människor far illa i bränderna 😢😢😢", "patrickswitzer9664": "The fires in Australia were deliberately set, arson. Climate change has nothing to do with it", "keithhaggett": "😩😩😩😩", "jbchapman08": "THANKYOU ❤ ALL THE WAY FROM AUSTRALIA, you are so courageous & so inspirational.yes the fire's have killed lots if our animals,it has burned our beautiful flora & fauna, the fire's have taken my friend's homes & many other's here on the far south coast of australia, its devastating & we need to stand together for a better future for all of us.", "still_not_telling_you_": "Rescue Australia", "captainfinest": "LIAR - Arsonists caused these fires ! NOT CLIMATE CHANGE ! lil witch spreading propaganda", "n.iklas64": "youre amazinz! keep up the work!", "luca.pxcitti": "How dare you", "emmavcotaya": "January 11,2020 and our planet continúes to worsen thanks to global waming 😖💔🌎more than 5,000 animals and hectares in Australia,have excellend and that really horrible se have to be very aware about it.!!WE HAVE TO ACT BEFORE OUR ANYMORE , WE DON'T WANT TO SEE OUR WORLD FALL ANYMORE .WE TAKE AWENES AND HELP ONCE FOR OUR WORD 🙅🙅🙏👋👋👉👉🌎", "oliver__smythe": "Climate change doesn’t cause bushfires.", "lonlonslens": "That is so sad 😞😢", "fionacoco89": "😭😭😭😭", "bradnolan1": "Why the need to over exaggerate with everything? If you lived in australia the last 20 years you'd know australian summers are always hot, temperatures in the high 40's is nothing new, theres nothing extreme aboutany of it. Of the 28 people that have died most of them died making the decision to stay & fight for their home instead of leaving.. so really that's nothing to do with the fires that's people paying the price for their mistakes. & its not 'thousands' of homes.. its 1800 which isnt even two thousands so again over exaggerating. People continue to push this agenda & its just crazy. Look throughout history.. Australian history.. australian bushfire history & youll see this isnt the worst ones we've ever had.. more homes & more lives have been lost in fires well before this climate change talk came along.", "hellonanalala": "🌧🌧🌧🌧", "wohlhabend_wolf250": "Yum, roasted kangaroo. God bless Australia tho", "tom.harris11": "Stay the fuck away from our country", "semcortesproducoes": "Fala que foi um motoboy que passou queimando com a tocha", "alexanderrova": "😔", "kallem78": "And yet over 100 people arrested for starting these fires, probably activists like yourself.", "jack_lion1234": "😢😢😢", "giselecaldassadlac": "😭🖤💔", "_sydney.zhh_": "💔💔💔💔", "marti.dara": "💔💔💔💔💔💔💔💔💔💔😭😭😭🇦🇺", "mexicanwithnofriends": "People were arrested for causing the fires pendeja", "heliakimona": "😭😭", "bigbrainphotos": "I bet you caused the fire", "croy2465": "https://www.youtube.com/watch?v=48lGGfiV1H4", "oscarwangel": "😢", "lia.2208_": "💔💔💔💔", "gabrielledelconteoriginals": "I'm sure you've heard the fires were the result of arsen?", "muscabdj2020": "😢😢", "natiii.natiii.7": "Move el culito viaja a australia y ayuda a los animales que la estan pasando pesimo. Porque estar con el dedito diciendoles a las empresas, politicos y demas que hagan algo comoda desde tu casita solo te hace una pendeja comoda y no revolucionaria", "xxamy_realxx": "😭😭😭😭", "redgearnofear": "😢", "nrtkdnb": "Johny Cash - Ring of Fire", "miss_militia412": "This is extremely sad. Things seem to get worse every year. Something needs to change!!!", "nurse_houtz": "183 people have been arrested for starting the fire. Not a climate issue 😂", "j4cob_420": "HoWw DaRe YoU GrEtAaaa", "gelson.ramos.73": "Porque você não faz o mesmo protesto que fez nas queimadas da Amazônia? Por favor não seja manipulada pela esquerda podre! Você é jovem ainda, mais tarde poderá se arrepender.", "codybarker55": "These recent fires weren’t naturally occurring. They were started by eco terrorists. Over 100 people have been arrested so far. Sorry that doesn’t fit your narrative @gretathunberg", "jenkell75": "It’s ONE BILLION animals lost and counting. These fires have been burning for 4 months now and your just now posting about it.", "mxi_schlr": "My stepdad said your stupidness is also caused by the climate change", "djtfoto": "Greater warmth means more evaporation and more rainfall. And dozens and dozens of people have been arrested for arson. Your uninformed lies have to stop now!", "bad___lac": "183 people have been arrested for starting the fires....🔥🇺🇸", "iamnotarobotyet": "How much did YOU donate Greta????", "dughzoomer": "They took the L", "master_of_sloths": "Too bad that people were arrested for setting the fires disproving it was climate change but you wouldn’t know that because you lack intelligence and instead speak under the control of your parents", "_.leonnn_": "that’s what you said u fucking fish", "tuvalinn_": "💔", "michele_attal": "Awful", "izabelrodriguescosta": "E engraçado que o primeiro ministro disse que nao quer ninguem de fora se metente ,mas quando o incendio foi aqui no brasil vcs falaram ate babar ne?quase que vcs botaram fogo nos meus aplicativos de cl de tanto que postavam fotos nos criticando sobre nissas floresta se queimando.agora nem vemos vcs.ate a greta sumiu.", "judas.yeast": "I know. It’s unbelievable. Jk people started these fires you don’t know what you’re talking about", "deshley_030": "The australian fires have nothing to so with climate change. 183 people got arrested for starting bushfires", "hiv____aids": "This is heartbreaking💔", "et61328": "People started this fire though it didn’t have to do with climate change.", "komal_singh_official99": "You are posing a very big threat to the coming generation, due to the fire in the real forests, due to which millions of animals and animals have died, but the people of any western country have not thought of it nor any politician. So far, we have not thought that how to control this fire, people of western countries talk very big things that we will tell the environment like this, but you will still be saved I have done nothing I can explain to you very big, you should be ashamed of these people that you do a lot of big things to change, but you have not done anything yet, you are posing a great threat to the future to come. Ho is studying today because of global warming.", "mcna.lly5": "😢😢😢", "dravenny": "Facts: 200 people arrested for arson for starting the fires.Fiction: Greta knows her ass from a hole in the ground blaming the Climate Fairy for fake Natural Disasters. Lol YOUR POST AGED REAL WELL DROPOUT. LOL", "corpsman_": "I guess all of these people that have been arrested for starting fires should probably stop Huh?", "hannah.scofield": "fuck you you don’t even care you idiot", "zachbrinker.78": "Does anyone actually care about the news and how there charging around 24 people with arson", "theyhatebr1an": "Straight Heat 🔥", "klimawandel_stoppen": "😭🔥💔", "d_photo_grapher": "Oh shut up!", "bmattingly_ky": "You do realize multiple “climate change” activists started these bush fires to then blame it on climate change... how much are you being paid to spread bullshit? #Q", "gemmayvonnewilling": "♥️♥️♥️", "apstein9": "90% set by arson you uneducated Twatt", "beatricekeul": "CALL BRIGITTE BARDOT FOR HELP", "beluganos": "😢", "dead_bmth": "Wrong. Only 4 people died so far. But that's not tragic. I'm more concerned about the animals...ffs, 500 million animals died so far, yet we all want to raise money to put out the fires. Why does it cost anything to save our HOME PLANET??? And why did Notre Dame get millions and millions in such a short time, but not this?? I'm mad. I wish I could save all the animals which are trapped in this fire... How did this fire even start? Can anyone please explain this to me?", "ben_stimpy": "You do know they arrested the arsonist responsible for starting the fires, yes animals have died in the fires but for the Australian ecosystem it is essential for these wild fires to happen many species require the fires to be able to spread there seeds", "unclepodrae": "That person taking the picture of a kangaroo like oh this will look cool but they aren’t even trying to help it", "adamtrolin08": "Vchfhvh", "baillie.alison": "My heart is breaking in two. Such devastating loss xxx", "aswathsuman": "Not climate change 183 fires were set on porpuse", "dcporter12": "That’s because it’s arsonists setting the fires. They have arrested over 100 people for setting more than 20 fires....", "francisqueiroga": "😭😭😭😭😭😭😭😭", "rat_cage10": "Jesus these hate comments are full with normies, you wouldnt want to see ur Fruit gummies in fire? No thought so, keep em well kids", "_cassionobrega": "Pirralha chata essa greta-pool", "fariduddin.noori": "🙏😨😔💔", "champanzeed._fluffy": "finally you’re posting memes now", "no111nestandsalone": "It’s now 1.25 billion animals", "jeffiszac21": "I’m sorry but the climate change has nothing to do with these fires. If you look at the weather from 100 years ago Australia had almost the same weather. Most fires have been caused by people not the climate", "penelle": "😢😢😢", "cinhosurf": "How dare you, hipocryte", "digorockeru2": "Ajudar que é bom nada, só no blá blá blá", "shaun__clark": "It's not because of the climate the countries on fire it's because of lack of back burning and because people have lit these fires", "violet_dawnn": "Can you imagine how Steve Irwin would react if he were still alive?", "anapereira865": "😢😢", "julian1arnold": "Fuck greta", "pcosmicgirl": "Arson! Over 30 people have been arrested for starting bush fires !", "jesserosenow": "You are just a fucking mong greta. All you are is a face thats probably in to deep and now cries herself to sleep. Iv seen fads like this before you will end up 60 years old in tears as that brain washed kid from back in the day and its sad. Spotify search Sounds of then - GANGGAJANG -this is Australia... 35 year old song. Cut your pathetic shit out", "macarenabg": "💔", "wildsearch": "I wrote on article on how you can help wildife in australia post fire! Thank u💙 https://wildsearchaustralia.com.au/2020/01/10/the-best-way-to-help-animal-and-wildlife-bushfire-victims-in-australia-right-now/", "piperandsophiebff2020": "We have to do something", "nonosurvie": "3", "bale_a_cake_": "😢", "soltar.vivir": "Cuanto desamor", "oonaheyse": "True🥺", "skazki_o_zvetah": "🙏🏼", "jolen20001": "Wir müssen was machen", "no.name.yet.yet": "Get f real. The reason was arsen there are even people arrested.", "gemersonroquefa": "😔😔😔😔😔😔😔😔", "millythompson12": "Why you omitted that most of the fires are arson? What about that? Do you really think is just the result of a climate crisis? What the hell!?!? Some people set fire to wilderness areas ON PURPOSE. Why everyone seem to forget that? It's the same damn thing happening in the last 2-3 years all over the world.", "jadernobrega": "@geografiacompleta", "marieroyconnolly": "so so sad....................", "sabriinaacarvalhoo": "Let's talk about the 10,000 camels that will be killed ?? or is nature just kangaroo trees and koalas?", "imaginillyar": "The connection that people fail to make is that their entire way of life has to change because it's not sustainable. We don't have time to gradually transition anymore. The necessary change is going to be painful. That is why people would rather pretend it's not happening even when the evidence is clear.", "ttejedamelo": "😢", "jack.r.souto": "😔😥😭😭😭💔💔💔", "saulmaxwellofficial": "💔💔💔💔🙏🏽🙏🏽🙏🏽🙏🏽", "kopaternina": "😥😥", "eliocarno": "This is fake xD", "albertejorck": "Its terrible😢", "am_kk4": "It’s ARSON, not a natural disaster. Epidemic ARSON problem in Australia.", "sebastian_colley": "But you don't do anything about it", "d_onkeey": "By the way not record temperatures stop spreading fake news", "aaron_douangaphaivong": "This is literally doing NOTHING for Australia you fool", "krislkessler": "When you realize it was real people that started the fires.", "aitoriko": "Gg🔥", "masukuboi_": "Ngl it is my fault I played my new mixtape there", "sebastian__barber": "Why don’t you call out the arsonists who lit over half the fires, dumbass🤦🏽‍♂️", "abazz313": "Oh shut up ur nothing but a pawn on chess board your told what to say and when to say it ! You have fooled many just another tool", "wheeler.charli": "Your such an inspiration Greta", "criscanhadas": "Greta ajude por favor, APARECE", "withthepassingoftime": "Tengo amigos de mi padre en Australia y estoy triste me dijeron que están bien por facebook el 7-1-2020", "jc5307": "Lolz", "buscadora_de_suenos": "And ur pic helping in Australia???", "extinction_fighter": "Fuck you greta", "j_a_s_p_e_r59": "Shut up greta", "_.jessi_.4": "💔💔💔💔💔", "death_to_fanfiction2.0": "Then go and address the world again and say how shit they are you do something too, I'm a 16 year old who's broke and you have the power too tell them so do it you greedy bitch", "blazingape": "You’re trying to say it’s because of global warming??? Arsonist were arrested", "desmond_brown73": "Your 15 minutes are almost up people are starting to become a more aware of what common sense is, with the exception of these idiots who blindly follow you regurgitating your bull crap", "rina0150": "💔💔💔", "i_sawl_it_": "I’d like to see how muck money you and your parents have made since you have become an Activist ? BTW you@failed to mention the fires are arson related #gretamakesalotofmoney #arson #arsonstarted", "igordiegochagas": "Para de falar e vai lá dar o exemplo", "carlos0619": "We are a species in the process of extinguishing everything🤦‍♂️", "zloy_by_nature": "Едь в Австралию, туши пожары!", "lucasxberg": "🙁", "susanjaywatson": "Vote all climate deniers out! The earth is burning and there is no time to waste watching Nero play golf", "mxrs3l.14.ru": "How dare you australia 🤯", "sil7709": "@sanarelmundo2019 tres meses quemándose Australia y ahora dice algo? Ni siquiera a donado dinero de los cientos de miles d euros que gana... es una farsante! Una speaker, no activista.", "luciana_sydow": "@luizsydow :(", "reginaldo_tyson": "You’re only a meme!!", "seymore_uvitt": "Tell them muthafuckas send help there wtf!", "corso__como": "200 + arsonists detained. Too many to blame climate only.", "yanhanzk22": "Kkkkkk se fosse em outro país, o chororô seria de imediato.", "julidelgadoalmenzar": "😢", "shap_demetrio": "А почему она ещё не в Австралии?", "brunopadua13": "In Brazil is deforestation and in australia is the climate dry? What?", "rafaelaorsi": "@adelesiacosta", "afonsoaranha_": "Agora q vc viu ??? Tava de toca ????", "byronpues": "😰😰", "cantaoluana": "@matheuszuck", "luna.rodrigues01": "💔", "tcap1327": "This definitely didn’t age well 😂😭🤡", "gabriela_nico": "@nicorosangela", "clara_franka_spammmmmmmm": "Wir wundern uns warum es kein Schnee gibt 😕 jetzt wissen es alle 😭", "jaquelinekent": "Ah tah, você é oportunista.", "soliveiragustavo": "Faz o biquinho!", "pina_irene_": "If the Australian government didn’t stop the annual burnouts there wouldn’t have been any bushfires they mainly started by people setting things alight, campfires and a car crash it’s devestating", "wybie.lad": "Climate change No fire bugs being stupid", "_sofia.elektra_": "Saying this, but doing nothing😂 i dont know how can you say that you are activist 🤮🤣👍", "peetu_qqq": "Ü", "mistern1ck": "None so blind, as those who will not see", "_ccapps": "Nobody wanna talk about the fact that almost 200 people got arrested for starting these fires", "addimclaren": "Get your information right before posting. 17 people were arrested for starting the fire. 😡", "dangerxtwo": "\"Summer has only just begun.\" Its fucking january FAS face...", "vaniarganini": "😢😢😢😢", "g.papers": "Yo dumbass how does it feel to be wrong that climate change caused the fires u globalist puppet @gretathunberg", "chris428fe": "From an Australian, go back to school and shut the F up!!!!!!!", "kacapra": "Aqui é normal as queimadas?", "marinablaup": "If you people are far away from australia and don’t know how to help, donate to @wireswildliferescue @redcrossau or other organisations !! They need our help 💔", "adambbowen": "I’m Australian and 183 and counting arsonists arrested. But let’s blame it on 0.03% of gas in the atmosphere.", "bri_young.17": "And out of your 9.6million followers comes a lot of cash what do you plan on doing with all that money? You of all people I thought would be first to go and actually help. In Australia our homes are burning and we've lost over 50 million dollars worth of land and buildings and food and you haven't donated to anything or used your platform to get people to donate. Tell you what, when you stop hiding behind your screen and protesting 24/7 and actually start trying to make change then I'll respect you. You make me so mad, DO SOMETHING AND STOP PROTESTING BECAUSE IT'S OBVIOUSLY NOT WORKING!", "__matthaeus__": "Kangaroo brennt glei", "leandro.fragoso27": "Foi só isso né sua desgraçada, agora é apenas por causa do verão, mas no Brasil é tudo por causa do presidente. Fantoche idiota da onu", "dontplaywithurstick": "greta shut the fuck up, u use plastic and u talk as if u don't harm the environment at all, u post these kind of shit and does it help? no, so just shut the fuck up and focus on ur studies, don't talk as if u're some super environmental bitch that doesn't contribute to the co2 emissions, the dare of insulting world leaders should mean u're extremely environmental friendly and there's many pics of u using plastic and shit, seriously greta go fix ur mental disorders then do all these crap", "laudiflor": "Salve os animais da Austtalia!", "tati17santos": "Golpista", "demostenedemostene": "😢", "jericho1986": "Stupid girl. Go School.", "tmrthiago": "Shut up and stop being a PUPPET.", "brodymcconchie04": "I’m from Australia and this is a tragedy but ur a complete idiot if u think these fires have started solely from ur so called “global warming”", "not_____me_____": "How about doing something instead of nonstop talking shit u tard, fucking puppet", "momo76114": "😿早く山火事が鎮火しますように−。", "flego18": "Andhe una canzone fa così", "paul_h_etherington": "🙌🙏🙌", "barbearia_artsbruno": "Cade vc pirralha falando igual vei aq fala d Amazônia pirralha", "c.jr00": "Hipócrita!", "ek_grbk": "Mycket ledsen...", "lele_ferreira84": "Olha só , a pirralha lembrou da Austrália!", "randerson.jones_": "Literally almost 200 people got arrested for starting the fires it’s not a climate or a political thing", "fsilva.olmek": "😢", "hoes_biggmadd": "@gretathunberg no asked", "joao_carlos_93": "Where is your theatre 🎭? Tears 😭? Screaming 😱? You’re a fake, nothing else.", "meteorizm_": "I want to go to Australia and help them with my own hands. all I have is my strength and desire to help. I don’t have money if I could help some fund if I could. I would go and work for free. My WhatsApp +77774439604 Vladimir", "__moy.16": "Esta mi bieeen", "dotterjohanna": "Fruktansvärt 😢♥️", "william_caines": "Ummmm it has nothing to do with climate change", "riosdelucasoficial": "Brasil lamenta🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷💕", "salmansharifi29": "Ok du som brinner för klimatet gör nåt då! Att skriva ett inlägg gör alla väll, skapa en organisation för att samla pengar eller nåt.", "askoullos": "You should use your platform to try and raise money for Wildlife Australia!", "_m.retarded": "Lol", "tomteslapow": "CO2 emissions are only a part of the problem. We have to change the economic Sustainibility is one of the keywords. To talk about actual CO2 emissions in context to the burnings in Australia sounds cynical.", "worldcare81": "fotze da", "mayrabandeiras": "Incêndio há mais de 3 meses e so posta uma fotinha e um texto pronto, mas se o @jairmessiasbolsonaro ou o @realdonaldtrump fossem presidente da Austrália, aí já tinha pedido até a cabeça dos caras, né, moça?", "jonas_lorenzo2": "#Pirralha 😡😠", "lunalunatwo": "Humans don't want, animals don't want, Australian don't want, they are trying to help the forest, you say so much but you do less", "harvard.comma": "Greta for UN Secretary General !!!!!", "yin_yang_99": "Bring the \"change\" you want to see!", "chrisb_rooks": "Everyone remember when the Amazon was burning? No..well it did for a bit then everyone forgot. Same thing will happen with this. Fires are a normal part of what happens on this planet. There are a ton of preventative measures that should be taken that aren't due to restrictions because of \"protecting the environment.\" Get down from your soapbox Greta and take some action.", "fernandosantos0410": "Vc esta ajudando ou so reclamando como SEMPRE.", "justin_zu.02": "Then do something to stop the fire ! Take a firefighter uniform and help the Australians instead of only posting something what doesnt help", "joan.latka": "😞💔💔💔", "babieslivesmatter2": "Ahh that’s why they arrested 100+ arsonists! Climate change🤯", "bonniearmstrong2026": "Scomo is helping? Too late mate and still a denier! You will.never be forgiven and your ever so important surplus will be gobbled up in no time trying to \"fix\" the damage your stubborn denial of scientific fact has caused.", "carlylin_yo": "What you should do is not saying words to general audience, but speak out for the Austrian people!!! Asking help from the government!!!! Did you know what the Austrian Government has done???? Nothing!!!!! The goverment would like to spend the money on celerbrating the new year rather than using this money to save the poor people whose houses are burning, to save those innocent animals!!!!!😢 Look at what the Austrlian PM did !!!!! People were in fire while their PM was having a holiday in a fancy place!!!!!!", "f182_v157": "Слушай, подруга, я сейчас скажу мнение большинства. Ты всего лишь девочка, которая только узнала о менструальном цикле и не хотела идти в школу. От твоих действий пользы 0. Ты понимаешь?! Профит действий нулевой, ноль блять. Если обобщить твои действия, то 90% - это пустые слова, неприкреплённый действиями. Ты не борешься за нас и нашу планету, ты всего лишь пустышка.", "n0_chill_jacob": "Ness really said PK FIRE", "ceo.of.vaping": "My dick is on fire", "wdntelecom": "You are a fuckin joke", "stephanielopina": "Okay but these fires were set deliberately by arson", "jacobc3518": "😭😔", "salana005": "😢", "sunshin9011": "💔", "bradleysaylor": "HoW dArE yOu!¡!", "correite": "#pirralha #hipócrita #pirralhahipócrita", "joecandu": "@gretathunberg Ask your dumb ass parents why they haven’t told you that a dozen Ausies were arrested for arson. And tell your parent to go F&$k off and stay out of our country. Bleach child.", "daddy.slorky": "Wait... if global warming is supposed to make the oceans rise than how we’re we in a drought?", "jackson__rice": "This couldn’t have been the work of arsonists😱🤯", "tyler_strandlie": "Hey dipshit it was set by 183 people", "recus.caliente": "HoW dArE YoU bECaUsE CLimAtE cHanGe", "isaac_rook14": "@gretathunberg when are you gonna tell your audience that multiple people were caught starting bush fires in Australia before the wild fires occurred.", "dalmirbitencourt": "Vai lá ajudar sua besta comunista!!!", "pedro_henrique333": "Só isso ???????@jairmessiasbolsonaro", "izargarth": "Caused by CHILDREN not global warming.", "bryantwallie2": "Man so many haters bruh", "33_markella_33": "Australia is on fire every year", "herpiadela2804": "😢", "sole0661": "💔💔💔💔💔💔💔", "evi_l_10": "🥺🥺🥺", "italo_silva_zs": "Saco de lixo", "pauloeroseliamor": "Sua Fuleira de quinta Categoria. A Austrália merece Respeito e Bondade. Lave a sua boca antes de falar mal do 🇧🇷. Bancada pelo Lula e a Ptralhada.", "tklouser": "You are truly a self centered pompous little twat. Get your ass back on school and learn something would ya. This is Arson.", "kylegravley_": "You do understand that people were arrested for starting this fire? So it truly is not climate change😂", "zachvalentino_": "You are aware the fire was started by arsonists right? I mean yeah the effects of the fire are sad, but how is this post helping the environment? You have no idea what you are talking about kid", "eligospel07": "Vai lá dar esporro no presidente australiano", "adventurara": "I looked up left wing extremist in the dictionary. I saw you there. People are waking up 🤡🤡 Fear can’t control everyone. #wakeup #agenda21 #NWO #questioneverything #agenda30 #hiddenagenda #seekthetruth #truthwillblowyourmind", "kktata": "@simoniframbach", "t4_critical": "Gone", "pa.ula6593": "Sólo pensamientos, nena sos la mayor potencia y no haces nada, cualquiera puede escribir un texto, hacelo anda y viaja a Australia, vos que tenes los recursos para ir a Estados Unidos a anda y en yate, esto es hipocrecia, la gente que menos tiene o que no llama la atención por su físico, ya sea edad o otra cosa, tiene la milésima parte de reconocimiento que vos. Y encima a ellos le s falta plata para seguir ayudando. Mientras vos ya estás politizada.", "darrenhughesart": "Devastating what is happening and there is refusal for unanimous agreement on the climate crisis.", "bill_mcnutt": "@gretathunberg You have any definitive proof the fires were caused by lack of climate control?", "vincentmontin": "damn nice väder👍🏽", "rightasrainstudios": "Many of Australia's fires were lit by arsonists. And \"distant NZ\"?? 4 hours by plane.", "rebecca_plastic_beauty": "Je suis désespérée 😔 je suis en colère 😡 contre l’humain qui se pense tout permis !", "alexgbrown": "Climate change did not do this", "steph_lud": "And then there was 24 people arrested due to a human cause and a not climate change 👀"}