{"jan.0602": "Hört auf mit diesen Hates! Hör nicht auf die! Du bist so tolll", "amar.cmc": "First class?", "jimmy._wr": "Clearly she would be happy if trains were overcrowded?", "onlyfiregames": "wtf so siehst aber net in der deutschen bahn aus", "ivyharley666": "So sorry you had to wait for you first class 😂", "mels_official.account": "I hope first class met your expectations", "dominik.ph": "Fake", "memento_mori_d_i_e": "There is videos of you sitting first class on that train", "handballbundesligazz": "Sorry but „overcrowded trains“??...our train system in Germany generally ain’t good, but this is far away from an „overcrowded“ train. You clearly haven’t seen our trains while rush hours. While rush hours you can’t even walk through the train, because it’s so crowded and many people still have to use the service every day to get to work, so stop fucking complaining. Also I really doubt that you didn’t drive 1st CLASS.", "danny_20_uk": "Shes Autistic obviously she wont like overcrowded trains!!!!!!!!!!!!", "mousewho_": "JADNO DETE..PA TI SI SE SMRZLA U TOM VOZU", "margoolis__": "You’re such a hypocrite fuck face", "byq_z_plastiku": "🤣🤣🤣🤣", "jono011112": "greta? what about the doner kebab in front of you that is not good for the planets and you are sitting in a train that emits co2?🤔", "brianfbaby": "You’re a 🤡", "r.c1992ss": "You have a first class ticket bitch", "benni_der_hobbit": "Tour a little", "grace_flora_g": "um thats not helping the earth now is it greta", "solonephy": "Shame on you", "lasse_wrt": "Is sich die Dame zu Fein zum Laufen oder was??", "maxklahold": "😂😂😂😂😂Ridiculo lotado com ela sozinha na foto com um monte de malas !!! Cade as pessoas toma vergonha na cara lacradora de merda e volta pra escola financiada por ONGs de jorge sollus 😂😂😂😂😂", "mali_mrtva": "Jaja Strom schlimmer als Co2", "tom.wetzel": "Just take a airplane, it's faster, more reliable and cheaper then the german trains", "logan_officer_who": "It fuckin empty", "its_ixbxl": "I don't see that the train is overcrowded 🤨", "thxnh_bln": "Typisch deutsche Bahn 😂", "nik.forget.me": "Hauptsache der Nudelbox geht es gut😉", "thozwin04": "Just guess we're you're baggage are made", "jacob_debruin": "This is fake its been on the news", "bogdan_wolff": "Fake News", "freestile_yt": "There is a PAPER Packet 😡", "jette_jnsn": "@typisch.tyler_", "haquaviva": "Deberías ser coherente y viajar en 🚲", "axelandersson9933": "that is bad for the climate you know like growing up in multi million dollar", "ma01007": "You always run home...", "gogsgordogordon": "Did you enjoy first class lol?", "juliaydm": "können wir kurz über die pomm-döner packung reden?", "walkingaplasticbag_cleannature": "I love that you now say that you are going to be transparent, we welcome that 🙏 will you then also tell that this is a staged professional photographer picture - those that are not blind know you traveled in first class 💚", "denisvelmakin": "Блин не позорилась бы, фейк за фейком", "amoray_koorts": "We all know u travelled in first class", "sebastiangavel": "waiting for an airplain haahhahahaha", "malika_9753": "❤️", "silja_leyla": "There is a box made of pape because of climate protection... 😱", "meme_crabby": "Sie geniest ihr Leben in vollen zügen", "fer.nandojime": "@danielagmeze amor mira te amo", "anne.welby": "Hello greta juste to tell you i am 9 and i try to do my best, i am very sorry ,😢😢😢😢", "will.gxx": "I hope the first class was nice", "duckillz": "Trump 2020", "normusc101": "Rebel News brought me", "j_nicholas_newman": "Thanks for traveling without using Co2 emissions ❤️ Your such an example 🙄", "mordiehn.mk7": "Schiebe dich raus aus Deutschland!", "cxaxr15": "das mit den Zügen ist ganz normal. es gibt nun mal sehr viele reisende in Deutschland. ich selbst muss jeden tag stehen. sie hätte auch ein bild von ihr selbst in der ersten Klasse posten können. da sass sie nämlich auf einem sitz und hatte reichlich platz. um die nachmittagszeit ist der zug nunmla mitb schülern voll!!!!", "marcogio873": "ah ok now i are remeber! these are Senegal train of raylweil company! look the write in Wolof on the back", "mrtn_grnz": "It is fucking empty", "cicheto.james": "Greta Hamburger you are a liar!!!", "yeh_that_billywarren": "Rebel News bought me here", "axel_lubbe": "🤔...", "zornibold05": "Haha Opfer", "dalton_holman7": "Lmbo, but hey you got first class tickets 👌🏻", "cone_miranda": "Why you don't go to Guatemala and take a chicken bus???? Pathetic... 🤣", "liya1_167": "Ohhh you a VIP oh no we don't like you😂", "cali_venom91": "Looks like she missed the trump train", "silent.forest.photography": "Lier", "danrburela_n_9": "Иди учись, хватит школу прогуливать!", "clementepegah": "You are lying to people and only some know the real story behind everything you say.you need to stop the lies ,companies are talking about you and they’re saying you lied so many many times and told the story to the world very differently than the truth.but the truth is coming out every time more and more.", "typisxhsarah": "stop lying you drove first class", "julianaaustralia": "Enjoy your first class seat 🥂", "darlan_braz": "@mariaclba_", "katalina.7.9": "💜💜💜", "jwfournier": "This was a staged photo.", "barneywaterhouse": "Doesn’t look over crowded if you fall for her staged act your just as bad this is badly staged like everything about her absolute joke", "julian_4598": "Das ist auch mit strom also auch Klimawandel vörderung also scheiße boooioo", "mukhtalef": "1st class train not so busy", "xxmr_t3rr0r_fr33z3xx": "Hoffe der Zug hatte mindestens 30 min Verspätung und am besten immer wegen einem anderen Grund🖕😂", "the100_teamforever": "Faaaake you Spakn", "georgemason.s": "LOL, when you was offered a free upgrade to 1st class!!!!! But decided to sit on the floor. The train is clearly not overcrowded when they open first class to seat everyone. Confirmed #fakenews", "mr.musical_beast1": "Is that paper I see", "drakedickey": "And how is she using some of her time for studies? That makes her a hypocrite through and through. Which I've know she was a hypocrite.", "bulterier_orso": "you are liar", "biggg41": "your amazing!...stay strong the world needs you!", "dominika_biharyova": "Wtf! You got 1st class. Don’t lie about that !", "saeed.javan.5": "They ruined your childhood. And planned their wire in your head.", "xxoliverpascalxx": "Klebe fotze", "gregor.jng": "Fake", "kosazak": "Giant nigger penis", "skemo.nk": "The train wasnt busy", "_niklas1999": "Deutsche Bahn bestes Leben 😉", "morisdor": "take a picture until we sat in the 1st class) hypocrite", "flightjomppe": "You sat in FIRST CLASS👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎 Thanks and bye Greta", "mlreet": "Бля да как в это все верят то?", "zehui_yang_": "傻逼玩意儿别他妈管中国人，我们筷子是他妈竹子做的，不是木头，你这火车也叫挤？你不是环保吗，坐火车干嘛？用脚走路啊，臭傻逼", "igor.effa": "Fake 😂😂😂", "leori26": "Lol", "_casparmainwaring": "that train has an engine like that sailing boat you went to America on lol", "goofytim": "I admire you so much and would admire even more if you had seated on the roof of an overcrowded train", "spezzziii": "Und die deutsche Bahn so :” Noch schöner wäre es gewesen, wenn Du zusätzlich auch berichtet hättest, wie freundlich und kompetent Du von unserem Team an Deinem Sitzplatz in der Ersten Klasse betreut worden bist”", "nico__rth": "Just because you're 'famous' you don't get special service. Thousands of other people are sitting on the ground in the german ICE dont cry", "mattguichon": "You say in first class calm down with the photo shoot. How clean does that train run btw?", "raffi._.der": "Lüge sie war in der 1 klasse", "yingo187": "Wenn unsere Züge so schlecht sind dann lauf doch", "deannavalentex": "it's not overcrowded if someone else can take a photo of you from a distance 🤡🤡", "roberta_valladao": "😂😂😂😂😂", "maxi_adg": "Ein Taschen Tuch und eine China Box das geht nicht 🙅‍♀️", "minereisetante": "How dare you", "sad._.wareniki": "Erst ma FLEISCH in einer KUNSTSTOFF Take Away Box ziemlich Klimafreundlich so 😂😂", "machuisla": "Poor little rich girl", "schnatter_knolly": "sie genießt ihr leben in vollen Zügen😂😂😂🌝", "he_is_kevin": "You sat first class. Stop it", "b.stat02": "This is fake af 🤡🤡", "little._.eye": "Stop lying, you are in the Forst class", "kkeen2009": "I feel so bad, I mean I’m sorry you got to travel first class", "mattlat87": "Those trains are great for the environment I’ve heard. @wesgeefromct", "ginairani": "Whatever if she sat in the first class or not. This picture is kinda \"asthetic\" you know 😂", "sbrt_bsc": "The Train is Not Hof für the World youre are Really Mistake", "clem.pron15": "En fait tu es contre la pollution mais tu prend les transports en commun😂😂", "dariopos": "Stop lying, all of this is fake", "jannik407": "Ich dachte du wärst Umweltaktivistin... 🤔Und warum dann die Einwegbox auf dem Boden 😡😡", "clintrisner_": "ah i remember you fabricated this picture and got called out by the rail company. they gave you first class lol", "nealiho": "But you were in 1st class.", "mariablondie19": "HOW DARE YOU!", "coinsrussia": "Пиздишь ты девочка", "andreadeinhadejesus": "Vai ajudar a Austrália? Cadê o seu grito hein Greta?", "marietta.privat1": "Is that take away food? How dare you?", "jungundgutgelaunt": "Deutsche Bahn sagt : Du hast einen First Class Seat. Scheiß lügnerin !", "thecowboycook": "😂😂😂 🤡 you were in first class .....", "adamtrolin08": "Ha ha du ser fattig ut", "lassefeldmann": "FAKE", "stizzileon": "Ist das nicht gut wenn die Züge so voll sind. Also was da für emmisionen eingespart werden merkt man das mal wieder Unwissenheit verbreitet wird", "sophie.nbg11": "Fliegen ist auch ungesund für die Welt", "outside.community": "дочь собаки", "niki.fliege": "Can you please just stop hating. She is maybe one day the one person who saves our ass. She did more for the enviroment than we all together.", "jasmxn.13": "I’m in the S-Bahn for gretatata gretatata ahhhh @imeeeennn 😂❤️", "jxalb.l26": "sorry but you get excited because you fly with the plane and co2 is eliminated but drive with a shit train? Then I don't think you understood the meaning of the environment", "a_n_l_o": "First classs", "domenik.fn_": "Fotze", "just.felix006": "It looks like a fucking yummy Thunfisch", "ricky_goerge": "Oh My PoOr GiRl. U kno what i gotta say to her ?, Ill wake my neighbours up every morning with my 12 valve cummins just to warm er up rolling coal out the hood stacks and once im done that shoot my batteries in the lake cause f* this autistic child. Done with my rant u can move on 😇", "mr.lucasrafael": "HOW DARE YOU?", "evita.z": "@stefanie_nowack ich habe mir während einer Zugfahrt die Zeit genommen alle Kommentare zu Ihrem Kommentar durchzulesen. Es ist sehr schade zu sehen, dass vielerlei Kommentare lediglich zum Angriff und zur Äußerung von Unmut auf beleidigende Art und Weise dienen. Trotzdem ist es wichtig einige Punkte anzusprechen. Um zu sehen, dass jemand falsche Rechtschreibung verwendet, muss man nicht darauf achten. Wenn man richtige Rechtschreibung selbst beherrscht, sieht man Fehler, ohne danach suchen zu müssen. Klimawandel ist akut. Natürlich explodiert der Planet nicht in drei Monaten, aber haben Sie sich Zeit genommen ernsthafte (!) Forschungsliteratur zu lesen? Das bedeutet Essays und Studien, die nicht lediglich durch Nachrichten zusammengefasst werden, sondern nehmen Sie ein solchen Werk selbst in die Hand. Sie werden überrascht sein. Nehmen Sie sich ruhig auch Zeit solche Literatur zum Thema Altersarmut in Deutschland zu lesen, es werden sicherlich ausreichend Argumente für Sie aufzufinden sein, die Sie auch aktiv verwenden können; denn leider konnte ich nur sehr wenige bis keine schlagkräftigen Argumente in Ihren Kommentaren finden. Sie haben sich ausreichend belesen? Nun kommen wir zum emotionalen Teil dieser Problematik; Deutschland brennt, Sie müssen ihr Haus verlassen, werden evakuiert, ohne Hoffnung auf baldige Linderung. Es ist nicht bloß ein Brand in einem Haus, oder einer Stadt, nein mehrere große Regionen brennen, aufgrund der hohen Temperaturen, wie gehen Sie damit um? Auch das ist Teil des Klimawandels. Nur weil Sie zur Zeit sich nicht davon betroffen fühlen, heißt es nicht, dass diesem Thema in Europa weniger Beachtung geschenkt werden sollte. Es ist eben doch sehr wichtig, dass alle Kontinente und deren Nationen alsbald handeln. Und ich bitte Sie dringlichst, lesen Sie Forschungsliteratur, zu allem, was Sie interessiert, nicht nur zusammengefasste Versionen in der Zeitung oder im Fernsehen.", "vetemaxts": "😫😫🤮", "xxo_270": "Mit was hast du denn die Nudeln gegessen? Mit der Hand? Hmmm", "gema.ampuero": "😡", "theonlyrealdeal1987": "completely doctored photo, you were found out to be a fraud, this was specifically framed to potray a fake storyline, you in fact ahd a first class ticket you vile creature", "charelgoethart": "Warum gibt es so viele Deutscher die dieses kleines Mädchen hassen? Sie hat irgendwie versucht, die Welt etwas verbessern zu können. Aber das ist nur meine Meinung. Netizens Weltweit können nicht chillen 😂", "ricardo_alexandre_alvaro": "FAKE FAKE FAKE. You travelled 1st Class you brat! 😡", "fondelmijunk": "This was a lie. You lied.", "x_dxniz.max_x": "You are really stupid, you are for the environment, but you have a bottle with a plastic cap and a backpack with a plastic cap !! If it goes on like this, humanity will go stupid!", "lorena_lola2": "Haha haubsache dönerbox gegönnt 😂😂😂😂😂", "india_do_para___": "Vai pro #Brazil querida e usa os trens por lá ,e vê se tu consegue tirar uma foto pelo o menos kkkkkkkk de tão cheio que são os trens por lá,depois tu posta algo do tipo @delima_emilly_ Translate aí pra @gretathunberg me entender.", "joleenkahl": "@lunibulli1 oha wie cool sie war in Deutschland👍🏻", "niconghailedesign": "Hope you had a wonderful Christmas! ❤️", "j_09_2004": "Haha", "bishop75349": "Sie genießt ihr BIO Leben in vollen Zügen", "ashleyswespneys": "That's bullshit, don't lie, you travelling at home in first class. You stupid game whit the people follows it's insane🖕🏼", "meme_kip": "Trains aren’t good for the klimate", "_lean_one": "Mal davon ab gesehen das sie verschiedenster Marken Namen trägt die auch keinen guten Ruf weg haben. Wo sind deine alpacka Sachen?die Hosen und alles ist mit dickste Chemie gewaschen🙌 gefärbt oder gebleicht sogar.@gretathunberg du bist nur eine Blendung, und hast hier in den Medien am wenigsten zu suchen ,stiftet andere dazu an dumm zu werden und sonst was zu bewirken. Genau das ist der Gegenteil", "grune_grashuepfer": "Ja Hauptsache ne China Nudel Box vor deinen Füßen du Mülleimer 🗑 🔥", "maradi_poyasnit": "Пиздаболка", "sanni_kazimi_123": "Bra jobbat greta 👏🏻👏🏻", "leandropisaia": "😆😆😆 sei sei 😆😆😆😆 sei sei foto manjada", "whydoesnickhaveinsta": "Hmm tr", "india.sf": "FAKE 100%", "gilmanovilya": "You are just a overcrowded piece of lies!", "csillacskaaaaaa": "Liar😂😂", "erickeller1706": "Fick dich", "_the_peach_girl_": "really? not everyone can afford to go first class so I don't think it's so crowded", "danfrench07": "Do the trains use petrol or coal ?", "_fxbi.bike_": "VERPISS DICH AUS DEUTSCHLAND DU FOTZE", "linus.ldt_": "Hat sie ihre Nudeln mit einer plastikgabel gegessen ?😂😂", "ritchie4jackson": "But you road in first class 🤔", "daniil_apelsinzik": "Эй, Русичи, откликнитесь! Кто её обсирать то будет?", "ebaaaann": "Its a real Bomj", "mariodesouzalima": "Fake! How dare you?", "hi_i_like_school_live_no_judge": "How dare you", "andreyzelencov80": "you're a liar", "screen12.3": "Hard that u dont tell the world how well the people treated you there. You should rather show people that it is good and comfortable to go by train instead of showing them wrong things. Yes, trains are often overcrowded but show People that it is better than driving a car!!!", "just_1_robert": "Bruh this stupid bitch came to my country shit", "eduusurfjp": "Fack 😂👎", "thi.p.gomes": "FAKE!", "laureymarcelia": "@tiajoy__", "w124privat": "Look the suitcases are not recycled Greta you tell shit to us just think about your stupid words...nobody can help the earth", "canchutranky": "@sebastian.aguinaga @jorgeandrecardenas", "6_7_chiara_8_9": "@mrbrx.68 deutsche Bahn oder was die arme GRETA 🤭😂", "e_o_cerju": "Don't forget to tell us how was the trip in first class @gretathunberg", "ryanrob99": "Also, I named my 2001 Audi A4 after you! It seemed", "patrik_kw450": "Ist das da nh Döner Box?", "icar250": "Nigga", "ddwyaa": "Paper napkins and Chinese food containers???? How is that low waste.", "luca_wave_": "Am besten fährst du noch eine Dampflok", "joshiii.backup": "dein zuhause", "kleiton_fcg": "Que farça hein kkkkkkkk", "haterqualified": "Oh nice I live just next to that sidewalk", "otto.koldits": "Go to work", "fvplima": "Fake photo!", "mmarcel.1": "Du geniest das Leben in vollen Zügen", "lucelia_g": "Fakeeeee", "montij9042010": "Eхала в первом классе, облизывали ей ,,,пу,а этот больной ребёнок пишет такую чушь.Иди Учись в школу", "johnvegan1": "Grazie a libero abbiamo saputo che in verità hai viaggiato in prima classe.. @margheritebianche", "makethataventiplease": "Don't trains use fuel? Which harm the environment? Practice what you preach 😊😊😊", "jonhxrdy": "Why are you wearing plastic shoes wear cloggs or leaves if your so passionate", "ubaidullah109": "Normal in india", "_edd1": "Heuchelerin", "tyreed_": "homeless😔", "henriquefedeli": "SO FAKE", "_i5aak_": "Nice image !!", "kakolid18": "You had a first class ticket.", "tiagomarquardt": "LIAR", "evmenov69": "Пиздаболка. Ехала ведь на самом деле в бизнес классе", "ricardocarneirofs": "First class are overcrowded???", "ederalbertino": "Fake", "ferozrosli94": "F*ck trump....trump is piece of shit😂", "dc3kssconnie": "@gretathunberg Shame on you for posting this photo and giving this false impression of your trainride through Germany. You were travelling in first class (with your father), served & treated like royalty by the train personnel! Ergo: #fake and then some!👎🏻", "ligia_lz": "What a shame!", "rahulpeters101": "Diesel train?", "hakanhakanbln": "Para var imkan var geziyosun fakir olsan evden cikamazsin", "amira.dlg": "Sie genießt ihr Leben in vollen Zügen", "willhurle": "not very environmentally safe fuckin hell", "fishman_fam_fans": "Wow u were travelling with 1st class and you are still complaining? Go to school and get some education", "ppmazza": "Ahah poor Greta, you are victim of the awful German trains too.", "dosome_crime": "You traveling in first class 😂😂😂😂😂😂😂😂😂fake af without you rich parrents you will be nothing", "orbzi10": "f a k e AF", "thiis.is.smb": "Nein bitte nicht", "thedrewkrys": "Love how people@are complaining about which class she was travelling in - but nothing about the single use food container? Isn’t that the evil?", "milli.esflower": "Greta i am not hating on you i don't like you but you do not deserve hate ... But can you please Stop posting fake pictures you had the first class so please Stop saying there are so much people that you have to sit on the floor please Stop it German trains aren't that Bad.", "e_facil": "Mentirosa 😠 Tão nova e já mentirosa desse jeito", "wallacechavees": "Viaje para Austrália", "13finn10": "Product placement😉", "max05.12": "Trains ? Hmm... co2 emissions?😂", "rebecca_delima": "Mentirosa 😒", "rbzhko": "Бедненькая", "dreee.1900": "take shame in the face traveled first class and was there just to photograph then returned to the first class u since childhood is no good", "heeenriiii": "Sie genießt das Leben in vollen Zügen", "_.xmadzx._": "How dare you", "mrsozialist": "Ich wusste gar nicht das die erste Klasse so luxuriös ist 😂", "diegoo.012": "💙", "xojesss.xo": "This was actually planned, she was in first class but was asked to sit there and move her bags. I dont get it anyway, there is no point sitting on the floor when the train is using the same amount of deisel", "lucasgf1995": "🖕", "4tlishna": "СКАЖИ СПАСИБО, ЧТО НЕ ЕДЕШЬ В ОДНОМ ВАГОНЕ С ЖИВОТНЫМИ БЛЯТЬ, ПСИНА СУТУЛАЯ", "aemmme62": "🤥🤥🤥🤥🤥🤥 business", "lil_peep_gbcgang": "fast du hade ju köpt first class så vad menas?", "lilyvinnyzak": "So you buy a first class ticket and then fake the photo for attention? Real mature and adult of you. Role model right her", "m4rianne._": "❤️❤️", "filippaaa97": "Ta ett flyg så går det fortare gumman 💕", "alfie.dhillon": "You were actually first class on this train there's footage", "greekcatz": "So what are your replies to allegations from the train company stating you were actually in first class and took this photo for publicity? @gretathunberg", "hpetertamas": "Psychisch Zerstörte Lebensweisen....", "felix_lca": "Sie hatte ein 1 Klasse Ticket und sich da nur fürs Foto hingesetzt. Hat auch die Deutsche Bahn bestätigt. She had an first class ticket and only for the photo she seats on the floor. The German Railway (Deutsche Bahn) said it on twitter.", "guto_ajr": "Ei doida, olha a caixa de comida que deixaste no chão aí sujando o mundo sua bostinha", "guillebal_04": "Fuck capitalism you were in first class", "x.cerysf.x": "🤡🤡🤡", "jacx_0.07": "Fake image.", "hermsdorflukas": "Die behinderte kuh", "david_evw_66": "Lol", "kevindoema": "How was your 1st class seat? 🤓🤔", "paulorobertodb": "You lier!!!", "anapaula.zim": "Was this photo before or after travel in first class? 🙄🙄🙄", "kingundderkilla": "She deserve a nice and warm stay at the gulag guys 🔥🔥 @haddi_nazari @soykan.ates31 @xelil_thoro", "x_rosie_jffsxox": "So overcrowded that u had to have a free first class lounge all to yourself and all the meals for free too And so overcrowded that there are no other ppl in the photo Thanks for saving the planet Congratulations on person of the year", "_marxxl03_": "Hate this stupid girl", "_fabi_79": "FUCK DB BUT ALSO FUCK YOU GRETA", "cliimateefloo": "great food box👏", "ellis__69": "Ur so hypocritical does that train run on fossil fuels if so doesn’t that go against your whole environmental activist religion and why don’t you be great full u piece of crap", "_xx._kiki_.xx_": "HAHAHAHAHAHA DER HINTERGRUND 😂❤️", "francibisio": "But the valigies are of plastica?", "lucasnpir": "Fake!", "vanice.leite": "Fofa vá lá ajudar de baldinho ajudar a apagar o incêndio na Austrália!!! A lembrei lá não tem nada que interesse a ti ou teus patrocinadores terroristas.", "edgy_spicy_memer": "Dddddddeported", "seungheonheonbraheondonlee": "F A K E", "paul.x19": "Greta Thunberg kriegt kein Platz im ICE Sie genießt ihr Leben in vollen Zügen", "alextugaoffical": "Big fake, just PR just for 🤑🤑🤑", "angel.ina_0307": "Es sieht jetzt nich so aus als ob der Zug überfüllt ist🙄", "geloescht17273763627": "Nudel Box!!!! Umwelt schädlich besteht aus Plastik", "_erikrs__": "So sieht’s aus wenn man First class bucht und Kanälen dein Platz wegnehmen ✌🏼🔫😛", "amalgama61": "К слову, оооооочень переполненных", "lavi_bhm": "🤮🤮", "bdllh.lbdw": "Why all these bags!!!", "vlonemarli": "Then she took first class🙏🏽😂😂", "aarononenc": "🖕🖕🖕🖕", "tomnicklas_2305": "I stand all day in avercrowded trains", "einzelkaempfer0": "Pech 😂", "save_our_planet_for_future": "Class*", "lunney121404": "Don’t trains run on diesel and diesel pollutes the air", "ashishkumar8081072178": "Hi", "kilometerdekagramm": "😢 eine einzige Person mit sooo viel Gepäck. Schäme dich 😢 Wo ist da die Nachhaltigkeit. Armes KRANKES unterentwickelten Kind.", "420_meldo_svk": "🖕🏿", "luzhifersbrthr": "Fake and stupid", "yannick.bollhalder": "Wen man den Flieger verpasst hat", "van_thomas_81": "Da gehörst hin....auf den Boden der Tatsachen du dummes Kind...😂😜😂😜", "official_glaza": "Wow 😘", "luis.atr04": "I heard that you sat in the first class...", "leon__aut": "@deutschebahn", "corichu32": "Oh TrAiNs ArE fUlL oF gAs AnD tHaT gAs RuInS eArTh 🤡 🤡", "dqsg_billznut": "Easy solution get a car", "ullikoppenhofer": "That is normal in Germany....not bad luck or something like that. Sorry Greta, but when you have to pay your tax and other bills, and you have to work 12 hours per day and 12 days consecutive time, you are glad to have a car to drive 2 hours to your home. Your photo is not a reason to get sympathy from me. 😢😢", "ossi_2000": "The German railways are not good", "q.lo13": "Omg there‘s paper!! Oh no the trees😂", "crazy_leon09": "Sie soll sich mal nicht beschweren sie hat nicht gesagt das sie bevor das passiert ist in der ersten Klasse super bedient wurde", "selinsch.aa": "dummes gör", "siddzzz.xo": "@gretathunberg ur a hässliche Arschschlampe", "derancourtjudith": "❤️ Thank you, Greta, for sharing yourself with all of us and our Mother Earth. #VictoryToThePeople", "arne.handball": "How are you😂", "justplayer534": "FAKE NEWS", "happyfeettonight": "Liar", "thxli.1707": "Warte SIE IST IM ZUG UMWELTVERSCHMUTZUNG 🙄das regt mich dann schon auf wtf", "leaw_2811": "Its sad because you was on your way home with 1st class... Its sad that you name wrong facts to feel good about what you do...", "alina_marie_love_123": "Und du hattest ein Platz in der 1 klasse und das Foto hast du ekstra gemacht du hattest ein Platz in der ersten Klasse in der ban also tuh nicht so als hettest du kein Platz bekommen", "crazy_simox": "u so bad", "_sxm_ara_": "Geh mal lieber zur Schule bevor du hier auf schlau machst Haha Greta hab heute Schmutz auf der Straße gelassen willst du jetzt kommen😂😂😂", "benny290182": "Hypocrisy", "angelina.zre_": "Auf Facebook hat das bahnunternehmen unter Das Bild geschrieben sie könnte sich auch in ihren erste Klasse Waggon sitzen den sie sich gebucht hat also wer so dreist lügen kann Puhhh Respekt", "danielcarvalhorito": "Its a big lie 🙄", "itzz.maurice": "Fakeeee", "kiraaa_garcia": "aren’t trains damaging for the environment?", "foxizsani": "U were in first class ;)", "takacs_gyorgy_george": "Hehh this is bullshit", "lloydieboy1984": "Didn't like first class huh? Stop lying to people! You are not God, get an education and be honest!!", "uwe_heinrich": "😂😂😂", "follow_udr.kai": "Verdient😘", "mglamur": "Hypocrite lying Retarded twat Lmao", "xo.celina.xa": "The photo is fake you bought a 1st class ticket and ypu don't like to sit there you don't like to sit on a another place!The photo is fake!", "_gabidze_": "Найс кушать из посуды, которая сделана из дерево (оно могло расти и давать, как минимум кислород, а пришлось срубить чтобы ты пожрала и выкинула ОМГ👃)", "_._nick._": "ACH ZUG FAHRE UND UMWELTSCHUTZ MACHE? HOW DARE YOU", "8_fazli_2": "Siehst du wie es ist wenn du nicht normal nachhause fahren kannst wegen Friday for Future", "segers.victor": "Krijg aids", "x.xmichelle.x": "Das Bild ist einfach nur traurig.", "ken_9.7": "Fake bitch mode", "flyingpsycho": "hOw DaRe YoU", "c17h13cin14": "Не пизди,ты ездила 1м классом", "becky_jurado": "I don’t understand what’s wrong with the first class , she is young first class is safer and if she can afford it 🤷🏽‍♀️ i mean , it’s a cool photo, there are worst things in this world to care about a young girl sitting on the floor", "einfach_marleen.lol": "Einen auf Umwelt machen und dann sich den zwei Euro scheiß im Plastik Behälter Lifern lassen läuft 🤦🏼‍♀️", "_marrviin": "Dreck gehört eben auf den Boden & nicht in die 1. Klasse", "narinkoese25": "How dare you you've lied your fans with YOUR empty words😂", "twinskat": "FAKE", "gisela_0230": "Ella en ningun momento dijo que no fuese en primera clase, y si fué que? Ella usa transporte publico, que es mucho más eficaz que ir en coche o en avión, dejen de criticarla, por favor 😔❤", "fratjakt": "🤣🤣🤣🤣 patetiska bilden. Tycker du ska ta skolan istället för ljuga lilla gumman. Det var inte snällt av dig att du gjorde så mot tåg bolaget.", "paith79": "Oh, amd one more thing. Do you know how many tons of fuel a plane burns? Yoi should have gone home by swiming and walking", "beethovenszehnte": "Erinnert ihr euch an den Song den Louis Armstrong gesungen hat....what a wonderful world. ..und die gilt es zu erhalten für Generationen nach uns 👍💕", "mis_telia": "#fake girl", "moaz_m.e": "Fake. And trains cause pollution. If i were u, I’d have went back to Sweden on a bike.", "wagon_on_wheels": "Trains doesnt that let off u now carbon or is it bull shit or r u just a hypocrete", "3_passineldelirio": "First class?", "ianorc": "Greta. How could you lie? How dare you. We all know you travelled 1st class. We all know the staff were friendly. Have some decency. How dare you.", "alex.frbg_26": "How dare you😂😂😂😂", "_officali_leon_": "Naja die Bahn sagt ja auch man soll 1 Gepäck Stück mit nehmen und nicht 20", "mherzer16": "She bought a first class ticket on the train and wasnt sitting there just to get this picture. What a fucking asshole 😂😂☠. And the fact that all her \"followers\" believe this shit.", "louisosullivan3": "Your fake", "_.el.guillee._": "Gang shit", "livloveland": "Don’t trains use fossil fuels", "xxpandanokowxx": "Überlege Mal warum du da auf dem Boden sitzt zurecht", "giulilein15_": "Plastic box for your food", "beatrice.walkerr": "Omg u r so hotttt 🔥", "christian_arthur_bourasseau": "But trains work on gasoline...", "saveplanet.ch": "❤️", "cedric.r07": "Pech gehabt 👎", "yt_max": "This is f fake", "hunter_greig_23": "Your using diesel", "dmitrypokrovsky": "First class bullshit", "hnhbnc": "die Kommentare hier sind auch die geilsten😂", "felix_spiegelsberger": "@stefanie_nowack so fucking true 👍💯", "slimisdead": "what powers the train greta?🤔🤔", "_just_nathalie": "Du machst mehr Umweltverschmutzung als ich in 3 jahren...", "_ale_s.p": "Maybe you can be less tumbler and you can help climate change. Idk, I ask...", "flo.trpp": "nice first class 🤨", "aannnikaaaa": "How dare you😂", "betseytrotwood": "You just keep doing you @gretathunberg the message was important here anyway and for those rattling on about coal were in the 21st century 🙄 - this marvellous young lady is doing more than most for our planet. Im in Stockholm until early Jan, would be so good to catch you talk somewhere ✊🏼", "the_young_pule": "BARBONA😂@karolg_ph 😂", "ab.amin_": "Ist kein zug ist ein Boot", "laurashtl": "@gretathunberg du willst doch das wir was tun für das Klimaschutz ä, dann ist es doch klar das viele mit dem Zug fahren statt mit dem Auto also sei mal froh und seh das als Anfang das der Zug überfüllt ist.", "preston_english": "trains are fossil fuel🤔", "khalil_mit_der_galil": "Lass diese u manyak", "lilian.vtl": "T sdf ?", "zabi_e_tico": "É vdd esse bilete?", "jeje.shams": "Go back to school", "rxmeo_187": "In German are say you are a schlampe", "david_lehmann19": "It's not Germany's fault for you sitting on the floor eventhough you have a 1st class ticket🤷‍♂️", "toastbrotiq": "Oh did is so fake bitch", "exup_sixo": "Ist da ETWA PLASTIK", "the_americansmartass": "10 bucks saya that train shes on is powerd by coal.", "meiko.210": "Das sich hier alle so aufregen jeder kann doch machen was er will 😂", "mattydb123": "So overcrowded that you're sitting by yourself with no one in sight?", "hamburger.architektur": "Good you travelled like this. It never so easy to get a seat here around in the trains especially when trains a cancelled like in your case. By the way it can still be comfortable no matter what they say.", "tonyw123": "She sat in first class and ate from plastic packaging. Not to mention all the journalists flying backwards and forwards to Sweden to interview the puppet. What a sham!", "shtz_pxscxl": "O", "gleb.chekanov": "So ein Schwachsinn 😂", "_w1ly._vg": "🖕🏿", "viki.dmt": "You should be shame! Shame you", "_.derechtebasser._": "Blyat", "le.fils.de_lhomme": "А потом оказывается что она едет первым классом не в забитом поезде)", "leafiance": "Aber Hauptsache ein ganzes Abteil kriegen", "jle_33": "Her parents have brain washed her", "steven_fsh": "Hure", "frie._.troll": "Sänk ju for träveling with se Deutsche Bhan", "moritszchindler": "Sie genießt ihr Leben in vollen Zügen xD", "rebek_h": "Aye looks jam packed... 😂", "benkycrop": "Where is picture of first class??? 🤣🤣🤣 Fake little girl🤥", "lhdoug": "I was there !!", "aharonoltra_": "El tren contamina imbecil", "ericschaumloffel": "Omg those are using coal!!!!!! Won’t that kill the earth??? Hahaha jokes on u.", "thiccccccccccccsavio": "I am a supporter for a healthy earth and all but people with the mindset like Greta Thunberg should go back to school damn it because they think yelling at a bunch of people way more politically inclined to have a say in this with their head wrapped around in other such more urgent means like world peace and poverty", "paolo_cabello": "🐎💩💩💩", "baddluxk": "Aren’t...don’t trains pollute the environment too?? Cuz of their smoke cloud from the engine?? I- I’m not finding the logic in this.", "mobabife": "Was für eine Show. Bei mir würdest du zufuß gehen", "weinema": "Fake! This is only the half truth! Why are you leaving the Deutsche Bahn in a bad light ?! You had a reserved seat, didn't you? If you now also attack the railroad companies, then you can only go on foot, right?", "shelovesb.ditty_": "🤣🤣", "diesermarian": "Greta genießt das Leben in vollen Zügen 😂", "lizottersberg173": "Ich finde dich einfach toll du setzt dich für uns ein👏👏👏👏👏👏👏👏👏👏👏👏👏👏. Ich wünsche dir ein frohes neues jahr. Erlich", "johnswereda": "HoW dARe YoU", "svenja.fishr": "Setz dich auf dein Fahrrad wenn du reisen willst! Züge brauchen genauso Kraftstoff und Strom!", "emanuel.kllr": "Fuc* u", "pascalweis1": "🤮", "hueseyin_can": "🤦‍♂️", "axmy.prv": "Stop hating Greta💚 she opens your eyes to see what‘s importent to the world and she helps you to think about your acts", "luke.9223": "Fucking hypocrite", "dr_jelle": "Didn't you have a seat in first class? 😂😂😂", "viewpointllc1": "The train company wouldn’t allow you sitting on the floor. Get back in the 1st class seat you bought. More fake news", "daszo_2neun": "Full looks different", "owen._pixley21": "Velcro shoes💀", "_sloppy.exe": "Stupid lil fella this is what we call first class and btw the trains are overcrowded because of you saying that we need stop the carbon dioxide. Cars produce this shit, so the people travel by train. That is the reason why they are overcrowded. You are not aware of your mindset.", "linuss.ulr": "Hau aus Deutschland ab man😂 @http.marvin.1966 @andremitstrich.1966", "_paulamrtn._": "Pobre shit a que iba en primera clase sentada :')", "jrmszrmnn": "Bruh ihre Schuhe drippen", "asher_flame_1": "So inspired by you have a great time 💕", "lele_7464": "It was 1 train that she didn’t catch so in the other she had to sit on the floor", "myworldin4": "Super top...🙌", "sdhwmaha": "Hopefully you won’t arrive back home or with a delay🖕🏿", "____.robin.____": "Dumme fotze", "bdapete": "Geeez you lot are fast to judge. She traveled on 3 trains in Germany. Two of them where packed and she had to sit on the floor on both trains accompanied by several reporters from Sweden’s two leading news agencies. On the third train she was provided a first class seat as were some reporters. Get your facts right before you go ape shit on someone even if you don’t agree with them or if your jealous for some reason. It is easy to sit and criticize everything. At least she is trying to make a change.", "ethanjogola": "Those trains are burning fossil fuels. Even if they’re electric there’s something burning down the line", "marilu_l_keunecke": "Foi na 1a classe e agora fica aí postando foto pousando de coitada . Sabemos que há muitos interesses dessa sua causa pelo meio ambiente", "carson_lashlee": "nice shoes", "tewhaititimara030": "Hi", "jaredtorez": "youre fake news. everything about you is so fake it’s hilarious", "ajandro04": "Hmmm oil based luggage🤔🤔", "thompson_g88": "Ooooooh soooooo dramatic (sarcastic)", "_anthonyapos": "Trains cause pollution you fucking idiot", "seliiiii.249": "Du tust so als hättest du keinen sitzplatz gehabt aber hast in der ersten klasse einen gehabt", "flynnyi006": "She actually got first class seats", "emir__cassab": "Greta deja de mentir y fíjate lo que realmente está sucediendo en la ciudad de Mendoza con el tema del agua y la minería", "kostas_firinidis": "Why are you on the floor?you bought first class tickets", "s_sanders1703": "Proud of what u are doing but is that an electric train or what 😂", "mael.xxl": "THIS BITCH DID NOTHING EXCEPTED BASHING OUR GENERATION !!!!! MR BEAST PLANTED 20.000.000 TREES AND HE DESERVE TO BE TIMES PERSON OF THE YEARS #mrbeastfortimespersonoftheyears", "jn_julian98": "Und danach schön in die 1.klasse gegangen, genau da, wo du zuletzt in der Schule warst 😂", "ha.rry8119": "Except you actually had a seat in first class, yet another lying leftie", "dazzle_novak_69": "Я спущу на тебя собак🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿", "forest_queen_03": "Does not one see that she actually was given first class seating but being the way she is (a snake looking for any reason to complain) she didn't portray that side. You should be ashamed. Also, are you really that \"above\" others where you cannot sit on the ground??? You aren't some \"god\", you're a teenage girl who can sit on the ground like everyone else if you have to!", "kgb008": "Wow! How much pollution was made for YOUR travel? Huge climate impact!", "hoyce32000": "Why are you sitting on the floor in First Class??? Also, don't let your parents control you with lies, get your education because everyone will disappear at some point and you'll have nothing.", "fuckoffpatricia_": "You look very sad", "adrii_jaq": "Train diesel en Allemagne, bon exemple @valentin_rapin @maxime.crausaz @bapt_is_te", "nylahkovacs": "while everyone is talking about her in first class the first thing I thought was, you’re on a train which use resources which harm the environment thus completely contradicting your argument against the government polluting the earth 🤷‍♀️", "tkalec_luka": "Thats not an overcrowded train you bitch,you probably have your own apartment in that shit", "se_lina7312": "So jetz pass mal auf du laberst nur müll jeder ist darauf reingefallen du bist abscheulich 🖕dein Vater handelt mit Klima Zertifikaten und verdient 1000000 Du bist das letzte wen du wirklich was tun willst dan gehn in Wald für ein jahr und bau dir da ein leben auf den so wird es bald sein wen du so Weiter machst 😶🙄🖕", "jeffrey_koppendraaier": "🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "pia_ofzl": "How dare you", "avvdddoooo": "🤣", "jessica_kii": "💚💚💚", "markrichardbugg": "Truly shocking the train company said you were on a first class seat", "tim_wieking": "Zug fahren ist Umweltschädlich die alte kann besser laufen verursacht nicht so viel co2", "eukotly31005": "HOW DARE YOU! The DB gave you a place in the first class! And why you post this foto as you are very poor! That's very ridiculous!!!!😠😠😠😠", "david.blh": "Bleib mal schön auf deinem kak boden sitzen", "jair_sabbath": "🤡🤡", "freddiejevans": "Nice first class seat in your name just behind you 👍", "dunebuggywyo": "You and your parents are wack job commie liberal shitstains that need to stay in your own fucking country and stop spuing lies to all these people around the world you people are scum and you know it ...", "sauz.z": "Y los boletos vip?", "manolinvalerio": "Is just a Child. The mother is the Real monster", "bigbunda_irenerob": "Me and my grandson love your instagram😀 kepp posting petine", "cutekitten87": "Wasn't you first class in the train???", "berlin.wyatt": "They gave u first class tickets and u moved all ur bags and suit cases just to take a photo that will cause drama nice one", "sarah.carroll.104": "Why do all you silly boys waste so much time picking on somebody who is doing more than the lot of you put together to save our planet? Where's the threat? Is it really just because she's a girl? Why not support her, or at least refrain from the low wit and infantile carrying on?", "sashe_8888": "❤️", "czny19": "Fuck off Thunberg, Buy a Ticket for The Class to sit or shut up and go to school peace of shit", "burchi_der_fuchs.aspz": "halt dein Maul und gib dich damit zufrieden...du hast es eigentlich nicht mal verdient mit der deutschen Bahn zu reisen also sei froh das du wenigstens auf dem Gang sitzen durftest!!!😠😠😠", "foresth5n1": "you are lying, you are a little damned hypocrite", "samnkranz": "Didn’t they call this chick out for riding first class on twitter😂", "x.swaggerlord.x": "Walk home is ecofriendlier", "sellerswestley": "Lots of bags", "patrick.and.bella": "Selbstdarstellerin 👎😤", "wesley.d.silva2": "FAKE !!! LOL . Bahn widerspricht Greta Thunberg – „Sitzplatz in der 1. Klasse“ . https://www.welt.de/politik/deutschland/article204333576/Greta-Thunberg-Deutsche-Bahn-kontert-Sitzplatz-in-der-1-Klasse.html", "cosco_shipping_kai": "I hope your train crash", "matt2385_": "Pero viaxas en primeira clase eh!!", "allsan": "Tönt", "tossierika": "Ridiculous", "saddamsfamily": "Funny for someone who traveled 1st class", "adowns.lax": "Super fake your not cool never should have won person of the year. You bought a seat on the train but didnt in it for publicity stunt", "rayzorblade4": "How dare you. That train is killing the environment. 🤡", "paulnuma": "@deutschebahn nice", "jake_the_communist": "“Overcrowded” your the only one in the photo", "elijah_rinaldi_": "I think those trains use alot of fuel that harms the environment 🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "landwirtschaft_by.henning": "Fahr Fahrrad 😂 und nicht mit einem leeren Zug am besten noch mit einer Diesel lock 🤣", "jason_sherriffs78": "Cough fake news like the rest of the world cough bunch of bull shit learn some respect you privileged white prick", "_michael_mccann_": "those trains use diesel gasoline causing pollution", "sasa.s_rb": "Fake bitch !", "saveourplanet_planetearth": "Hope you had a very Save Travel! You are always a Role Model!", "paul.08.15": "Fuck", "06jjam": "mentirosa voce estava na primeira classe!", "danny05.31": "Fuck u", "ke.v.in1": "Fake 🖕🏻", "g.lauraxx": "@samil._krupic sie war in Deutschland", "luciaalozanoo": "Verguenza", "bor.ki": "Пиздаболка", "pez_422": "Only overcrowded becasue you have 50 bags hahaa", "hayden_r_hunt": "Bitch you had a first class seat and even had people take care of your bags shut the fuck up", "i_kuk009": "E хули выёбываешься,у тебя были вип места !!!", "kristyna_kul": "Fucking lier! SHAME ON YOU!", "mi_b_74": "Die🤣🤣 hat echt einen an der Klatsche", "maja_krafczyk": "💗💗💗", "hopfnpauli": "Greta genießt ihr Leben in vollen Zügen ...", "dylaneltringham2134": "If you’re trying to save the planet then just walk", "zoee.schroeder": "too bad you were riding first class", "nikitaverhozin": "Хуле ты пиздишь", "vikavgystinova": "Пиздёж! Тебе потом дали самое комфортное место, ты только умеешь что пиздеть и нихуя не делать", "swirlzyy": "Literally fake news, the German transportation company called you out for sitting in first class. Delete this and stop publicizing falsified media into making people believe you live a simple and humble life. You can’t ask people to live a lifestyle you don’t even fully practice yourself", "john.marie.98622": "Gretathunberg # noel homecoming many climate HUD horizon ..also in economie pave# friends..#reseau partenaire: Facebook: email:monitor prix200.$..‡.calendar.-/12/-.like yours stories. Very 16¶√®™•° little people pole...big reseau. Global. Firewall.. Numerique. Regional..2020", "russellasser": "Coal train or what?", "william.sxlz": "Why are you lying? The DB Said That you hazards in the First class... What is wrong with you? @deutschebahn", "tommy_ve_66": "How awesome! a person sitting on the floor of a train 🙄🙄🤣", "hxneyanna": "STOP LYING! You were in the first line and now you're \"sitting on the ground\" ...", "joline_svan": "Greta Thunberg åkte 1:a klass hem, OCH?! Hur har folk mage att klaga över att en ung tjej som reser världen över för att rädda vårat jordklot väljer att åka första klass med TÅG??? Jag begriper inte? Enligt mig hade hon lika gärna kunnat flyga världen över (som andra ledare och aktivister gör) med tanke på VAD hon gör. Det är ingen som klagar på privatpersoner eller influensers som flyger hit och dit för nöjes skull?!! Men när Greta Thunberg tar 1:a klass tåg till stora klimatmöten för att förändra världen blir det ett jävla liv?", "fran_zis_ka87": "Du hast doch echt einen Sockenschuss, welche 16 Jährige reist mit soviel Gepäck? So ein eckelhaftes gestelltes Bild... 🤮", "cesar_r_._._": "I must have Alzheimer’s because I don’t remember asking", "moritz.1344": "The DB say he has a Place in the first class😂🤷‍♂️", "la_pulga_19": "YoU hAvE sToLeN My dReAmS!!", "mattleiby": "I wonder if that is an all electric train", "marleen.shz": "Raus aus Deutschland☺", "fresh.lemons": "Hahahahah you rode first class.", "just_muffshop": "In China fällt gerade ein Sack Reis um", "epic2null": "😂😂😂", "_privat_joleen": "HOW DARE YOU", "christinaelisch": "På tåg SER man även NATUREN utanför. 💖", "i.am.sofia": "First class Ticket ?! 😂", "jolina.hzb": "Und eine Plastik Packung daneben", "hermontleonardo": "#Bolsonaro2020", "linus.prvt____": "Wird auch Zeit hömma Ferien sind schon lange vorbei", "leni._.lisa": "How dare you?! You say first class so don’t lie!!! Your picture was made by professional!!!", "over999999999999": "dumb backward cunt deciles its rules to tolerasts", "_47.luann_": "How dear you", "amundbentzen": "Poppin sisters🔥", "eleanor.oughtonxo": "yet you didn’t mention you got put in first class🤔", "merwinf0": "When you realize that she travelled first class.......", "niklas.1731": "HAHAHA", "mvrtinv.idk": "En primera clase", "timbr17": "🖕🖕🖕 mach mal gschider öpis🖕🖕🖕🖕🖕", "edo.monzali": "Down di merda", "jahmal__23": "Watch out for neo nazis", "sergeytrepshyn": "Ahhahahahha loooool so fucking retarted", "hdandler": "You are lying....you drive in the first class🤦‍♂️ (i'm not english i'm pseirerisch)", "j0elewiss": "YOURE ON A TRAIN WHICH USES NON RENEWABLE FUEL, “HOW DARE YOU”", "m.w10x": "Biggst lie", "julian.klitz.1994": "FAKE!!! Schön in der ersten Klasse sitzen und vollservice ausnutzen. Dann sich eben aufm Boden setzen für ein Foto 😠", "edillanrodrigues": "Mentirosa. Viajou de 1° classe e diz que viajou no chão. Bando de idiotas que acredita na mentiras dessa garota riquinha...", "tahirus888": "👎👎", "_mayur_gharat_": "Jo tera torture he vo mera warmup he", "johnecomin": "FAKE NEWS...", "nathan.abraham.1982": "🤮🤮🤮🤮🤮🤮", "mvon05": "Es falso, has ido en primera clase, si eres una activista medioambiental no seas mentirosa, porque das ejemplo a mucha gente, así que ahora no digas que has ido con los animalistas cuando no es verdad", "blasphemyblacksoul": "47 chromosome", "gg_____bb": "Пиздаболка ёбаная", "rtygvm12": "Fuck u bitch", "nikii.sth": "Erste klasse du ...", "alexchorltonwilson": "forza bajen @gordon_sa", "dmytruk96": "Пиздец сколько боли, когда едешь в первом классе и у тебя удобств больше чем у многих квартирах", "miarodrigues56": "eu vejo o mundo morrendo menina em tidos lados; o clima e so o começo e as pessoas atrás com problemas tbm", "ayush_923768": "@gretathunberg inspiration♥️🖤", "frndodepaula": "FAKEEEEE", "travis_parisien": "TRAINS USE COAL THE JACKET IS MADE OUT OF PLASTIC GRETA EXPLAIN", "yourfaceblyat": "Бла да там же выяснили что это все постанова", "finnmartin30": "Neek", "manuferrandez_": "Poco hablas de que vas en primera clase, falsa, hipócrita, imbecil, embustera, das asco haciendo estos montajes de mierda, mucho asco...", "_hayden_adams": "Train FUEL BURNING TRAIN how darrrde you", "youcancallmestucci": "Greta Tumbler", "eazy_c_de": "U are so gey", "m_a_r_c_o_21_": "Thats fake How dare YOU!", "layneestadach": "Should’ve walked that ain’t environmentally friendly apparently", "mayonnaise_high_not_verified": "Ugly", "l.ig97": "Didn’t you ride first class?", "yoni_642": "Se dice que viajaste en primeras clases 😂", "bubnova27nina": "Лицемерие", "morningzzzzzzzzzz": "Greta is the issue with this world that she cries about. She is what is going to cause the world to end. We must stop her NOW before it goes to far. Join me in ending this madness so that we can move on into a better safer world", "b.orczyk": "on a train that BURNS fuel...", "danielsilva.bjj": "Fake news. #bolsonaro2022", "sirvan_latifah_cakici_kan37": "Greta we Love ♥️ you & the PIC... I hope you had god holidays ✌️", "samuskoo0": "fuck you greta mr beat is better 🔥", "saretta1306_": "ho appena buttato la plastica nella carta", "blazer_sc": "You are a liar you had a 1st class ticket!!", "beautifulearthco": "Have a safe journey!", "fctillona09": "Crying for the climate , but drivining 1.class", "goshel999": "Deutsche Bahn", "script_bbc": "Dumbass kid", "maxi.ktx": "Ekelhaft", "darenshilt": "The girl is a soros weapon she had first class tickets on that train fake🖕🏻", "luzian.cremonini": "Karma", "philipplhd": "You're lying! False slut you had booked a place in first class", "oart1337_": "Тупое говно, тупого говна", "lenahonoldlena": "Sind das etwa Plastik Reißverschlüsse?!", "till_obs": "Ist das etwa Pape aus der du da isst? Ich bin enttäuscht", "mariusmarii": "@gretathunberg jajaja menudo montaje!", "annabrown.moore_": "How is that overcrowded", "citizen_wrong_think": "First class on the train not good enough for Greta toonsburg.", "annalenaa.sa": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "teresabeck999": "No this is Germany:“ https://youtu.be/tyDJv2tmawI“", "tll.tms": "Lügnerin 😠😠", "jonah.sullyy": "why don’t you mention the fact that you were in first class for free", "n_x_24_04": "Schön Zug fahren", "litos_98": "Fake", "prishchepoaleksei": "Wow. Lying bitch", "asalihanms": "You was in Germany omg 😱", "gus.almighty": "@cesar0910 #sustainability", "barry_beatson": "trains cause pollution", "teresa_ohnheiser": "You’re same “actress” as your parents. Total drama and playing the victim.. Fuck you Greta 🙃", "thano.patzatzi": "How was the first class i think loved it", "lari.mnk": "Said it and drove 1st class", "nance__oooooo": "The smoke from that train makin ya sad ay", "smakenoff": "😂😂😂", "phil.scw": "Fu king hooooeee", "_noelle.fsr": "geh in die Schule!!!", "oscar81bravo": "O", "enouch64": "火车费油", "whotfisglow": "Nobody cares", "spam.hoi.im.brooke": "Diesel burning train? Alright greta😂", "jsdpolska": "Fraud!!!", "_unterwelten_": "😂😂🤣🤣😎", "_max.a.million_07": "Fuck you you little bitch", "umok822": "@little_ebony6366", "janne070505": "Der Zug war komplett frei die haben ihr einen Platz in der ersten Etage angeboten lel 😂😂💩", "ithek08": "@hxnkeljxel heult rum aber macht nh halbe weltreise 😂😂😂 stupid", "leon_20.60": "Kinda sad to see you lying, cause obviosly, as the DB said, you were chilling in the first class lmao😂", "onlywtr": "Amazing", "juliianamassaroni": "Who finances you? Everyone knows who finances their NGO. You're a reptilian puppet, but, ENOUGH! In the Name of Hyahushuah, our messiah all his hypocrisy will fall apart.", "liieszbeth": "Deine Falsch Aussage ist RUFMORD und somit Strafbar 😉", "idahoelk9909": "If you all don’t know the best way to save the climate is to ride on trains that use oil. Great message Greta", "roman_zc": "Sieg Heil", "anti._links": "Die pls", "noahha_ha": "Slipped on the PR slime trail", "panther_platform_": "Privileged little shit", "fabse_lostplace_": "Ein like =1 Mitleid", "nancyjokanovic": "@deutschebahn 😂😂😂", "leokraft_": "I dont like you", "tinasconnell": "Why don’t you ever see pictures of her actually working to save the environment? #afrozshah is the real deal and is humbly working towards the common goal we all have. She won’t ever answer because she is about self, this is very apparent by looking at her Instagram page.", "sergio_valentini_": "😂😂", "lessthangoood": "Guys, relax she's just a human as we are, stop hating", "brontesh_": "@amanda_s1405 read the comments, staged", "fritz_gda": "Sie genießt Ihr Leben in vollen Zügen 😂👀", "kaiyan_hibbert_": "First class you were in you fucking lier this is why no one likes you", "xkingalex88": "@hellg.rl_ Gea gscheida Schual und dua nit soebbas", "bxrix.35": "Some legends would say this bitch empty Jeeeeeet", "c_wizzy_izzy": "You’re a fraud. #liar #fraud #berlindataprotectionoffice is a phucking joke! #deutschebahn @deutschebahn #goodjob #callherout #gretathunbergisafraud", "ben__r252": "Deutscher Gruß Greta! 🙋🏻‍♂️🇩🇪", "pxx_77": "🖕🏽🖕🏽🤡🤡", "welifebeing": "Why not take a photo in 1st class you had tickets in?!🧐", "kmxn.vn": "Aber erstmal dönerbox auf nacken", "isijo9": "Thank you. In germany I and we hope, that trains become better service, they should start better in time and should have more connections. Please help!", "matteo__2701": "Is that an plastic to go box?", "juliebulie6": "Follow @boyanslat if you really care about the environment", "juliankabatnik": "Warum ist da ne Dönerbox neben dir?", "tommygun21k": "Spoiled kids; one of the biggest problems of this era...", "nikoart10": "You niggas know she was exposed right. She was travelling in a 1st class portion. Its all for your attention and it all goes in the benefit and profit of those who control her but u people are uneducated and dont know shit so u just belive everything", "m.hunyadi10": "How dare you", "44__joker": "An SUV has more seats", "leon.amn": "Du kleine Tunte alter, warum gehst du nicht zu Fuß oder fährst Fahrrad?", "kauan_migue12": "😂😂😂😂😂😂😂", "luk.831": "Hat deine Asia Box geschmeckt ?🍛", "sciencememes_daily": "How much money did you get for this fake picture? Shame on you", "arbuzovaks": "🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️", "jp_den": "What about first class?!fucking liar! 🖕", "irtn": "Deceitful coy robot slave 🤖 @_liam0", "eduardorodriguez385": "Yo te apoyo en lo que estás haciendo pero me dijeron que viajaste en primera clase dónde quedó el auto con basura eso anda diciendo la gente", "bikerware24": "Bitte mit dem Lügen aufhören!...Danke!", "andreii.97_": "Why u going on train, if u defending the world? Lol sad...", "maxim3882": "🍏🍏🍏", "_.t0nii._": "HOW DARE YOU?", "i_v_a_n21": "I wonder how many harmful emissions were released into the atmosphere when this yacht was made at the factory, how many were your rubber trainers casting so long? So shut up and go to school", "mario_prrrvt": "@realdonaldtrump", "go_succ_it": "well most of us dont give a fuck about you sitting on yhe floor because the train is overcrowded, and thats because you aint special, you're just like every other living human. that's it.", "bok_kalbs": "You're traveling on a train that releases shit ton of harmful chemicals to nature, you know that right?", "mayaschwarz__": "exactly my point how dare u greta", "_leon.smn_": "Ok boomer", "hans.dsg": "Fuck you", "__yeshimov__": "Ебанашка", "rizvanaj": "Das is ja ekelhaf", "jacky_news_": "🤮🤮🤮", "hannah.parkin28": "U got bloody upgraded it to first class 🤮 big lier", "odinevans": "If you trying to help the environment maybe don't ride on a train that makes carbon emissions.", "x.juleeee.xx": "😂", "rachlee111": "You don’t deserve to ride in a train. Stop spewing your BS. Walk back home", "oliver.ftl.bmx": "Wo is des Fahrrad", "cox_henry04": "I’m sure that train is a good way to help the environment 💁‍♂️", "lennox.blw": "Das wars komplett", "hechtitz.exe": "0,001 Tonnen co2 produziert", "1stlotto": "how do you like in the first class of the train? Ahahahhahahaha stupid bitch", "juuulliuuuss": "Scheiß kind", "david_17.10_": "Geh Schule machen", "marv_e30": "Leider ist der zug nicht entgleist. Verdammt nochmal....", "lmacedo.neto": "Espertinha hem 🤔", "s39imon": "Hurentochter", "joe._.cahill": "Shut up u got first class seats home u liar", "_david_huba_": "Rücksäcke wedern aus Plastik hergestellt", "_leon_6632": "Yesterday i turned on the audi 80 1.6 diesel (year of construction 1987) in the choke and at full throttle yes at -1 dagrees! And yas there he had a nice BLACK SMOKE! Ahahahah", "carazoccoli": "Between talking about crowded trains in Germany and hot weather in Australia you clearly don’t get out much do you 🙄", "ethan.m_16": "What the hell are you on a train, that train is polluting the environment, you have to walk everywhere.", "dmotyl": "How was your trip at first class? 😂😂😂", "not_unknownuser": "Overcrowded my ass", "schimmi_2.0": "Du bisch scheiße", "ogi_cetojevic": "Du Nutte dann reservier dir ein Platz du kurva", "ttttiiiimmyyyy": "Gegen CO2... aber mit den Zug durch Deutschland fahren Gratulation👌 #bestelogikever", "raulnaa19": "First person class", "silvio_schiller_": "Fake", "robertuk21": "Look like you travelling first class 🤣🤔", "maksimowfelix": "and the rest she travelled in first class... looks like some1 got exposed🤡", "alright.lucy": "AAAHHAHAHAHAHAHAHAHHAAHAHAHAHHAAHAHHAHAHAH", "leosteinxdizzda": "Such a lie. U had first class and don't even reply to any comments to maybe explain ur self but if u just ignore everything critical, u will only get hate.🤦‍♂️", "sam_bus15": ".", "_daniel_narbut": "What a bunch of lies", "controll1983": "😂😂😂", "_901_tj_": "That ain't over crowded if it was there would be more than just you and your bags in that spot, get off your butt and go to school like the rest of us CHILDREN maybe you would learn something", "autumnrosebr": "I hope you have a good trip", "allahworshipper69": "ah ah you are liar", "steellook": "Ulan alman demir yollarimda birinci sinif gidecegin yere gittin sornada camur attin... Bi insan bukadarmi asaglik olur... Ünlü oldun diye biyerin kalkti orasi belli", "jxri_.md": "HAAHAAAAAAA", "gisberto88": "Hai viaggiato in prima classe, bambina viziata.", "dazed_nebula": "greta, is that a chinese food container? where will you throw it away? where will it end up? oh no... not a land fill! or the ocean!! oh man... looks like you can’t control that, huh?", "jamie_os10": "You’re in first class stop feeling sorry for your self", "mainz_memes": "⠀⠀⠀⠀⣠⣶⡾⠏⠉⠙⠳⢦⡀⠀⠀⠀⢠⠞⠉⠙⠲⡀⠀ ⠀⠀⠀⣴⠿⠏⠀⠀⠀⠀⠀⠀⢳⡀⠀⡏⠀⠀⠀⠀⠀⢷ ⠀⠀⢠⣟⣋⡀⢀⣀⣀⡀⠀⣀⡀⣧⠀⢸ Desch ⡇ ⠀⠀⢸⣯⡭⠁⠸⣛⣟⠆⡴⣻⡲⣿⠀⣸ is ⡇ ⠀⠀⣟⣿⡭⠀⠀⠀⠀⠀⢱⠀⠀⣿⠀⢹Brutal!⠀⡇ ⠀⠀⠙⢿⣯⠄⠀⠀⠀⢀⡀⠀⠀⡿⠀⠀⡇🌚⠀⠀⡼ ⠀⠀⠀⠀⠹⣶⠆⠀⠀⠀⠀⠀⡴⠃⠀⠀⠘⠤⣄⣠⠞⠀ ⠀⠀⠀⠀⠀⢸⣷⡦⢤⡤⢤⣞⣁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⢀⣤⣴⣿⣏⠁⠀⠀⠸⣏⢯⣷⣖⣦⡀⠀⠀⠀⠀⠀⠀ ⢀⣾⣽⣿⣿⣿⣿⠛⢲⣶⣾⢉⡷⣿⣿⠵⣿⠀⠀⠀⠀⠀⠀ ⣼⣿⠍⠉⣿⡭⠉⠙⢺⣇⣼⡏⠀⠀⠀⣄⢸⠀⠀⠀⠀⠀⠀ ⣿⣿⣧⣀⣿.........⣀⣰⣏⣘⣆⣀⠀⠀⠀⠀⠀", "stoiberpaul": "Haha selber schuld musst halt zu fuß gehen dann is vielleicht umweltfreundlicher. Und eine frage deine Koffer sind die nicht auch schlecht für die umwelt. Wasser Predigen Wein Saufen", "rebornfelicity": "Leute ich war zufälliger weise im selben Zug, und hab sie in der ersten Klasse sitzen sehen. Überlegt jetzt mal wer euer Möchtegern Klima-Gott ist.", "edmon.arakelyan": "Followers @lil_hovhannisyan_125 ❤️❤️❤️❤️😍😍😍😍🇦🇲🇦🇲🇦🇲🇦🇲🇦🇲", "ethan_thomas_beam": "Lol post a picture of you sitting in your seat in first class lmao", "e.geez.t": "Please leave Germany and go back to Sweden. U are just harming us. What should everyone drive a car so poor Greta can get in an empty train. Oh I'm sorry but u lying we all know so stfu and sit ur ass down on ur 1st class seat", "malevinsky": "я, конечно, извиняюсь… а где люди?", "flaviolicios": "🤡🤡🤡🤡🤡🤡", "denkursky1": "Кто это такая?))", "huntcerberus": "Господи куда мы катимся", "aka.vladito": "Ahí de botellon", "mi1hel": "@deutschebahn warum bekommt nicht gleich jeder der keinen Sitzplatz hat eine BahnCard gratis?!", "t0mp3ggs": "Staged HoW DaRE yOu!", "o_s_i__i": "OLLARE OLLARE OLLARE OLLARE OLLARE OLLARE OLLARE OLLARE", "re.brkn": "Bruder deutschbahn ist jetzt auch nicht das umweltfreundlichste", "steven_mooz": "Wenn der hype um eine zugfahrt grösser ist als die Ergebnisse der klimakonferenz ist es ein klares Zeichen das der Zenit von Gretchen überschritten ist. Wird Zeit das sie endlich wieder die Schule besucht.... 😇", "moritzbiermeier": "Dislike 😂🔝", "aaron_1707_6": "Dislike🆙", "dxr_bxss": "You travelled in the first class. There is always a seat free", "simone_bollini_1": "Quante valigie per una un esserino tanto piccolo.", "lia.mschmidt14": "IT is so nice that in Germany people are using zur train", "bossmarken": "Ha! Good acting", "lispyjon_": "Staged stop faking this for attention", "le.onie5199": "🖕🖕🤮", "mccreg7": "Hold on to Greta!💪🏻💪🏻💪🏻 We will find your childhood!😍😍😍", "miezzekatze": "Wie sich erwachsene Menschen drüber aufregen das sie in der 1. Klasse saß. Habt ihr kein Leben?? Nichts besseres zu tun als euren ekelhaften Hass hier auszukotzen? Kommt mal klar und ordnet euer Leben neu! 🤦🏻‍♀️", "ilya__92__": "Fake", "leon_g357": "Fick dich 😘", "gasgas511": "So für die Umwelt aber dann so ein einmal Becher benutzen", "jaiden.kacic": "First class", "brrar06": "🤢", "laurin.scp": "☢️Umweltschädigerin☢️", "nico.nbx": "Hahaha you are a fucking meme. Dumme kleine kahba", "felixs.t_": "You were sitting in the first class, so shut up", "klaramelania": "what? tar du toget? du sko ha gått", "srishti_ranjan_25": "You had A seat in 1st class... Why are you telling lie @gretathunberg", "peopleforfutureleipzig": "🤔...", "abandun.co_": "Our future, our hope ❤️", "you_deluded_fool": "Ask the meaning in spanish: atorrante", "joel_the_normie": "She can finally go to school", "beto_cordeiro": "Puppet! Manipulated so easily...", "angelaferreira2109": "😍👏👏👏👏", "theonlyaxellaw": "Get some rest. Your voice is heard!"}