{"feco_dobos": "ONLY STRAIGHT 6!!!! FUCK U GRETA", "artistengineered": "Godbless you @gretathunberg Keep your head up", "fedros777": "Тупая пизда", "giorgia_virgilio_": "Voglio questo giubbotto . @__al.ee.__", "ulisesbiaggin": "🇨🇳🇨🇳🇨🇳🇨🇳☁️☁️☁️☁️🌪️🌪️🌪️🌪️🌪️", "pandelo13": "La tuya por si acaso", "stuka49": "How dare you", "gregor.jng": "How old are you ? 😂", "oriolalbi_": "Pk carajos llueve tanto en cataluña es por tu culpa greta???", "alekscher2": "🤮🤮🤮🤮🤮🤮🤮🤮🤮", "views.news": "The sun will soon be set forever, this intense heat marks the end of the star, which will soon be dark. Repent to Yahweh ..Allah so that your forgiveness and divine mercy may be included", "caden_casey": "Reeks of ass bud. Take a shower 🤡", "duckillz": "Trump 2020", "art_yervin": "Go to mars", "zxandrei": "Go back to school!!!!", "squish65": "🐑🐑🐑🐑🐑", "ianalexander1986": "Fucking state of u man😂😂😂😂😂😂😂", "joeycadogan": "He’s under contract at United though", "lulu_koira_nelly": "GRETA ÄR BEST!!!❤️", "ecogardens_odessa": "Please give me money for a good deed! My name is Stas. I live in Ukraine in Odessa. Engaged in landscape design. I want to open a children’s school of landscape design and landscaping, so that from childhood to familiarize children with nature and the preservation of the environment, we will plant plants together, treat them, grow them. For this I need 10,000 $. For rental of premises with a small land plot, for class equipment, for planting material and for trips to parks. If anyone can throw off at least a ruble, a dollar, I will be very grateful. I want to attract the state in the future and to be taught this in schools since childhood)) 💳4149 4991 0488 1337 $", "brianfbaby": "🤡", "tommy_monfo": "Falsa di m", "_derek_wood_": "Wish I could just drop out of school to protest something that isn’t even close to the biggest issue in the world right now", "2749174927q530q": "😫", "frank666777": "Super Greta😍😍", "joao_brazilianfitness": "Negativo 👎", "rjbrorsen": "I'm pretty sure that ink is a petrochemical and you made that sign out of paper. If the jacket is water resistant it made out of some sort of plastic which is a fossil fuel. 🤔", "_garcia026": "Gå leva din barndom brat, inte röra med de stora.", "rochy_picon": "Grande Greta 👏🏼👏🏼👏🏼", "oscar.edlund": "🤢🤮", "nici.d06": "How Dell you", "oksana__schastlivaya": "Браво!))", "smallandpepper": "I am with you!!! Let us all create new ways of living.", "serhat.a564": "How dare you", "chelino_09": "Muori", "jnaskoch": "Ist das ein PLASTIK Regenmantel????? how dare you", "vicente.1989": "Clothes made with slave labor", "badr_1207": "You are going good greta keep the vibe", "taekkers_": "Hang on. Didn't you literally complain about you not going to school because you had to take care of the climate disasters n shit. But you chose not to go to school yourself, so what are you even conplaining about? Lmao", "x.teri_x": "You look like a minion", "3a4em_mne_nik_": "🤡", "_the_peach_girl_": "great! I love how you recycle the banners🙄", "uai.mirian": "Você nem estuda! Abandonou a escola sua PIRRALHA", "noahgnw": "Hobbylos", "janfxck": "Ökos an die Macht 🤘", "http._lauraaa": "Geh mal lieber zu schule es gilt normal eike schulpflicht man du bist ein kind du kannst med alles wissen!!! Auserdem wenn du doch der umwelt helfen wollst dann geh nach amerika oder wo auch imer dieser vulkan aisbruch idt und leg dem schalter um", "ryan_kraus05": "Ew , what a disgrace", "compressorhead02": "I get to think about this strike when I start my 350ci chevy every day", "victor.patrizzi": "Se mandarem vc segurar um monte de bosta 💩 vc segura", "tyreed_": "70 weeks in=spent", "andrin_mueller_": "an alle fahrt mehrr autos für greta😂🥳", "paolop79": "This is only business for you", "emmasofiabredenberg": "Skolstejk????Får int barn gå i skola??", "big_boys_media": "Go to school", "fratjakt": "🙄..😑🤔🤬🤡💩💩💩", "joshiii.backup": "geh sterben", "mdsakir621": "🙌👏👏", "mr.roth_": "@dsr_ldwg 🖤", "yll631": "silly🙃🙃🙃", "maikel_morales": "Cagou para a 🇦🇺", "_.xmadzx._": "hOw dARe yOu", "mademoiselle.coan": "what an idiot!", "bianca.g.faria": "Do you have a 16 years?", "jxck.mac": "😂😂 Global warming isnt real", "hakanhakanbln": "Tanrım ülkeniz çok soğuk", "sarahrball": "Your skipping school until everyone changes the weather for you", "will_debie": "Great way to skyve", "lbf2612": "..AHI..AHI..AHI...The lights behind you produce heating..Didn't you know??🤔🤔..BETTER TO USE CANDLES..!! NO?!?!?!", "matheuscarvalho99": "Pirralha", "nat_g_shattuck": "Is that board your holding up recyclable?", "br.ooke5804": "Greta is such an inspiration. ❤️", "franquito_ivan.ok": "@jairmessiasbolsonaro la mocosa", "karlawilliams_": "Look like a fucking boy", "timllindahl": "Men min kölmaskin 740 då?", "rocketkiddie": "Omg...🤨😒", "imthatkidavin": "Those signs are hurting the environment tho", "albin_svenman": "🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "mosnargo": "Crazy little girl needs to@practice what she preaches lol", "wallacechavees": "Você liga para o clima ou para as riquezas da Amazônia? Porque a Austrália está sendo consumida pelo fogo", "ebbe_reuterborg": "Allahulakbar", "eng_civil_paulogiudice": "And Austrália?", "lil_jxvxn_prrrr_gvng": "Que guapa", "juan.m.trujjilo": "Eso es lo que haces los viernes cuando tienes clases", "_bstnblnk_": "#itsaboy", "fynnweh": "This ist shit🤮🤮", "bevillena": "@victorietafuster", "sandii_the_sloth": "If you were really deticated the why are you wearing plastic clothes (came from oil) wool beanie (from a sheep) use electricity ( coal burning exc) living in a house ( made of dead tree matter(wood) and metal from mines) see what I mean", "cadenmacattack": "Shut up nigga", "angelica_hidalgo37": "Happy birthday Greta!!!😉🥳😉🥳", "mountainous.max": "Thank you for your amazing dedication and perseverance!!! 💪", "tomekstar": "#goForGold", "fuckoffpatricia_": "I don’t understand", "marcel.bennington.3": "😂", "jack_ruebel": "I don’t speak Russian hippy", "m4rianne._": "👏👏🔝", "h.tsmemes": "Come to HTS", "bboythiago10": "Filha é a Austrália..???? Vai ficar caladinha agora e ?? Onde está o macron. ???", "emilydoesnotfwyou": "girl ima juh be straight up u wasting your time n not going to school ain’t gonna help u get a job in the future 🙆🏼 you can’t actually do anything for the future bc people don’t give a fuck so it’s a waste of your time, let the next gen do for themselves", "daaviiiid": "no", "k_a_t_j_a_1_9_6_3": "Alle Welt spricht nur noch von \"Greta\".. Ich kann diesen Namen und dieses Milchmädchen Gesicht nicht mehr sehen. Was hast du denn eigentlich schon erreicht in deinem Leben? Nichts. Reist durch die Welt und lässt dich feiern. Animierst die Kinder nicht zur Schule zu gehen, sondern zu Demonstrieren. Du sagst, das man dir die Kindheit genommen hat. Weißt du eigentlich was du da sagst. Du plapperst das nach was man dir vor gibt. Du kommst mit deiner Aktion 10 Jahre zu spät. Jetzt wo fast alles zu spät ist, da willst du die Welt retten. Was Klimaforscher schon lange vor dir versucht haben, willst du jetzt klar machen. Weißt du was du für mich bist. Eine Person die auf Kosten anderer durch die Welt reist. Wie wäre es denn wenn du mal die Wege die du per Boot und Flugzeug (davon sagst du nichts, das du ja auch wieder zurück musst, und bestimmt nicht zu Fuß) mal zu Fuß zurück legst.. Dann würdest du den ganzen scheiß hier nicht machen. Aber es ist ja viel bequemer mit Boot, Flugzeug und Auto zu reisen.. Bleib in Schweden und geh zur Schule. Denn unsere Kinder müssen auch zur Schule gehen.", "maik.matthies.3": "Hallo Greta das was du 2019 geschafft hast ist der Wahnsinn, mach weiter so. Wir werden dir unterstützen. LG. Maik ❤️❤️❤️", "user_reuser": "Torna a scuola somara", "gertruda_mimimi": "Иди в школу!!! Go to school!!!", "kleidsontavares": "Papagaio de pirata", "vladisdive": "Go to school, idiot.", "cjp912": "Awesome Greta", "anthonytaaffe08": "Good luck with climate change it's very important we keep our animal friends and our plant life safe", "klaus5921": "😠", "jan__tj": "This jacket is made of plastic madame🤨", "can.luca.g": "Geh mal zur Schule du *****", "charlierugby12345": "Got a life gretta🔥", "freitag479": "No one not from Sweden is gonna understand a singel Word on that sign", "tyler2wheel": "😂😂😂😂😂 They have preached climate bullshit before you were born!!", "francisco_junior_rcc": "Inspiração para todos que querem cabular aulas sob o argumento de um \"bem maior\". Irresponsável.", "t_i_a_r_a.privat": "I think I know you.. Are you not the child from \"It\"??", "lwaccount165799": "Schreib du deutsch du Hure", "pischi69md": "Wir haben auch jemanden mit Asberger in der Familie und wissen wie das ist", "88intheshade": "Just keep giving money to your government. Eventually they will fix the climate control. 😂😂", "alfarano._._hanna": "Viva il diesel", "ckelley2222": "The only person this is affecting is you. Had to be said", "xa_v.i_": "Nigga where is the global warming solution at", "dillon.ingrid": "Dear Greta, I am very happy that you are still standing up fighting for our planet. Please, never feel insulted ore hurt by hateful commentaries. You are wonderful just the way you are 🎈", "jrossi_mtb": "Woraus ist eigentlich dein Regenmantel ist der etwa aus plastik oder so🧨🧨✨🎇🎆✨🧨???????", "x.inst14tim.x": "Cool bitch", "becker_eva9": "dfdgeeppö112334g67udw1Ye.", "emberger9": "Mer I beaucoup Greta! 😊 ❤️Your are the best", "feuerwerker205": "Fehlt nur noch der Sand dann kannst du orginal Sandmann spielen", "hinrich.bosche": "Back to school", "lavi_bhm": "🤮🤮", "tuvalandaverde": "Vilken tid? :(", "cristian.esimo_": "Sinceramente bere roba con la cannuccia di carta rovina il sapore quindi🖕", "miajoana_hmb": "@am.ado5599", "nordwind770": "FCU", "nico_p.e": "Aus was besteht die Farbe des Stiftes den du für das Plakat benutzt hast?", "official_glaza": "You go girl 😘", "flex041": "🤡", "charlieharriii": "Go to school kid", "xmattix_": "Gay", "corichu32": "Global warming, along with your brains, aren't real. So give up and go to school. You can't change the world", "mirela.staicu.54": "👏", "antoine_jfk": "Ta gueule et écrit en français sale pute", "faust_nick_": "Wendy Adams hasnt aged at all", "44.luxe": "Schreib deutsch du bastrad", "puffereric": "Booooooooooo", "angelinaa.knr": "I luve yu vary much", "porotosconrienda": "A la clara también le dai mieo @claraopazol", "juskla_": "Good und make weiter so", "hanacelustkova": "Wenn sie was bewegen will dann sollte sie auch was dafür tun z.b. Bäume pflanzen oder Müll sammeln und... und nicht nur blöd schwätzen über irgendetwas wo sie keine Ahnung hat. Und die Jugendlichen sind so blöd und folgen sie ( es ist auch bequemere nur stehen und nichts tuen) . Mit blöden schwätzen rettet sie die Erde nicht. Bis jetzt hat sie damit nur erreicht das vieles verboten und das alles wird teuer. Und das hilft dem Umweltschutz nicht.", "francescaamely": "You don’t look like 16 ,u look like 10-13", "marcus_cruz_automation_tester": "Bra ursäkt att skippa skolan🤣", "_diego_the_raptormask": "Du e duktig", "queirozzmila": "Oi linda! Dá uma passadinha na Austrália pra ver como que tá lá e ajudar em algo! Bjs de luz ❤️", "me.and.the.boyzz": "litt🔥", "gelareh_ak94": "👎👎", "linodemaio": "@benjcd I thought this said ole gunna solsjkaer", "levdzhungli": "🌍🌎🌏👍", "neesa326": "Guess what that raincoat is made out of? School is what you need because you're a complete moron", "maxi_ascher": "Save turtles!!!!", "s.p.1.7": "Bahh igitt", "motblk": "skolstrejk för klimatet 🔥🔥🔥", "_.rxlii._": "Ey du ja genau du ich kipp öl in deinen lieblingssee (umweltsbewusst) @lincoln_clay22", "isaiah._.91": "If global warming is real then why is is fucking freezing outside then🤔", "xnusslein": "How dare you", "kajsafribergg": "It its so hot then why do u have a whole hazmat suit for 2 degree weather", "holdi_mtb_": "😂😂😂😂😂😂😂😂", "walmart_bread00": "What a stupid bitch libtard", "jxhxnnxs_mwz": "187", "lucasljungqvist05": "Gå till skola", "rosangela_olivier": "Vá para Austrália ajudar a combater os incêndios na floresta", "close_to_the_borderline": "Shut up go to school like the rest of us dumbass", "mangumcaky": "Gff", "justinachatzy": "@vellen_m Wir machen mit bei der Rettung der Erde 😂", "r0my_._": "Dein Mantel besteht bestimmt aus Plastik", "hoy_joey": "@mauriciootz", "ad_174738": "Stfu", "christianc.goficial": "Pau no CU", "adamsoini": "🤡", "_karimy__": "@zamanshirzad wtf bro 😂", "urboiben29": "Do something with ur life", "matthewclarke2017": "Pathetic. Encouraging children to leave their classes. You should be arrested", "ludwig.1337": "Greta, snälla gå hem och lär dig om saker innan du börjar med sådan här skit.", "marinarorocco": "Io faccio tutto il contrario che dici tu... Presuntuosa viziata", "anyaxmarps": "👊🏻❤️👊🏻", "colderthanabsolutezero": "Животное", "dizzlfizl": "🤮🤮🤮🤮", "mert.amigo": "She exaggerate", "mb_lifts": "Sorry but I don't think protesting climate change is beneficial if you aren't in school to learn about it you clown🤡", "sweetlessdivas": "Thats true Jamie _s_margolin", "tuomasuomas": "https://aikaisansilmin.blogspot.com/2019/12/voitko-sanoa-vammainen.html?m=1", "emma.wiley.xo": "How much does that jacket cost?", "marek_333x2": "I hate you", "piperhazel1": "❤️🌲🌍🌎❤️", "ab.amin_": "Meine hübsche blume❤️", "maga2020_0mezzy": "So cutting class will help ??? Please explain?", "my_mom_beatz_m3": "Destroy my pussy not my planet", "tomioka_aa": "blya...", "beatricekeul": "G R E A T ... G R E T A @beatricekeul", "saveplanet.ch": "❤️", "blackforest69": "Kunststoffregenmantel mit Heizölanteil 🤔du machst dich immer lächerlicher", "diiviera": "Skol litrão á 5,50? Aí tem meu voto!", "axel20___11": "❤️", "kskfkrkkwjd": "@realdonaldtrump Klima gibt es nicht !", "orinchak.v": "😂😂", "khalil_mit_der_galil": "Skjölstraika for greta marmita", "lilian.vtl": "Trop styler ton bonnet", "xx_yung_chapo_xx": "Thicc asf", "riserva_irisxhoney": "😍", "no.name.yet.yet": "People still are paying attention to her? Sad.", "luisromero___": "490 dias sin ir a clase @carlaafdez_", "parpalaalex07": "Erstmal Schule schwänzen🤦‍♂️🤦‍♂️", "michele.deluca_": "va scassaci a minkia", "reidchavis": "@gretathunberg is that a plastic rain suit 😑😑", "landon_barton04": "Fuck ur school you can choose to go to school you don’t have to in Sweden", "danilo_ribeiro_616": "Não consigo ler os comentários", "lxx__sxphxx": "You have a Smartphone, but why????? You say you don‘t like things like that. Smartphones are not good for the earth!! You don‘t want to go to school only. nothing get changed in anyway!", "darren_328haze": "🤢", "world_to_save_nature": "Save the Arctic, glaciers are collapsing, and it is becoming thinner. In order to save Nature from a global catastrophe, we must abandon all harmful civilization and refrain from extracting oil, gas, ore and much more: And we can save the World from destruction. Catastrophic climate change is associated with oil, gas, coal and much more. Humanity destroys all life in the whole world. All of them are poisoned: poisoned water, earth, air and the destruction of the ozone layer of the atmosphere are one of the main problems of the whole world. If people continue in the same vein, everyone will die from the catastrophe that man made with his own hands. Catastrophic environmental problems of the USA, Russia, France, Germany, Spain, Portugal, Italy, Argentina, Canada, China, Japan, India, Brazil, Australia, Mexico, Malaysia, Thailand, Philippines, Vietnam, Kenya, United Arab Emirates, Taiwan Indonesia, Jordan, Finland, Sweden, Great Britain and all countries of the world. Mining companies and the mining industry have turned the whole world into a huge quarry and underground void, this is a real hell for the whole world. Nature's pollution all over the world all diseases from oil, gas, coal, iron ore, sewage, garbage, cities, industry and transport. Global climate change around the world: drought, floods, hurricanes, earthquakes, tsunamis - all this happens around the world.", "alistairwestonn": "GO TO SCHOOL", "_maxwilliams._": "Your lack of education reflects your behaviour", "enyeleangels": "Why is written on that? Is that Danish? Norwegian? Swedih?", "brennerblakeman": "She the only one every time 😂😂😂😂😭", "mar.cobianchi": "ma solo io vengo qui per i commenti italiani?", "x.imon_": "Go back to school", "dennis20.04.2001": "Go to School", "_oreo_lover_1": "Go back to school", "franz7187": "I hope Fridays for Future going down 😂🖕🤮", "topixtm": "@hamburgwheeliekidz", "user26289": "🔝", "dylan_carpenter_04": "Why the hell you wearing a jacket?", "vincent.sfk": "Da is plastim in der Jacke", "rawad_algorf": "Sluta ljug", "lennihyvonen": "Your jacket is plastic", "emery_kloc": "Sorry what is that written on the sign? I don't speak Nazi.", "jdhillyardjr": "Go to school! You miiight actually learn something about science!! 🙄", "silas_plattner": "do chum ich ich de schisser über @j.buerki_1997", "a_balla04": "Is the jacket plastic?", "v_sieger": "Ебанько с диагнозом", "69_._._idiot_._._69": "🤡", "stev__pt": "Your jacket was made with petroleum you big dummy", "saveourplanet_planetearth": "👏", "lexi.golder": "hey girly!! 😘", "alex_pfaffinger": "fotzn", "tony.pg.1313": "Climate change is fakeeee Mother Earth is way smarter than you", "bert_wooster": "🖕🏻 Little twat.", "kevin.wab": "Hi Georgie @giuliano_spo", "_valentin_p": "How Dare you?????????????🤮🤮🤮🤮🍗🌮🌮🔥🔥🔥", "colmfcrehan_": "Go back to school 🤦🏻‍♂️", "_lea._79": "So bescheuert geh lieber mal in die Schule hör mal auf mit dem zeug es nervt", "taisa.m": "😅😅😅", "julkalenderfantasten": "Du är dålig! Jorden kommer inte att gå under! Det kommer bli en ny istid om 100000 år! Det har forskare kommit fram till men forskarna har inte blivit intervjuade @gretathunberg", "judealangriffiths": "Me am the do is the yes", "myworldin4": "🔥", "bagas_surya02": "Noble Woman👍👍👏👏🙇🙏❤❤", "mobabife": "🤮🤮🤮🤮🤮🤮🤮", "myles_riley": "School is nice", "iba_diegomanuel": "😂😂😂", "benedykt_zk": "@sip.ka.1992 bruder sie ist doch deine traumfrau oder was sagst du 🔥", "alee__tt": "You are the best person of the word", "coshemirs": "а таблички то твои из чего сделаны? правильно, из картона или бумаги! а ради бумаги и картона чтоб ты знала деревья рубают!", "vika_chernjaeva": "You com to Russia..", "gabardine9": "Bruh", "pablo____lauao": "Oh yes giving a very good message to the youth", "udududududu13": "Isnt striking school against the law and you can be fined right?", "michael.c1775": "Will lie for food", "iifvarsson": "Du är asball", "wyattm5": "That sign is made out of card board which is trees. Them boots are made out of petroleum products. The coat is made out of hydrocarbons. Everything your touching is made of petroleum based products. Bit hypocritical", "pre_crusade_memes": "Go to school you dence", "thompson_g88": "Is this what she does on her spare time", "davi_pasi_": "Quanto sei brutta", "blackswan_27": "You are sick, Greta!!!", "realdylanobee": "How the hell does skipping school gonna help the climate? That makes absolutely no sense.", "wornvintage": "💜💜", "kaankutluturk": "skipping school for climate is unrelated and you are just making excuses lol", "kosta.sten": "Hluxa", "naturebobo": "❤️👍👍👍🇫🇷🇫🇷🇫🇷 @naturebobo", "tslay45": "😂😂😂", "giancarlom89": "Affogati con la plastica", "kunze.ok": "Go into school!🤮", "lisa.knt06": "Instead of striking for climate, strike against the war all over the world and strike for the poor children all over the world for example in Syria, Iraq, India, Africa, South America!!! So sad to apply for the shit ambience instead for people who need the most help!!!!", "photography_by_cesari": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "erjon__12": "Fuck you", "grenrashiti": "🤮🤮🤮🤮🤮🤮🤮", "markrichardbugg": "Fucking idiot", "carla.pnicole": "💚💚💚", "yungfgta": "wanna fuck?", "mariietassprivv": "🌍🌍🏳️‍🌈🏳️‍🌈", "running.molitor": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "herve_2705": "Climate change won’t happen", "thodge255": "Hey what kind of material is that rain jacket made from??? 😉😉 you've been busted yet again you hypocrite", "branson_rom": "Go back to school", "patrickxxgreen": "Ol' English (Explicit) · The Game", "nathan.abraham.1982": "🤮🤮🤮🤮🤮🤮🤮🤮", "uschnoll": "Warum sollen immer nur die Pkw-Fahrer bluten und die LKW's nicht? Die LKW's gehören auf die Bahn. Der gesamte Gütertransport soll ber die Bahn lsufen und nurvom der Bahn an den nahen Endpunkt darf per Lkw geschehen. Dadurch werdende die Autobahnen entlastet. Das spart Sprit und Strassenausbaukosten. Ausserdem muss die Bahn viel öfter im Berufsverkehr fahren und pünktlich sein. Dann wären viel weniger Pkw's auf den Strassen", "darrenstallcup": "Please follow back", "fun_vanallesxx": "Stay strong🔥👏 i love what you do❤️❤️", "__huanfisch__": "Hässliche Dreiecks medchen", "normalnakcja": "You're a tool", "blackpanther.22": "M", "anton.stojan": "🖕", "chulitoomamii": "Tay puro weando loko deci q te quitaron la infancia y mas encima teni el descaro de decirlo tomando el pedazo de desayuno (pagado) habiendo niños trabajando y con calambre en la guata por no comer aweona qla", "nomakeuptho": "🤍🤍🤍🤲🏽🤲🏽🤲🏽🤍🤍🤍🧡", "yhuitsuagi941": "Você não vai resolver nada e no mundo.", "olimarzenell": "Fotze 💩", "pietro4895": "Autistic peace of shit", "dalterwalter": "Lmaooo get the fuck back to school retard", "_bpeck_": "Ok Commie", "y.ld.r.m": "Bitch", "jacksonllewellyn": "You’re delusional", "anniebrient": "Wow so much hate why? Let’s get everyone involved especially kids in the discussion. Check out @skitmag work with children making climate awareness relevant at home @helpfulkidz", "morgannmurrayyy": "shut up", "kellyyconway": "Ur a nut", "v_keymolent": "CAN WE SAVE THE KOALAS 🐨🔥😭", "foreverfilip": "Why is this shit popping up I don't care.", "that_fake_laramie_slt": "Ight y’all have seen that old Tom and Jerry meme we’re he puts the gun in the hole and it comes out above and points at him right? That’s this WHOLE DAM PLANET 🤣🤣🤣 🤣🤣 so in the first world countries for are Diesel powered trucks and etc we have DEF fluid and EGR yeah if we look at Bangladesh which is a Third World country and it’s also the place where all ships go to die were they are cut up and dismantled right there on the beach pouring asbestos oil diesel fuel coolant and what ever else right back into the ocean in northern British Columbia we have a huge carbon tax for driving vehicles that use fossil fuels yet our government invest $300 million in Chineses coal powered factories 🤔 this world is a dam joke", "karen_tookthe_kidos": "RAWR X3 *nuzzles* UWU you so warm. Couldnt help but notice your bulge strewn across the floor *nuzzles your necky wecky* *murr* *unzips your baggy ass pants* OOF baby you so musky take me home pet and make me yours and don’t forget to stuff me see me wag my widdle baby tail all for your BOLGY WOLGY *Kisses and Lickies your neck* I hope daddy likies *nuzzles and wuzzles your chest* I be getting thirsty Hey I got a little itch, you think you can help me? Only 7 inches long, UWU PLS ADOPT ME Paws on your bulge as I lick my lips Bout to hit em with this furry shit", "pedro_guglie": "Vai a lavorare", "jonas.fy": "@adrian.johann wer kennt es net 😂", "oramongouveia": "😂😂😂😂😂😂😂😂😂😂😂😂", "eliasmaxim_": "Den diesjährigen Kerosin-bedingten CO2-Ausstoß widme ich meiner speziellen Freundin, der Aspergerapokalypse aus Schweden. Seit der Antike träumte die Menschheit vom Fliegen. Erst 1903 gelang es den Gebrüdern Wright, einen andauernden Motorflug zu absolvieren. 116 Jahre später erklärt uns der blondzöpfige Pampalatsch, dass wir wieder in Höhlen leben sollen. https://m.youtube.com/watch?v=yJRqC6UNTtw", "laboratirio_supreme": "te pareses al jorgi con ese trage jadjqbd", "lennistim": "Youre Jacket Was plastic 😂😭", "warvex_": "Imagine if the whole climate change protests she’s doing is just an excuse to not go to school", "arvidhogluund": "Du går inte i en skola med skolplikt längre", "jotadejuankar": "Viva la gasolina", "ya_eci": "bak çok uğraşma manyak olursun bilader ben sana diyim", "djblitz_it": "Even tomorrow?", "seergio_oteroo": "ARRIBA ESPAÑA", "ellixtt_2nd_spam": "Who in a what now", "blueesafarii": "You should be at school and learn about the environment", "nolan_klippel": "Lol so fake there is no such thing as climate change", "bollfam": "Stirb du Hure", "kx_mx.x": "Wo sind meine Simson Fahrer??🤤🤤", "adrian.johann": "@jonas_gvst für die umwelt einsätzen aber ein handy benutzen😂", "d_king12": "Just when you thought the youth couldnt get any dumber 👌", "_benmarlow": "Fuck off you slag", "_gabriel.serafim_": "climate change is also important on holiday✊", "sahar.ezzi": "👌", "miguep2000": "I so proud of you, because you have the best super power, is a intelligence and pacience. You are the best human in the world and the only can change opinions in stupid people, for example Donald Trump. Greatings from Colombia", "arod32": "Greta drives a Tesla that Soros gave her! Look inside you will find all sorts of plastics and trash lying around", "_spencer_bourne_": "Imagine not going to school for over a year because of something that wont even impact you in your life time then moaning about not being in school", "richard_van_staufen_": "und in Wäldern, nicht auf WhatsApp oder Instagram. Wir waren dreckig aber gesund und litten nicht an Fettsucht, Allergien und Depressionen. Wie scheinheilig Eure Proteste doch sind! Kinder in Deinem Alter verursachen mehr CO2 als alle Jugendgenerationen davor. Eure Schränke sind voller Kleider, von Kindersklaven in Asien genäht. Eure coolen Smartphones und Tablets landen regelmäßig als Schrott in den armen Ländern. Alles, was ihr im Überfluss habt und fordert, wird mit CO2-Ausstoss produziert und zumeist importiert. Gerade Ihr seid deshalb kein Vorbild für eine klimafreundliche Gesellschaft. Deshalb, liebe Greta, nimm lieber Deine Altersgenossen ins Gebet und widme ihnen Deinen Zorn. Bei uns ist er nämlich völlig fehl am Platz.", "lovisaaa.a": "❤️❤️", "kracav4ik73rus_": "Саси член", "just.some.aussie.c_nt": "I find it funny how she bitches about this and says that adults need to do something, yet she herself is not doing anything", "just_no_for_a_change": "Good hope you end up jobless and uneducated because you have done nothing for nobody.", "piggy.meme": "du suger", "x.swaggerlord.x": "#gotoschool", "enzo.criscione": "🤡", "0sc4r_28": "Hurensohn", "kanj.e.e.e": "Hi", "28lupo": "🧂🥫🍼🍶🍶🍶🍶🧨🧴🧴🧴🧴", "k1m_h7": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "kennytheku": "You are a fucking idiot!!!", "jack_da.lad": "This is just one big excuse to skip school 😂", "emxn.xer_co": "Go to school and shut up", "isabelisme": "fuck now my own generation is starting to believe that we cause climate change", "abg1972c": "💩💩💩💩... payasa.", "seregavikhr": "Fuck you Greta", "joaquin.mingote": "Títere élite 🤦‍♂️", "martinn.jansson": "Go back to school", "__elenamaria__": "You go girl💪❤️", "_gio_bonomo": "2 tempista tutta la vita", "wiedemann.sophia": "Global warming is a lie", "lokrantzoliver": "vet du hur många liter vatten dendär regnjackan tog för att göra? fy!", "florenciapaola.marquez.5": "Hi Greta, I am from Argentina, we need help in the city of Mendoza, they are wanting to reform a law 7722 that authorizes the miners to pollute the water, please we need the world to know what is happening here ... help me spread it please! #elaguaesoro #conelaguanosenegocia", "fynn_k1": "Lost", "jason_sherriffs78": "She dose know that the majority of the shit she’s wearing is made from HaRmFuL chemicals that make it gross and I say your gonna try and take all the away you can go live with the Amish who have none of this stuff", "mark.tan1974": "Go back to school! Hehehe", "nick_hinebrook": "I hope you don't expect to graduate on time because you're skipping school like this😂. Nobody cares about what you have to say Greta. You're a 16 year old that knows absolutely 0 about anything in this world. Shut the hell up and go back to school 😂", "vinc15.03": "🤢🤢🤢🤢🤢", "yuval_tzor08": "You are an amazing person!💕", "usa_kkana2": "It is difficult to believe you’re my age. You know, as idiotic as you are.", "_martzel_": "🤣🤣", "tonya.sergeev": "Young upstart. There are so many significant people in the world who have done cool things this year, and they give her the title of the man of the year ... Facepalm.😒", "vedo_bbb": "How dare you", "thehexend": "16 years old and not even a chest in sight, not a woman just a child. Stop trying to get followers and fame foolish child.", "hx.connor": "Maybe provide a solution to climate change instead of crying on tv about it. Blaming other people won’t solve it", "iron_greywolf": "Ne Çirkin itici bi kız bu yaaa kusucam", "chrisi._official": "#fridaysforthunfisch💪", "i_fck_btches": "@chrisi._official #HalddeinMaul", "matanzimman": "Get back in school and stop protesting about stuff you don’t have a sense of what you’re talking about. @gretathunberg", "vadimchik_spotter": "Иди в школу, а то родакам спалю, что ты куришь за гаражами", "esrasumeryan": "uiy ula hamsi bu ne hal", "kun_publ_acc": "Instagram servers use really much electricity, let’s ban instagram or have instagram curfews", "coltonlovisone": "Bruh you can’t just skip school for 70 weeks to support something that most people know is not going to be solved for several more years", "o4oxannax": "How dare you", "lindagransart": "Ne laisses pas les abrutis te critiquer. Ce que vous faites les jeunes est super bravo la planète vous dit MERCI", "ali_mbrk": "Geh lieber zur Schule ya scharmuta @oskar_233 , @pepe.aurich", "climate914": "❤️❤️❤️❤️", "ailin.railao": "💪 We need the world support to our reject on modification to mining law #lifeispurewater #LA7722NOSETOCA #argentinalovespurewater 💙💧", "yourpublic.confusedkid": "Wow nice strike its really making a huge difference", "donoes98": "Ridículo.", "mr_adjusture": "You have finished school allready because your 16. That means your not doing any striking. I think this movment have gone to long and its not about climate anymore.", "barrrrg": "You are gettin stupid go to school", "franz.officia1": "In Germany we say: „Fridays for Hubraum“", "buymyogaccount": "Pyro IS NO CRIME!", "paseando16": "Me parece que tienes mucha jeta... eso significa que lo de estudiar te gusta poco", "scooptiwhoop": "🤡🤡🤡🤡", "f.dangelo_": "Is that coat made of plastic?", "chucky_d.blue": "You cant go Strike After vhristmas bec the hole grpup from you was sitong unser a tree , the new strikers dont know how does it works. You cant go say safe the Planet After making Christmas diners Plastik presents and a death tree in our Apartments ä. Holy crap tue new gen is not ready für this", "leeesimsi": "Starkt av dig som kan stå för klimatet💪🏻💯❤️", "autonomous_consciousness": "Well done for drawing so much attention to the issue, sometimes we have to just get up and DO whatever is in our power, however small it may seem, instead of resentfully accepting our fate. It seems obvious that all people want to talk about is ANYTHING but the very issues you are trying to shine a light on... which is the very proof you need to keep going. They underestimate and fear your commitment. Keep doing what you’re doing amazing young lady. The trolls will troll on regardless 🤗", "james_strunk.57": "Now you’re just doing it to stay out of school", "bichos0l": "😂", "luciaalozanoo": "Chubasquero de plastico", "loru_davide": "@marie.stplr 😂😂😂", "bor.ki": "Как же ты достала. Люди, вы что совсем разум потеряли? Это наглая девочка ничего не сделала. Почему так много внимания ей уделено?? Несправедливо…", "serch_puerto_": "Less student strikes, and more studying the possible solutions for climate change", "4ma3cel9": "🔥🔥 @moritz1200", "patrick.beal.161": "Blessed love gretathunberg wishes you many more years to come in good health and happiness with God guidance", "walter_hartl": "Fucking asberger xD", "tryh_clan_yt": "Lp", "_bo._13": "Go to School!!!!!!!!!!!!", "saulrodaldm": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮YOU SUCK... GO TO SCHOOL!", "javigvrrido": "Eres mas tonta hija", "studio_reuse": "♻️🌎❤️", "blackperson_1488": "Go and kill yourself, little bitch", "isyaboieleazar": "🗿", "_shlyakhov_": "Я посрал и поплакал, сделайте меня человеком года", "jerichoselin": "Callieu", "miluu_guardia01": "#7722nosetoca Mendoza-Argentina", "vanja_vasiljkovic": "How is not going to school helping the enviroment? And seriously im not being mean I want someone to answer, because she say she should be in school and yet choose not to be 🤔🤔🤔🤔 i am actualy wondering how is not getting a proper education helping in any way to the enviroment? No hate just really wanna know if someone can explain?? I am curious 🤔🤔🤔🤷🏻🤷🏻🤷🏻🤷🏻", "danytaabe": "Hi Greta. I don't know if you will read this but I must try. I am from Mendoza Argentina, the land that gives life to the best wines in the world. We are known and visited by many famous and great people of the world for the beauty of our land and the attractions of the inhabitants, at least they have told us. I write to you with all the humility I have and with the hope that you will listen to me and understand the great sadness I have been with my family today. My family is the whole town of Mendoza. and on December 22 we started a peaceful march, walking more than 100 kilometers until we reached the government house. We started on december 22 and arrived on the 23rd at 7am to the city. We marched because the Mendoza government approved the reform of the only law that protects Mendoza's pure water, giving the mining multinationals permission to use cyanide, sulfuric acid, among other things to perform the extraction of metals. Law 7722 was prepared to protect water, not to be against mining. We only wish that the mining that is carried out does not use the little water we have since it is used for consumption and agricultural production. Many people from my town marched to the capital through the desert and several more small towns. We are so many interested in protecting the water that eighty thousand people gathered who only carried water and a flag of Argentina. nobody represented a particular ideology, nobody was interested in anything other than the protection of 7722. law that was applauded in many other countries and admired. When we arrived at the government house, our governor Rodolfo Suárez did not attend us, he did not try to talk and nobody in his cabinet did. Families with newborn children, young children and grandparents with their entire families were part of a cruel repression that the government itself devised by placing infiltrators who attacked the police and they responded with tear gas and rubber bullets everywhere and sparing no people there they were. but we ... were many more! and we couldn't do anything to stop them. Help!", "selma_koullou": "You wanna protect environment while wearing plastic jackets?! That’s irrelevant! Go to school Crazy psycho B!", "dogthefurst": "I wish I could miss out on school💀😂", "havannajk_": "Du sitter och lurar folk att du har sett koldioxid med blåtta ögat, det var vattenånga. Koldioxid är helt osynligt och ofarligt. Utan koldioxiden skulle alla växter dö. Jag är 9 år och kan så här mycket så ta åt dig. Istället för att sitta på torget och stejka så kan du typ gå och plocka skräp om du vill hjälpa miljön och klimatet så mycket. Föresten blanda inte ihop klimat och miljö.👋😃", "o_nedobelskiy": "« да Да даа, Иииидииии Навахууууйй» (с)", "letmefight": "What does your parents do with your school strike?", "luciadrianana": "After 100 kilometers traveled on foot by the neighbors in a historic 10-kilometer long march in defense of the water against the polluting mega-mining, the governor of Mendoza, Argentina ignores the popular claim and approves the modification to law 7722, thus liberating the use of cyanide among other pollutants in complicity with local media that do not convey reality. We need your help to spread this scandal!  Luego de 100 kilómetros recorridos a pie por los vecinos en histórica marcha de 10 kilómetros de largo en defensa del agua contra le megaminería contaminante el gobernador de Mendoza, Argentina desoye el reclamo popular y aprueba la modificación a la ley 7722 , liberando asi el uso del cianuro entre otros contaminantes en complicidad con los medios de prensa locales que no trasmiten la realidad. Necesitamos tu ayuda para difundir este escandalo!", "its_zhihong0202": "MrBeast giving 10000 present to people in need", "a.xant": "Can u pls go and do some actual work for the climate than just talk and hold up signs and keep protests. Times person of the year it seems. 😂", "carly.reina25": "After 100 kilometers traveled on foot by the neighbors in a historic 10-kilometer long march in defense of the water against the polluting mega-mining, the governor of Mendoza, Argentina ignores the popular claim and approves the modification to law 7722, thus liberating the use of cyanide among other pollutants in complicity with local media that do not convey reality. We need your help to spread this scandal! Luego de 100 kilómetros recorridos a pie por los vecinos en histórica marcha de 10 kilómetros de largo en defensa del agua contra le megaminería contaminante el gobernador de Mendoza, Argentina desoye el reclamo popular y aprueba la modificación a la ley 7722 , liberando asi el uso del cianuro entre otros contaminantes en complicidad con los medios de prensa locales que no trasmiten la realidad. Necesitamos tu ayuda para difundir este escandalo!", "emersonluiz37": "While you don't go to school and make on school strike for 70 weeks, there are many children from very poor countries who don't even have a chair to sit on, you don't have reasons to complain. Do you really think that's a good example? How dare you?", "correacamilo": "Look at this girl @tank4rd she is taken 6 bath a day", "jackyriv4": "Hi Greta! We need your help! In my country Argentina, Mendoza the government approved a modification in the water protection law. They allowed miners to use chemicals such as cyanide and sulfuric acid. People are against the government but they don't want to hear our claim. The town walked 90 kilometers to reach the governor and say no to this law. We need you to help us, the media does not transmit this fight. Regards.🙏💪", "omrigoldenthal": "Instead of avoiding school, why don't you go educate yourself and try to resolve it? It might get way less likes and media exposure but it's actually helping you know..", "pedrovazquez325": "Ponte a estudiar es lo mejor que une puedes hacer para ayudar al planeta", "buy3dprints": "Go to school and learn why what you say is insane", "dss_579": "Your homework is pending just go and complete it", "yonii74": "Hi dear gretathu. I don't know if you will read this but I must try. I am from Mendoza Argentina, the land that gives life to the best wines in the world. We are known and visited by many famous and great people of the world for the beauty of our land and the attractions of the inhabitants, at least they have told us. I write to you with all the humility I have and with the hope that you will listen to me and understand the great sadness I have been with my family today. My family is the whole town of Mendoza. and on December 22 we started a peaceful march, walking more than 100 kilometers until we reached the government house. We started on december 22 and arrived on the 23rd at 7am to the city. We marched because the Mendoza government approved the reform of the only law that protects Mendoza's pure water, giving the mining multinationals permission to use cyanide, sulfuric acid, among other things to perform the extraction of metals. Law 7722 was prepared to protect water, not to be against mining. We only wish that the mining that is carried out does not use the little water we have since it is used for consumption and agricultural production. Many people from my town marched to the capital through the desert and several more small towns. We are so many interested in protecting the water that eighty thousand people gathered who only carried water and a flag of Argentina. nobody represented a particular ideology, nobody was interested in anything other than the protection of 7722. law that was applauded in many other countries and admired. When we arrived at the government house, our governor Rodolfo Suárez did not attend us, he did not try to talk and nobody in his cabinet did. Families with newborn children, young children and grandparents with their entire families were part of a cruel repression that the government itself devised by placing infiltrators who attacked the police and they responded with tear gas and rubber bullets everywhere and sparing no people there they were. but we ... were many more! and we couldn't do anything to stop them because there were families and it was a peaceful march. in fact it is the biggest march in Mendoza something ne", "xen_master35": "Morons", "andreasolnerea": "@gretathunberg Hi good day. Excuse me, can you help us spread this message that protects Mendoza (Argentina) water from toxic substances against mining? No to the reform of law 7722. Governor Suárez, wants to modify law 7722 and poison our Water. Help please, we are a province in the middle of a desert ...🙏💦🇦🇷💦🙏", "frimannmusic": "So many of the comments here really disgust me. Some of you really need to do some soul-searching instead of attacking a teenager for trying to make OUR world a better place. Thank you for everything that you do, Greta ❤️ Your voice is inspiring and necessary!", "maxton_lackowski9": "If the fucking climate is warming why the fuck did winter come early in my town", "wesleybroothaerts": "Goeie boobjoke", "keviindav_": "Yo mientras no valla al insti me da igual la huelga ehh", "xjordyk06x": "Georgie?? 🤡🤡😂😂", "ian._.__": "go back to school", "abigailpalmerr": "Go back to school", "amandajennifer1964": "https://www.youtube.com/watch?v=r8SyoRwV_To", "_privat_joleen": "🤮", "rekkyt": "I got you a private plane into the middle of the ocean you puppet.", "kneeboardsurferpom": "Stop flying around the climates in crisis", "harryhuschner": "Tack för ditt engagemang..", "_infinitesadboy_": "fuck you", "_mitchtownsnd": "Oi bitch guess what. That wood ur holding came off a tree", "akkavajhula": "Meanwhile, 36yrs old self is questioning itself why it didn't get this idea to skip school. 😂. I used to cry for fake stomach ache and headache whenever I wanted to skip school. I used to get one or two days off once a quarter. This climate change protest seems like a much better idea these days. Can I skip work and protest? 🤔🤔", "ole.evt": "Wo is der scheiß dislikebutton????", "anarcodemocraticosocialista": "Sifudê", "simonk15699": "the reason why the pension system fails", "jfleischli13": "Shut up", "the_orwan": "Good job changing nothing and impacting your education", "brodie_blore": "Go to school or u will carry on having the iq of a 6 year old", "jannes.ehl": "🤮🤮🤮🤮", "ayyub_okunola": "People are starving in Africa and you live in a first world country in which you basically have all your necessities taken care of.#spoiltbrat", "7.62x39jojo": "Fukk u ugly ass hoe", "bilal_ak._": "Du Arschloch", "marinaa.abad": "@beaacanor el cartel contamina", "samwideman": "go away you critter", "juheli240": "Meanwhile mr beast plants 20million trees", "_jacobjoseph_": "go back to school", "rand.marino": "😂 “Schools strike” ...“privileged white kid on permanent vacation” potato potato", "li._.monero._.ai": "Hello Greta we need your help, the government wants to install mining in Mendoza, Argentina, the province is resisting, but the government started a repression, we don't want our water poisoned with cyanide and other pollutants! We need your help!", "mcele_perez": "Dear... We need your support! The government of Mendoza, in Argentina, have just approved a law that will allow to use cianure and other contaminants in mine megaprojects. We are trying to raise awareness about the risk linked to the use of these chemicals for our rivers, mountains, biodiversity and communities. Mendoza has the highest peak in the region: Aconcagua, and we want to preserve it and our habitat. Please help us!!!", "dima270287": "Пиздуй работать на завод, ученная!😂😂😂", "johndeere.tractors": "Go back to school", "jack.nic12": "why you look like you bouta get killed by a clown in the sewer?", "mayratiponaa": "Hello greta we need your help the goverment wants to install mining in Mendoza Argentina. The province is resisting but the goverment started a repression WE DO NOT WANT OUR WATER POISONED with cyanide and other pollutants, we need your help.", "jomairoh": "🙏🏽Goed zo Greta. You go girl!", "xanda_foolheea": "Shoosh no one cares about global warming", "farimaa.lxe": "Lass dir bitte helfen @mrs._xelena HAAHAHAHA", "badb0yz_of_vegas": "Show your tits", "_silasklink": "no", "kh_leo_coc": "VERSCHWINDE", "kedibabywear_global": "You are doing sth amazing, hold on, Many people think your way but stay silent being afraid to be ignored. You are an example that one voice can be heard by the whole world 🌎", "bellahernandez656": "She doesn't like to go to school...and now she is insisting others to not to go to school...IRONY 😜🤣🤣😂😂Kids must complete their education first...Running away from school education in the name of climate..", "jakafortuna": "Rec da se zajebavas pa j uredu", "hel7er.skel7er": "ты в стокгольме живёшь, родная, хули тебе не нравится? в монголии дети дома из говна верблюжьего строят и мясо сырое едят пока ты там хуйнёй своей занимаешься. кстати, с каких пор не хождение в школу меняет климат?)", "luca.brgg": "Mach weiter so🔝🔝🔝", "megansnyder778": "Go to school!!!! You don't need to be ugly AND stupid", "marianalejm": "Carajita gafa", "bernardoblancocine": "#elaguademendozanosenegocia", "jesperljungstein": "Pajas", "ramr000m": "Go ahead Greta.. I will support your climate change movement by trying to learn more about climate change & spread awareness in my community. However, just to assure you most of the Arabs are aware of climate change & we believe that this is a fact. Some rivers & lake already disappeared from our lands. It is our job as humans to take care of our planet earth & make sure that we make the future better for children. Good luck & please do not overwhelm yourself. Everything will be alright 🎡👌🏼👌🏼 Enjooooy your childhood & have mercy for all ppl", "26_painers": "wuejjddj jelakwlle isjamnr jdnameior jdkakala kskamwm", "over999999999999": "gays die downs die western sodomites die", "uncpro": "NICE PETROLEUM BASED JACKET! HOW DARE YOU!", "amundbentzen": "Slime tanken over 4😮", "skankhunt_4232": "You know what maybe there much of animls ore plants that die but much of braincells are dying too 😂😂😂😂🙃", "manuel_samer_perez": "🕊⭐🕊⭐🕊⭐🐧👍👍🌎🌎🌏🌍❤", "anoniem.utjeee03000": "Tenenschimmel", "fausto39": "Studiare no?", "a.nashammar": "Bra Greta Thunberg 🙌❤️", "carlos_privat4": "Bist hässlich", "vikkiplotnikoof": "Дебилка!!!", "fattzoe.exe": "Go inside and study to give some real facts", "upxmxnyu": "Wait did you just waste paper", "setal_art": "Мразь ебанутая!!! Что ты сделала для планеты, кроме как языком своим помойным на всех трибунах почесала??? Дичь тупая! Человек делами а не словами определяется! Люди которые хотят улучшить жизнь планеты делают это молча, а не несут хуйню! Boyan Slat тебе в пример, человек сделал ловушку для мусора, которая реально борется с загрязнением окружающей среды, а ты только загрязняешь информационное поле своим пиздежом! Тебя не зря вселенная болезнью наградила, ты пустышка!", "fishyfo756": "Go back to school and learn something", "h.e.w.w663": "Such a disgrace", "k3fer_nr1": "Are you go to school??", "dan_gaff_": "So what happens after this do you just go back to school?", "ellencarlss0n": "🤤😻😘", "ethanphysick": "Twat", "timi_grt_827": "Ich hoffe du verreckst an Plastik du kak nutte", "andrs_1": "🤡, for deleting the comments", "j0elewiss": "why are you bunking you moron, youre gonna fail your gcses, what will your parents say", "rmay1988": "Please like my last photo on my page 😊 merry Christmas from Ireland 😊😊😊💟💞", "jeremy._.gggggg": "Whats the point of talking shit about climate change when ur not actully helping.", "fritzkellermannn": "Cunt", "georgemills15": "Cunt", "consumoconcabeza": "🙌🙌🙌🙌👉🏻❤️", "szygallery": "Keep up the good work.", "carlostorrell": "Eres bastante estupida y tienes una enfermedad mental provocada por tus padres! No tienes ni idea de lo que hablas, deja a los científicos que hagan su trabajo y tu el tuyo que es ir al colegio, eres una manipulada y tienes necesidad de protagonismo, tu actitud realmente penosa😡", "edo.monzali": "Vaffanculo", "vegardleraand": "Ugly", "dinogusic_official": "@sanelsadikovic tankade precis diesel för över 700kr, det är ju inte så miljövänligt", "sergeytrepshyn": "Fuck...", "lucascrta": "Who r u ?", "poppsie_princess_lady_olive": "❤️❤️❤️❤️", "dokedoyle": ". . . go back to school @gretathunberg", "sthlmnews": "💪🏼💪🏼💪🏼💪🏼", "nikii.sth": "Halt’s Maul", "alexchorltonwilson": "@gordon_sa wants to meet u", "_mc_marvin_": "U are shit", "abby_brescia": "Ok bro", "houstonianpetson": "It’s all a lie. HOUSTON smells like oil burning. If you cared get to Houston. But you are like. @dancrenshawtx and only want to be in tv you don’t really care or you would have come here whete the issue began", "x.s.s.2006": "Is that a anagram?", "spencer_hay06": "No", "maledetti.i.comunisti": "Fai caaaaaaa", "gti_meister": "😘", "uwuthauty": "Clown ass", "nicolai_jacobsen05": "'' i should be back in school'' hell yes you need to be back in school... You have no clue what tou are talking ab let the adults take care of it", "0.s.a.d.r.a.0": "Fuck off you lil bitch you aint shit you just talking and you didnt deserve to be the person of year", "y.a.s.i.n.0": "😑😑😑", "enrichaleix": "Pasa algo si meo en el mar?", "alex_cansec0": "Nunca cambies tu eres el futuro de la humanidad", "bbrookeschreiber": "hottie🤩🤩🤩💖💖💖", "gradstuwgc": "Must be nice to drop out of high school fuckin loser", "yumasteam420": "Retrasada", "zaikaigraika": "Купи зайку помоги миру!❤️", "mael.xxl": "MR BEAST FOR TIMES PERSON OF THE YEAR. THIS BITCH JUST BACHED OUR GENERATION WITH FAKE ACCENT BUT DID FUCKING NOTHING MR BEAST PLANTED 20.000.000 FUCKING TREES AND NO ONE TALK ABOUT IT", "mathiasdesutter_": "Hoer", "dylan_harris1881": "Win an election in a 1st world country", "whatevvvea": "Selfish prick", "ecils_obmij": "schools a fucking joke so is our government #stoptakingmynic", "luka.radovanoviccc": "Yea fuck no mrbeast deserves that Person of the year i mean did you plant 20 Millionen trees?? Fuck no", "devid_meaning": "Неадекватная! По ней видно что психически не здорова, за что ей вообще дают нобелевскую премию???", "factspitter123": "❌❌FUCK YOU GRETA WE LIKE TO BURN GASOLINE🚗🚗", "mani.mirzi": "Autism", "bene._17": "#diesel #dieselpower", "johnecomin": "1ST CLASS PASSENGERS IME NO TROLL JUST YOUR BLAGGING IT YOU'LL GET YOUR MONEY YOU'VE HAD YA FAME", "cintypindy": "“Go to school! #propaganda #woke” 😂, Keep on inspiring, motivating and educating people👍🏻", "fanlimit": "Where's my tesla, fucking kind", "prosto_misterivan": "Where's my tesla, fucking bitch cyka blyat", "eeeme16": "tu chaleco contamina", "36.rozzi": "Perrofla", "vika_geynets": "Ебанутая 🤦‍♀️", "89.wesbang": "U a disgrace", "skyemaxilian": "trump2020 🇺🇸🇺🇸🇺🇸", "vieze_melk": "Vieze aandachtskech", "_aka05_": "Fuck you", "g.reg__": "You’re a cunt", "jack_anderson.13": "Wow I wish I could miss 70 weeks of school by just complaining about warm weather!", "vomervan": "I hate you, Greta. Get da fck out of this planet.", "_bbenji": "didn’t deserve person of the year you complain and don’t act on your words", "levi_schouten": "I gues 1 chromosome too much isnt always good", "alexreed890": "🖕", "deadinside20778": "Пиздуй в школу", "pavel_dvzs": "Толку то от этих заявлений? Вместо того что бы пиарить шизонутую девку, лучше бы пиарили людей, которые реально изобретают вещи и способы сохранить природу нашей планеты.", "m.w10x": "Get to school kid", "hasanshashashaq": "i do hate you", "cciacomo": "@sickchinese buon natale", "200seuraajaailmankuvia": "How dare you!", "mo1ri3tz": "Go to school and lern", "fede_verdoliva": "Ma in Italia quando vieni a fare sti cazzo de scioperi?", "xbahir": "HoW dArE YoU?! With a fake accent.", "bulavinn_a": "Да как же она уже заебала", "anne.baumgartenwalter": "Super Greta 👍😘🎄✨", "i._uzzii": "hOw dArE y0u", "manuferrandez_": "Anda, haz el favor de ir a la escuela de una vez, lo necesitas hija mia, no todo es el clima en esta vida. Entiendo que seas una desustanciada, además si tus padres te dejan hacer esto...en fin no debe haber Servicios Sociales en tu país. Vuelve a la realidad, paranoica! @josegp11_", "igsmobile": "Y cuando estudias!!! Tanto cambio climático y más climático.... piensas vivir toda la vida protestando?", "slowara": "Maybe if you went to school you wouldn’t sound fucking stupid", "dk1_kk": "How dare you", "whoiscodyy": "Mr beast all the way. You’re useless", "monika.mancini": "Merry Christmas and Happy Holidays😊🎄🤗", "mickeydevs": "Let me know when you’re going to India and China 👍🏻 no first class trains this time though you lil monkey 🤷🏻‍♂️", "dansvw": "im gonna roll coal once i get my tdi just for u greta", "shashank.kollu_16": "stop bitching about the climate crisis and actually do something", "georgeous.gymgirl": "Love your attuitude", "fluidfiretea": "Liberals have children spreading their agenda now, when conservatives do it its child abuse lmao😂Girl won person of the year SO DID HITLER (TWICE!!!) AND JOSEPH STALIN. Selected for the sheep to worship as the liberal god (libs generally don’t believe in god and therefore more prone to need idolism)", "g._at_home": "Ich hoffe sehr, dass Du für immer verschwindest!!! Du bist eine Populisten - genauso schlimm wie etliche Diktaturen. Du hast nur eine große Fresse bietest aber keine Lösungen. Du bist eine reiche verzogene Scheissgöre. Du solltest Dich schämen!!!", "vbarda": "Тварь!", "blackchorizo": "Mr beast should have gotten person of the year", "adrian_mette": "Genau.... geh du mal weiter irgendwo protestieren während andere Menschen wirklich was für die Umwelt tun. Vielleicht solltest du dir mal ein Beispiel an MrBeast6000 nehmen und auch 20Millionen Bäume pflanzen bevor du dich irgendwo hinstellst und einfach nur heulst...", "hal3d": "@alexx_b5 drecksau blede🔥", "ice_ice_97": "@mrbeast deserves more than you", "marvik__": "Well you finally got something right Soros puppet... you CAN'T SPEAK FOR EVERYONE ELSE.", "b3n5kelt0n": "Mr beast should’ve got time person of the year", "stecenkonikita": "All year you go through school, you don't invent and invent fuckers, you yell and fuck you at all. Done! You are the man of the year!", "bust3r_br": "I’m sorry but what have you done besides talking ? Mr.Beast Planted 20M trees and how many have you planted ?", "y_y_chow": "Lmao nice excuse to not go to school, I might try that too someday", "cheggnogg_": "You are pretty fucking useless", "lmaoyouarearetard": "Destroy my pussy not my planet- Greta", "benbruner1": "You ever watch this retarded bitch? @alculpepper she should win best actress of the year", "albert.ba7": "Pleaca in mm de aici de proasta", "wesselvdbergh": "Een kanker mogool is zij", "t_e_n_d_i_e_s": "mr beast😪", "millerjory223": "You’re doing literally nothing for the planet right now. All you’re doing is standing outside like a fucking idiot. How about you make a fucking effort to do something like plant some trees instead of trying to find ways to skip school.", "noahmacclovin": "Greta thunberg a bitch", "willdavies3.3": "Stupid", "olivia_mccloud_spam": "🔥🔥Stop yelling at us for no reason tou have stuff to do with it to 🔥🔥", "aaa90_tm": "Feliz Navidad", "viklong59": "Да что вообще сделала для окружающей среды? Марионетка, иди учи уроки.....", "izzy_0426": "Greta your work is absolutely amazing and you are a great time model to so many. I hope this number continues to increase as our fight for recognition and support continues. Happy Christmas, hopefully in the middle of all this, you do manage to enjoy some down time with your family/friends ❤️", "lennox_cricket": "Do something instead of just bashing. While your on strike your not actually helping anything. What about the people who actually do shit. We gotta do something but just talking about it won’t do anything. We need to take Action", "pattrefaro": "You belong in school!! How dare you!!🤮💩 PS How is your mental illness working out for ya?", "akmalll.____": "Mr beast is better", "swedenborgken": "@GretaThunberg Hej Greta! Det kristna julmysteriets ekologiska budskap! Ny artikel från SvD!  https://t.co/NO8saGOZ5p", "ivangor72": "Ебнутая! Иди нахуй с этой планеты!", "the.g.o.d.f.a.t.h.e.r": "Scripted bitch🤣🤣", "_abbie.grace._": "Were here for a good time not a long time", "ad.riana007": "Ебать я насрал вчера в кусты, но потом понял, что это во благо климата. Хочу так же насрать на лицо Греты, чтобы 9 лямов подпизжиков превратились в частицы ума. 😍", "rs.v4l3ntin": "Back to school", "508_loop.detected": "Got pay from China now? you're a real bitch. All Taiwanese and Hongkonger will never forgive you", "alexsukhenko_": "HOW DARE YOU!!😡😡😡😂", "high.key_sav": "This makes no sense to disrupt and promote an interruption within the education process isn’t right. The topic is concerning and need to be talked about as well but education is important too. Allowing this to be a thing only instills values of taking the importance of something else and measuring it up to the importance of something else when both are important", "buz1k_": "Иди в школу", "gunawankss": "How dare you!!", "aidanleva": "spent all her money on public awareness events and can’t afford a plane ticket back to 10th grade", "aantttonioo": "Sup retard", "nawni15": "Nice petroleum jacket you planet killer.", "_.ryo_.dem": "i dare you", "imlitxd": "Shut the fuck up you didn't do shit for the environment except give speeches and protests, Mr beast actually took initiative and planted 20 million trees", "jake_zundel": "Smh.", "sxmyxk": "How dare you", "vicky._.mmmm": "Doing great 👍", "seanaveryftw": "talk to china and india not Alberta-we need that pipeline", "d.page22": "This shit is so sry. Everyone has to make it out that humans r out to do bad in everything y’all Fr look dumb af. Like gtfo of my feed with This shit", "conor.boughton": "Mr beast is 10000000x the activist your whiny ass will ever be", "tremblay_nathan": "I’m starting to feel like all this climate change talk is just an excuse to get outta school cuz your aspburgers is giving you difficulties", "dr_montague": "People who think climate change is real 🤡", "gengming.chen": "You are a bich", "ash_campbell__": "............ you know sitting around holding a sign and talking about it isn’t gonna do shit. Go plant a tree or pick up rubbish in a park or something that might actually make a difference. Don’t just sit there and destroy the country more and more when all you’re doing is reading off a fucking script. (#stopantifa)", "dcashion69": "Who gives a shit", "vinniciusdiass": "Keep up the good work 👏🏾 most of us are rotting and being inspire by u", "_lammy._": "Is it just me or does this lady just sit around and yell at people. Like fuck she doesn’t even do anything", "_shuni_chen": "Power to human soul", "el_christian49": "I don’t get how people respect her when all she did was talk and mrbeast planted 20 million trees😑", "4ktrey_tata": "Yfudhhfufufufufhururhrhrhrgghrhrhhdhrhrhrhrhrhrhrhrhrhrururhhrhrhrhrhrhrhgerggegehehehrhrhhehe👏gdhdhgrge👏gegrgrgrghr👏dbbdhdhdhrhrhrfhhdhdhrt👏bdbdbdhhdhdhdhdhfhdh👏fbfbbdbhdhdydtettddd to d to txttxtdxfxfttctctcttctctc👏chhcgctc👏hfhdhdydydyyegdyydy👏hdhdhdggdgdgd👏dgvdgdgdgdgdgd👏gfgdgdhrhgd gf👏 dhdgeheuehrujhdheydydyydudydydydydydydydhydhdyeyhdgfdgdheyyeyegegryeyjehrhrhfhfyhdgdgdggrggdtcgrgttxgegfdtegetter they hrurhehyddhywhhdywhh hhehhcufhwhhh hhfyy I fhheygctteggcgycff gd ydudyhftddyyyry fur ryryryruyryryryryryyryryryryryryryrtterytyytreryrytrrrtrertrtrrrrtee", "0zzynk": "Ёбнушка😂", "er3wsr3wr": "WHATA BOUT MRBEAST HE BETTWR", "abhyudayaarsha": "😂😂💩💩💩", "garlic.cookies": "I bet I can accept your follow request in 10 seconds. No scams 🚫", "jovi_laaman1": "Do you have an extra chromosome", "sofia_ilardi": "Go fuck yourself", "tl_xxiii": "or u could go to school lmao", "adammbeber": "Me Beast is better than you", "zheneview.life": "Ребёнок!Иди в школу!Получай знания!Лишь бы в школу не ходить!Бред какой то .Всё можно совмещать!!!", "vihar_sv_naik": "This girl really don't want to go to school... And also she is encouraging others not to go to school 😂😂😂😂 that's all.. @mrbeast planted 20 million trees in just 3 month... What did she do... She is just uploading photo with that poster... And.... Passing her time...", "cxlebsedits": "so you’re skipping school? bitch wtf😂😂", "eddyhaqani_": "Mr.beast has done more shit then you how come he ain’t the person of the year 🤦🏻‍♂️", "hozich": "You'd better go to school and learn, how your clothes are made,you stupid small cunt", "milladshokraee_": "Lisbon", "alexandrianfall": "Hey guys! I make art with recycled canvases and try to use my art to inspire people to people to take care of the planet and all of its inhabitants! Please leave some likes and comments, and follow me if you want to help support my mission! 💖🌱🌍", "__shams__01": "To the list of top scientists, for just screams from trebuns. and people who do something real remain in the shadows. it is not right", "rawk360": "Stupid puppet needs a script for everything. #fakenews", "squash_simon": "Her parents are truly bad people. Do you tell your kids \"you're gonna die in 10 years\" truly bad parents especially for someone like her eiht aspergers just horrible", "sergio__ostos": "Ur retarded", "gera.guy": "What if I revved an aventador in front of your house and spit some flames?", "samuelicoxd": "Cállate anda", "zyxen2k20": "MR BEASTTTT IS BETTTERRRRRRR", "_nend.sudes": "Слыш шлюха нахуй, климатическая хуйня, не выебывайся сосать блятб", "nabil.najmi_._": "Why you guys hate this child ?", "lucasmercedes_official": "🎅🎅🎅🎅🎅", "marcioo7": "@jairmessiasbolsonaro Bolsonaro is the best", "bake747": "You da wo(man)", "royalfucillo": "Fuck you", "sando_2411": "Fuk u", "carsondbreedon": "You have ass burgers lol", "yiannimamais": "Trump 2020 LOL", "andre_the_brownie": "When did we ask🗿", "emmettschrader": "Ruined Mr beast’s career 🤡", "smellyminaj": "Yes, because taking a picture with a sign is going to help the climate.", "fardeen900": "mr beast planted 20 Million trees and you Bashing the generation how dare you", "adamthomas338": "@mrbeast is better", "jameswerbiski": "Their is no religion higher than truth.👌👌👌", "robs1706": "Go back to school🙏", "863.edwin": "Can yo bitch ass sit tf down nobody cares 🤦🏽‍♂️🤦🏽‍♂️", "endroholic": "Bitch listen up! I too wonna bunk Schools.....Gimme some tips and tricks", "_the.meme.make_": "Go to school u uneducated wannabe scientist activist", "gofundmeforgirlfriend": "I would really appreciate if you awesome people could help raise money for my girlfriend’s education and dreams, link for go fund me in bio", "aidangravelle": "and where are your parents in this?", "mats_otello": "You should start doing less complaining and start doing a little more action like Mr Beast, fancy speeches won't save the planet. And do you really own a goddamn private jet, may the lord have mercy on you", "moonanimalswall": "Ебанутая пизда", "hedemalmcarl": "So you complained about the heat and youre freezing at 0 Degrees C whilst i can wear the same layers at -20 C snd enjoy myself. So heat or freeze, pick one", "jironyan_17": "made in china 🇨🇳", "domwll": "mr beast is better than you , you have done fuck all to help the planet", "55128abb1125": "You are ass hole", "kayser.2002": "Me beast is better how much money have you given to your people a fat 0 dollars. Also what in gods green earth have you done for the planet besides bitch and moan about people that aren’t even from your country let’s get the damn facts straight the earth goes through climate phases aka dinosaur extinction hot as heck. Ice age colder than a witch’s titty. Now we are increasing in temp it’s normal", "kirsanov2209": "You fat fucking dog", "harshverma736": "How dare you just to talk about it any doing nothing", "b.nandan_": "Go back to school", "josemanuelrosa80_": "que piensas conseguir con tu huelga de los cojones? que se limpie el océano por arte de magia? ten como referente a @boyanslat si quieres cambiar algo hija de mi vida.", "beaddauber": "How many trees did you kill for that sign😡😡😡😡😡😡😡😡😡😡😡😡😡😡", "averyconspiciousdoggo": "literally no one gives a fuck lol we chillin we all gonna die someday. go to school and make a life this aint it", "oygago": "you a lame", "jp.torrico": "U look like my math teacher", "nixson_619": "Who cares you are crazy", "sharkboi0916": "Here we have a girl who just bashed our generation with a fake accent, and on the other hand, we have someone who took initiative and planted 20 million trees in 3 months. Now tell me who deserves to be on the news everywhere.", "landon_dyerrr": "Corrupt", "eric_welter_": "#fuckgretathunberg", "pableras.93": "Eres una progre", "ameraathena": "💙🌍", "miarodrigues56": "acho q se fosse uma velha q tivesse a frente 🧐", "carolapq": "You are always there for us dear Greta! Thanks!!!", "cmt_swims": "Go to school", "typical__e": "💪🏽", "horror_zip": "👍", "finleycream_boots": "FUCK YOU 🤡", "8_ball_wil": "Greta, do you think we could simulate a volcanic eruption to mitigate the warming effect?", "drsmashlove": "Where you been mama? You ok? ☹️", "panther_alonso1733": "Greta, you are great! Regrats from Chile #fridaysforfuture", "overlyunderrated": "How dare you!", "bigg_bubba_": "Atfu bitch nobody likes u", "matheus.bsb": "Suga o pai", "_carlescomp_": "🤢🤮🤢🤮🤢🤮", "757pimpdaddy": "Idiot", "doubletz_splasher": "Its mad how @mrbeast has done more then you in 3 months", "th3_p3anut2109": "This was the person of the year she did jack shit other than bitch and moan about our generation and you know someone who did do something @mrbeast this girl did nothing", "harry_james_schmidt": "That moment when you say people don’t do things to decrease global warming when they say they will and you don’t yourself. 🤔🤯", "m1rpedroph": "Stop it", "preston_lininger": "Mr beast will always be better than you", "conwayryan": "Snowflakes are such a weak breed of human", "howdy_its_grantly": "Shut up", "r6darkx": "😭😭", "agneshj0rtfjall": "Lovar att hon bara strejkar för att slippa skolan! Om inte, hade ja hjärna hjälpt henne strejka för ja hade iallafall velat slippa skolan på fredagar!", "mr_m1ata": "Plastic-shelled raincoat, huh? y'all know what those are made of...", "stevenfalle787": "Do you go to school", "moaningdog": "That coat is probably made by 8 y/o in india", "just_john18": "Imagine thinking you actually earned the person of the year 🤡"}