{"__livixgneist__": "@_suueri_ isch dä rächts nid dä, wo für ds sp-präsidium kandidiert?", "helio_euzebio_de_paula": "😡 a uma bomba aí", "lolit542": "👎👎👎", "xx.blueridgeboykillex": "That Just proofs that ur dumm u should go to school", "seanyboy621": "And explain to me how @gretathunberg is traveling to all these events and protests?", "protmanprotman": "Thank you so much to initiate the first real change !", "pollybertoldo": "@kessinhab @pkelvin__", "levi.reid.796": "Scroo climate change", "riley_davis21": "Go to school you are stupid there are many scientists the went to school and got a education and are currently doing something productive for out climate nobody wants to listen to a high school drop out that is uneducated about what they are protesting so once again go to school @gretathunberg TRUMP 2020", "joansoledi": "Xixarelus", "evie.stiling": "What's skolstrejk", "adkins.bryce": "Good luck getting a job.", "ma01007": "بنی آدم...", "_dulciewebsterjones": "why is everyone's concern that she doesn't go to school. that doesn't matter she doesn't need school to make a difference. and if you comment shit to try and stop her getting noticed your too late.", "england147": "@cicheto.james one petty little COMMENT after another. Apparently, some people never get past infantile stage.", "jones.life77": "Go back to school and learn something.", "patches53": "Look at me getting my 15 minutes of fame.", "naud_ve_14": "Only doing it for the dumb money", "ali6.blx": "You are a big bit ugly", "nmarinne": "Linda sou tua fã número 1 no Brazil", "hacer_klein": "👌👏👏", "lukaarukavina": "Srbin", "tijsbuijs": "Kanker autist", "tiagoruff86": "Hance Tiago Soares Spokesman of the Gambian Embassy in Angola. Help our Campaign in Angola. We are all immigrants. Phone and Whatsp 244930089073.", "lukeburgess.music_": "Dictatorship 😂😂 Jk", "malle.76": "Looks like 8", "random._.memes._.lol": "Tbh I respect this but you still need to go to school, I do", "aandreev__": "Maika ti sheiba I kurvata", "tha.b.moraes": "Chucky's sister....😫", "lxnny.deathghost": "Ya'll gay", "delmiracamaral": "Estudar que é bom,nada😬", "johauer": "Nobody caaaares, suck my ass", "floridaoutdoorgirl": "Absolutely ridiculous", "carlosjohnson2": "Bravo Greta ! !", "ancordovih": "you study the economy first, and then talk about rejecting fossil fuels. you are a fool. your followers tode stupid downs🖕", "keita_yamada_kun": "If a black hole engine is realized, global warming will be solved. However, human beings cannot implement a black hole engine to combat global warming. However, for the project of human migration to Universe, a black hole engine can be implemented. I thought so.  Global warming will be solved if mankind obtains a powerful energy source with almost zero cost. If the project of human migration to the universe is seriously set, the innovation will be realized. For example, black hole engines are set by technologists as a real challenge.  So, if a black hole engine is realized, wouldn't the production cost in the industry be zero? I think that the production cost in the industry will be the energy cost excluding the labor cost. . Raw material costs will be zero. With almost no cost, rare metals can be recycled indefinitely. The price of the product is set to labor costs. The professional ethics of ascetic Protestantism interpret that engaging in professional work is God's command on humans. Companies are obliged to hire and engage in labor and pay wages. However, there is no need to pursue profits. Anime Thunderbird's International Rescue is professional work? International Rescue does not pursue profit.  Isn't this a second industrial revolution? Humanity will be freed from the constraints of profit hunting and will be able to engage in various projects as professional labor  Thank you", "jorge_luis0799": "No falten a clase.. no tiene ningún resultado sino dejar da aprender.. Mejor y a limpiar zonas contaminadas que con la motivación que tiene los harían sin problema 1000 personas a 2 piezas de basura, son casi 1 tonelada o más de basura recogida @gretathunberg", "siksa_kubur123": "No homo in school", "ace_the_gangster_6868": "🙌🙌😢👏😍", "fletch_44_97": "Awesome work greta 🌎", "oscar.sevon": "gå ti skolan flicka", "x.emilio17.x": "@anna.ern is des af 100% Chlor freiem Papier gschrimm woan oda mid Edding der an Bambus Deckel hod? 🧐 Ich glaube nicht", "argunhan81": "Every one looking in the Same Kamera greta Right Go the Moon", "clumsy_lumsy": "I love what she is doing but go to school wtf????", "chaima.belarbi": "Kben heel trots op je @gerakadieva", "sorayaadanberradre": "creo que llegaste a españa en barco y tenias recipientes de plastico,eso no contamina? vaya negocio has hecho maja", "gasstogr52vy": "CRIIIPPPP ♿♿♿♿♿♿🤣🤣🤣💯💯💯💯 HGC 👉👈", "trubois.botman3b.x9_s5_6j1l": "Useless girl🤡", "jitel_darwi4": "Hej Greta du är den anda personen som bryr sig så mycket om klimatet och det är jätte jätte bra", "_cyyruss": "screw u mr beast deserved better u loser 🙄🤡🤬👉🏼👎🏼🖕🏽", "johnie_johnson69": "You or not changing a damn thing with this", "rasulkhsntdnv": "Dolbaebka", "mr_pineapple1": "#iSaidCommunism #100percent @thedemocrats", "eugenia_just": "✊", "itsfuckingfedee": "Link in bio donate here!!! gf.me/u/xggd6v", "lev.i.nstagram": "@_____________justinbloem______", "reshetova588": "Gretta, save paper!", "marcogio873": "but what is missing man and women today than freedom? I live in Pisa, Italy, and I am always selfless, friendly, loving, good, generous, open and available to everyone, the door of my home is always open and I always offer everyone welcome, hospitality always good food, good wine, warmth and laughter.", "i_am_the_bestx999": "Speak English or die", "_carolcamila": "Please continue like that 💪", "danielltrajano": "@gabrielcoelho_7 tbm sou a favor das skol’s", "prihodkoevgeniy": "И никто не винтит людей как в Москве! 🙌", "fridaysforfutureloerrach": "Love you🔥", "moxamdh_nuur": "🖕🖕🖕🖕🖕🖕🖕🗡️🗡️🗡️🗡️🗡️🔪🔪🔪🔪🔪🔪🔪🔫🔫🔫🔫🔫🔫", "tonydetroit": "No such thing as global warming.", "tongtong_z3": "how dare you 😮", "creme__dog": "go to school retard", "joannemini1020": "🤡🤡🤡🤡", "ethanlivingston784": "😂", "coleh_376": "Or you could not be a little ingrate and go to the school that you so kindly we’re given unlike those in Africa who are actually experiencing a harsh climate", "mkh.yrslv": "Autism", "lu.z34": "All the power from patagonia", "padwardo9": "This photo is so you, Greta", "ibazhak": "Gollum Thunberg", "lobsterman17": "Poor thing.", "brave_new_word": "Thank you! Everything seems to depend on our youths all over the world!", "lukevd11": "Prove climate change is real😂 it isnt", "luca.k.l0": "🤡", "riffraffryry": "#gogreta", "breivikfanclub": "jävla afrikan", "aigner33": "You have downsyndrom?", "zilmamede": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "postolovskifilip": "Not going to school wont save the planet but making it worse lol", "alexreed890": "Lies", "musanjafalikhan": "The Amazing work 💪💪 Great..God bless you", "zaidii110": "ll31cjx””!", "cheeshee12": "She's a fraud 👏", "dimitrin_fcz1312": "fucking authism lokinass", "jennyx2610": "😂😂😂", "huntinggod95": "High school dropout telling people how to live their life. Go to india, or China. They polute the earth more than any other countries. Ypure a joke", "sofkasorovic": "Вот прогульщики собрались! Лишь бы в школу не ходить", "deus_galaxia_deorum": "Greta now watched the news of Russia no destabilization where I live! You don't want the whole Euro zone in chaos! trust me with the click of two fingers. You're for prosperity", "nils_gilomen": "Gang go wärche du verdamti huere soumoorä. Gang it schuel du dräcks lumpepack. Setigs bruchts uf derä wäut nid du i gschlagnigs scheiss gsicht vore schwedin u steckdose befruchtets eichörndli u arsch gfiggti bannane. Guet merci dasi ha dörfe wuet abloo a hoffentlech versufsch mau ufem meer. Lg @michi_2oo5", "elisaovallemeyer": "You are the true leader of hope", "stoicmicky": "If you want to find the next Epstein just look at Gretas dad 😂😂", "captainnicholson": "White privilege goes refuses to go to school until the world literally changes to her liking I get it’s an issue but damn any excuse to not go to school", "kozyrev9398": "Какие забастовки)))", "rmuser234": "Greta save paper , please )))).", "martin_krantz74": "🤣🤣🤣", "erik_vision": "Lol", "jfranklin_carvalho": "Skolumreal", "lilyellabuss": "Well done Greta you are so inspirational and a role model to everyone. You are literally saving the planet! Well Done!! Keep fighting!", "mountainous.max": "💪", "theabbas72": "Wow great", "fzvzbzbubuctvhbvu": "Jag tycker att vridmomentet är bättre än Friday for Future", "aude126": "❤️❤️❤️", "chpo_k_": "забила на школу = помогла чем-то планете? лол, нет просто будешь еще глупее, а в глобальном смысле нихуя не поменяется", "rmp.bredl": "Golum", "dominika_biharyova": "strike for what? why you follow her? how the strike can help? guys, if you want help this planet go out and do something. Change is only up to ourselves. There are many people in this photo and how many people from this photo actually do something? plant trees? use the less plastic things? picking up the trash from the beaches? Not using cars. I don't think so.", "juamt9": "🇨🇭👏🏽", "mojitich": "✌you can👊🔥", "tommy.nilsson.313": "😂💩💩💩💩💩💩", "zdv21.8.3": "China", "artnekto": "Insane crackhead🤦‍♂️", "hojjatvali6": "شما بایددنیا را نجات دهید نسل ما دنیا را به تباهی کشانده است پس تلاش کنید موفق خواهید شد آینده از آن شماست.", "alek_iakomi": "Can we just ignore her 😂 “how dare u affect my future and education”", "daniellisboa17": "Vai estudar pirralha", "pavelkuznetsov13": "Распиздяи, которые не хотят учиться 🔥😜🇷🇺", "lylajune": "@gretathunberg 🌎 I’m fasting for 7 days for the next 7 generations. Join me in prayer #FastForTheFuture", "al_exgre": "Fuck you Greta", "benedikt.lewalter": "Climate change is a lie", "billieismystrangeaddicion": "Du instpererar mig❤️😭😭 Du är min idol❤️❤️❤️❤️", "emersontayler": "Oi que linda história", "freddrickyork": "No one cares if you skipping school but it is a good idea for others to make an excuse to dip👌 mad one", "navruzov94": "Инопланетная хуйня", "ivan_koptelov": "Шлюха экологичная", "daniel655o": "Värför?", "w88zzzl": "Go to scorro en buy a 2stroke", "doktorspaetzle": "Children all over the world, keep on fighting for our planet earth #fridaysforfuture #ourhouseisonfire #wearestronger #wearemore #youareoutnumberedMrPresident", "a6syrdfox": "go back to school !)))", "davykaiser": "Похоже на обложку рок группы 80", "l.flxrian.l": "Ich verbrenne gerne Öl in meinem Garten", "steafan1957": "You are a fucking piece of shit", "max.chipizubov.04": "Whore", "annasmemories": "❤🌎🙏🏻", "mikefla_tenn": "Global warming is junk science", "roger4668": "first give all thanks to the gods, 2nd most high and Nina already lost everything including their planets, i ain't happy for it, but it is what it is, 3rd Nina repented hopefully she told yall if not she'd be rolling wit the devil, NOW MOST HIGH DIDNT REPENT SO SHE'S ROLLING WIT THE DEVIL AND TRYNA KILL THE WORLD, I'LL BE HERE SO WILL YOU IF YOU REPENT IF NOT YOU WONT I HOPE IS MANY OF YALL REPENT IS POSSIBLE IF NOT ALL OF YALL, ESPECIALLY YOU LADIES I LOOKING FORWARD TO LOCKING MYSELF AND MY BIG BUZZINS, BHARRIS, BI, NOLTE AND NITTY PLUS THE DAWG POUND THEIR CHIMING IN HERE INTO A CLUB OR BAR STYLE PLACE WIT IS MANY OF YALL THAT CAN HANDLE IT FOR A FEW HOURS DRINKS AND WEED (I DONT SMOKE) ON ME, PLUS SOME FOOD, WHOSE WIT ME,,, SHEESH YALL CANT LEAVE ME OUT OF THE PARTY,,,,,, BUT ONA SERIOUS NOTE MOST HIGH IS LOOKING TO KILL THE WORLD A REAL GOD WOULD BE TELLING YALL TO DO WHAT?????? REPENT AND SAVE YOUR SOULS, NOT WATCH THE WORLD DIE, CHECK AUSTRALIA, NOW ALL YOU GOTTA DO IS ASK MOST HIGH/DELLE DA DON WHEN U SEE HER AND SHE'LL HAVE TO TELL THE TRUTH OR ASK ANY OF HER CHARACTERS INCLUDING THE MEN AND KNOW I WOULDNT BE ALLOWED TO SAY THIS SHIT IF IT WOULDNT TRUE ME TALK ABOUT MOST HIGH SIDING WIT THE DEVIL AND ROLLING IS A CREW TO KILL PEOPLE/THE WORLD OR DISRESPECT NINA WHAT UP LOVE??? GLAD U REPENTED....... ALL PRAISES GOES TO THE GODS,,,,,,,,, NOW U CAN REPENT AND LIVE FOR EVER OR DIE OF BEING STUPID..... YOUR CHOICE......", "max__pyne": "@ruby_iles", "jana.24.10.83": "Young and 🤮🤦‍♀️stupid Girl😡😡😡😡admit to psychiatry.....OMG...", "olivier.3s": "Queréis dejar de hacer putas fotos malgastar dinero en tonterías y invertir dinero en otras cosas más productivas , solo vendéis humo !", "xalo_nahui": "🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈", "recycleyourmind_": "👏🙌❤️", "mchamorro_8": "😂", "kasspnord": "🤡", "alex_tabox": "🙄🙄🙄🙄 here we go again 🤦🏻‍♂️🤦🏻‍♂️", "azzam4967": "I robot 🤖 😭😭😭😭😂😂😂", "mr.musical_beast1": "Is that sign made of paper", "elcalientepapi": "Now it all makes sense why youre so dumb. You stopped going to school 😂", "prettylegit.v3": "I hate how people in here are like “you keep up the change” or “your the hero we need but don’t deserve”. Has she actually done anything to help the earth? Yeh she brought awareness but actually doing something about it and making people aware of it are two very different things. I don’t see her planting trees or new plants. She just goes on strike at some place and closes down a school. Just sayin I think you need to recheck who ur promoting", "corona_is_meme": "Hallöschen Popöchen, Wir posten täglich neue Almangeschichten von Anita und Sigfried ;) Wenn du an dem Leben unseres Almanpaares teilhaben möchtest, dann schau doch mal vorbei 😁 In dem Sinne Ciao Kakao", "legb1958": "Plesse traduccion in Spanish ¡¡¡ Blessing Greta¡¡¡¡", "politicamidiaal": "Vão trabalhar", "meduzza369": "Feos", "shmuelstock": "This is such incredible horseshit, most these kids don't know what climate change is, (neither does Greta btw, her dad and some tech support guy write her speeches and upload to her Facebook) and if they did, they would know that protesting is not going to magically halt the natural progression of climate. People like aoc and greta are so rialed up about climate change, meanwhile, they're constantly driving cars that run on gas, taking planes, eating burgers, in short, they're a bunch of pathetic hypocritical bullshitters", "joskoo_781": "Die", "niks_klaus": "Kann jemand Gretel abholen. Sie nervt. Möge die Schule besuchen.", "alessandro_fibroga": "Great Greta 😍❤️❤️❤️❤️", "daniel.wolle": "i love coal", "jacmagdi": "School strike week 74 = 74 weeks wasted.", "delilahdalene": "Zombies", "pyro_md94": "😂😂😂😂 I love Fireworks 🔥🔥🔥🔥", "camer0n_lad_123": "You used trees to make that sign BAD FIR THE ENVIRONMENT", "shailenpatel_": "Go back to school", "x.swaggerlord.x": "Go to school", "juniorsandler": "I don’t know if my message ever went through I’m so impressed what you’re doing I did a painting and I titled it after you you can take a peek or have someone else it’s on Junior Sandler Instagram keep doing what you’re doing🌴🌴🌴💕💕💕💕💕💕💕🌴🌴🌴🌴🌴💕💕💕💕💕💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙", "tinnwonder": "Are u looking at your boyfriend? Oh, I forgot. You look at me.😶😶😶😶💘", "r3m0___wicki": "#fridayforfuture i like you Greta", "cowboy5871": "👎👎👎👎👎👎👎👎", "7352eli": "#grethathunfisch laber nicht so viel sondern mach was bitch", "elruubiiii": "Calvoo", "calvin.lxh361": "Muss groß", "_bordeaux5": "Fuck yourself", "vagg_papageorg7": "You look like Smeagol from Lotr", "muzjik_tadzjik": "Climate, first is C", "3800.sethhhh": "The best thing that came from this was the memes", "gertatunfisch": "Kiddy contest", "bernardi6381": "Keep going! The people are following you! 🙌🙌🙌", "adnan63_34": "Bir Çevreci görüşün ola bilir Ama bunu bir Senin Dünyayı kurtaracak kadar gücün olmaz ve bunu yapınca Bir şey olduğunu da düşünme çünkü gözlerin de ki Yoksuluk değil bu bir gerçek tir Diğer insanların Ne hallerde olduğun görsen böyle yapmayı bırakıp Durmada Çalışıp iki lokma Ekmek kazanmak için gece gündüz çalışırdın şu anda ki yaptiklarin boşa geçer çünkü yoksulluğu bilmeyen bir insan Dünya ve insan hayatını anlayamazsın", "blaga_falchera": "Ti sei fatta i soldi eh bastarfa", "jasminelaprettebodnar": "Gay", "50g._.butter": "#Trump2020", "beatricekeul": "G R E A T ... G R E T A", "daveed_exe": "I wish i was there to punch the shit out of you and btw i live there", "lucybersten": "💪✊🔥", "antoniopedrodacru": "👏👏👏👏", "formiga_meirelles2017": "Você, é apenas uma fantoche,uma marionete dos Iluminates todos sabemos da nova ordem mundial , esta perdendo seu tempo , brincado de de ser ativista pelo mundo , uma garota que ao menos nunca passou fome, ou se quer ajudou lavar um prato dentro de casa .", "666gang666gang666": "👍👍👍👍👊💪", "jager_david_bajnok_": "Kancsi geci", "thewave1969": "🤡", "thenoplasticco_": "Great work!👏", "heygabehey": "❤️", "xx.jana_amr.xx": "hOw dArE yOu", "emilyantoinetteeee": "i thought you were 13", "daisy.bradley14": "Go back to school", "murecky": "Climat project", "vosstart": "Ой пошла нахер", "nklz.124": "Schmutz fuck the Klima", "tamaramatray": "❤️❤️❤️", "adri_cat305": "Yes of course go to school 😂 🤥🤥🤥🤥💶💰💰💵", "leoldv21": "Car and better energey efficends and other new technology", "i_1_josh_1_i": "Good work!❤️❤️🌍🌍", "pachobbaby": "Lisa Simpson", "jaksa_18.3_": "Ass Burgers", "pswaviedavie": "The beat goes on. Steady on into a new day. 🙌🙌👍👍", "sleep702": "#fuckyougreta", "tristan_donohue_": "This aint gonna do anything the world is burning welp ggs boys who wants to get high?", "guttalads": "👏👏👏", "dominguezraydel": "💚💋💚💋💚💋💚💋💋💚💋💚💋💚💋💚💋💚💋", "andresbarrera4551": "She's just a distraction", "daniiel___santos": "😂😂😂😂😂 tem doido pra tudo nesse mundo até pra crer que existe aquecimento global", "kxrx.49": "@_real._lena_", "jbeach45": "Go to school idiot.", "toestel9": "can't you find a rope?!", "alisados.ballester": "✅PIRRALHA✅ .", "mac.clls": "We hate you 👊👊👊", "gusttavo_resende_ps": "Greta, pq vc não vai ajudar lá na Austrália aos menos os coalas, ah não vai senão roubaram sua puberdade 🤔", "danielevasta73": "Vai a protestare verso i venditori di armi protesta in 🇮🇳 o cina per inquinamento. Facile fare il radical chic.", "jules_lbr": "@jeep @jeep_france @caterpillarinc", "marcia_severian": "@janeiija", "romper_stomper14": "Lol, what a retards", "dxnielbecker": "Lul", "erins._.priv": "Gun fingers for a real raver", "ankong1220": "China tells a lie that you advise to ban chopsticks", "codrin_theo": "Sa ma cac in creta ta", "anya.bit": "Make sure to tidy up,after every eco demonstrations there is plenty of rubbish left,practice what you preach", "luishpl_": "Please kys", "theostroombom": "@liamstralin", "charlietorsborn": "@liamstralin", "felixhallgren": "@liamstralin", "camillaaa.w": "@corina hdy?", "tk260519": "Was für eine bekloppte🤦‍♀️", "marahgaming_6x6": "😍😍😍", "teemukaarre": "Fuck you", "fortnitemoscowcity": "fucking underage idiot. fuck your climate hahaah", "whiteskinjoe": "No1 cares.", "hasan_kurds": "👏👏👏🙌", "user_reuser": "Torna a scuola cretina", "carter_farter19": "F in the chat for the world, cause she exists", "bas_ti13492": "Wir machen mit bei der Rettung der Erde 🙌🏻", "oneancientfuture": "Dear Greta,  we just heard that you are currently in Davos and since your work is highly related to our own mission and work, we would like to invite you to our Launch Event for the ASSEGAIA Declaration for the Protection of Natural Sacred Sites TODAY AT 14:00 at BlockBase (Promenade 40, Davos Platz)  In support of the Declaration, indigenous Elders will be holding simultaneous ceremonies on January 21st at Sacred Sites around the world. If you won’t be able to join, please help spread the word woth your community, read and sign the declaration here: https://lecielfoundation.com/assegaia-declaration-for-protection-of-sacred-natural-sites/?preview=true  If you’re interested to learn more about Sacred Sites, their importance for the current changes and the initiators behind the declaration here: www.oneancientfuture.com www.instagram.com/oneancientfuture/", "rightmindedmin": "She’s such a fraud. These poor kids - just like hitler. Targeting the youth. #wakeUp", "joshua_phkg": "I didn’t know you can count the number of school strikes since you fucking dropped out of school", "lehna_ml": "Please stop Tesla from killing Trees for a new factory in Berlin 🌳🌲🌳", "sutvinder": "All the best today in DAVOS, nice to hear your journey was the train. Not like other’s using private transport.", "diana_william_harry_scrapbooks": "You are an amazing human being ❤️❤️💞", "hakonramstad": "bro check dm", "cavanleemedlock": "Hi Greta you are cute 😻", "alirizaunaldi": "Fuck swedistan", "dopejakob": "gibbeeeyyyyy", "checkerjoo555": "Gibbeeeeyyyyyy", "iza.4191": "👎👎👎", "thefoxhorse": "#burnthe4thworld #lovethemoonnotoil3 ⚡️🦊🐴🌌🌲🌲 #leaderofthe5thworld33", "stalindad7": "China Russia and India have some of the highest greenhouse gas emissions", "stephenyoung444": "Private jets and 4 by 4 vehicles all taking people to climate change conference?????? Hipocritacle!!!!", "baumann2652": "Greta ich wünsche dir einen grossen Erfolg in Davos. Amerika und Deutschland wird nicht hören wollen. aber vielleicht unsere Regierung Schweiz. mach ihnen klar das zwischen 2015 und 2016 Millionen von Vögel und Fische in Amerika gestorben sind. man kann es bei Nachrichten Watson lesen. und ich weiss das in Australien der Brand nicht zufällig ist. das war Brandstiftung. ich drücke dir die Daumen ☘️☘️☘️☘️☘️☘️☘️", "ryan_d_trucks": "This makes me wanna do a burnout In my gas guzzling race car right after I let it idle for an hour or so", "einaeugiger_max": "I just go to fridays for future to have no school", "max_ugrinchuk": "Божевільна", "thesisi84": "👎👎👎👎", "lars_vd_oever": "Don’t believe this shit guys. She is lying, everything she say is pure 💩", "body_builder_start_today": "We have to kill this deficient bitch, she should be erased from existance like plastic straws #fuck#down#fridaysforyourmama", "pezezda81": "School strike week ...every week 🤣", "caseykooiman": "you are burger", "kazza2802": "Wow what a great hero 🙄 all she does is talk and join rallies for climate change she’s not like mr beast who literally helped plant 20 million trees like why is she so popular", "3301_q22g": "Go Vegan, or die.", "susanvetalena": "Greta Stay strong, Trump is ignorant to everything. Here in Colorado, the paper had multiple pages of our polluted air. https://www.denverpost.com/2020/01/19/colorado-air-pollution/ I moved her thinking that this state was top notch on its recycling program. I did not know it was not top notch in air quality. I am proud of you for taking a stand. Honestly for years, I have been upset with landfills and air quality. What we have done to this earth, can not be reversed. It can be slowed down, and with time and you and your followers will make a difference, unfortunately I do not think I will see it in my lifetime.", "lake_swanson": "puppet", "travelaroundtheworld_me": "Hi Greta, I know how difficult it is to change the minds of the powerful people in the world but we have to try it.Thanks for the cause you carry forward and if you need a hand here I will be.", "nurlanskyi_": "Hype hype hype for nothing...", "___leonz1347": "@realdonaldtrump", "glena_anastasiia": "Мда, оказывается как просто в наше время стать популярным. Делать ничего не нужно, нужно просто выйти - похайпить и все, ты уже пуп земли. А те люди, которые реально делают крутые вещи и могут помочь миру, так и остаются в тени.", "joel.o7o": "Annoying lil shit", "kingstonkittens": "save the planet😍", "niqqart": "Global warming is fake", "nxkoir": "“hoW dAre yOu” 🤡", "thenewvillageschool": "Greta, you are fighting fire🔥with internal fire🔥 and it is beautiful to behold. Keep going. ❤️", "j_koster63": "Who tf asked you to leave school? Don’t think it’s anyone’s fault but hers that she doesn’t do anything but ride her diesel train and jet fuel burning plane to her dumb little rally’s.", "_martzel_": "Fieber 🤣", "b.r.a.d.y.1.3": "You are changing the world every single day, inspiring millions! ✨ 🌱 ✨", "colbycollinss": "gretard", "alex_kar2006": "ой бля иди нахуй", "miriamocean": "I used to walk to school and drink tap water only had new clothes in my birthday and some times Christmas. I am sorry but is your generation 🤔", "_ogbandit": "It’s a bullshit cause, only reason for this is for y’all to get outta school", "globe_app_": "Have a blast at Davos! Remember, you have millions and the truth at your back! Soldier on brave warrior!", "victor.coelhoo": "More climate taxation , nice", "aleksiej1": "Ty się do nauki wez marionetko", "roozbehs77": "🤣🤣🤣🤣And you are proud!?!?!?🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "alicia2vr": "🖤", "s_syrius_b": "Love d'or you're action!!!!!👏👏👏👏👏👏😘", "t0prak": "slaak oç", "magdagvn": "How dare you❤️", "world_to_save_nature": "Save Planet: This petition must stop and stop the production of coal, oil, gas, ore, diamonds, gold, salt, soil, gravel, sand, stone and much more. Save and save Nature, as the global destruction of Nature is becoming an increasingly serious problem for the whole world. We must all live according to the laws of Nature - the main commandment of the world. Human civilization, industrialization and urbanization lead to the mass extinction of all life in the world. Chemicals affect everything living in the world, as well as infect air, terrain, buildings, water, various objects and materials, making them unsuitable for use and dangerous in collision with them. Humanity destroys all life in the whole world. All of them are poisoned: poisoned water, earth, air and the destruction of the ozone layer of the atmosphere are one of the main problems of the whole world. If people continue in the same vein, everyone will die from the catastrophe that man made with his own hands. Environmental issues that the United States, Russia, France, Germany, Spain, Portugal, Italy, Argentina, Canada, China, Japan, India, Brazil, Australia, Mexico, Malaysia, Thailand, Philippines, Vietnam, Kenya, United Arab Emirates, Taiwan Indonesia, Jordan, Finland, Sweden, Great Britain and all countries of the world. Mining companies and the mining industry have turned the whole world into a huge quarry and underground void, this is a real hell for the whole world. Nature's pollution all over the world all diseases from oil, gas, coal, iron ore, sewage, garbage, cities, industry and transport. Global climate change around the world: drought, floods, hurricanes, earthquakes, tsunamis - all this happens around the world. Save the planet, admire the beauty of nature and save the world from environmental disaster.", "garrett_collins80": "You haven’t done anything never payed taxes either got to school", "josiexprivate": "Amazing work! I can't express it enough!! I can't believe some powerful political leaders like Donald Trump deny climate change so are doing nothing to help it 😔😔 it's so upsetting", "james.sullivan12": "U do be looking kind of hot tho", "josie_ethereal_rayne_evalation": "@gretathunberg Darling, Sweet and Powerful Young Woman. From a Fellow Aspergers- Switzerland- Aka- Swiss/American woman. I have dyscacula and I'm A female Genius, Myself. I'm an English savant. If Ever you need my Service to help \" Mother Gaia \" Climate Change!\" I AM 47 And A: Human Rights, Animal Rights- Womans Rights. And I want this Planet Cleaned up too. I do Care about Your Future and The Future of My Grandchildren And All of \" Human Tribes Children\" Protected. My Deer tell me, they are sick and being poisoned by \" Round-Up\" and pollution. We Must Stop Monsonto. We must Stop the World Banking system and the \" Depopulation Agenda\" it more than climate change- were in A \" Pole Shifts- \" Greta- please. Go to 4cornors- America- Hopi Reservation. #hopiprophecy is True. Research- there are things coming my child. From a fellow Quantum mechanics perspective- We can change this. 7 Hermetic principle. I cover you in love and light Rainbow child. This Indigo covers you in unconditional love and Energy. To carry out your Destiny. 💙🔥💙", "roberto.hero": "Estúpida", "evigekonomi": "💜", "mifairytalespoet": "You are a great inspiration @GretaThunberg ✨🙏🏽💚", "_tomiiii._ctm": "Esta niña es intocable🤷🏻‍♂️", "813.floridaman": "The planet is trynna heal itself, we're harming it not letting the caps melt an extinct its current life, stupids", "fufupat": "Go plant a tree you fools 🖕🏻", "raph_synchro": "Save the planer!", "costa_choco_documentary": "We love Greta!!! 💚 Follow our ecological documentary on a sailboat!! @costa_choco_documentary 🎥🌊⛵️💙", "maxcox4": "@k.domi1 a few years ago the stopped plan burning and putting cattle on the high country to let everything grow, but it got out of control and where the fires have burnt was that area so dont u dare say its climate when we had every chance to stop this years before", "lucian.smt_": "@marcel_sx 2takter forever💪♥️", "g_r_i_s_c_h_k_a": "В ПОМОЙКУ", "1.edwiiiin": "🛫🚛🛵🚜🚗", "officialwheatcups": "This is great! 💚💚💚", "ldinkel98": "@cummins", "tonyy_3050": "the people who support this guy are stupid his 3 million yacht was stolen hahaha", "edoardo_micati_": "Suca", "freshotdog": "Ты заебала", "marcel_sx": "Dieselllllllll, wir brauchen mehr Diesel @lucian.smt_", "florianenzolino": "Gähnnnnn", "japan_loveee": "Vem ska torkar min röv när jag blir gammal? 😂 älskar låten💗", "peppo.198": "A scola vatinni", "itzzz_just_layla": "U", "oneplanet2020": "Yeeees 🙌💚", "paul_of_kent": "Greta is weird child what normal child would promote striking school ? A day off school is a day missed of a science lesson. She is just attention seeking now because all you sheep", "cortella__681": "Ma vai a scuola bastarda💩", "feni333": "All together. We will make the big change. 🔥💖✨💫😎✌💖💞💞💞💞💞💞💞💞💞💞💞💫", "theforceiswithusorder66": "How does playing hooky from school do anything for the environment??? What, dont want to waste your weekends protesting?", "marybarbu1980": "Greta is The Girl", "lorenzo_sanches1509": "Flamengo nao é time nao porra", "gregommmmmmmm": "👏👏👏👏💚💚☘️🌳💪👋👍", "seba.fraga": "Jajajajajaja, cómo no vas a ir al colegio, man? Andá y listo, no es tan difícil. Un saludo, máquina", "eyuelles": "Krya på daiiiii💗💗💗💗💗💗💗💗💗💗💗❤️❤️❤️❤️❤️❤️", "vyytal": "🌍Did you know that fashion is the 2nd most polluting industry in the world? But you have the solution! If you want to look handsome and protect the Earth, you have found the solution! Check our bio ✔", "sxrxn.o": "🤮🖕", "zepplyn_berry": "Where is her next strike", "josh345677": "skipping school isn’t making a difference moron", "bandanabones": "Can't wait till this brave girl goes to the front lines in China and India! Go Greta!", "skaijamew": "The more she continues, the more fake it all looks 🤦‍♀️", "neubert.paul": "Nein", "philipplhd": "You are so stupid like your mum", "kenballou": "Hi Gretta - Appreciate any comment on the attached article ? https://www.wired.com/story/a-surge-of-new-plastic-is-about-to-hit-the-planet/", "niclbt": "🤮", "cloudyystarss": "literally go cry somewhere else, ya twat", "estelarte56": "El uso de dispositivos electrónicos también contribuye al calentamiento global...entonces?", "luciano.responde": "PRA.cima deles", "jonas_12812": "I find what you do completely unnecessary. Climate change is coming, I know that, but you can solve it otherwise. But don't demonstrate with this because that only bothers people", "tomnicklas_2305": "Dumme Kuh geh zurück nach Schweden in die Schule", "ka.rthik8825": "Dr Vandana Shiva salutes your incredible work. https://youtu.be/lach5QIy-_0", "monsterology": "greta you a 🤡", "wyattlewiss": "just a stupid excuse to skip school", "m_tuzovsky": "🤢🤢🤢🤮🤮🤮🤮 Die in pain stupid bitch", "thealchemisttt___": "Yeah the youth! Woooooooooo. Fucking cornballs lol", "sem_van_deijnen": "Gay", "antthonny_90": "Trump 🇺🇸", "ginisgp": "👏🏼👏🏼👏🏼👏🏼👏🏼", "_dabr__": "#2stroke", "annaaagots": "😂😂😂😂", "_ogaboga69_": "Climate change is not real", "citizen_wrong_think": "Week 74 the search for Greta’s upper lip continues 😂", "bernie_the_next_stalin": "Why do you fly in a jet greta", "khoithaboy": "So there is a guy called Mrbeast has planted 20m trees and this girl is just talking and not suggest any options or plans to save this world and yet she has more impact than him?????", "linneagranstrom1": "Go girl", "eliga899": "כל הכבוד צריך לעבור לאנרגיה מתחדשת עכשיו לפני האל חזור ב2030 ולרכב ירוק ולהפגין ולהלחם בחברות הדלק ונפט והחשמל והמנהיגים בעולם שמכחישים את האקלים לא נרגע עד שננצח במלחמה שלנו למען כדור הארץ", "davi__d1": "At least learn something", "_fun_player_": "@schneider.yanik die söll der latz hebe", "_adi_aliotta_": "Go kill your self", "ivo.tc": "Geh zum Sport anstatt über Klimawandel zu labern und schaff dir ein besseren Körper an 😂", "hasemitweissernase": "Photo taken by a camera.. Camera contains batterys.. => not good for the environment?! go and fuck yourself you polluter!", "chadcover.6380": "I feed my turtles plastic straws all the time", "ereenkse": "How dare you", "benjaminbrown_": "Amazing Greta, you inspired me to start my own project called How We Save Earth. Where I am trying to educate the younger generation on what they can do to save the planet. I am also showing them what is being done to help alleviate there eco-anxieties. I would really appreciate it if you could check it out. The link to the YouTube channel is in my bio", "stephanie_shablam": "Read more learn more so than you won’t say something stupid without knowing the truth or culture", "jeremy_charvet_": "@nath.leger05", "anili_anili30": "good people help raise money and buy a house. beg", "eddielif05": "Tesla=🤮🤮 Volvo d24=😍😍🥰🥰🤤", "llkmaria": "te amo", "r.c1992ss": "Fuck you illuminati bitch", "alex.47.k": "#howdareyou", "fotocracia_arq": "🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢", "memes.imperium": "Fuck you.", "victorlund999": "Dumfan helt reeeeeeeee", "jeff_everhart": "Go to China 😜", "janegracejan": "#shameonyou dear world pls wake up! You can fight for the environment but pls go to school to learn something!", "kees_luttikhuis": "@silbekhuis_2002 moei je s kieke, dit is echt 'n door wief, beetje te kouwen op buskes bosjes 👌", "_saraafg": "VETE AL COLEGIO DE UNA MALDITA VEZ Y DEJA DE HACER HUELGA. PRIMERO ESTUDIA Y LUEGO HAZ LO QUE TU QUIERAS DE ACTIVISMO. Y ENCIMA NO TE SIENTAS ORGULLOSA DE NO ASISTIR A CLASES, PORQUE MIENTRAS QUE TU VIAJAS POR EL MUNDO *GRATIS* HAY MUCHA GENTE QUE LLORA POR IR AL COLEGIO", "ecowarriorproject": "Stay strong. 🌎 The world is listening.", "volleyball_rachel245": "you got to think twice about the side effects of doing this. Dumbass", "marcelinaaa_p_p_": "Hał der ju", "lenilovesbooks": "Thanks❤️😍❤️😍", "chiggerchumpkin": "We love you Greta 😍", "marcel._.25": "👎", "juli_rg_costa": "Master of puppets 😌👍", "maxi_ilian1": "Russisch Kochwasser", "na._.ch": "Diesel👍", "dmelomusic": "looking at my daughters eyes, I know what longing question lays behind, the question „why?“ I know that I can‘t make it right, the things we should have at least tried, but lands once lush now have dried, forrests green were set alight, I wish I could look at her and stand upright, at least could tell her we put up a fight I wish we had realized it in time, that things may happen we can‘t rewind, I wish I could tell her It’d all be fine, but we ran over the last warning sign, Buried it deep so none after will ever find - find out what we‘ve done, or what we’ve failed to do eliminated evidence denying hidden truth I wish I could gift her a worriless n bright youth But my hands are tied my feet took root this is the future inwhich I wish I could undo luckily I can act now and so do you!  Some message I wanna spread!", "mr.leonchino": "U make me wanna throw my trash into the ocean", "lawrence_whiteside": "@mr.leonchino she certainly does offer solutions, you just believe what others say about her and let them piss you off.", "brownkingmusic": "Hey, Gretta... go to school...", "tropicalpilots": "HAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAAHAHAHAHAHAHAHSHSHSHSHAHAHABABABAHABSIBD", "soren_feistel": "SO MANY PEOPLE ALL OVER THE WORLD MANY HAVE A HEART MANY PEOPLE NOT MANY PRAY MANY DONT BELIEVE IN GOD MANY HAVE LUCK MANY NOT MANY HAVE KIDS A FAMILY MANY LIVING LONELY ME 2 MY LIFE IS HARD ITS OK I HAVE ACCEPTED FOR ME I NEED IT LIKE A DRUG HARD WORK I CAN NOT GET ENOUGH HERE IN GERMANY THERE WHERE I AM FEELS LIKE A PRISONER FOR ME THERE ARE MANY PROBLEMS ROUND THE WORLD THE FIRE IN AUSTRALIA FOR EXAMPLE WISHED I COULD FLY DOWNUNDER TO HELP THE FIREMAN TO DO SOMETHING GOOD FOR THIS WORLD WE ARE LIVING IN BUT I HAVE TO SAY YOU ARE THE SWEETEST THING YES I LIKE YOU VERY MUCH WHEN I SEE YOUR PUCTURES I AM ALWAYS HAPPY NO MATTER HOW I FEEL WHEN ITS DARK HERE IN GERMANY THERE IS A LIGHT BURNING ON MY SIDE YOU ARE LIKE THE SUN WHEN I THINK ABOUT YOU ALL PROBLEMS ARE GONE THANK YOU VERY MUCH 😊", "dxvxdfml": "How dare you", "pimdr076": "Time traveller", "anastnorth": "why you sended you boat from America by plane?", "gti_meister": "Fuck u", "ib_marlon_ub": "Du bist scheiße 💩 Ich stecke dich in einer Tüte 🦚", "030tim_b": "I am warming up the planet with my big penis @x.elize.xq420", "k.i.k.i.k.u.n": "How about Datteln 4 Greta?", "peacenationarmy": "Love it Blessings and abundance From Peace Nation 🕊️", "timpix": "💩 💩", "_a.i.d.a.n.8_": "When you realize she is not accomplishing anything", "manuelgreckl3": "#fckgretathunberg", "saretta1306_": "amo hai sbagliato la fotocamera da guardare", "nb.bethke": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "li_b612": "Is that a way we can address climate change without discussing the fact we are over populating the world? Should we start thinking about having less children?", "roberrocks": "how dare you", "tompoelman_": "Adolf hitler an das macht", "ayham.42": "How dare you", "moritz.amg": "Idiots 🙄", "history.of.palestine": "How dare you 🤡", "wldhrss53": "You're all amazing😘😘😘", "nils_frz": "Fotze", "emil_jigemark": "Du är beige", "michael.jahanbin": "Join VHEMT to save the world.", "salakayttis205282761": "Jag uppskattar dig så mycket💕", "paulbckrr": "Saving the planet? Its okay but not with this toxic Clima community. What you are trying to do is not getting in school thats why there are days where you can \"protest\" for clima. And what then? You have not a resolution for this problem. And if someone like me is saying their opinion you trash talking them. Literally overrated", "russlove": "Another 15 minutes of fame and then a flash in the pan! Get back to school and learn something other than your lunacy. We will still be here in 13 years but you will be just a bit stupider.", "albatta.ahmed": "Climate change is real and is happening in Australia and the world. Check out my latest post to know how to stop it.", "alexxchurch": "FUCK CAPITALISM AM I RIGHT GUYS oh wrong rally, see you boys later", "_niknn04": "Io inquino", "slim_gorilla_music": "Well do you even imagine what would happen if all the industries which emit carbon dioxide close immediately? People will not die because of global warming, they would die because of global famine!", "semihtasking": "Fuck u bitch", "vittoriafabbianii": "A Greta thumberg, where are you now? Why don’t you plan a new climate manifestation??????", "marflashm": "if you care about ecology so do not wear a jacket that is made of chemicals I recommend straw instead of a jacket.", "x7marrojo7x": "Puerca", "henriettemx": "you are so cool", "bencebooiii": "Do you like beans?", "jeremyadamkroll": "Full of shit🖕🏻🖕🏻🖕🏻🖕🏻", "rebeccaandmolly": "#howdareyou", "dead_.acc_": "MrBeast: I am 4 parallel universes ahead of you", "charlmaefretter": "🙌🏻💕🙌🏻", "koroll_samoocenka": "😍😍😍", "unicefinnocenti": "💙 🌱🌍 Go team! #FridaysForFuture #ForEveryChild", "_lukas05_": "Figg di🖕🖕🖕🖕🖕", "kimiya.dentist": "Huge fans!!!! Nice.👍👍👍👍❤❤❤❤❤❤❤❤❤❤❤🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉", "offiziell____tim": "Alte geh Mal zur Schule 🤮", "ofmg_luca": "Juckt?", "kevin.cxmm": "How dare are you?💫", "joey_massoud1": "How dare u", "asian.dorito": "Trust me we all could tell you don’t go to school", "i_have_problems_ok": "Do you know how stupid this is some people out in the world wishing they could go to school and here u have it a bunch of lunatics skipping school it's not like their going to do anything so basically if u want to become stupider this is the sort of things you should do thanks for listening to my Ted talk", "sina__mohammadi__": "کچلیک اونا", "itsprathapkumar": "Get to school little kid cause u do nothing all u do is say 'how dare you ' go fuck urself", "jarvitto_333": "How dare you", "alessandro._8": "Nobody likes you", "claudia_abi_chahine": "@rhea_a.c", "m.o.r.g.a.n_fanclub": "Mmmmmmmm", "daniel.newling": "Go back to school", "hardley_cossin": "With the school strikes thing the young people’s mind would be dead way before environmental change come", "dalla_mente_al_cuore_lifestyle": "I’m with you", "tadeucarlos2010_": "💩", "png.owl": "отсоси мою жопу", "anvar_zinanov": "Ладно", "benlilly05": "I hope you realize you being used as a pawn some day 😢😢", "kevn_p02": "Go home loser, nobody likes you", "conner.pearson": "Maybe you should go back to school and actually learn about the environment not from your antifa retarded parents who have no clue about the environment neither does Danny archer or Arnold Schwarzenegger both disel guzzlers and you wear clothes made from petroleum so do us all a favor and shut the fuck up", "therealdragontheshark": "Hey, I got schoolwork: can you organise one, oh I dunno, on the weekend?", "edguardoh96": "Please follow us, we will follow back! Start up looking to plant 50 million trees and raise 100 million bees by 2030!! We need your help!! If you’re looking for change & growth, it starts here! Together we can fix the world, We’re your trusted Non-Profit in US who will post every batch of trees planted (first planting = feb 24th) and later on every colony of bees created!", "cmmesa57": "Great work Greta Thunberg.... keep going my friend, your contribution towards a better world is amazing !!!!", "mhedderick": "#IStandWithGreta 🤘🏾❤🌏", "anka.eliasz": "Is it true that you were making a film about Polish coal power plants when the Germans are opening another? It is a bit weak that you are on the side where you will have more profits. I was hoping you would be an objective activist, but what can you expect from a teenager...", "prostokrrr": "Грета, иди на хуй!", "michele.tomasino": "👏", "eddiesafdieh": "No one cares about Australia", "misterorsonwelles": "Everything you do inspires me to be a better person. I hope you hear this and accept my compliment. Please do me this one favor: stay strong and use your voice! Use that voice of yours, because we are listening. And also, please be safe, and keep being very, very strong. 💜", "turtlemoon64_studio": "To our global leader, GRETA.", "awfunk": "#chickenlittle 😂", "leila_hattami": "❤️", "yungtille": "time traveler", "yodajihad": "What do we want? Action in climate change... When do we want it? After I've got my new iPhone 30", "velosolaire": "I am translating your article on TIME.", "americantrxgedy": "gå greta! 2020 gör en skillnad☘️🌿🌱🍀💚", "the_rammer_2001": "At this point your dropped out....which is illegal.", "fablous01": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "brose857": "You are a joke", "nunziov1402": "Piazo e loca", "homewreckerxoxo": "LENDARIAAAAAA", "rookiebbrasil": "😎👀😎🧐🤠", "joecar2004": "The green new deal is globalist scheme to expand the power of big gov change my mind", "yago_magalha3s": "✊🏽💦💦", "zhaifengx": "Hi Greta Did you think 0 carbon emission to anywhere ？ See the whole world And spread the word of saving the world ?  I know you for the 0 carbon emission cross the Atlantic have sailed 2 time ! ( I also sailed 2 years with my family )  I am Feng and Xin A father and a daughter From China. We want build a solar power airship like sailboat of sky .  Since we can be crazy enough to save the world, why not build a crazy airship ?  for see the whole world ， Me and my family Cruised a million miles on land , Sailed for 2 years , Flown around Australia by microlight . My background is as railway worker from China, We do the impossible ！  Live in the sky and see the whole world “Airship school “", "lou_bouiboui": "Je suis avec vous !!! 😍✊💪💚🍃", "johnmarqzzz": "I first read that sign as killstreak the climate I was like wtf", "margaritaansoleagarod": "😢 🐨 🔥 ❤️", "gingeritus__2a": "Puppet", "elphilippeau": "Va niker ta mère toi et la roue", "mikerton19": "Disgusting", "mikerog_19": "Disgusting", "alex.likeafox": "U G L Y B I T C H", "kacperpietras": "Ale myrda", "robert41017": "Environmental issues are important but any government involvement violates the NAP it’s the people that must combat climate change with no government involvement fuck the government", "ldylmsty": "cut the cameras... deadass", "viktorbarosen": "Du e så hjerne skada at æ får ondt i mæ", "torukoishi.helsinki": "The youth is amazing! 💕👏👏", "radkokeleman": "All I see is dumb asses in the photo", "robert.bethune": "i like to suck dick when it’s asian men", "squally1245": "How dare you", "travis.h.mayo": "Your country agrees that these climate policies were the biggest waste of 2019.", "yasmine.067": "kahba", "ohlivveeuh": "hey i sent u my testicles please respond <3", "richardlajoie1": "However do you need me", "joshma_losh14": "17 but looks 9", "tigraaa09": "Hej", "interdimensionaltrainconductor": "ass burger", "gengming.chen": "贱人一个，把你丢去印尼做雏🐔，你就明白啥叫环保了", "chris031067": "👏🇦🇹👏🇦🇹👏🇦🇹", "marek_zgc": "U have been seen in Poland in Bełchatów i dont like this... Go away pls", "pascalpfiffner531": "@thommy.egli @_raphaelschindler_ söll öpä mol d schnure zuä hebä dumi chuä", "jay_wiese": "Mein Vorbild! Durch deinen Einsatz habe ich mich dazu entschieden den neuen C63 AMG nun nicht zu kaufen, der Umwelt zuliebe. #praisemothernature", "nolantd04": "This is fucking liberal bullshit. This girl is on the farthest if the spectrum to stupid libtards. Fuck your \"human caused climate change\" shit", "autistmemes.mp4": "Nelson here to tell you that my meme page is very good and that you should follow it pls and thank you", "marywho__": "You are a true hero Greta 💙🌍", "r4venn1": "curablarini cikra", "ryantacklin": "Will you be in Rome for May 14th?", "cesmeeport": "Oruspu çocuuuuuu", "evanambrosino": "You are a horrible little person", "karmatik13": "Why everything goes around with sex? It is damn wrong... 🔥😢", "alexsukhenko_": "Hahah climate hoax", "moelli_manu": "Ein Mädchen wird von der Presse zum Weltstar aufgebaut - weil sie panik hat und zum Schulstreik aufruft", "_sven.04_": "Würdet gschider go wärche🙄😂", "wielebenbesserleben": "PFTTUUUU", "secretsboutiqueoficial": "Siga nossa loja @secretsboutiqueoficial e participe do sorteio para ganhar uma fantasia de Carnaval 🎉", "monkey58493968": "Lol dit face Greta dör så roligt", "was_issn_mit_dir_1966": "ZECKE🖕🏻🖕🏻🖕🏻", "_daviidd.mtnz_": "Viva vox💪🇪🇸", "ghadi11225": "Follow &like please 👍🏻😍@alzhirri", "adrik_albesku_cota": "Leave schools alone i know your a cringe kid and you're like school is bad and all but grow up plz", "antigruen_": "Greta Thunfick", "yeritakiboyz": "Do you have asparagus?", "lolamylifee": "bien bien q t haces la buena pero después seguro q hasta tiras papeles a el suelo 😂", "saul187er": "CL500 hör den V8 ja das macht krach in der Nacht @benundergrounddog", "hannavirveus": "@4pettersson vi borde hänga med!", "mats.thuresson": "👍👏😊", "soydelmar.ok": "💚💚💚", "buster.rocket": "Vas donc a l'école au lieu de t'occuper des politiques de différents pays ! On as pas besoin que tu leurs explique les choses, ils ont du recul sur le sujet ! Toi tu es juste a parler du réchauffement climatique alors que tu y connais strictement rien ! C'est ton Asperger qui fait que tu es plus scientifique que les personnes normale mais tu n'as aucun recul ! Retourne donc a l'école, espèce de Folle !", "caucolibri": "@gacolini4", "asier.lbxz": "Dale duro greta", "xxjins_destinyxx": ":)", "s2.selena.gomez.s2": "Pirralha", "lilmar_lovers": "Askin niggas to do shit but she aint even doin shit", "the__real__jrm": "For too long governments have continued to ignore us and still damage the environment. We need to call yet another Global Climate Strike", "e.sofia.i": "✅✊🏻", "ttp.solisss": "Dumb bitch", "samdwarikarawlings": "‘Hero’", "littlebidsnmz": "👍", "german_wine_enthusiast": "😊🙌👏🏻", "sunmaid36": "🌍💚🌍💚🌍💚🌍", "osmancapalot": "Get a life u fucking twat", "amti": "fuck you lololol", "istvielbesseralsdu": "Plot twist: she only do something for the clima to don't go to school", "alexis__avl": "I love diesel", "fanboy380": "Greta is shit", "lennovan": "#ozoneuvb", "_a_l_2_1_": "my guy be wearing leather", "lhaglenn": "@yulianavu were you skipping school as well?🌍", "paulalny": "Pirralha", "official.clarice.r": "🔥✊", "susanjaywatson": "Go Greta! Never give up the mission!", "jakublaciak78": "Är du i Polen nu?? #belchatow", "__notetoself__": "💙💙💙💙💙💙💙💙💙", "tony_tomatoes": "Keep up the good work. 👏👏👏", "christallen1": "Heja Greta! Din kamp är viktig!", "viidalarturo": "Te odio putaaaa", "treborallen": "This will change absolutely nothing. Poor little puppet.", "nn.010_": "🐐🐐", "tiborkeser": "What a joke", "bruno37201": "Fantoche da elite", "k_0.11": "You are my idol ❤❤", "luke_the_goof": "No one cares", "1.samirzzz127": "Fuck off", "saltysoysauce123": "MrBeast should have won person of the year", "crazyaboutcola": "Follow @plantatreeco and @treesbolivia to plant trees", "penkkipena69": "God i fucking hate you", "tin_matkovic": "go to school", "andy_levyok": "Bla, bla, bla... Greta👎👎👎👎👎👎👎👎👎👎", "theskinney": "Look at all those people doing nothing to help the environment.", "briimariexo": "How can I support you and the work you do?", "luke.f.cordell": "I just dumbed 7 quarts of used motor oil in the forest", "i.o.o.n": "you cool girl", "juanguzmanguzman": "Apoyo y ayudo hay que llegar hasta la. O N J y la UNU", "brandonjsandoval93": "If we don't do something, the Earth will perish; us along with it.", "varesegirl": "Wow!!", "greystev22": "Lokee thought she was 6", "fishb.oi": "74 weeks of no school and how is this changing the world dumbass", "ferry_otong_": "@livyah08", "mjulyv": "👏👏👏👏👏", "jay.wallder": "Stupid", "charles_brunez_": "Fuck of and go to school", "123_soleilllllsbhee_": "Va crever sale pute", "shahab.810": "How dare u", "khalid.harthy": "How dare you", "ahmadd.810": "How dare you", "luke_burnz": "We shouldn’t be on this comment section", "saab_e_najs": "Häja för mer disel och mer bra saker🔥🚜⛟🚙✈🚢✈", "tonineto.headtr": "Hypocritical", "lennartbernsel": "Du blir bara bättre och bättre!", "jasdhanjal11": "Lol", "arias.troncoso.torrez": "Chupame la pija", "isaakartist": "😂😂😂😂", "walter_white1212": "ANTECHRIST", "alekswillpower": "I am very touched by your honesty and as a human that.i.am I like to join the work you do. It breaks my heart to see our nature decline. @gretathunberg from @alekswillpower", "sandra___costa": "PIRRALHA", "onlyjames80": "Stay in your lane, your not impressing anyone, Gas and oil is the way to go🖕🏻", "konradbinek": "Datteln 4 Germany 😡", "miogoteson": "Bra jobbat", "pavo_sjc": "I hate you so much Thunfisch", "servetakkaya53_offiziell": "@gretathunberg you best👏🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️", "reesyyx": "how dare you", "domdemonstrerande": "Hej jag är svensk och är ditt största fan,har en grupp och vi hjälper miljön..", "cupcakesoul_": "Btch then do something. All u do is speak and harm the world yourlsef. Also heard u have mentall illness which shows why you behave like a retarded", "mihailescu63": "🔥🌍🔥🌎🔥🌏🔥😷⏳😷", "adrianwess": "Go to school Stupid shit🙌", "anetteerman": "❤️", "shavermechko": "Хватит убивать докторов ради докторской колбасы!!!", "rammert15": "How dare you", "beautifull_see_moments": "That Look is Awesome 😂😂😂😂", "scientist.for.life": "Rich spoiled kid who wants everyone else to live in poverty.", "crutches.to.crayons": "😍🔥", "goat3262222": "https://www.youtube.com/watch?v=QsP2NF8ndJ8 Коптит сильно. Грета дай им пиздюлей за это.", "jiltedgeneration_": "Does she have fetal alcohol syndrome?", "joycesart123": "Greta. You are a Star ⭐️", "andre.kluge.100": "🙌", "ellis.king.directors": "Hi Greta, I thought this could be a good suggestion. I really admire what you are doing, but I feel that you should use your power to focus on what people CAN do instead of always looking at government for the answers. I encourage you to watch 'The Biggest Little Farm' to see how everyday people turned unusable land into a thriving ecosystem in just 7 years. If we turn our attention to solutions we may get through this. Government will always have their own agenda. They will use your campaigning to tax the poor and nothing will change. You have a unique position of power, look at where you can focus the human race and when we can start changing things on a macro level, and then we will be able to shift the big things. We need to make government work for us, not the other way around.", "fetteralsnerobbe": "ok", "teens_for_tomorrow_india_": "We will fight against climate change until we receive climate justice.", "justtalkproductions": "It’s all good! 🧡", "raj_bangia": "Greta is Great! Good Luck.💝 #schoolstrike4climate", "yuri_1913": "your mom should have swallowed you", "granyt884": "If you aren't #vegan you aren't serious about the environment #govegan", "tmshre": "Can i smoke cigarettes without damage the nature", "va.ria__": "How dare u", "dimus_228": "Homeless shelter", "cem_cimsit1": "Ich hab ein 14,8l Verbrauch", "luyisianna": "little ｌｉａｒ？", "jadatrengove": "How dare you", "destroythesystem": "For Polish People you are just stupid bitch fuck you Greta and stop lying....", "thiccolas_123": "Go to school like the rest of us", "dannycrab003": "Climate Change isn’t real dummies", "anthonyr116": "@x_nolan_x t y es grand fou", "souzagil1864": "Hihihihohihihijijiijihihihihihihi your message reached bolsonaro hihihihihihi", "jxxnh.hiu": "Was ist denn hier los aber auch mal an Schule denken ne", "mate_xd": "GO BACK TO SCHOOL pls", "nico.kobald": "😤🤢🤮🖕🖕🖕👎👎👎👎", "2008daewoo_matiz": "Fucking bitch shut the fuck up", "soft_daisy_": "U go😳💕", "isac_th_privat": "😂", "pigiamadipile": "Follow us! We are new🍫🤤", "kirsteenthomsonart": "Take care of yourself too! We all need to step up to make change happen.", "esme_arsty": "Go Greta", "sarah_ruehrnoessl": "So, not being educated is cool now and will save our future?", "linus_fgr": "Samra :verbrent seine g-klasse greta:how can dare you😂", "lvna.fsb": "How Dare you", "zarinoblue": "💩💩💩💩🤢🤢🤢🤮🤮🤮", "theuniverseisfine": "You autist", "dpsgaharwar": "This is quiet impressing task that she is doing ..hope for a great future ahead....👏👏", "jaytlucas": "Wow! What a legend", "krassechecker": "When you are so close, you should also come to #Liechtenstein @fuerstentumliechtenstein 🙌🏼", "datto_sgnakkeroo": "Ngul a soreta", "lina230690": "Mongo", "afetxalikova": "🇱 🇧", "scrivere_per_ragionare": "🥶🥶", "ifbmhdukv": "Fuck you jewish 🧟‍♀️", "leoha_ppiness": "👏", "kategephart_": "You rock girl! 💗💗 So proud", "koronamania": "No school strike for geoengineering, no for sun simulators and Haarp/eiscat....no strike for cemtrails... No no just co2. Stupid People promote this kind of madness", "abilovv_t": "Угадайте кто это: Лает и лает, ничего не предпринимает?🤔", "privatsachen": "🍀🍀🍀🍀🍀🍀🍀", "draco_malfoy_fanpage06": "🤦🏼‍♀️🙄😒😑 go to scool your hoe", "greenpostig": "⏳!TIME IS RUNNING OUT!⏳ We are a non-violent climate activist group who aim to change the future for good by getting the word out to social media. Give us a follow to help us be able to raise awareness of climate change", "tevypy": "🔥", "sohel_rima": "We agree but why not Donald Trump give value greata..i think he Don't like climate change", "_.alma_._": "Girl you are amazing ❤️🌎", "dbz2k18": "You’re stupid so is your fan base", "lachlanxstewart": "@vincent_menard1 I thought that was you on the right for a second 😂", "astra.plants": "💚💚💚✊🏻👏", "17sc.ars": "Your amazing 👏❤️", "leronikz": "YouTube \"3 R's theory Reflect, Reclaim, Reuse, the first theory to solved climate change", "enciso_2011": "Tu cara de :\"no quiero estar aqui\".", "oks.408": "Лучше бы вы учились!!! 🤦‍♀️", "fsb_nikto": "Fuck you🖕🖕🖕go back home noob asperger", "marcel_kalvelage": "Du weißt doch nicht mal wie es ist motorisierte Fahrzeuge zu benutzen", "veronica.ibarra.77": "❤️", "rosa._.07": "Sie übernachtet am Montag in der Schule meines Bruders!!! Das ist so traurig ich hab Schule sie ist mein grösstes Vorbild ich würde sie so gerne sehen❤️", "yuvashaktiinitiative": "I am a student in New Delhi and I urge you to sign a petition (in bio) to urge the environment minister of India to approve and invest in an E-Waste recycling program to deal with our massive mounds of waste that are typically strewn across streets. This is a problem, and we need to deal with it.", "peterval1323": "Hmmmmm, I wonder if the countries she has started protesting actually has some of the most cleanest air, if the change is going to happen, start urging the government to push countries into having cleaner air regulations", "phoebeilovedecojewelry": "Go Greta Go!", "wicked_lord_shinigan": "Can we just finish off the earth already", "carmenbusquetsdotcom\nVerified": "Verified", "czlady1": "America has to elect a different president and we will be behind you 100 per cent! I can’t wait.", "sa_lma2750": "Du hörde @khxd1ja.177 hahhaha", "jziggy2000": "@danielfinell_ !!!", "tonyvneone": "Все уже забыли про тебя , а ты решила напомнить о себе за счёт России, иди учи уроки 😹😹", "curtisschindle6": "Education is the key. Change doesnt happen overnight! Dont stop learning", "jamieadamsbeauty": "Love you Greta! ❤️❤️❤️", "jayden_taylor07": "🖕🖕🖕 Fuckin brainwasher", "wxgabiie": "Greta, did you see that koalas are now considered extinct?????", "harperrrrr_chengzzzzz": "The funny thing is she only knows what to say on script but when she acually speaks she doesn’t know what to say? Hmmm? Explain that", "loraburnett": "I am so sad for America and so thankful for all the rest of y’all. Send help, we need it.", "clararath_": "Oh shut up you cunt", "our_animal_friends_in_aus": "🙌😍Your Amazing and a voice for all of us . You are not about money and personal gain but willing to put yourself out there for the great of good !", "alex_whooo": "Oh wait what did Greta do again.......oh wait that’s right nothing", "jey_the_alien": "❤️", "ilhamdieen": "what did she did and why she become famous?", "agneta.c.malm": "Right!!!!!!", "kekistanyt": "Mr beast deserves the time magazine", "holger1803": "🙋 👍. 👏. 👏👏.", "ti_mo_th_y_": "ur not an activist ur a scared little girl asking to be saved by the grownups ... that's not activism, twitter isn't activism, parroting daddy and the indian isn't activism, screaming to be saved isn't activism ... plant a tree, loser", "mrn.e46": "#fridaysforhubraum #dieselpower", "adk1857": "B4 I drop dead", "nattycomics": "You say you’re for the environment and anti plastic but you were busted with a car load or plastic containers and bottles! #fraud", "ericmauropm": "🙏🎇", "garciapereiraarthur": "🙉P🐊I🐍R🦍R💸A💵L💰H🤑A🤦💵💴💶💷💳💰😂", "domenic.insta_": "I want Cookies 😮🍪🔵!", "cole_brown2005": "Boooooooooooooooooooooooooooooo", "pinkpunkah": "The STRONGEST! 🙏", "simone_g_imagery": "Good on you Greta!! 🙏🙌🙌", "yogaforpeaceandvitalty": "LOVE YOU!!! 😻😻😻😻😻😻😻😻😻😻😻😻", "will_woodw": "Lololol clownn", "shaipova_olga": "Угомоните кто нибудь уже её 🙈 пы.сы Гараж кто нибудь продаёт ?😆", "bailey__bentley": "She is just making up an excuse not it go to school"}