{"xlost24": "@jasmin_1108__", "conservativeguns": "😒 Stupid the bushfires were started by arsonists not bushfires and climate change is fake so your whole movement is a failure", "hallokitty1234567890": "I THINK THIS UGLY CHILD SHOULD BE CHIPPED BY BILL GATES, STERILIZED BY HIS FATHER AND THEN TAKEN ON A PLANE RIĐE BY JEFFREY EPSTEINS FRIENDS, BILL GATES IS ONE OF THEM!", "axel.groove": "Hi, we are AxelGroove and Joe Mangione, two indipendent producers and Musicians. We’d like to share with you our no profit Project “WATCHING YOU”, a tribute dedicated to the precious Greta Thunberg messages. It consists of an original music and related ad hoc video. We hope you can share it, many thanks https://www.youtube.com/watch?v=e_g4kH08DHU", "_my_art_by_maxe_": "😭🔥🌎🔥😭", "hanna.augustynska.tennis": "💔💔💔", "entoinsects": "None of this will happen", "_.iinniiggoooo._": "@50cent", "elliott_spam123456789": "Listen, I hate to rain on your parade, but if we abandoned all fossil fuel use, we would have a lot more to worry about than global warming. This would literally shut down the world’s economy and living situation. This would mean no fire, no electricity, no food, nothing. This has got to be the most hypocritical thing I’ve seen, Greta literally took transport filled with carbon emissions to say this back in January. The fact that people from the left will listen to this just because she is 17, and tell people who don’t listen to her that they are making a victim out of a child, is despicable. I am 15 myself, and I actually study these things, not from fox, not from the daily wire, but from actual studies from government agencies, and I don’t get over 10 million people listening to me on Instagram. How dare you, Greta, for proposing something that could very well end human civilization, if not send the world into chaos, without being educated on the likely effects of these actions. There would be no more food, electricity, means of transportation, any of that. All of the “clean energy” comes from a factory run by fossil fuels somewhere. Pretty much everything we have we owe to fossil fuels. I wish people would actually listen to Greta, so that they knew the crazy things she actually believes.", "jeremy_burt1": "#STFUchallenge", "x_1luca4_x": "I like fire burn all forest down", "skuri.02": "holidays in australia seem lit to me", "savetheearthak": "😢😢😢😢😢", "cameron_lenhart05": "The fire was started by stupid idiots going and lighting them not the climate", "jozeff16": "it's lit", "pritam_0001": "Ja jake aag bujha de waah pe!!!!!", "rodrigocerpa9": "Comunista.", "ovsanka1238": "Ты серьезно?", "bodesapp": "The australia fires were arsen, not climate change. It’s a ducking hoax retards.", "saeid_ny": "How much dollar do you pay for help Extinguish the fire?!? @gretathunberg", "alex3463786": "😮😮😮😮😮😮😮😮😮😮😮😮😢😢😢😢😢😢😢😢😢😢😢😢😮😮😮😮😮😮😮😮😮😮😮😮😢😢😢😢😢😢😢😢😢😢😢😢😢 wegen dem", "fiftytrillion": "Bruh. Someone made those fires not the environment", "arkc.gg": "This happens every year it’s called a wild fire", "genderneutralbeauty": "We are not in a climate Emergancy, we are a brainwashed malfunction 😂", "sure4136doorkipkap": "😍❤️", "_seitbekovna__": "you sucker you told the Chinese and the Chinese hit you loooooh looooooooh", "__cdub__3": "Lol it was arson homie.", "elstonblackmate": "lol get rocked", "ivarruiter": "Its only officially measured every 30 years not 1 year", "bg4082": "How are the fires now? Oh sorry floods🤣🤣🤡🤡", "louisapharr4ever": "wild fire more like fire post 💯💯🥵🔥", "roamlion": "Davos 😂", "nataliefootball": "Team climate", "minaabaszadegan1397": "🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝😍😍😍😍😍😍😍😍😍😍😍🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🏠🏠🏠🏠🏠🏠🏠🏠🏠🏠🏠🏠🏠💫💫💫💫💫💫💫💫💫😍😍😍😍😍😍😍😍🙏🙏🙏🙏🙏🙏🙏💝💝💝💝💝💝💝💝💝💝💝💝💝", "tallystocke": "I just want to say that no diesel is gonna work. All fire department vehicles are driving with diesel! The pumps in the fire department vehicles work only with DIESEL !!! So what do you think of? I'm in the fire department too! Should we go to fire with horses and erase horses or what?????! You better go to school and leave it to the adults !!!! ❗️", "susi.cherubini": "😢", "mikkel_christiansen06": "This is because of fucking klimachange please it has Bin like this aleays", "jesse.lai": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "charlieharisss": "That’s jokes why’s it on fire that’s quite dumb just setting your Outen county on fire, probs just wanted a challenge tbf", "josephs030407": "🔥😢😂😍🙌❤️", "melody__labrador": "😲😲", "davlatbekov_shamsulloh": "Friends also subscribe to our channel please do not waste time,,,,, @nature_vait 👈👈🙏❤️", "michae1.gerges": "HlWhy did you do this?", "alvish4u": "I pray for all of you.", "willmonkey49": "@gretathunberg you couldn't give two shits about us Aussies during those fires", "caspar.kevin.8i": "🤢🤮🤮🤮🤢🤢🤢🤮", "baby_ancliff": "The world is in a natural cycle which constantly changing!! You can’t change it happening. The uk used to be a tropical swamp and we are far from it now. Please educate yourself with all aspects not just government scientific info, look into geological record and carbon levels within the ice sheets and your argument will fail", "anne.welby": "vraiment tragique", "matteocera._": "Wie noem je wie mpp", "lukas_carlen_privv": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "konradgerhart713": "🇦🇺🇦🇺🇦🇺", "dsumble": "Very very sad 😢😢😢😢😢😢😢😢😢 from Pakistan", "jakob.tillberg": "All these greta supporters in the comments here are so moronic. Trying to shove their stupid vegan diet down others throats when no one gives a shit. Plus you morons are also promoting a total collapse of the economy. You guys should be ashames of each other.", "fierro3500": "Son los Estados que tienen que poner limites a las industrias contaminantes . Acá tenemos el veneno Glifosato . BayerMonsanto", "yomomagai": "Its happening every year its normal it is not caused by climat change stop lying", "spirri18": "If you become a politician, I’ll wote for you! That would be fantastic for Sweden, and the world! But it’s your life, no one should tell you what to do. You’re perfect!❤️", "akk_og": "Заглянула бы ты в Чернигов, ты бы от этой планеты отказалась нахуй и повеселись.", "rudes888": "Unfortunately you wasn’t there !", "sarahbloodyjane": "I wrote a song regarding the bushfire crisis called ‘dear prime minister’. Its on my insta page (IGTV). Would be wombats if you could check it out 🐨💖", "blue2018_chevy": "If only it didn’t take fossil fuel to grow food we wouldn’t have a problem abandoning it.", "weaver92101": "Yeah you really have no idea how many things use fossil fuel ask the nursing homes that use it to stop", "nathan_hadley_36": "i agree, i am also stupid", "christianhofler": "Why haven't u been in australia to HELP STOP the Fire....ahh cos u were to busy with a school strike and fridays for future u chick 🤦🏻‍♂️ 🎶🎵...all we ever hear is just BLA BLA BLAHHH🎶🎵 u Chicken !!", "oxycontanyl": "Arsonists... But we’re not gonna talk about that...", "maximevan.hattem": "Its not even the climate? Watch the news or something", "amatory67": "Красиво", "brother1748": "Go back to school", "e__lite005": "Who do you expect to pay for all this tho", "silverbil_official": "I find it funny how you say it but probably don't do it", "i_bims_1_robin": "Lecker grillen", "bobby_lewis45": "HOW DARE YOUUE", "5629ghi": "So devastating", "lake_bates_pictures": "Especially sense a lot of people were charged with setting the fires. But yeah, totally climate change", "e_r_i_k____l_a_r_s_s_o_n": "Är det läskigt att stå och prata över alla", "tuvasjolander": "Är det du som tagit bilderna?(såååå synd😢)", "mason.bontempo": "These fires CONTRIBUTE to and WORSEN climate change — they are not CAUSED by climate change. The point is that we need to stop burning things... whether it’s a tree or a gallon of gas or an entire forest.", "i_a_m_batman": "I demand you pipe down you inbred fool. You have no idea wtf your talking about. By the way everything you post is powered by everything you hate you. How do you think those clothes on your back were made ??", "wazgoodjesse": "What are you gonna do?", "colintomlinson11974": "#geoengineering ??????", "fap.jar": "Crycrycry", "logan_carrington": "The fires didn’t start from climate change lol", "_flash300": "No mention of the 20 plus people arrested for started these fires though. Is that global warming too", "rossanarochigimenez": "🙏🙏🙏", "scottvasbo": "😢", "_zacharypopcorn_": "🤨", "cutykatze": "Poor animala😢😢😢", "pojkenlucas": "kosa mu", "fil1p.hb": "On fire wie ein Waldbrandt💥 @therealmoneyboy", "emily_airey": "is it cLiMaTe ChAnGe now that the country is flooding or is it a natural disaster just like this was?", "philipp_kaiserslautern": "Bla Bla bla", "cicheto.james": "This is the result of Greta's Hamburger followers: arsonists!!! Down with Greta Hamburger!!!", "smh.1228": "We’re not in a climate emergency for God’s sake 🙄💀🤡", "simon.freemansimson": "Ask for change in China, Russia, India..guess not..yeah they are the allies of communist leftists..ok keep at hating the democratic west then..", "gavin.terry_": "Do something about it stupid. These firefighters are working there asses off and all you can do is talk about it being done right this second", "larson_fanpage_official": "Imagine there being more than one problem in the world", "rosielea_andthecats": "😢😡😢😢", "blackbird.tt": "210 people charged with arson. This isn't caused due to climate changes. Bush fires in Australia are normal, the plant rely on fire. Before settlers arrived in Australia the aborigines set fire to the Bush land to promote growth and this would stop the major fires we have today due to the Australian government banning back burning in most parts of Australia. The volunteers of the rural fire brigades are underfunded, low in man power. You know how I know all this I am Australian and I have volunteered with the rural fire brigade.", "1treemission": "Please support reforestation efforts in Australia! This catastrophe should never happen again anywhere! #1treemission", "jacob.kennison": "People started the fires, not global warming.", "collin_mcdonald1": "Fuck your dumb everything evelves around oil can’t live without it u liberal", "nevzat_king": "Wer bist du geh zur Schule fühlt sich wichtig", "ma01007": "😢😢", "daniel_one_1": "I love fire 👏🔥", "zuege_niedersachsen": "Fuck Girl its write👍🤮", "_school._.sucks_": "It’s a fucking fire, in the middle of a hot dry summer. How the flying fuck does this have to do with “climate change”", "designdrawing_amy_": "That‘s right 😘", "sam.brook06": "How dare you", "lucas007077": "😂😂😂😂😂😂😂", "vin_the_pizza_roll": "Weren’t there people sent to jail for starting this fire. I’m pretty sure climate change isn’t one of them", "albert_andersson04": "hela lit bhru", "quarantined.weasel": "yet you are all blind that there are multiple Australians being arrested for arson 🤡", "gavin_k289": "When you’re still arguing that the Australian fires were “Climate Change” even though multiple people were arrested for STARTING THAT SAME FIRE", "mag_260913": "Loll ya ok. Good luck.", "julielardner": "😢", "_anxietyisland_": "No one sees that all those changes' side effect is a huge economical devastation. Doing that needs a horrifying amount of money. Unfortunately, there's not enough money. Imagine a poor man from Asia, who barely has money to live. Now, he would have to pay at least twice as much for air purifiers, \"clean\" expensive appliances, filters and all other stuff needed. He'll live in hunger, poverty and sickness. Now, imagine that there are at least 2 billion people in the similar situation. Deal with it.", "verxds": "This is so typical of you complaining and not doing anything 😂", "berdakowy": "Wszystko dla fejmu", "sebesta_pavel": "YES - absolute support 👍👍👍", "apevegano": "@gretathunberg you should speak about veganism, dont you? 🌱💚♻️😘", "hacer_klein": "😭😭😭😭😭", "dumbasscomments321": "You realize that 200 people got arrested for starting bush fires in Australia 💀💀 that's totally climate changes fault", "bootscontainers": "Omfg you think this is because climate its because the water keeps all heat and after that it gos on land and there started an fire and they keep making new fires..", "ellaviktoria10": "So true ❤️", "hacob_jorsey": "greta started the fire🎵🎵", "max.6r": "But in the end nobody is doing anything and nobody cares🤷🏻‍♂️", "tumexpliques": "Al Gore said end of the world for 2020, when Will the end of it for Greta??", "lauti_manf": "Hace algo mamita con quejas no solucionas nada", "alex200929": "I like that fire, it's very beutiful", "silentattidude": "well 1 billion animals died 😞and what now !?????", "embassymtl": "Very very evil empire all society’s are controlled by greed power without a care of the common people or the state of the planet!!! They are lost souls mechanical droids of modern society 🥴", "arionguyon": "Cool fire", "richachaturvedikaul": "This is heartbreaking.. 💔😞", "ryant7g": "Fossil fuels will never be abandoned. If you want to pay everybody's bill for switching then go for it.", "leonrichards.06": "Did I ask", "_moonlightangel9": "#ChenRezig @dalailama", "frank_korsel94": "Okay sorry if I'm stupid but what has a bushfire to do with climate change", "polsejensyt": "Werdo!", "daughterofenki": "So instead what? Use battery powered cars that fuck the environment by the mines needed to make the batteries. You have nothing useful to say and we are sick of hearing it. There are kids your age doing real things to solve the problems yet attention seekers like you are getting all the media attention. None of which you deserve.", "siksa_kubur123": "Do u know meat smoking hmm delicious", "rusty2232rusty": "Do the 180 people arrested for lighting fires in Australia count as climate change ???", "shawnaelleson": "Lol 😂", "bak.verk": "Australis is trying the best", "charly_leeee": "I hope they all burn", "fallon_collins_": "Funny how the fires weren't caused by climate change. They were caused by pyromaniac. 🙄", "gust_aze": "@natan_caet \"Abandonar o uso de combustíveis fósseis\" lkkkkkkkkkkkk Perdi jão, tô rindo dms", "fh_alieren": "They are killing camels. Why you didnt talk about this?", "agent_salinas_1924": "I don’t understand I’ve done more things then you ever have talked to very important people and making changes that drastically support and help many people,but yet your here crying for everyone else to do something that you don’t like and want everyone else to change.", "isaiahpost": "Bitch wtf you doing then, just sitting here ranting about how trump ain’t fixing the world, like he owns the world? How bout you put down that phone little girl and put on a firefighter suit if you’re so concerned and go put out all of the fire. And no way in hell this is a real person that wants to talk like this and be like this, she some government plant ong, why not go to the mall with your friends or do this and do that, no she wants to bash trump and she gets to hold rallies? This is 100% a government plant.", "calvin_morrison_jr": "I am sorry", "_erichoffman": "you do realize the fires weren’t started by climate change right🤡", "fanboy380": "Hahhaha shut up, world", "bahram.sha_7": "😢", "toranjdooni": "😟😰😞", "lydia__fernandez": "@social.justice.alves OTHER: it’s so sad to see what climate change is doing to our planet. forests burning + the animals living in it dying, ice melting causing our sea levels to increase making it very likely to overflow into our city..etc. we have to do our best to put a stop to it, if everyone does, it may stabilize and not increase, because if so, our planet isn’t going to last for very long with lives remaining.", "jetlir86": "Det är inte på grund av oss din iq befriade idiot!!! Det är vetenskapligt bevisat att gjorde går runt solen lite närmare nåt år en vissa andra år. så tröt på alla personen som blir så hjärntvättade av folk som dig!!", "itsfuckingfedee": "Link in bio donate here!!! gf.me/u/xggd6v DONATE DONATE.", "izumo65": "日本の伊方原発とオーストラリア石炭発電だと世界の皆さんはどちらを指示されますか　hiroshima", "marcogio873": "Yes, and so what meaning this? No more spaghetti with tomato and Chianti D.O.C.G red wine?", "excellentkosmetik": "Danke Greta für dein Engagement, du bist einfach bewundernswert und so unglaublich mutig. Du gibst Hoffnung! ❤️", "stormace29": "This is a great thing to say and raise some awareness of the world and inspiring", "yvelcat": "Shut up the forest was lit by people trying to convince climate change is a thing, I know it is but they made it worse to prove it", "luissqf": "The challenge to the bucket of ice", "anastasiakhlopina": "Greta, I am very surprised that you are so worried about Australia? Why didn’t you so worry about Russia in the summer, when our forests were burning ??? Or are you worried only for a certain category of countries?", "__macdelgrillum__": "Y dont want thunders anymore??", "ebbflowdrift": "Listening and acting. I've switched to solar and have recommended my community to uptake it too in my Council meetings and thru social media too. I have been making a switch to non-plastics, am composting and gardening with my kids. I have planted trees in front of my house and am influencing my fellow Councillors to redraw our tree management policy to inject cool zones into the township. I have moved and supported motions to get Council to do away with single use plastics and join the growing number of Councils supporting compostible products in South Australia. I have brainstormed and wrote for change such as our government supporting alternative industries which thrive on renewables, which has been supported by our National General Assembly. I'm seriously trying to make a difference, but I feel Federally we are being let down in Australia - by our government saying yes to oil drilling in virgin Marine territory and yes to foreign owned coal mining. We need to do so much more than leave it up to our government - and you are doing an amazing job of making sure the movement starts with the people. X", "maz.azman": "The most difficult is persuading the politicians. 🌿", "voshavel.a": "Da idi ty nahuy, i bez tebya razberutsa", "jongaal": "Ummm this fire was set by people not climate change", "ady_g09": "This is a little over the top, but i get your point.😂", "itzz_giuliaa": "We are strong we create this!!", "joannemini1020": "Climate change is brought about by the universe not humans 🤣🤣🤣", "hiott_oquinn": "Greta, u mental bro", "brookereith123": "If u hate climate change do something about don’t do shitty speeches saying the earth is dying, Mr beast deserved better", "norwegian_bunny__": "Lol this funny", "theairsoftmando": "AAAaannd this had absolutely jackshiit to do with climate at all. this was 16 retarded fucks that was the cause.....when do ur lil retarded ass get to school or read something factual for once....jeezzzzuz christ lil shits like u piss me off", "lukevd11": "Australia is on fire because of arson😂 not climate change", "osago.work": "Fak", "stoicmicky": "Fires were started by antics and extinction rebellion 200 arrested for starting the fires you will pay for this Greta you will regret this", "valecabralm": "@social.justice.alves OTHER. We must all take action now! Climate change is an injustice to the environment and its species, it affects us all, climate change is real, the world is in our hands.", "chels_jaye": "Most of the fires in Australia aren’t climate change it was mostly arson...", "bradlee.mclachlan": "Climate change isnt even a real thing. 🙄 i bet the world will still be the same 50 years from now. Stop overreacting", "_carolcamila": "😔😔", "jakeyoungs": "Buy me a fuckin Tesla and I'll stop using fossil fuels but until then I still have to drive to work every day 🤷‍♂️", "tatum.walsh.clevely": "You save that fire 🔥", "ketochris86": "Nearly 200 people have been arrested for lighting these fires that devastated Australia. Don’t use your climate change propaganda to explain what happened here. The climate changes everyday... of we were truly in a state of emergency then waterfront houses would be the cheapest property to buy because sea levels are rising. It’s false and not true.", "schuberthasfallen": "No", "harrison.boys": "You realise that by abandoning all fossil fuels it will make the whole world fucking stop. Everyone will suffer and the world will be worst than if it had fossil fuels!!!", "anderson_c99": "2050 third world war for lack of food", "mogantoban": "@geobrus gives me chills! We need change", "_ii.man.ii_": "بنی آدم اعضای یکدیگرند ، که در افرینش ز یک گوهرند . Humans are like organs of one body all made of one thing ، Iranian poet Saadi Shirazi ، If they were allowed I would help in Australia", "lil_rip_666": "words won't change anything", "c795543": "👏 Thak you for the awareness on the climate emergency/crises Greta. I live in Australia so yes my house is LITERALLY and REALLY on fire. I am sure you have seen the horrifying photos on the monstrous bushfires already and so has the whole world which no human has the capacity to fight because of their magnitude and ferocity.😢", "mermaidz15": "😢🔥", "kimilla": "@skyla.critchlow", "lucas.trader34": "Respect", "xceed09": "Youre a fucking idiot @gretathunberg", "feelthebern13": "We're all going to DIE by 2022!!!", "views.news": "The sun will soon be set forever, this intense heat marks the end of the star, which will soon be dark. Repent to Yahweh ..Allah so that your forgiveness and divine mercy may be included خورشید بزودی برای همیشه غروب خواهد کرد ، این گرمای شدید نشانه پایان این ستاره است که بزودی تاریک خواهد شد . بسوی خداوند توبه کنید تا بخشش و رحمت الهی شامل حالتان شود سيتم قريباً تعيين الشمس إلى الأبد ، وهذه الحرارة الشديدة تمثل نهاية النجمة ، التي ستكون مظلمة قريبًا. توبوا على الرب حتى يتم تضمين مغفرك ورحمتك الإلهية Il sole sarà presto tramontato per sempre, questo intenso calore segna la fine della stella, che presto sarà al buio. Ravvediti a Yahweh affinché il tuo perdono e la misericordia divina possano essere inclusi Солнце скоро зайдет навсегда, этот сильный жар отмечает конец звезды, которая скоро станет темной. Покайся с Господом, чтобы твое прощение и Божья милость могли быть включены Die Sonne wird bald für immer untergehen, diese intensive Hitze markiert das Ende des Sterns, der bald dunkel sein wird. Bereue Jahwe, damit deine Vergebung und göttliche Barmherzigkeit einbezogen werden El sol pronto se pondrá para siempre, este intenso calor marca el final de la estrella, que pronto estará oscuro. Arrepiéntete a Yahvé para que tu perdón y tu misericordia divina sean incluidos. Le soleil sera bientôt couché pour toujours, cette chaleur intense marque la fin de l'étoile, qui sera bientôt noire. Repentez-vous auprès de Yahweh afin que votre pardon et votre miséricorde divine soient inclus", "samedaydiffrentshit": "You can all slit ur wrists and slide into a warm bath if you want the world to be better 😉", "charliemm_13": "Haaaaa", "vovanpwnz": "Как обычно хуйня какая то #", "berkeleyconstructiongroup": "Just for you guys stupidity, more then 35 fire was set by kids age from 17 to 25. And I’m sure , the activists of climate change where beyond this to pressure there agenda", "turkeymustach": "👏", "je_rosa.flor": "Tobacco plantation destroys the environment too, for that it needs deforestation of nature. Whereas cigarette kills millions of people worldwide and it still affects passive smokers. against tobacco nobody protests right?", "leonardogomes112": "Só agora que você fala né mercenária", "geil_haft": "HOW DARE YOU", "mustixhoney": "How dare you!!", "ihcizxutxugcizc8zci": "She thinks posting a photo of fire will help australia lmao", "victorhugo4130": "😭😭", "charlygalzin": "Trop stylé on devrai en faire plus des feu comme ça 😂", "oleluleich": "Nur zur Info es brennt", "_n.base_": "Beginning in China with you CO2!!!!", "ajd_dalpiaz_25": "@Gretathunberg só sabe falar besteira, sua piralha.", "chromethius.56": "Shut up", "rasmus_moutain_bike": "🔥🔥", "lbinsk99": "Now i know you’re just a liberal puppet greta jesus i liked the movement at first but these Australian fires were all man made so nice try", "berserker785": "Actually, over 180 people have been arrested for starting the fires in Australia. Some intentional and some not. This has nothing to do with “climate change” and you’re globalist agenda.", "braydenmann7": "Like fuck off, this has nothing to do with climate change u little fuck. Gtfo your phone and go to fucking school", "victor_zink": "save forest! forest will cool earth! We need to restore forests after fires! if we plant a lot trees then forests will reduce CO2! You exhale CO2, so it is useless to fight emissions if there are no forests.", "lilivanfreitag": "🙏🏻😞👏🏻👏🏻👏🏻👏🏻", "hugo_chanz": "That looks so cool", "kevinvanhu": "The climate is not the ground why Australia is burning😡", "bendy_hendy": "How about all these vegans stop picking on a 17 year old who has more guts and balls than all of you put together! Literally, just stop being mean!!", "banana.biker883": "How about instead of using this for your political agenda you actually help?", "daniel.kiesow": "Okay Greta, let's get in touch. If you not only want to talk and demonstrate, but also want to come into action as far as our planet is concerned, please contact me. Dear greetings from Frankfurt Germany🙏🌱", "piet_kske": "Any proves that this is couse of Klima???", "camille_kahuana": "Video THE DARK SIDE OF : https://vimeo.com/386567399 Australie in on fire and the Us Open is playing as always on January. No matter what happens !", "mat_tin.b": "#schoolstrikes4climate", "tommy01122002": "Lächerlich", "matt___ello": "Bruh this was the work of arsonists. Dead ass.", "croatian_car_collector": "DABOG DA IZGORILA TU!", "jared_seiya": "This wasn’t even climate change they arrested over 200 people for starting the fires you idiot", "niks_klaus": "👎👎👎👎💩💩💩💩💩💩💩💩💩", "jord4n.wing": "Then how u suggest we do it then if ur so smart mate?", "annasmemories": "💪🌎", "swaggyp_yt": "i already know what your gonna say. it’s trumps fault! y’all are trippin! 🤡🤡🤡🤡", "josephraymond_fineart": "@gretathunberg You DO KNOW that 183 people were arrested for arson right?🤦🏼‍♂️ Sorry that doesn’t fit into the narrative, but it’s truth.🤷🏼‍♂️", "jana.24.10.83": "Was für eine scheisse sie Labert....den Klimawandel kann man (Mensch) nicht ändern....rafft sie es nicht...🤦‍♀️Klima ändert sich jeden Tag ,jede Woche ,jeden Monat und seit tausenden von Jahren....", "cosette.cassette": "🌲🌲🌲", "_samandrew._": "Umm I think theirs rain in Australia 🤡 climate change isn’t it", "arsh_snowshower": "@stormydaz2 Honestly, calling younger generations is pretty stupid. Considering how you say something as dangerous as a claim change is a hoax is arrogant. 1971 was nearly 50 yrs ago. If it wasn't obvious enough, fifty years is a long time. Half a century. Let that settle in, because in those fifty years, a lot of our ice glaciers have melted into the ocean, causing floods. Animals are endangered and some still going down despite getting help. There is a lot of pollution going up into the air and causing dangers to not only humans but animals. Have you seen what happened to Delhi due to Pollution? My cousin hadda move outta that city. There is the plastic island that is still existing since past, basically, over a decade. Yes, the sun is expanding, no doubt, causing Earth to grow warmer. But because of us humans, we're killing our Earth faster.", "brandontoman18": "This wasn’t caused by climate change hat to break it to you", "smexxy20": "She does know that people got arrested for setting these fires and that climate has nothing to do with it. All this girl can do is act and read from a script.", "manjukunwar1": "💕💕💕", "clayandcoco": "You don’t know what your talking about do not use Australia for your rants, back burning should be aloud here and clearing blame the greenies and maybe learn from the indigenous and also the fact we have had a drought which as been happening for forever over years and dum kids throwing a crate on fire into the bush because there halfwits not right in the head . Don’t tell us when we’re going through hell here and volunteers as people have lost life’s homes and the poor animals instead donate to the cfavic and nswrfs and wildlifewarriors and wireswildliferescue and the Red Cross and many other amazing organisations and we thank the ones that already have you do nothing but talk", "tom_ow_mtb": "Why do you do have a ln instagram account? Do you think marc Zuckerberg is standing before and is blowing? 🤔🤔😂😂", "gentlelady_91": "Shut the fuck up @gretathunberg", "marcelloo_23": "Tu lo que eres es subnormal", "lisasignor": "@cynthisouthe", "grayt_gray": "The Australia fires were caused by arsonists...", "masa_shitpost": "Que buen asado me hacía yo", "xl_ayuso_lx": "Apagalo tu", "spencer71405": "Shut up Greta Australia has a wet and dry season ... there are always fires some larger and some smaller ... u are dramatizing the already dramatized topic of climate change ...", "damon_2a": "I hope those people that started those fires get torn from limb to limb . 🤦🏿‍♂️", "meduzza369": "You sound like a damn fool", "timmo_35": "Are you aware that 200 people have been arrested for starting fires here in Australia.", "amanda_dickins_12": "Ok Greta's dad", "sandramarisapaladino": "💪💪💪❤️", "fabriziolorenzoni": "Its Bolsonaro fire 😂😂😂😂 or trump kkkkkkkkk", "mistressofsenses9": "We r not in a climate emergency. We are in a political pantomime and your the latest recruit Please. Celebrity activists are the latest trend", "truebrit2k20": "@gretathunberg you do realise this bushfire was caused on person by 200 individual's and they have been arrested for the arson attack stop pushing your lies 30 years they said you wouldn't be able to go outside due to acid rain @gretathunberg you are a massive liar", "love_to_draw_horses_that_dance": "😭😭😭", "jamesjanse": "While the US just wants to be #richonadeadplanet ☠️🌎", "drlexwinter": "All the fires in Australia were started by arsonists and accidents. They started the same month ISIS magazine encouraged 'jihad by fire'.", "_bellskijr.11_": "Smell like barbecue", "pcanham54": "Heart breaking what we see on the news", "olliezzzielezna": "O my fucking god retard it’s coz cunts like you and the greenies don’t let us back burn get farked", "jenny_71003_16": "@gretathunberg du müsstest dich mehr für Australien einsetzen 🤬🤬", "x_lolafrancis_x": "I agree", "_fanside_avatar_germany_": "Stop it", "tomsemp": "Fires set by careless people", "captainfinest": "Started by Islamic radical arsonists ! NOT climate change - FACT", "marie_chvedko": "😢😢😢", "ruby33789": "Make that 21 others!", "howlett_thomas": "People are trying to stop these fires all your doing is talking then walking away if your going to strike DO SOMETHING ABOUT IT", "walkingaplasticbag_cleannature": "People like do not help. Sorry you are just propaganda. Have you ever lifted your finger to pick up garbage have you ever sacrificed anything apart from being in media! Hope you will be glorified later as you are now and not like modt who have been on Time magazine 💚 https://m.youtube.com/watch?v=dSH-x6DhfW0&feature=youtu.be", "sarah_plaque": "❤️", "biljna_ljekarna": "👏", "darkwave1984": "Shut up you puppet", "saskiamediummineralwasser": "\"Climate emergency\" a sane person would call it ARSON", "iamofficialismaela": "#australiaanimalsrights #australiacamels #australiaanimals 🐪🐪🐪🐪🐪🐪🐪", "romaromute": "😢❤️🙏", "zaborszkyattila": "It is tempting to try to ban fossil fuels today. The result will be millions upon millions of people dying in starvation..... and that will be the spectacular effect . Think creative and smart not just on emotions and feelings . Acting on emotion usually cost more lives then climate change could ever do", "leeyabeckman": "Every firefighter is exhausted I wish I can give them a hug", "vicenzodamasio": "It’s natural stop being boring", "wallacesilvago": "E você faz oque pra isso parar de acontecer? Quais suas obras? Você é apenas uma mimadinha de rede social.", "milkshxaebear": "God is with you", "jack_keeley_": "Want a bbq @charlie.k_370_", "liletronix": "Hahahahaha🔥🔥🔥🔥🔥🔥", "gregommmmmmmm": "😱😱😱😱😱", "hbk_vonjo": "That party was fire ngl", "aaronrsalazar": "This wasn’t even climate change. A arab got arrested for arson along with a like 10-20 other people🤦‍♂️", "_gentzschii_": "Hoffentlich verbrennt greta Thunfisch da drinn 😂🖕", "cantini_06": "Beneeee caaaaa @lucasani06", "a_mantinha_do_miau": "😢😢😢😢😢😢", "israelsson_": "Good", "erins._.priv": "That’s a shame", "theostroombom": "@liamstralin", "felixhallgren": "@liamstralin", "t.jelinek1998": "Lol", "jozze01": "protestar com cartazes e gritos não vai mudar nada, so vai perder tempo, tem que tomar devidas providências e com democracia, se n nem adianta", "wandrinaround": "But these fires were stated by arsonists.", "homesteadingonthegrid": "You fail to mention the people arrested for starting these horrific fires...would you like to explain why that is? Crushes your climate “emergency” narrative a bit doesn’t it?", "413hooligan": "You spelled arson emergency wrong- these fires were intentionally set, up to 180 people have been arrested. Report facts, not propaganda- how dare you?!", "climate.it.facts": "WARNING our posts are too real for you @klima.facts 🔥🔥🔥🔥 You won't believe us... Go follow!!!", "evisirtindacocuk": "You are so stupid greta !!!!", "henriettemx": "we have to chance", "saretta1306_": "hai fatto una pereta pesante eh", "brock.godfreyy": "It’s not climate dick brain it’s you idiots not letting us back burn you flog go back to school and learn so common sense ya dawg", "diogo_santos053": "😍", "e_staa": "these fires have nothing to do with the climate, panic sowers for nothing. in egypt there is snow for the first time in 122 years. is the earth getting colder now ?. think the weather maps are moving. this is just bullshit. sick people", "feni333": "It is true that it is a climatic emergency that needs to be acted upon. to all governments, companies, institutions, banks our world needs us we can all make change. 🌍🌎🌏💖💫✨😎✌💖💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💫", "scientist.for.life": "It’s ARSON not Climate Change. These were man made fires. Almost 200 people arrested. Why you encourage stupidity?? 🤦‍♂️", "_iandooley_": "Remember when hundreds of “climate change activists” turned out to be ARSONISTS. Petty and ridiculous. HOW DARE YOU.", "wtf_dima": "2020 started really well! It started with a fire in Australia and with the risk of ww3 wow kkkkk you can't live on this planet", "ollieryan64": "and you think this i a “climate change emergency”?", "notnormalmeme": "Ah okayokay", "elliot.balaj": "How dare you", "zippel_xr5i": "Halt die fresse du Kind. Keine Ahnung von nichts schreist deine Probleme in die Welt aber das was du willst geht nicht einfach so. Geh zur Schule so wie alle normalen Menschen. Jede klimasktivist der sich das nächste mal vor mein Auto stellt bekommt versöhnlich von mir eine Maske mit Schlauch zu mein Auspuff das ihr endlich mal klar kommt in eurer Birne. Null Plan von der Materie aber sagen ahh mir wurde meine Kindheit genommen. Welche Kindheit du bist mit mehr Geld auf gewachsen als ganz Afrika. Also sag nicht das dir deine Kindheit genommen wurde", "ryan_penney420": "Well if green peace let Australia do controlled burns of high risk fire places the fires wouldn't have go so big", "alexsukhenko_": "This wasn’t caused by climate change 😂🤡", "evieleigh55": "How dare you", "jossiebarker_": "Same with California fires. All man made part of the agenda", "nathan_walters1_": "you know that almost every fire was arson not the climate", "patriotfromla": "Hmmm the arsons didn’t help your agenda did it ya cunt", "yennis.djg": "@mmbg59", "j.neeson03": "@gretathunberg how long did it take you clean them ditches 😂", "llucianabarros": "💚💚💚💚💚💚💚💚💚💚💚💚", "darthjacensolo1": "NOT CLIMATE CHANGE!!!! These fires were caused by arson, many of suspects are your supporters! You are a fraud and a communist.", "wahlstrom.oliver": "Du är bäst", "daniel_king2104": "fuck off happens every year", "lessx5": ".... yeah those damn assholes that started those fires i bet they were Democrats 🤷🏼‍♀️", "lisa.hsh": "The fires were mainly caused by arson🤔Not climate emergency", "cristian0963": "ciao", "reborn_love_3": "😢😢🔥😢😢 this is very scary😢😢😢", "yishaa.x": "Lies and lies that they have told us that the fires were caused by ‘crazy’ people but it was actually the climate crisis. People don’t realize that they can’t hide forever the real truth from themselves...", "the_murkin_dude": "Yes, the fires are bad, but to stop them we need to arrest the arsonists that have started the fires, the climate didn't start this destruction in Australia", "marszalek_guillaume": "En voyant ces images, le réchauffement climatique avance de jour en jour, d’année en année et si on fait rien, l’humanité va mourir car si les forêts brûlent une par une alors le taux d’oxygène va diminuer et il y a aussi les animaux qui vont disparaitre à cause des feux de forêts, le manque de nourriture, le braconnage.... Pour sauver l’humanité et les différentes espèces animales, il faudrait que les différents pays travaillent sérieusement ensemble et il faudrait écouter Nicolas Hulot, Greta Thunberg... car ces personnes sont ceux et celles qui se préoccupent pour l’environnement, le réchauffement climatique, la sauvegarde des espèces en voie d’extinction....", "thomas_padovese": "Viva la plastica bruciamo le foreste porcoddiooo", "giacogobbato": "Ciao", "bianck4": "🙌🏽🙌🏽", "bosseboss59": "Soon the fire will increase. Get rid of the coalindustry !!!👍💚", "matheprofi11": "Wie kann man diese THUNFISCH GRETE möge", "we_can_save_the_eart": "It’s awful", "jamarcaroline": "dank je wel hoor👍👍🤗", "stoler420": "having fire exstiguishers rooms with spriklers rembering grease fires have gota git smothered withhh bakinggg powders maybe extiguished prevents arsonist that's myyyy kinnd a hero", "rodinada93": "I think you can start with yourself and for example sell tesla car and donate thic money for firefighters in Australia. Stop useless striking and speaking and start doing real things.", "mrplanteverte": "Arrêtez de dire que le feu en australie est a cause du réchauffement climatique criss, c’est un incendie criminel et ça l’a été prouvé", "greenspacessa": "GreenSpaces Africa plays hosts Africa Green Cycle Tour in December this year...we are tree planting-community connection initiative yet we are encouraging communities to clean their back yards as there is too much lying around..cleaning rivers as we...Anybody interested in Cycling For A Green Cause please email us at greenspacessa@gmail.com", "__jake.palmer__": "🤡🤡🤡", "cameroncoates25": "Not like they arrested 183 people for starting the fires or anything", "rocky_mountain_racing_review": "@gretathunberg hahaha you know people started the fires not the climate hahaha. Youre just a dumb child and have no clue how the world turns. Lol. Dont tell others how to live win you dont know how to. Way to stage pictures on the trains you liars.", "lena.carlstrom.75": "❤️❤️", "authorshaunchapman": "The fires that have ravaged our world from California, to Brazil, to Australia, to Portugal . . . these are only the pangs of distress our world is facing . . . in the future they will spread to the large cities casting their shadow over our civilization, a civilization that we think will continue for ever . . . WHAT MAN CREATES NATURE WILL DESTROY!", "bigmike_ny": "you dummy. they arrested like 10 people for starting those fires", "marianaalucena_": "This picture is so sad😭😭", "sarahagoebel": "ur crazy", "maddyrose203": "Well you know how there’s like skin cancer? Well they cut around it", "shrimpo1": "Gretathunberg, It is fine to tell us what to do to save the. Planet. Why. Not get over to Australia and do some REAL work to save our animals, flora and property- your words are shallow unless followed through with action😕😕", "solomikey31": "Australian fire was done by an arsonist.....PS Climate change is a lie just like Al Gore's 2000 global warming", "_andywayne_": "It’s literally a cycle!", "brianna_evans_111": "What are you going to do about it? Are you going to donate money to stop the fires? Send food or anything to the victims? Add a link for us to donate to?", "archiekeogh1": "❤️", "khushrooirani2000": "#gretathunberg how much money have u helped raised for fighting the Australian fire? U just talk big and cry, thats all u do and u will do", "hfromsix": "These wild fires are not because of climate change! They were started by individuals", "_paparice_": "Also sell your Yacht that's bad for the climate as well", "wetakenote": "Lil baby pyro 🔥", "eamon.sweeney_": "Jump in to the fire", "kevin_collaris": "This January was the coldest January recorded ever in Australia. Shame on you putting falsehoods into the world", "proudtobecroat5473": "Nous ne sommes pas tant dans le changement climatique qu'il y a de pyromanes protégés par la loi. ne chie pas", "levdzhungli": "😯", "g.pat": "😢😢😢", "bendean0": "How dare you", "elizabeth_gotta": "Litteraly people lit that not climate change Greta please correct yourself", "jorge.serra11": "So why dont you go and help to stop the fire with the firemen instead of writing bullshit.", "selvini.riccardo": "Tinpuzza il buco dell'ozono", "melvinjarlesater": "Jag och @melvin_holm_townsend06 ska kasta in dig i elden", "isabella__odea13": "This is not climate change do u know Australia had heat and that’s why we get fires and there called spot fires", "martinabikhan": "😣", "gabrielle.rea": "@gretathunberg I understand that you are trying to do a good thing.. kick start a new movement, but please refrain from using Australian bushfire pictures to push your agenda. I was affected by these fires and you are not here. You are listening to media reports. You aren’t living it! Find something else.. don’t use our fires", "mybiocase": "You want to act against climate change? Visit our profile we have a solution for you! 🙌🌿😍", "asiessino13sino": "i love fire", "harome.frick": "This “climate emergency” was set by 200 arsonists you tool, like shut the fuck up and stay in school and out of politics, you’re not saving the planet and you’re not special for having your childhood ruined, like the kids mining your cobalt for your electric cars that you want so much", "x.natur_fotos.x": "But today all people only see the money and that it's very expensive to change something so they won't do something that costs a lot and unfortunately today nothing works without money and that's the worst...", "tylerlavigne1": "TOO BAD CLIMATE ACTIVISTS SET ALL THESE FIRES 😭😭😭🤣🤣🤣🤣🤣🤣🤣", "micheifmanaged": "Climate change needs to be changed", "cenz_official": "No its called a bunch of A holes 🕳 set the forest on fire 🔥.", "zackzerwick": "If u want to make a difference help the people who lost their homes in the fires because it looks like all do is talk the talk but don’t walk the walk", "dariaelsuni": "❤️❤️fight for the climate", "krukkrukenamers": "Do something🦠", "dilriczamriv": "If obvious I think I am worth it 🍀😁🌈🌈🌍🔥🔥🌥️⛈️🌏🐍🐆🐇🔫🔫", "bocddu": "ur posting on instagram and im praying for rain whos helping the most?ME", "summitandrei": "Then stop talking and start doing", "maloney.99": "nothing to do with climate u some dummies fr, imagine believing everything this girls handlers write for her", "speakingbroadlyshow": "#SocialRevolution2020", "danielcerroni": "Yur an idiot my guy. The fires were started from PEOPLE not FoSsiL FuEls", "mattguichon": "Have you tried yelling “how dare you” at the fire? Might help", "donating.to.charity": "please help donate", "nightwi1derness": "in 1980s I'd write \"SPIR!T Stop Pollution In Rochester! Today\"🔛 restroom🚻walls@#RochesterNewYork & tell ppl💚#ecology is#️⃣1️⃣Priority🔛🌎#Earth & no one Listened to me, but🌐World Listens to Greta (a little🙄) I Never buy cars only🚲🚵#bicycles I Always: #RRR♻️=#ReduceReuseRecycle ⛔🏬🛍️#ShopLess 💚#BuyOrganic ♥️#MotherEarth 🌎🌍🌏", "loganshtat": "No one cares bitch", "anderbar7": "Greta Marioneta", "darrenyew_": "abandon fossil fuels and u won't be able to conduct ur rallies lol, stop being retarded", "salmanova_medni11": "Молодец девочка", "kadenhart26": "U make us Sweden’s look bad", "thisisourhome_ourplanet": "I believe in Greta. She leads the youth in the strike against our climate, and is brave enough to go out into the world and fight for our futures. I wish I could be a part of this", "espaco_mulherdeverdade": "Hipocrit...😒😒😒😒", "anili_anili30": "Good afternoon. I'm begging you for help. don't pass by my trouble! please help! it's hard for me to live and I'm thinking about dying. just help me, please!", "andiemac22": "How about a bushfire solidarity sit for Australia? 🤷🏻‍♀️", "theres.no_planet.b": "😢😢😢", "divimityy": "Imagine saying shit everyone has been saying before.", "lucasbugeja": "For all information please go to the NSW rual Fire service website. Any US based murdoch owned media outlet seems to be running with Arson. Arson isn’t something that is happening here as it’s being reported", "gustavoprovasi": "Eeeeee Bolsa", "d_b_a___": "You fellas smell that? That caption has some strongly scented 💩 in it", "cusack_": "Listen to “TheSecret” and you may actually learn something....Like attracts Like!! YOU R creating your prob!! @gretathunberg 💝", "elisabethdesvalois": "Melle qu'est ce que vous faites par rapport à l'Australie", "senio.crocini": "🔥🔥🔥🔥", "barley._.bear": "Save the planet", "tiagodiasharket": "With this climate the world is in a terrible countdown ... we need to stop this clock!! 🕑🌎🙌", "supervegetablu": "The plan >>> @savearthnow2020", "btw_zxnxn": "How dare you", "neutral_i_am_2020": "Climate change is fake!!!! The world is 2° C colder than it used to be 10 years ago, talk to a damm real scientists!!!", "reslpanter": "💚💚💚💚", "_christopherlaatz_": "Looks lit 🔥", "medic_bdraw": "Arrest all the arsonists. The fires have literally nothing to do with the climate.", "katjusha1411": "We are with you Greta 🇩🇿", "tomas_teixeira11": "Are you the one that is going to pay for my expensive clean energy? Not everyone has a good life in the Nordic Countries...", "danieledwardlevy": "It’s time to Go Vegan! Be kind, be just. 🔥🌱💪", "larrygolden76": "Who are you to \"demand\" the end of fossil fuels. If you just ended it , you have NO IDEA what it would do to economy's. You are living a pipe dream, but showing you immaturity. Please make sensible comments if you must.", "joe_buggin": "Australian fires 🔥 started by arsonists, not climate change. #ecoterrorism", "the_garden_farmer": "Lol...climate change is a cycle...noone is talking about how the rest of the solar system is heating up too. It's all a farce. Example...aussie fires right? Well...I can name 4 major counties that have HAARP programs or giant tesla coils...that have the ability to push rain where ever it's needed in the world. \"They\", wanted aussie to burn X amount , so that a specific outcome or distraction was achieved. We have the ability to control weather...this isnt a fucking secret and isnt science fiction. Do your own research.", "bryceporterfield": "Except it wasnt started by Climate it was started by arsonists that got charged....", "mylene015": "Fahr nach Australien!!!Du kannst doch was bewegen!!!Hilfe dort die Tiere zu retten..die Klimaaktivistin", "cammie_cmck": "@gretathunberg And yet 183 people have been arrested for starting the fires therefore climate change cannot be blamed solely as you say", "maximilianhattersley": "Are you retarded. Great way to end the world faster from an economic crisis. Nice one", "lil___mil": "Not when 189 people started it 🤡", "sundenalvin": "Lycka till att göra det nu", "50sburro": "@lorenzo.todesco va tutto a fuoco", "ricks_life_reality": "Member the Bush fires in Australia from 1975? It was way way worse as this. And we all restored.. The earth there restored... Stop spreading fear and hate and go back to school. And hello Gretas dad. Get your kid back to school. Talking about stolen childhood. What child goes around the world over the ocean... Hypocrites makes me puke", "lil_weed.__": "U travel with a fucking plane and u talk about change pff that's dumb asf as fuck and it isn't like everyone can effort a new electric car", "emanuel_corazzini_9": "Oh no 🔥🔥🔥", "marvik__": "How much did your daddy George Soros pay more than 100 people to start those fires? #SorosPuppet", "cl.ayton22": "Climate change isn’t real😂 someone literally admitted for starting these fires. I say we let God control the weather too. Over yonder might be getting hotter, but down here it’s getting colder. That isn’t climate change. That’s called ‘Mother Nature.’", "rabbo07": "Shut up bitch", "tobj2": "Kleines Feuer für stockbrot", "warren.sg": "Yes indeed.", "schlicht_inspirierend_design": "🌎👍", "0029284b": "We aren’t in shit. Just look at the people getting locked up for arson", "crisdan420": "Haaaa Gay", "audreylarlis": "Hottest decade on record-that’s gotta prove something to the unbelievers", "lozareale": "👏🏻👏🏻💪🏻", "jstn.ritr": "The earth is Done with us.", "ana_ixchel": "@elisafrosali ya vamos a separar la basura", "stijnvanloon_6320": "Gij kut hoer", "will.iv91": "Yall some idiots 😂 people were actually arrested for starting the fires", "mike.harrison66": "Slight warming trend, big deal, adapt or die.", "ashish.agra.india": "💚💚", "gustav_04_hallgren": "Går ju att grilla korv där nu", "alex.faye13": "Climate change did not cause Australian fires, environmentalists banned burnning the dead grass so it cant regrow. Now its atarted fires. I understand what your trying to achieve and i admire you for that but we need to burn the dead grass.", "jotaka71": "We don't... @diegostnunes 😢", "dokedoyle": ". . go back to school @gretathunberg", "jared_aka_makaveli": "There's to much greedy rich motherfuckers that don't want to help if I had a change to meet them I'll kill them all 💯", "rico.aviation": "The world deserves to die and it’s not fucking climate change. Were there cars during the change from the ice age? 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "joardanielsson9": "@liamstralin", "n1wes": "fürio de zeusli chunt", "flamingo.soniaa": "Hi there! Gretta, I'm proud of you and your actions! you will save the planet! please help notice my latest post on animal abuse! post a photo or something! I also want to save the planet from problems😢😢😢", "dominguezraydel": "💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💛💋💛💋💛💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💛💋💋💛💋💛💋💛💋💛💋💛💜💛", "mutlusaritas": "To those who say that climate change is a drivel, or a hoax: if the climate change is a BS, as you suggest, than explain why it doesn't rain or snow this winter in some parts of the world like the east of Turkey, the weather forecast always shows sunny, partly cloudy or foggy when it has to snow in the middle of January where I live: https://www.mgm.gov.tr/?il=Sivas.", "tahoe4us": "😰🙏🏻❤", "villainqueenlioness": "i believe in climate chamge and this is very scary and i want to change it now😱😱😱😱🤔🤔🤔🤔😨", "ur.mum.sweet": "Was machen Sachen?", "moushy.h": "Like actually shut up if it makes you feel better I use my diesel excavator in Australia and I turn eco mode off", "nick.palka": "Bruh it’s -52 here in Alberta", "theclownphotography": "Message me through direct", "woodard.dane": "Not climate change the polar icecaps melt every few years then freeze back over do your research", "9.1.6": "Witch 🧙🏻‍♀️", "thiago_br_eua": "🇧🇷somos poucos que nôs importamos com isso e não temos nenhum poder mundial enquanto as pessoas que tem esse poder e podem usar dele para impedir chingam agente falando que isso é bobagem esses líderes mundiais que podem resolver isso estão cagando pra situação do planeta🇧🇷. 🇺🇸we are few that we care about it and we have no world power while the people who have this power and can use it to stop them cheating agent saying that this is silly these world leaders who can solve it are shitting on the planet🇺🇸 🇪🇦somos pocos a los que nos importa y no tenemos poder mundial, mientras que las personas que tienen este poder y pueden usarlo para evitar que hagan trampa, dicen que esto es una tontería, estos líderes mundiales que pueden resolverlo están cagando en el planeta🇪🇦. 🇸🇪vi är få att vi bryr oss om det och vi har ingen världsmakt medan de människor som har denna makt och kan använda den för att hindra dem att fuska agenten säger att detta är dumt dessa världsledare som kan lösa det skrikar på planeten🇸🇪", "nanyori99": "Where are the stats on animal agriculture and how much methane emissions come from this industry?", "krusty_kristan_": "Imagine having autism lol", "memesargeant": "The Australian wildfires are just god deleting his DLC.", "a.safford99": "Do you know that climate change isn't real?", "the_rossmann": "Hi! Does anyone want to help me to convince the World Economic Forum that serving meat and dairy at their Annual Meeting in Davos, at the end of this month, is wrong if your main focus will be SUSTAINABILITY?!? If you are with me, please write them an email with your concern about it. They have a Sustainable Manifesto on their website, dedicated to this event, their idea to be sustainable is serving one vegetarian, not even vegan, meal during the 4 days of the meeting. How can they pretend to teach or lead the world to be sustainable if they will serve dairy and meat (proudly local, as they specified)? Please help me! They can ignore a single person but they can’t if we are together. This is the email address: sustainability@weforum.org", "don.lives.on": "Change starts with YOU. YOU need to change. If EVERY follower on this account changes, that sends a message. DRIVING to the farmers market does not send a message. STARBUCKS does not send a message. If YOU want to change the world, change YOURSELF first.", "matttmfg": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "hanzlfkri69": "180 people got arrested cuz of ur bullshit", "smg4.waluig.time": "Go to gulag", "tamara.rubanowski": "💜", "emrik08": "What is this bullshit, this is totaly normal it happens every year, this climate changes aren’t real, do any one remeber the ice age?", "tommysotos21": "Buddy those fires were all caused by humans maybe if u we’re in school u would know", "lefty_business8187": "What about the people who got arrested for lighting the fires", "gustavoferreiramusic": "Lies and more lies Criminal fire", "tjw111": "Calm down Greta! Go back to school!", "miguelprze": "https://greenpeacefilmfestival.org/en/film/amazonia-le-reveil-de-florestania/", "big_time_chitown": "🤡🤡🤡", "pdx_chris_84": "RETARD", "davidasher85": "Your dad write this for you too?", "travis.h.mayo": "I hope people see this, but it is not from climate change. 50% of these fires were started by arsonists. The other 50% were by the dryest conditions on record in Australia cause by El Niño in the Pacific Ocean, and positive Indian Ocean dipole effect. Imagine having a Facebook account run by your dad and some Indian dude. 🤡🤡🤡🤡. Greta is a hypocrite sorry it had to be said. Even Sweden said that her policies were the biggest waste of time.", "ingersollteachers": "So your whacked-out father and an even more whacked-out Indian climate flake writes all this baloney? What a fraud. This poor girl is just a prop for an agenda.", "avaenvie": "☀️", "bean_boyj": "Your parents should have used a condom", "nerakkane": "Omg....🙄", "scottd_0125": "Oh trust me we will be in mars by the time u fix climate change", "chrissiflessias": "GRETA WE DONT NEED YOUR HELP FUCK OFF", "schneiderei_neutor_graz": "@live4experience", "mikefla_tenn": "Junk science lunatic", "shreyapat11": "Yes two hundred people were arrested for that fire. So yes it is cLiMAtE ChANgE", "sebastiann_santanaa_ctm": "🤡🤡", "your_local_morron": "😂", "ryweav": "How daher you", "t_bryson206": "This isn’t from climate change it’s from people burning brush fires", "jose.ph_216": "Yag", "cadenlangley": "when your dad writes all of your social media🤡🤡🤡", "oskarholmgren_": "Please Greta, i Think that the government in these countries knows better then a 17 year old girl from Sweden", "antoniopedrodacru": "🙏", "nelsonkades": "PENTELHA QUERENDO SER FAMOSA COM TEXTÃO!! 🇧🇷😂😂😂😂", "contra_omimimi": "Vai procurar uma barbie pra tu brincar vai 🙄", "losangelessos1": "Scott Presler has done more for the Planet than Greta Thunberg", "marmoon830": "Thank you, Greta! You are an inspiration!", "sanergiatheworldone": "Salvar el Mundo es una obligación de todos, porque siempre que brilla nuestro corazón, surge la energía universal, https://www.dailymotion.com/video/x7pak9p", "2muchadulting": "Smh. You have a lot of growing up to do", "trinquitronqui": "deja de llamarme bro, no puedo quedar contigo siempre", "zak_starke": "Exposed exposed exposed💀 except everyone knew you were just reading what your parents were forcing down your throat without thinking for yourself!", "thatcattleguy": "FAKE! FAKE!!!🤣 How come it is that yo dad is writing these? Huh? Oh that’s right because your whole family is fake!🤣🇺🇸🇺🇸🇺🇸 #trump2020 bitches!!!!🇺🇸🇺🇸🇺🇸", "betchy_bink": "Fuck you’re stupid.", "_casparmainwaring": "take an L greta 183 people just got arrested for starting it. It wasnt climate change have a day off", "kane_1664": "Im pretty sure wildfires are made to burn down the forest, cuz they kill all the ild and dead stuff, basically its like Mother Nature cleaning her self", "pelitajewellery": "And the meat - agricultural industry !", "kun_rrrr": "🤡🤡🤡🤡", "u5t9371": "Lil stupid bitch", "1312_dynamosieg": "Huhre", "mel_nelson18": "❤️", "joel_brotschi03": "How dare you👀😂😂😂😂", "colonelcub": "BUSTED! HAHAH!!", "karakoyun333": "Hi greate how are you?", "chilot17": "she's fake guys , she doesn't even write her own post on Facebook", "3nd_my_life": "Whole meme bruh 😂💀", "michael.atan": "Hi, Svante.", "302mikeeey": "Climate change is fake like you", "evama38": "Australia Is Burning: Blame The Greens & The Arsonists!!!!!!! The Green police discarded temperatures all over the board and manipulated early temperatures lower!! #UN #SCAM the climate police discarded a record high temperature because the person who measured temperatures did so on a Sunday. They claim the recorder was not supposed to be working on Sunday, thus the record high should not have been recorded.  Of course they moved thermometers to airports with increasing numbers of planes and hot asphalt, etc. And finally, they switched to electronic measurement recently which tends to be hotter than mercury-based thermometers!! #CLIMATE #HOAX Other than lies, temperature manipulations, piss poor burn management, arson, environmental restrictions, and other misguided Green ideology, this story is all about climate change hoax!!!! World Wildlife Federation Paid $70,000 to Activists who Set Fire to Amazon Forest! Remember those Amazon Forest Fires that dominated the news until Hurricane Dorian broke the second seal of the apocalypse? It turns out that “man” was responsible for at least a few of those fires after all. Well, the four men who set the fire. Four members of an NGO have been arrested for starting fires in protected forests. They started a blaze then took pictures which they sold to the World Wildlife Federation for large sums of cash!!!", "viktorpoetter": "EVERYTHING in WHOLE, from earth to rocks over water to plants including animals and us Humans and even conciousness is defining and definable as \"clima\"...we should be proud of and ACT CONCIOUSLY and CONFIDENT instead of discussing and talking about relativ possibility we could possibly be an influence to our planet...i want renewable energys electrocars permaculturs and futuristic architechture... channel God or channel devil the same comes out...Viktor Pötter", "dj_snake_487": "Please Look into your dm", "ireland_memes.co.uk": "Nitty", "ts__media": "How dare you post this to support your protesting! This is a genuine emergency in Australia where so many have lost not only their housing, towns or everything else but also their lives. It’s disgusting to see this being used as a promotion to support your arguments against climate change", "sydney_carspots": "How dare you post this to support your protesting! This is a genuine emergency in Australia where so many have lost not only their housing, towns or everything else but also their lives. It’s disgusting to see this being used as a promotion to support your arguments against climate change", "car_craziness49": "How dare you post this to support your protesting! This is a genuine emergency in Australia where so many have lost not only their housing, towns or everything else but also their lives. It’s disgusting to see this being used as a promotion to support your arguments against climate change", "saad_robert": "To everyone that thinks the fire happened due to climate change...first of all congrats on being a moron...second of all 168 people were arrested in australia with charges of arson...soo....", "frx.pt": "U are so dump", "lmc_.905": "How about you run into the fire and save the animals Greta, it's your destiny", "michaelclarkee": "420 blazing 🥵", "danilo_skurr": "Yeah that looks beautiful", "hecnyg12": "They arrested close to 200 hundred people", "patrickxxgreen": "Raekwon - Rainy Dayz", "call_me_collin7": "what a bunch of sheep", "lindsey_mayhall": "😂😂😂😂 Daddy wrote your speeches 😳", "jay_chubacka": "Minus 52 celsius here in canada today @gretathunberg #climate change", "_ri__ck_": "Evil kid Greta", "ryan.leblanc": "Did your dad write this for u😂😂 fuckin embarrassment", "seleenfrieden__": "People literally started the fires tho that’s not climate lol", "aitogerardpique": "Aaar you virgin", "paul_lhmn_": "@gretathunberg Du kannst dich ja mit dort hinstellen und das Feuer Löschen 👍🏻🙃", "pc229_": "@gretathunberg did your dad write that for you, like he does your Facebook account??", "low_rpm": "Say it ain’t so Greta! Your just a mouth piece? You don’t write your own speeches? You a puppet on strings being controlled by a master behind the curtain?", "balukapital": "Then don't just talk, do something, if you already consider yourself a climate activist!", "xkennedyxy": "Criticou tanto o Brasil que ta aí !!", "cesariiantonio": "Just go there and make facts talk for you instead of saying useless words", "anatolyjr10": "OMG Environmentalists and Greta as well. Write your stupid posts that will not change anything By type Australia, the end of the world burned If you are so smart Act Australia has a lot of money to rebuild that house Those who follow you the most stupid people in the world", "topherdogan": "You and your entire family are disgusting. Too bad humans are resilient or else survival of the fittest would have you long gone.", "leori26": "K", "robsonclarko": "Baaaahahahahaha Climate bla bla. Bushfires have been happening in Australia since before the industrial revolution and even before European settlement. You guys will use any reason unrealed to climate to support your cause, but none of you even bother to get active in the highest co2 producing countries, China and India", "pennsylvania_guitar_company": "You idiots used to call it Global Warming now its Climate Change. Biggest bs story of the 21st century. Temps rise and fall. Last year saw an increase in ice at the poles. Should we develop tech that is more efficient, pollutes less, and lasts longer? Sure! But stop with the fucking nonsense. Even Al Gore knows it’s bs. How many homes does he have again?", "cejay__": "Finally you got exposed ! Stop being your parents puppet", "dylangross22": "Climate change is a hoax #trump2020", "slo.wdown": "Get involved - https://www.kickstarter.com/projects/theslowdownmovement/the-slowdown-movement", "official_photosnap": "I mean @gretathunberg since you have this much power now why don’t you just create a charity raising money for these problems and maybe do a collab with @mrbeast to raise more awareness.", "jay_malakamba": "The Bush fires were caused by arson. There have already been 200 people arrested for strating them and there will probably be more. As per usual greta has done no research and just gone \"oh look a natural disaster thats effecting millions\" CLIMATE CHANGE", "_jakobwilliams14": "You’re dumb", "lord_juicy66": "No you dumb little 💩. Someone started those fires. Go to school and go away. No ones cares what u say. Your a soros puppet.", "yungriglee": "Puppet", "aka__kat": "🤣🤣🤣🤣", "mathias_jyde2678": "Stop", "tristan_529": "Youve been busted. Your father writes all your speeches and runs all your pages.", "mateus.mcz": "Não vai falar da Austrália Pirralha?", "jesus877x": "😢😢", "edoardoriccii": "If you really care about our planet why you don’t go there? You are just becoming a political symbol and you are just a girl of my same age and we can’t understand really these thing then go to school to learn more things because if you have to say us that the car makes pollution let me tell you that we don’t need a genius to say that, I love our planet too but I prefer to trust an adult that went to the university than a girl that doesn’t go to school", "francklatour": "https://m.facebook.com/story.php?story_fbid=10215646724468095&id=1441088399", "guapo_viking": "This had nothing to do with climate...there were hundreds of idiots starting these fires..now stop posting on your daughters behalf goofball", "ivdaxy": "@rxwan.mx", "admwoodwerks": "Ooooh boy Greta - last night you were exposed to be the pawn that thinking people (not your fans of course) KNEW you were. Your DAD wrote all your heartfelt speeches 😂😂😂", "billsponsor": "⭐️", "stephenthomasgreen": "Tr", "easydama_mj": "Fuck you", "beperes": "@jamesson82 @nedsonlima @tatianedos67 VIVA A GRETA ✊🏼", "___potato_____something____": "MORE NUKES", "1economygold7": "Hola, hi, eres parte del cambio... Sigue en la lucha....con mucho cariño... El pulmón...nuevo cambio para el mundo.... Inicio y descubrimiento...❤️👏👏hay una moneda para el cambió...😍😍😍 princesa.", "aloyramirez": "¡QUE HORRIBLE IMÁGEN! Me da tristeza ver tanta destrucción en el medio ambiente, cientos de Miles y millones de animales muertos que horror. Es lamentable.", "mony67267": "🌎🌍🌏💪💪💪❤️", "matticejustmattice": "She forgets to mention the 200 people that actually started them but blames the climate.", "travellover1502": "😢", "lafikat": "Follow me and i Will tell u how to save the koalas on the best way! 🔥🙌😍", "saman_1958": "Arrest the arsons . Solve the problem", "marco_lfl": "Ma quando è che fai un altro sciopero cosi balzo scuola?", "gusttxvo": "VAI TOMAR NO SEU CU", "tim_koehler__": "#fuckGreta", "jay_wiese": "How dare you", "gabrielsarmiento_04": "Exelente 👋👋👋", "luissmii_": "#greta = 🤮", "ketchup0919": "Hi ! Dad", "thecareerfarm": "Thank you for what you do 🙏. You might like this song from a UK singer .... the lyrics talk about hope https://open.spotify.com/track/18venMCMj8gxCxJ3KDUGQi?si=vR_kG1lTRL6DpylRb_I5AA", "les_recyclettes": "Action ✨Action ✨Action ✊🏻 Pendant que l’on parle ils continuent à vendre aux plus offrants l’avenir de nos enfants !🤬😡🔥🌎🛑 stop 🛑", "fde_pizzabeckerv2": "Greta halt deine scheiß Fresse ihr seid reich aber gibt nicht mal ein Cent für etwas Gutes", "planetb_who": "Hi there! My account is aimed at raising awareness for the pending environmental issues that are all around us. Feel free to give me a follow! 🌎♻️🌱", "enesdal2710": "Ich habe heute 5 Plastiktüten gekauft und morgen kauf ich noch 3dtück", "dgd_54": "Your own country just said climate change is bullshit and a waste of money", "spcike": "bruh if it COULD be done now it would have been done already", "_goukoumou06_": "Bruh you think climate change did that omy u dum dum", "francisco_silva1998": "Marionete dos donos do mundo", "biscupuk": "🌱🌱🌱", "tchioo1": "yes !!", "stupretto": "i sbor on del beeeee", "edgartoide": "Fuck you", "carlosabreu61": "Só tem louco aqui.", "_caiden_kelly__": "Would smash", "christian_dabaker": "Swedish people voted climate change beneficiary taxation as the biggest waste of the year @gretathunberg lmfaoooo u got fucked by your own people 🤦🏼‍♂️😂😂😂", "______im_white_trash____": "Bruh, Australia is turning into dust", "thesweeterspot": "#ecocide needs to become punishable by law.", "leonelibraheim": "due knas wallah", "henryk_2006": "HOW DEAR YOU!!!", "ivannovvak": "https://youtu.be/6C0RgIvno6Q", "hakunavinyasa": "Save the planet💪", "citizen_wrong_think": "Greta the puppet, daddies writing your posts 😂 hOw DaRe yOu 😂", "vlera.05": "How dare you? 😥😂", "serpurple": "Awe, poor chicken little. The sky isnt falling, dear. 🤦‍♂️", "jando66": "You have no right to demand anything", "thorsthetroll": "Greta’s social media is run by her parents and they all are antifa members. they aren’t in this for good reasons", "djmangoclasic": "F", "hayzey_2805": "Can you stop having a sook and actually physically help us", "_nv18_": "How many millions $ did you donate???", "elyas.hnvr": "Do you already know that you a living meme?", "i_know_better02": "Lol not gonna work", "hennessy.melissa": "Thank you Greta. Please help us stop Adani in Australia please", "mansi_damiano": "Hi @gretathunberg a famous creator due to a viral filter, he was able to achive more then 100k followers in about 3 days with an instagram effect I think we can use the filters's “power” to support a better cause, so i want to share with you my work to sensitize the population and kids. Use the filter in your stories👇 https://www.instagram.com/a/r/?effect_id=615673052533682", "liviy_e": "OMG BE REAL 🙄🙄🙄🙄", "joaq.88": "Fossil fuel will be abandoned", "morganabelove": "Funny this....sounds like the song Amazon all.over.....again....", "missmichelskii": "How about the people who got arrested who started fires.", "dylanjollie_": "SHE IS A PUPPET FOR THE CABAL", "the_erection_selection": "Siemens is still going ahead with supporting Adani. I signed petitions for months and sent emails, voted for parties that have a good stance on climate change and it hasn’t stopped anything. What do you suggest for the every day person to do? Because I’m starting to worry that whatever I’m doing still will never be enough 😢", "agnes_jee_": "Lmaoo it’s because we didn’t back burn in the winter now naturally it’s burning", "wtf_does_that_even_meme": "Just came to your page to say shut the fuck up greta you are the most stupid naive and useless person fuck you and have a nice day dumb ass", "carpetcontinentcenter": "👏🌺", "david_crf75": "Ves tu y empieza a tirar cubos de agua no publicar imagenes desde el sofa", "jxry1512": "How dare you", "ollinkoskieero": "Hello greta! My frends pöyhöne,lantto jne smoking Marlboro kikarets one time lantto viskas marlboro in heinäsuopaan and fire everyvere😂", "pilatospaixao": "🤔🤔🤔🤔In Brazil, the burnt of the burnt was President @jairmessiasbolsonaro and Australia is the climate!🤔🤔🤔🤔", "daisy.daffodil_": "So true ❤️", "peta.ashlee": "For f$ck sake! Why are you supporting this brat?!?! You just love a bandwagon to hop on so you feel like you have a purpose in life. Focusing on climate change is like putting a band-aid on the Earth. Why don't we focus on the people inhabiting this planet!! It's F$cking obvious that we have some inherent emotional issues that need fixing!! PEOPLE FIRST; ENVIRONMENT SECOND!!!", "ite_poyhonen": "Hello Greta My young frend. my friend ollinkoski owns the e30 bmw, you know this eco car when he welds it and the whole garage caught fire😂😂", "ozzyinwanderland": "90% of these fires were deliberately lit. We have a mental health issue epidemic. The Greenland glacier grew 15% this year and Antarctica grew 10%... look it up. A volcano emits more carbon in a single eruption than the world emits in an entire year, you think this world wasn’t designed to handle carbon emissions?", "rinaldo_araujoadv": "@karlasoliana", "eliot.kohli": "T’attend quoi pour aller sauver les koalas ?", "trickleupeconomy": "Yang 2020💙🇺🇸", "ccanimodesigns": "Amazing!", "jx.sx.05": "How dare You", "tomsaywer_travels": "Can we talk about how many volcanoes have erupted in just the month of December last year alone and then talk about how many ever erupted in the last 10 years because one volcano eruption emits more CO2 emissions than the entire human population so just the one that just happened here in January has emitted more emissions than the whole entire human population in the entire existence so maybe they should be talking about how the core is heating up and they will be continued to be more and more volcano erupting.. you can't stop it..", "photogr41": "I agree", "matsparn": "Hey girl wassuurr nr?", "ferryvdpavert": "So why not make your own plan instead of waiting for anyone do something. Plant a Tree. You have Millions of followers. If they all plant one Tree on a Friday, you have Millions of Trees in one day. If they plant 2 Trees, you dubbel the number of New Trees. Now you are doing Something. You immediately let every leaf cast a shadow. Every Tree casts many shadows, you can Cool your World NOW ! Everybody knows the problem is urgent, but we have the wrong people in the wrong place. Keep at them, but you Must Act Yourself too NOW, get your followers to move and Plant a Tree Greta ! Every Friday one Tree are 4 Trees per Month. + your followers and you get Millions of Trees. Ask your local Council where Good Luck !", "jie5053": "Your father should be arrested how dare you you little bitch", "123_abc_": "💔✨✨", "nico_28.12": "So muss das", "lpsjoberg": "Vem skrev detta då?", "eliel_costa2020": "Fala alguma coisa pirralha", "old_tokks": "🤯FOLLOW THE BEST AND NEWEST ACCOUNT OF TIK TOKS IN SPANISH AND ENGLISH. CHECK IT NOW! -> @trick_tokk 🤯", "kingovertexas": "Arson", "cristinas.gonzalez": "Are you helping the firefighters, to write and say something is easy❗", "rosannyarmila": "Hi¡ Greta I am sure you had a wonderful New Years eve ,Yes rigth now they have been some rainy days up there,is horrifying all the wildlife is death", "ya_otkrytye_goda": "Молодец грета ,пиздеть в инстаграме это не пожары тушить👍деятель хуев", "odlijah": "Following an autistic teen into the future. We’re fucked.", "nico__hnl": "Fuck you Greta", "riddypapa": "Hello greta I am Australian and i am very proud to say we’re fucked", "nikhil_0927": "Bitch just need fame🖕", "candeoj": "Why have a big climate emergency in the world 🌍", "liska.steffan": "how dare you", "nihil_liberum_est": "And the 185 eco terrorists that started the fires? Just delete this because it debunks your ideology 😂😂😂", "nathanpage918": "It’s funny how people think the world hasn’t always been warmin up and the dickheads that believe are using this girl as a platform to get the incorrect message across", "eastboundanddown84": "Liberal fed fire and spoon fed protest child", "whitetoyopro86": "Hoax", "7cristiyano": "How dare you", "filip_big_boss": "I don't want to set the world on the fire - Ink spots", "mena1964": "Arson", "bezfez": "I think that our world is perfect the way it is", "kody__phelps": "Fun fact the fires weren’t even caused due to climate change it was arsonist who got arrested😂 btw def didn’t deserve person of the year. All you do is speak on a good cause u don’t enforce it or do anything about it except yell into a microphone. @mrbeast truly deserved the person of the year", "vignesh_18vikk": "Pray for Kerala, To get GooD Rain 😶", "pgyaboy": "This has nothing to do with the climate. It was a bunch of arsons. Australia has already arrested almost 200 people", "rossbossman1": "Quit whining about it and do something about it", "michael_n_lila": "This fire was caused by arson", "one.health.peru": "Yes!!! We need change right now, because our planet are climate emergency!!", "sweatydan": "Too bad this fire was started by 200 arsonists not climate change", "casparyashchoudhary": "@gretathunberg Australian government ordered to kill thousands of camels?", "lucas_bitt21": "Fllow 4 follow", "yasaihawaii": "@govhawaii", "martycncha1": "Dejate de wear y hace algo no solo charlas xd", "karas.petra": "Hallo Greta 😊Ich bin 60 Jahre alt. Meine Oma mußte im Hitler Krieg von damals Ostpreußen von Adolf Hitler mit meiner Baby - Mama flüchten! Meine Oma hat mal garnichts mit dieser Klima Katastrophe zu tun!!! Weil, Sie war damals schon so weit, wie wir es heute nicht sind!!! Das ist meine Oma'sGeneration. Und ich bin auch noch Mit ner Milchkanne, Milch holen gegangen. Ich hab heute kein Auto. Fahre schon seit über 20 Jahre mit dem Fahrrad. Liebe Greta, pack mal die richtigen am Wickel!!! Soweit ich denken kann, bin ich und meine Kinder immer Umwelt Bewußt!!! Greta, du bist nen tolles Mädchen!!! Mach weiter so. Gutes Gelingen. Ich sehe, obwohl sowieso schon nichts mehr zu retten ist!!!!!!! 🤔😪", "haa_loserr": "“Telling” How bout take some action tho? That’d be nice 😐", "gavinclark85": "Your just a robot that the government made to show us how stupid people can be", "1_dankman_1": "Did i ask", "diego_falcao7": "🥒🍌", "portodavidantunes": "The fires in Australia were startes by arson so chill out lol", "kalebyrd_": "these were started by people", "white_boi_tj": "Every white girl liking this post but not actually doing shit", "mrt_326": "Greta wie viel Geld bekommst du eig für den ganzen scheiss", "sammymaceri1024": "U relise 183 were just arrested for deliberately lighting them 😂", "katebutzler": "Can someone please tell me when the next climate change strike is in dc? Because I would love to go and try to help our environment", "one_big_loser": "Gretata Thunberg. And that’s on Lisbon.", "fadedheadas": "Who else wants to join in and have some snores with me?", "polarnightmare77": "How dare you?", "kyle_isovski": "@gretathunberg what have you done for Australia?? What have you donated or helped?", "taco_bell_walrus": "You do realize the bush fires are from arsonists not from climate change.🤡", "thexjefv": "That wasn’t climate change that was climate change activists trying to prove a point and they are now arrested", "monet.f_": "Ummmm the fires were started by arsonists. Not climate change", "gamesnapcentral": "Yeah good saying all of this shi* @gretathunberg and @jamie_s_margolin and @beafihn but your not doing FUC* all about it. Nit bags", "gabriel.aires1": "Vai dizer que foi o Bolsonaro tbm?", "andersgottfridsson": "Tack för att du finns Greta", "fatos.hoxha.77": "🙏🙏🙏🙏", "rafa_asekas": "Como mola", "pocahontas_per": "Sigan a @boyanslat el si se ve trabajando por el mundo , no dividiendo el mundo", "andr3w_hunt": "#kag2020", "josh_card10": "Greta stupid you are. Arson related these fires are", "andrewschmidt223": "Maybe do something about it cause talking isn’t doing anything to help", "niikita.backup": "How dare you", "onurb_sevlasnog": "Young people like that one are really doing something to change lhe world and bring solutions. You are just a puppet for an ideological group who supports you and doesn't care about the environment. Use that case just to get dominance. Bring solutions not complaining. https://www.fastcompany.com/40419899/boy-genius-boyan-slats-giant-ocean-cleanup-machine-is-real", "brandon.armstrong1": "You’re ruining my adulthood brat.", "christan_arnesen": "HOW DARE YOU", "vitor_vitinhogarcia": "You are an idiot", "_2damian5_": "For real why are you even protesting against climate ? you call yourself a climate activist but ur breathing??? you produce more CO2 than a car in a year😂😂🤦‍♂️", "sergioluizpereirabrito": "Greta, a RIDICULOUS teenager", "lena.2o2o_": "😂", "totallygenericcarguy": "Hope you are joking about abandoning fossil fuel,because it means life to our car community.", "mattwalla12": "It wasn’t climate change, it was nearly 200 climate believing arsonist", "d4shmr": "das feuer wurde durch euch gelegt damit ihr eure interessen durchsetzen könnt, weil ihr den arsch mit geld nicht voll bekommt", "masontiday": "Fire was started by people playing w fire not climate change, it ain’t real", "realbryanbatz": "The fire was caused by arsonists and made worse by government incompetence.", "rayan_kche": "I don't think this girl understands how the world is built, is not as simple as to just change something in no time", "trash_mynd": "No se puede ser más patética en la vida. Jajsha ha cy mirrenme me di cuenta de algo k ya sabíamos :00 ohh soi inteligente jeje miren e jeje", "flowerdreamz": "Arson isn't a weather event!", "blue.hemi": "I just fired up my v8 and burned a tank of gas in honor of ole G Thunny.", "svdsvint": "Fukk off", "pirjonash": "How dare you", "demonicvalkyriev": "I wouldn’t be surprised if this was the work of some Muslim extremists", "tati.taber": "О Грете Тунберг говорит весь мир. Но почему никто не говорит об ещё одной девушке из Швеции по имени Изабелла Нильссон Ярванди? Ей, кстати, тоже 16. Она выступает против глобализма, пропаганды ЛГБТ в школах, за защиту традиционных семейных ценностей и за борьбу с нелегальными мигрантами.", "will_zo3rman": "Was it climate change? 🤡", "admiral_k_": "Asshats deciding to start fires isnt climate change.", "ozoneclothingofficial": "Follow me to donate!!", "jacksonbaker50": "@gretathunberg dad is such a fuck dumb ass for posting shit like this in her name because she’s too much of a complete fuck up to talk without her note cards. Also, they arrested 200 people for starting the bushfires in Australia that must have been fans of your daughter. Stop it and re-enroll your daughter back in school because she needs her education before she starts spouting shit to others.", "indistinctivelofi": "I've been scrolling through the comments and I seen plenty of close-minded bigots.", "constantinpapadimitrios": "KARMA KARMA KARMA", "kadon6_wine6": "So did you or your dad write this? Because recent events in the news have led me to believe that these are no longer your own thoughts. You are just a puppet controlled by your parents Greta... Very dissapointed", "stafbleuze": "🤡", "justin_d009": "Greta, get out while you can, this is your last hope to make real change for the good of the world , you can do it we believe in you if you could convince the people who are starting the fires and polluting the oceans to listen to your dad we will all be safe , please please please MAGA", "noahd.c": "🤡", "mxritzrxff": "How dear you😂", "_.tegandaniels._": "You realize the fires were started deliberately not by climate change", "charlie_peterbudge": "It cant happen now silly, sort yourself out, were just coming out of last ice age still, calm your beans", "alvarosanchezz.0": "Q fea eres coño viva Méndez y la contaminación hijos de puta q le den a grin pis y a la Greta agarrame la y aprieta❤️@angel_andrada3007", "oksana__schastlivaya": "Молодец!👍🥇🐨🌳", "fightersroaresportsteam": "Trying to get 21,000 followers before 2021 and doing a giveaway at 1k", "zbirdpix": "We really need to join up NOW! We can only win together!", "giorgos.mentis_3_5_10": "@gretathunberg Where are you during the summer European wildfires? Cause I was there when my village's forest was on fire, helping firefighters. If you keep on with just \"trying to raise awareness\" and not actively doing something (e.g. plant 100-200 trees in your neighbourhood) you aren't going to actually help.", "plagroue11": "ur annoying @gretathunberg", "tist007": "🤡🤡🤡", "nour.sr7": "How dare you", "vlaming_voor_altijd": "🦁🖤💛", "c.pintus": "Are you there to help?", "phuzzyknutzz": "Shut up"}