{"jompalop": "You're literally all talk and don't do anything", "labella___erika": "Leave her alone . Stupid ppl (like everyone who’s leaving a negative comment ) are the ones who make ppl feel like they ain’t shit Y’all ain’t shit ! Y’all old as fuck attacking a young girl Fuck off miserable ppl y’all miserable because your young childhood wasn’t shit", "cam_tatara": "\"Looks down at script\" How dare you!", "a._.duck_.on_.quack": "😂wow this girl is so retarted", "die.wahrheit.heute": "😂", "hayden.828": "greta is nothing but a joke purely a joke and will never have any serious point or even relatively understand the real world because she is nothing but an attention seeker not a problem solver but a problem causer trying to blend in.", "azhnjd_": "You've a great critical thinking, greta... Good job", "johanfrithiofsson": "Plast", "daraioucherouamal": "❤️❤️❤️❤️👏👏👏", "gabriel_moyano_2008": "Greta FAKE,", "e.4__envy": "Better learn your speech ,i can read that too", "tonythomas510": "@skystar_cash", "edosa_pen_wagon": "Wonderful dear🔥", "canuckri": "@paganohasaninsta", "sondrajohnson75": "She's a puppet on a string. She's a political tool. Go to school, get an education and work towards change.", "redfoxgirl": "@gretathunberg What about chemtrails and geoengenering? #chemtrails #geoengenering", "luccv_vl3xvndro": "eh greta enseñame a disertar la ctm", "geslachtloos": "nigga this climate change took centuries to occur and u blame it on the current people? fr?", "tyessia14": "Keep it up ✊✊✊✊", "chrisacollings1": "@gretathunberg great speech.", "_ryan_steen_": "😂😂 you would royally fuck the economy.", "indigo__miranda": "you are awesome! great speech! keep it up :)", "julietbak123": "Omg what will you tell your children? This earth was created by god, and has become the devils play ground, lets not worry to much about climate change, but worry more about how mankind has changed and become wicked and evil, you won’t need to explain anything to the next generations, as god will intervene soon and make heaven on earth, this earth will be restored and most impotently mankind.. please focus on god and the creator! We only have this earth because of god! And the sprit that lives in you and all of us because of our lord.. so people don’t let this take you away and distract you, she can do what she does but it won’t change anything because everything is in the hands of god and we should trust in him only! Amen 🙏🏻", "_karresand_": "Tyska diesel sexor🥵🚜", "agan_tbk": "@micha_hkl fotze", "merid32": "Do at least something, do not shout from the stands! People take away garbage from the shores of the ocean, but no one sees this, sow the world from plastic, separate the garbage. Do something like that too. ￼", "nolimitsurbex": "Silly cunt", "ajai_patidar": "We had grown to 7 billion people , we need to stop here, this will help to control climate change , rest of mother earth will do.", "fight4earth.climb.bee.blobfish": "Thank you", "halildincs": "Bundan böyle davos benim için bitmiştir. Daha da olsa gelmem..", "therealdrdrew": "🤡", "ciera_carter4": "Greta what do u propose we do", "gloriat.07": "VAI A SCUOLA", "heidivh_17": "Ur a loser", "amandapapadakis": "http://chng.it/6SKH2ttNDr no 5G", "bell_osama": "Cada vez que hablas contaminas mas al mundo", "ayadsadihov": "Yea bro :)", "alexandliane": "You are everything", "helio_euzebio_de_paula": "Vc é chata viu", "real.samii": "love you greta!🥰", "louis._.pearson": "safeeee", "tala_va_javahrat_yaghot": "ب زبان لری بگو تا متوجه بشیم", "mynameissooraj": "This type of shit is why we want Instagram to introduce a dislike button❗❗", "_0mariana0": "This is only words, this is not helping, you know. if you want to help do the environment you can do something, no only talk and talk and talk and talk", "tmc.yyc": "Greta, It’s proven that the sun controls the climate. What the hell are you going to say when the ice age starts? Plus, your a kid. You don’t have the slightest clue about supporting a family. So shut up you little brat.", "carrlo98": "@marcco43", "jakebolam09": "Great speech Greta ✊✊", "janetnebraska": "Shut up", "nderang": "❤️❤️❤️", "infinity__ranger": "We need u🥺🌻", "chrissi_u03": "Zu wild", "jan_luk10": "Isch sa zu meine Kinner dass du e Jockel Bisch verpiss dich sonst bekommsche e Anzeig", "a_daniliyk": "Попизди попизди", "askhatm": "Иди учись овца", "tyleronthebeatsoitsnotnice": "Shut yo goofy ahhh up", "saeid_ny": "Who wrote these sentences for you?! You travel with the vehicle's that energy comes from fossil fuels and wearing clothes that made trom plastics polymers ...😂😂😂 So you just travel all around world to say bullshit like this?????", "golfgtsport_": "😂😂😂😂😂", "_kingbarb_": "Ye you tell them mini Greta boi xxxx", "iamliontjk": "Бляяя вот она дура", "elstonblackmate": "lookin head assssssssssssssssss", "andersson.4": "Älska d24", "brandonscales1409": "Nice Jacket Greta.", "charlie_mckay21": "Holy shit what do you think you can do to change the weather 😡just shut up and go back to school", "robinmore13": "🥀", "lucasbeemer": "Why is she wearing a zip up hoody and sweatpants? That doesn’t look professional. It looks like she doesn’t care about being there. She is a child and she is lucky to be there giving “a speech.” It looks like she just got out of bed, didn’t even wash her hair. And also, baggy clothes that don’t fit properly is a waste of fabric material.", "youzara._.m78": "Really great be careful thank u", "sasiiikann": "@____pack____", "costavcosta": "Why dont you go there and help????", "bed_baby_": "Girl power", "onclevalery": "Stfu kido", "spapapowpow": "In my country, the youth doesnt care about climate but stab eachother and listen to rap music because they think its cool🤣", "bykrishnavr\nVerified": "Verified", "looltvbiasaaja": "Mantap kecil-kecil udah pintar bahasa Inggris", "no_agli_ambientalisti": "Vaffanculo", "rspalloran": "🇵🇭🇵🇭🇵🇭🇵🇭🙏🙏🙌🙌", "stylish_star_prasad": "You done great job👏👏👏", "kateeisen": "what does it take... act now people! wake up.. please", "kalim4ik_74": "Хуета", "world_realization": "When do children think about climate change", "carteroconnor1": "Fight me", "maverickhawk55": "Sorry I just wanted to hear a V8 Mustang and they would understand", "zakarya_shakur15": "Nobody asked", "lxxa00": "Kill Greta", "1202wood": "🖕🖕", "arsen_khoetsya.n": "When the fuck did i ask", "amy.vdsteen": "Great words!😍", "neuzam867": "👏👏👏👏👏👏👏", "girl_save_climate": "👏👏Your the best Greta 👏👏", "royalefelice": "@feraselhaj du hörst sie doch so gerne reden 💪", "x.ig.joe.x": "Nothing like taking the spot light 😱", "xokrystalchapxo": "You only done this to get famous and to get money man", "julia_000": "Да мужика у тебя нормального не было. Дурью маешься", "tonyny.zhang": "If! You really want this word be good, start from yourself, take the fucking action like a real leader, read the book 📚 not keep use your bloody mouth took about the bullshit", "aliod98": "@davyt_96", "jay_adams24": "stupid ahhhh don’t know how to speak without a script", "connor_wky": "🙏🙏🙏", "vegaraah": "Stfu", "od5964": "Lavagem celebral mk ultra na cabeça dela", "artnbits1171": "More emissions here too.", "nicole.er123": "You keep saying we need to change things but have you come up with a solution yet or any ideas? What are you contributing to this besides throwing a temper tantrum? Go back to school get an education and learn about everything you need to get it fixed instead of running your mouth. You want to be a leader then shut up and do the work.", "xusgomez21": "You hace all the reason", "vini.g.reilly": "The Truth is like a Law of Physics as applied to A drop of oil, which Always Rises To the surface Above any horrible unclean contaminates, And Truth Is Being Raised & Has begun To Be Seen Surfacing Now. That Is An Astonishing Accomplishment already, & More Accomplishment’s Inexorably Will Occur Now, Because A Young but “old soul”, Wise & Seriously Well Parented woman SPOKE with enough Conviction & Truth, so Nothing Can Prevent any further ignorances any more than already exist in stupid uncaring fools deluded minds.", "queenlylee1": "Solidarity on climate action! ✊🏻", "caspar.kevin.8i": "🤮🤮🤮", "rigorozno": "She looks like a girl who reminds the theacher that she needs to check homework", "edrn__": "Words❤️❤️", "sarah.prze": "You say we have to change something but you Never say how 💩", "professor.frans": "I've been on you're page for 10 minutes and you've quoted yourself 3 times already", "julie.vuillaume": "can I just say about all the things you say, don’t you think that everyone wants to save this planet and have the beautiful green grass and the beautiful sun like old times? we want that so bad. but we are used to a kind of living and it’s by using plastic and all of the stuff that can be bad. and it’s bad bc we use it so much. not bc it was exists. like McDonald’s are giving now cardboard straws instead of plastic but when we will use the cardboard too much it will be a problem like plastic. we want to save the planet but we hardly can. you think that by going out the streets and screaming will change something? we want the same thing but we think more logically than you. yes we can reduce a bit the use of plastic for example but we can’t just not use it at all or hardly use it. this is our lives. we invented plastic when we need it and now it’s damaging the planet but we are humans. we need this. this is how we live now THE END!", "bandits_battery": "If you really are so worried about climate change turn your gas off in your house over night and see how long you last", "jumow": "@arthur0o0", "awwwww_mannn": "K", "claystudleyalex": "No one likes u", "cascadeblues": "Let me read this script", "ollie_hubbard": "Turn up wearing something suitable, rather than wearing a hoodie. You don’t look credible wearing ‘chav’ clothing when everyone else are wearing smart clothing, e.g. a suit.", "sougata08": "@mimi_f02", "lewyj99yt": "🙏❤️", "ittcha1": "💖💖", "jacquilougido": "💖 you're a blessing to us all.", "jasonsouza569": "shut the fuck up", "_jvann": "The world is constantly going through different cooling and warming periods. I don’t understand why people blow it up in the moment for any reason other than money. These problems have existed since society started.", "kcjkrenar": "I fucking hate her voice literally I cant stand it", "_ddaarrkknneess": "Shut up please", "chlo3samantha": "Yeah no I’m not buying it", "johnald19": "There saying this girl done more about climate but what about the other kid that got put up with greta as he made a device to clean up the ocean and had a prototype and worked so proofed he was more action but goverment wanted someone for more talking less action right so screw it let mess up this earth even more what actually can be done about it nothing as its too far gone but humanity dont think so but it is", "mat_xander": "Not once has she done anything herself. All she has done is complain that society has caused this and done nothing to fix it. Instead of putting the blame on others do something. Instead of skipping school go clean a beach or something but don’t just blame everyone else.", "1unbekannt36000000people": "Alle Menschenkinder die der Botschafterin das Sprachrohr von Mutter Natur nich zuhören und verstehen wollen und nicht alles tun das sie aktuel können um ein wandel bei zu führen momentan habt ihr die Financen und die kontakte die Welt zum Paradies auf erden zu machen dem sei gesagt Gott der Vater aller Menschenkinder hatt lange genug zu geschaut und langsam ist seine geduld am Ende der Mensch sollte bereits 2012 was verstanden haben das er hörte aber anscheinend nicht wirklich darum 👏 mann kann nur betten das Gott der Vater Gnädig ist den wen Vater zur erde niedergekommen ist dan wird er auf sein recht bestehen und alle Menschenkinder und Engel Erzengel haben auf ihre knie zu gehen und sich vor seiner Herlichkeit zu Verbeugen", "abigailselenah": "@kxrita dette var kleint å se på fyf", "555hms555": "Бидолага по бумажке читает, что дяди написали и дали", "alcantaraholanda": "👍🏼👍🏼👍🏼👍🏼", "zammaster_2020": "Кострома ЗА экологию!", "ich_im_duett25": "🤮🤮🤮🤮", "tomtommiis": "😂😂😂😂😂😂", "abu.ftp": "🤮🤮🤮", "smurthy07": "Carbon dioxide", "brownboidiego": "Keep wondering", "marie______johanna": "We love our children, but does the love is in your family? Are your Patents love you? We all can see you around the world but whats about your parents? Did they don't care about you? We all know that you cannot feeling like normal ppl but feel you this coldness from u're mother? How can U ignore that? Where is your mother while you are far away from home? Does she go to partys? Did you actually know what are you doing? Did you? Ask yourself if its worth", "dorizin_pia": "Pirralha ta ok", "shyladuff_": "Everyone believes one little girl???", "alpergndz90": "LAN SEN KİMSİN GERİZEKALI MAHLUK.BİR HALT BİLİYOMUŞ GİBİ MİLLETE AKIL VERİYOSUN.BUNUN GİBİ APTALLARI MİLLETE BİR HALT DİYE KAKTIRIYORLAR.SİKTİR ORDAN PROJE MAYMUNU.", "noplastik.fr": "👁🧠🏅👍🏿♻️", "fashion_mode_ca": "🙏🙏🙏", "emery_bingham_fan123": "I believe you🦋🐝🌞", "siemon.thomas27": "@gretathunberg if you were really so passionate about the climate and not just the money you earn, maybe you would be able to hold a speech without just repeating the text In front you..... #justsaying", "r.c1992ss": "Good actuation bitch", "santiagodh_": "Como me gusta mi coche a gasolina, no hay híbrido que me adelante", "miak______": "Stupid", "bella_ballu_": "Ich hasse dich", "abigail.mcphersonx": "U flow my friend Flossie's climate change !!! That's so cool", "dzenad.mesaljic": "Shut the fuck up", "miklos6997": "😂", "hi.le.kulam": "👏❤️👏❤️👏❤️ good luck!!", "dostisabelle2000": "Ich würde mich lieber umbringen als mit dir Verwandt zu sein", "yomomagai": "JUNGE DER CO2 AUSSTOß HAT SICH VERMINDERT LABBER KEINE SCHEIßE", "mousasow1983": "Hdf", "beanhead5859": "Bullshit", "ericvanz12": "Who’s gives a shit that the world is “getting fucked” just have fun 😂", "jelenasecretino": "идиотизм", "sturiop_aaftpon": "Как найти ее на порнхабе?", "the_kazoo_lord": "More like anal meeting", "sara.spricigo": "i’m happy for you ❤️", "_panterii_": "🤢🤢🤢🤢", "sultanov1621": "Fuck you", "gracy.mak": "🔥", "metalconceptt": "@metalconceptt 👍👍👍", "evka_81": "Shut up Greta !🙄", "mj_barcelona": "“Your problem now bro”", "1.ashish_": "Great 🙏🙏🙏👏👏👏👏", "filip_big_boss": "Autist", "maximiliano_d17": "No se inglish🙁", "raptorian_benz": "I’ll tell my children as we cruise through a yacht... fuck bitches .... make money 🎼 fuck bitches.. make money 😊😊😊🤣", "renataoda2901": "Wonderful 💚♻️🌱 #govegan", "buli.vl09": "haaaaautshnurre", "bergasmilla": "Fadinha♥️", "i_a_m_batman": "https://albertapressleader.ca/professor-writes-critical-open-letter-to-teen-climate-activist-greta-thunberg/  This is what we tell them.", "nnanda.z8": "❤️💖❤️❤️💖💖", "nasty_eagle_insane": "Fuck off", "nightwingxs": "hOw dArE aRe yOu ı lOve 🌍🌎🌏", "desiii.bby": "Corporate does not ♻️ first step - @planetfitness it is at discretion of ownership that a company with such a significant footprint in terms of recycling does not put the effort forth to encourage their clubs to recycle. ♻️ nbd. It’s just the planet. 🌍 🌎 🌏", "sofiyalambinet": "You’re my hero but can u talk about the ice sea please because I have sent you a message with a video", "leongruber50": "Buhhhhhhhhhh 😠", "andres.amaat": "Eso que llevas es sudadera con cremalleraa?!", "carlos_sv0": "¿Ere hilipolla illa", "sylkowa_official": "🌟🎻🌟", "cami_moraga_0512": "❤️", "neonsparks5": "She's blaming people who can't do bull anyway", "findyte_": "@kasie.leaxx she’s chatting shit", "fffrosetodegliabruzzi": "go Greta!", "j.ross3862": "Yeah our house was literally on fire man nothing to do with climate change. Mother Nature doin her thing", "querci_alessandro": "chai ragione diomerda", "richie_obert": "False", "vaclavskorpil": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "coldest_ramen69": "Good luck with your next one!!👍", "nathaniel._hagler": "Cool but all your speeches are the same", "timur_alimbekov": "Even making microphone and the camera required certain amount of copper, plastic etc. And to get this grams of copper u need to mine it first and process the ore and smelt the concentrate to get the metal out of it. All this needs resources and has certain outputs including wastes, exhaust gases etc. We need to protect the environment, but these extremes would mean that we need to return to stone age and live in caves. Let's be reasonable and realistic.", "scott_a_hewitt": "🤡", "tonyd2389": "She can’t wear something nicer? Try to look like you didn’t just roll out of bed.", "wadesullivan_": "Poor kid is absolutely brainwashed... at least the adults are willfully ignorant and want to believe in this religion of propaganda but kids are being brainwashed.", "aviationnut86": "🥴🥴🥴", "raimundadejesus2": "Este dia 🔥🔥👏👏", "arabella_rosele": "Great words ❤️I’m reading ur book called Greta’s story 😻", "batu.namli": "Ass words, as always. ❤️❤️❤️", "leoniie9": "@emelie_177 😂", "lovetheoldvintage": "Obviously she got help with her speech😝probably she’s being sponsored by George Soros or any of his foundations 🤨", "peteguido": "The worst actor award without a doubt", "deboragroff": "Great work girl ❤️", "thankmyluckyscars": "Gives me chills💗", "truckfotografie_vrieson": "I Will shoot your dammin't head off, if you say something about farmers that isn't positive", "_mxxim_spurs": "😂😂", "slogoman_1234_": "I'm gonna make a change to", "expertsage12": "I believe in what she is saying and if you dont agree with it then please tell us your opinion but don't leave hate comments because that makes you look immature and childish this is a child and she sounds more mature the most of the people in this comment section so please stop making a fool of yourself i know it seems impossible to fix environmental issues but we caused these issues and the least we can do is try.", "oliviiacady": "yes greata i want to be a climate change activist one day 2 . our leaders need to wake up and realize they have to do something !!!💖💖", "memocbn88": "Gayayysysyy", "bara_kick_videor": "Haw dare you", "_david_pvn_esp___": "Più che altro stai facendo inquinamento acustico", "alvaritodlr00": "MAKE EUROPE GREAT AGAIN", "jpoliz06": "I don’t know why your trying I’m not giving up my power for your slutty conduct for America has power and money that we are not willing to spend on Sweden this tv Is not known around the world and as popular as these states of em Mercia", "daniel_church1": "🤡🤡🤡", "lastochkiinaa": "Нахуй иди, ты только пиздеть можешь", "kacperzajaczkowski": "Why can Not give disslikes", "roko_mijanovic11": "Why is this even special or some shit every one can fcking read a paper", "ssuuareez": "Shut up", "diogo.splah": "How dare you!XD", "joe_kremerr": "How dare you 🤡", "rfmuldowney": "@lankphoto", "kha1idbyn": "Omega luul", "tolya.m_69": "1. Она ничего не сделала. 2. Читать с листа умеет каждый. Но наиграно не плохо.", "a.b0t1full.b3by": "💚💚GRETA’S THE BEST WOMAN IN THE EARTH #savetheplanet 💚💚", "nastyyy_kl": "Pay me 10k and i will kill her", "lifebeginsat200mph": "Oxygen thief. 🤬", "heilygrisales": "https://youtu.be/iQyybD4Wr7E  This is a dance video on climate change. I was inspired by you and Ellen and many more. Hope you watch it, Thank you. 🙏", "loncrockatt": "Why not make a real impact and support @gidimten_checkpoint we need all eyes watching so they can’t just steal and destroy more native lands. ✌🏻", "itzz.jarow": "shut up 🦠", "derek_edward_trotter": "Shut up 👌", "nikitalist7356": "I always feel suicidal listening to her speeches. But it's true why continue to live don't we have like only 2 years left until it's to late?", "dvellad": "Does she really has 17 years old? She looks 12 or something like that.", "hilario_sabao": "Idiot and dislike", "934.leon": "Du arschloch", "pot19201": "whore, get the fuck out", "tjo_bre12313": "CAn you give me shoutout ? Plz", "eyesofjosh__": "I am all for the speech but when it isn't coming out of your heart and from a prewritten speech on a paper.. this isn't how you change climate change. If you really want to make a difference say it like you mean it. No ACTs no BS. Shes a young girl who's trying hard. Don't get me wrong but the key word is YOUNG she is still learning. So if you do want to make amends bring the real you and make that speech from the bottom of your heart young lady. Thats all ♻️♻️♻️✔", "leandro.argie": "Oh yes, let's keep deindustrializing the west, reducing white fertility rates, and filling Europe with third world immigrants, I'm sure that is going to help", "livelifedieforever": "Get off stage and go clean then lol Kant change everyone only u can do it #mediacrybaby", "daria_sviderskaya": "Everyone screams about climate change but nobody does anything. Start with yourselves then go public", "wernerhart1801": "Amazing Scheiß 😄😄😄", "heyfeiia": "I’m deleting my duramax after watching this :)", "ives333.3": "@julzfairon for RYAN & JT ❤️❤️", "elliott_gdr": "Shut up and go away you’re the most dilusional person ever. You keep on talking about global warming but you haven’t done shit. Just go back to school. You’re honestly retarded.", "majitelpravdy": "Back to the shool bitch..®️🙌", "galahad_1997": "FUUUCK YOU!🖕", "sherr.s.sani": "Historic influeincial speech indeed.😍", "patchaiwaiaree": "🤩", "theonlyellafindlay_": "Wonderful speech👏❤️🙏🏻", "ida_karlborg": "Jävla miljöpartist", "7nixh_": "How dare you", "88oreo": "❤️❤️❤️❤️❤️❤️", "marquinhosmarcoaurelio8": "Votre petit morveux vous ne savez même pas ce que l'environnement va faire de la France car c'est un failli brésilien avant tout Dieu avant tout 🇧🇷", "a.vodianov": "Чушь👎", "real_emrankhan": "Puppet", "scooter_zach2.0": "❤️❤️❤️Im also vegan❤️❤️❤️😍", "al.al_01": "В мире коронавирус, а ты за экологию беспокоишься. Тебе все равно на людей?", "dima.diamonds": "💚💚💚", "kblxckburn": "All rhetoric no logical plans or solutions", "ryan_bhogal": "Oh oh scary, oh shiver me timbers shut up man", "greta_thunbergs_car": "How dare you", "ty_morrow69": "fuck you go back to school", "yeah_that_tom": "@madoxluneau that’s you", "cihacl": "OROSPU ÇOCUĞU", "mangesh_parmar_": "Did you write those speeches by your own or someone write for you? It’s crazy.", "luis1salazar": "Que no haces nada con esas charlas mierdas", "pee_to_tha_jay": "Dear Greta how will your idealogy control how the earth will pivot and rotate further away or towards the sun to curb our climate ? I was once a kid with similar beliefs as you. We fell in the trap of global warming propaganda and then we woke up.", "sfjellet_": "My boy spitting facts ye Let’s go champ", "gossmonika": "You are an inspiration. Thank you for all your great work so far - keep it up 👍🏻", "happybritborn_": "Good little actor!", "rena111999": "🤦🏻‍♀️", "balexandruo": "Very good Greta i am always whit you", "ivajra": "💚 💚 💚 💚", "wesleyjohnson.8": "It's China that causes most of it we can't do fuck all 😂", "lamorilladaa": "@rosariogarcia02", "jackywrld": "👏👏👏", "jackaaboy24": "How dare you!!!!", "rdye6896": "I wonder what you will tell your children was the reason you chose to not stop the corona virus and help those in disparate need. HOW DARE YOU....", "american_savage": "Trump 2020 🇺🇸", "justin_bergner_1337": "Jetzt habe ich Lust schwer Öl zuverbrennen", "maateeo12_": "We’ve to do something now", "dehetrecolby": "I will tell them that it’s all natural and that the world is constantly heating up and cooling down and at the moment we are just at a time we’re it is naturally heating up", "teokingofthefire26": "Shut up and go out", "tina.w007": "Great speech greta🖒👌but don't you think that it's better for us and for the politicians to have somebody who brings us concrete solutions ? Anyway you done well🤗", "dizo_gaming4": "👏 👏 👏", "literarycritic23": "💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗", "toxungo": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🙄", "chromoly_trashcan": "I say good luck bitches", "cowboy5871": "👎👎👎👎👎👎👎👎", "youngtrax": "Грета ты заебала нести чушт", "funpaninl_reallife_": "Bitch", "tkl.mo_muenze": "Ich werde meinen Kindern sagen, das Klima seit Millionen Jahren ein völlig chaotisches, nicht lineares Datenmodell ist , was man leider nicht schützen oder vorraussagen kann. Und das der Mensch nur 3,5 %CO2 Anteil weltweit verursacht, und für die restlichen 96,5 % die Natur selber sorgt... Und das durch dich Aufforstung und Anpflanzung fast eingestellt werden mussten, weil du die Geldgier nicht im Griff hattest und die Nahrung der Pflanzen abschaffen wolltest. Und so weiter... das werde ich wahrheitsgetreu wohl so erzählen ... Strafe muss sein Trulla!!", "g_farber": "🤦🏽‍♀️", "dylancarey_13": "Loser", "elijahxprice": "instead of talking ab it do sum ab it nigga", "aleyasig": "How dare you😂😂😂😂", "salim9383": "Good luck to you♥️", "ohmyitsjesus": "You look silly up there", "jessie_flores14": "Wow😲👏🏼👏🏼👏🏼", "robertfoltyn": "🔥❤️🙏🏻🙇😍", "_iikerr_3": "Tienes voz de traductor google", "ma01007": "I know what a wonder you are.", "nurnurrr3": "Nerde çocukluğun calindi ahlaksız", "ahmdalsylawy78": "جميل", "ankita.mohini": "@gretathunberg humble req kindly visit India Once 💖", "immariralat": "@mei_lynn", "issiac_renco_25": "Roll coal🤘🏻🤘🏻🤘🏻", "krepatcu": "Bs, do actions and not just words maybe that would help the burning homes and animals", "rebekkakreiner": "I've never heard anything so stupid in my life. And you all believe it or what? It is so sad 🤦🏽‍♀️", "neerea5_": "te van a salir arrugas bro", "oneil_bill": "Change your style - the dramatic reading and consistent nodding are more a focus point. You cant silence the volume and predict the motions. 17 is practically an adult - I know middle school children who can read a dramatic speech just as well.", "collin_mcdonald1": "Oxygen fuels the flames u dumb cunt", "realdanon_": "stupid", "uts_505": "🤡", "gerritvantintelen": "🤮🤮", "heywood_claxton": "Do you walk to Davos or do u take a plane, train or automobile?", "auna_223_": "Wtf man!!! How is she 17?!", "yacatus": "We can try to change the future but I think we know it's been set 💛 I'm looking forward to trying to reverse this problem 😊", "dalencsims2007": "How in the world do humans cause climate change 🤣🤣🤣🤣", "rafitabetiko": "Don't crying minigirl", "amanndaguerraa": "@jessicararruda", "alederani": "Fuck you bitch", "gb.georg": "😂😂", "daniel.newling": "Donald was right", "jmosforth": "I’m sure that Greta means well. But I find her very condescending. Preaching to people/adults about climate change and presuming that they don’t love their children. I think she needs to live in the real world for a while before she starts preaching. And, just how is she travelling to these places? And does she fly economy class, or by private jet? We all need to do our bit to help the planet.", "kjell.stevenson": "You need to eat, my dude", "bossieblondie": "just stop", "gangstafortnitegamer": "BigblackniggaballsHD", "dogoargentinoarmenia": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "xxthomasxx20": "How Dare you😂😂😂😂😂", "lillymac._": "how DARe you", "rickypoltro": "Almanco la lampo seretela fin in fondo", "1treemission": "We must all as individuals do our part!", "ivanovskialeksei": "В школу иди, чтобы иметь представление об экономике", "alicia_fs_priv": "U see there r 2 types of people in this kind of game. One who talks big and one who does big. The former goes to greta tunberg, the latter goes to Jimmy Donaldson", "cassidystarck1": "@kristjanthorsteinson", "serranomiller72": "Kppoq0", "gavin.terry_": "How about you stop talking about it and do something. How are you gonna change half a continent fire buddy", "jackpursley": "❤️At least she's doing the right thing ❤️🙌", "luis_miguel_silva_091101": "Juckt mich halt relativ 😂😂🚗💨", "nealiho": "Sigh... always using Africa, but never go there. Please tour Africa.", "a_loner_with_a_boner.cum": "U ugly bitch🤮🤮🤮🤮", "jackm_234": "None likes u suck trump", "electricfang_": "HOW DARE YOU!!", "a3l0e0x3": "🤮", "andrew.briseno02": "AHAHA SUPER DUMB", "evan_lee69420": "Sense she has that accent, you already know she smart", "585.jake": "Plastic is good", "majofonsecar": "Sweetheart you look so dumb criticizing us while your just reading what you freaking dad writes for your conferences🤫 so stfu", "sahak": "A puppet trying to spread #FAKENEWS", "alwinx.361": "Schlampe", "eyann_brandon": "I've doing nothing in life but she's already the one and the youngest activist😂.Keep going!", "julielardner": "💚💚💚", "giuseppe_sellaro": "I’m telling my kids to get some where in life, you have to work hard not bum around like all you millennials that just just want to protest and receive hand outs from the government . Go to work!", "kala__crois_en_dieu": "You can chill, our climate is fine.. no one is dying. Where are your facts?", "andreapazt": "You are AMAZING!!!! Love you so much from Chile🇨🇱❤️", "maxgorillaa": "Go to school and learn like the other chilldrens.😤😤😤", "just_emy000": "😢 Amazing Really amazing❤️", "luchoignacio.g": "https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.bbc.com/mundo/noticias/2013/09/130923_ciencia_noruega_basura_energia_ng&ved=2ahUKEwjA29Wb7bXnAhX7HLkGHYq-C9QQFjACegQIAxAB&usg=AOvVaw0M-g5jYnkAOKOSaMMLZJrB", "appleyard_richard": "I will tell my children I had an absolute scream in a mustang V8 doing burn outs while you missed out on your childhood.", "xx.todo_deku.xx": "IDEŠ MOJA POĎ!!❤", "sofia_bertolazzi": "👏👏👏❤️😮😮", "tiju_arquitetura": "Luv u!❤️", "rafal.ptrz": "I love diesel and gasoline ❤️", "ali.cantaraa": "You nice 🙌", "morgankane14": "Brrrrraaaaaiiiinnnnwwwwaaaasshhhheeeedddd", "marcoscloppet": "Te das cuenta lo pelotuda que sos ?", "harry_kitto": "Follow @thegretafreta", "garrett_slocum": "I love how she’s speaking at this huge conference and she’s just wearing a pink hoodie😂", "alici437": "Nixxxxxxxxx amg fahren und luft verpesten BOCKT mehr", "2lowmiklo": "Trash", "ethanlivingston784": "😂😂😂", "that.nikka.ant.sk8s": "It’s funny because she gives these speeches but doesnt act on it she doesnt help out these countries she just says stupid shit while people risk their lives to help these countries", "ilina_vi": "I want climate issues to be explained to me by a serious scientist, not a stupid schoolgirl with mental health problems who is being manipulated for someone else", "hvac_vic": "What a shame this world is crazy now. You guys are delusional wow", "the__terrible": "Тупица 😄", "nowactivism": "the voice of gen z 💗", "morenomaglia": "Sei piccola le cose dei grandi lasciale ai grandi", "sequeraven": "You’re so fake child! Please, stop that circus , nobody believes you. What would you do for the next conference when they’ll buy you an airplane ticket to go there? Do you will say NO, because airplanes contaminate the air and your going walking !?? 🤖", "cleliazeppo": "Ma bai a scuola che ti fa solo bene", "paranhos_ale": "PIRRALHA RIDÍCULA!!!", "studio_os2reh": "You are getting soft 😍😍😍", "fastonzanga": "🔥🔥🔥😍😍", "_saloelkurdo_": "Ey du bist voll flach und hässlich", "liam_jenks4": "You’re so sad", "bashford.21": "Hey Alexa.... can you legally abort a 17 year old girl", "rene_bezerra_": "😂", "bruepaul": "@markus_goebhardt @gassi_14 NUR ABSCHAUM HIER", "nichi310": "Powerful! 💪🏼🙏🏻", "idontshutmymouth": "i don't know if your parents and grandparents love you, but mine do for sure and didn't steal my childhood at all.. they made me grow up under insanely good conditions which i am very grateful for! therefore, stop calling out other generations for something they haven't done and stop saying anyone has stolen your childhood.. you should be thankful for the childhood you've had.", "sosnovskijs": "🤢🤢", "kiradupreez": "Powerful💜💜💜", "la_hau02": "#fuckyougreta", "alexmonsalvechile": "Bajo la sombra de las alas del eterno estas, nada malo te pasara, cada vez vamos más rapido, un poquito más y ya voy!! Saludos desde Valdivia, Chile, ya pronto vendras a nosotros.. lo creo con mi corazón! ❤️", "maikewahl": "@sebbi1234125", "isfolli": "❤️", "alexander_izyrov": "Дура , получи образование сначала ,а потом уже с докладами выступай", "__z__h__e__k__a__": "ДЦП", "realbryanrowe": "We're still wondering where all the people are dying from climate change.", "romankleutin": "🤮🤮🤮", "_shawn_wu_": "Go back to school", "kulveer.dhillon": "Lol first stop wearing this fancy dyed clothes, using all this plastic and technology to make and post videos, stop eating all this meat and agricultural products then we talk business. I wonder what school you went too or how much they pay you to be there cute little face. Have you ever heard of Sustainable development 😴", "montoyag76": "🤔...😒", "lucybenson6338": "So inspirational ❤️👏", "officialisaacbrown": "GOD is in control ♥️", "_winstein_": "Stupid tons of folks", "encichen6": "0201代po-109 2020全台最受好評の線上信用球板 時下最夯 出金最穩 優惠瘋狂送紫禁城娛樂信用板 誠徵代理、優質會員體運彩球、賽車、百家樂 LINE官方客服人員: @mbw4681a", "denis_keinulanerino": "Fucking slut", "official.jxkob": "Scheiß votze", "the_happy_grump": "Good message but you are someone who possibly never experience bad economy. The generation you are blaming are the generation who tried the best way they know how to ensure there are human rights, women rights and worked hard so your generation could live in luxury. Do your campaign without blaming other people. Each generation have their own fight - to protect the country in wars, for independence, free speech, women rights, etc. While I find your initiative inspiring, you may want to approach this from another angle. Blaming other people is pretty much how people view millennials. Lets not give them that impression.", "dmshp43": "Zip your lips You don’t know You stupid", "eplepike": "#warandenvironment", "arta_asgharpour": "الامام زمان النار 💥☀️🔥", "flight.wright": "shut the fuck up", "not.shaw": "Talking out your ass", "theo.s8": "Shes a classic sweed: good english", "jsongr616": "Shut the fuxk up mk programmed runt", "matthew_3601": "Your a puppet", "rosel723": "Lo que dijo fue: DEVOLVE EL VIDEO @micasuarez12 sino el mundo morira @galero", "peppy4eva": "You are all idiots! Climate change? What a load of garbage! You little girl need to get back to school and leave things to the scientists and adults. No one has control of what is happening to our earth! For hundreds of years it has been healing itself! It is the way the planet survives! The fires were caused by years of stopping back burning because the greens thought they knew what was best. No one needs to be a scientist to read about past earth rotations of healing! This kid is being pushed by adults and everything she says is written by adults! I think you all need to read some history and see the UN and governments are hoaxing this conspiracy as always!", "douglascasula": "O mesmo que vocês iram falar quando acabaram com os recursos naturais do países de vocês! #hipocrisia", "its._emmxnuel": "Jaa sie sorgt für unsere Welt🧐😂", "kdfcolorado": "You are a wonderfully amazing young lady. I’m absolutely blown away by your strength and passion. You are the light that our future needs. Don’t give up we desperately need you. 💜", "leif.lawrence": "Mistake", "sanyasalvares": "Грета, это ты ещё в России не побывала. Тут от увиденного нужно будет лечить твою детскую психику👍", "mascioliantonella": "👏🏼✨", "great_canadian_duck": "I'm on your side with this being part of the #scouting community we have done everything we can to keep our community clean but now is the time to take it up a step.", "arimyeverything._": "❤️", "amyybarness": "cute shoes", "bouchervillecoelho": "Vai criar cabelo na perereca antes de dar opinião", "dimdim4194": "То есть без бумажки нелья было прочитать, да?!", "_marco_115_": "True word's Greta", "alex200929": "I love you❤️❤️❤️❤️😍😍", "ma.rcus513": "There is no some big problemas with wheather i dont know what are you talkin about .just look and time its always chaning thats normal.", "nataliedickson2008": "Hi greta, wow, really powerful message. You are a real inspiration to me. Love from @natarm1588 x 🌱🌲", "tessanlaiffi": "How dare yöu vitun mulkku🥵", "quitorodriguezcordon": "And you're vegan", "tuanhyy": "Wow", "grace.brennan._": "We’ll be doomed if that happens. She’ll focus on climate change which is by far not the biggest problem. Sure climate change is A problem but I’m hearing a lot of the problems from her, and not enough solutions. Like I said climate change Is not the biggest problem, what about fires what about war what about poverty? I also think she’s not being very wise with where she’s placing her criticism, yes humans do contribute to climate change and how it is changing, but in no way are we the biggest cause. We didn’t melt the icebergs, we didn’t cause the fires, we didn’t cause Antarctica to start melting, we didn’t cause the Amazon rain forest to burn, we are not the main problem. Yes we are polluting the ocean, yes we are polluting the air and yes we do need to get a grip and start changing but Greta is placing so much hate and criticism in the wrong areas.", "tom.montoni": "tu mora na sueciaa fdp", "joshua47738": "🤮🤮🤮🤮🤮", "_celinecannizzaro_": "💘💘💘", "andypeche.mena": "Dö", "leandro.venturini": "Truth", "gui.demoraes": "Go back to school 😅", "hacer_klein": "🙏🙏🙏", "kolsdreamhouse": "ok", "pitty_1605": "Your a spastic", "tomlikessmirnoff": "they didnt knowingly bring it upon them lmao wtf", "d_f_col": "🤮🖕", "marcosroza7": "Tem que rir", "bradleypost01": "Hey Greta, care to mention how nuclear is the safest, most efficient low-carbon energy source? Maybe propose solutions instead of making speeches in front of globalist elites and then emissions will eventually be reduced.", "dianobutcher": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "soyandresbro": "Comete una hamburguesa chama", "630r63tf": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "blake.pomeroy": "Go back to your country none wants you", "civilbase": "Excellent", "sergeishishlin": "😍", "pfisteradrian": "Learn The fucking language Souhund # gretaout", "jedi_marcus": "#KnowNothingBrat #GOBACKTOSCHOOL", "ivanov.denis.321": "Зачем спасти мир, если оно и так скоро погибнет...", "nicolet_clara": "Beautiful speech", "songo.bruno": "Greta keep doing what you're doing. Climate change is already with us....it's not a hoax.", "bmxian16": "🤣", "berthaarellano": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼BRAVO @gretathunberg 👏🏼👏🏼👏🏼👏🏼😍😍😍😍😍😍😍", "aindomaveldozefelipeeduardoc": "👏👏👏👏", "latarione_miltonisaorious": "Dumbass", "fruity.enrique": "Haha fetal alcohol syndrome retard", "drewdogisme": "go rag on china and russia if ur worried about climate change stay out of the USA everyone here thinks ur a fraud", "matteo.davolio": "Brucia troia", "larslindkvist": "I haa då baara saaagt tjöööp ein triiihundra dissäl å fat tank borta finnland @jimeliasson 😂", "pabloarnalshelby": "🖕", "centr_jasnovidenija": "Иди учись \"активистка\"", "cuenen.etienne": "Do you need a pamper?😂😂😂", "69_clarke": "😂😂😂😂😂😂😂😂", "heidi_jimenez_wagner": "🙌🙌🙌🙌🙌❤️❤️", "callums_67": "Aye ryt", "knossi_meme": "How dare you", "j.akwa": "JOIN THE ✡️ILLUMINATI BROTHERHOOD🔺 Whatsapp us from any country, +1 6075620393 Are you a Politician,contractor, banker,doctor, musicians, pastors or what ever. Do you have a strong desires? Or are you chasing your dreams of becoming a billionaire? This is the opportunity now to become your title in just three days .No blood sacrifice.Distance is not a problem WhatsApp +1 6075620393 🔺. We have branches in every country in the world", "facund0xv": "🍖", "minguis13": "#Trump2020 🇺🇸", "delmiracamaral": "Vai estudar pirralha", "johauer": "Suck my ass dumb fuck kid", "mya_grace9977": "My friends dont support you but I do and I am trying to make them on your side but it is not working but I am trying my hardest to help", "jquinlan_": "shut up please", "martijngrunn": "🤣🤣🤣🤣🤣🤣🤣🤣", "lucaviviani123": "You say a lot of good points but you have no realistic solutions we understand its the older generations doing but we all need to help our planet so instead of doing accusations try coming up with solutions", "uebachpalenberg": "schöner bh ❤️❤️", "samocolnar": "🙌🙌🙌❤️", "paulfishstick": "No", "reck_it_ronald": "Nothing was said here", "dado0__gh_": "🔥", "barreto.vanilda": "@lopsshortencia e @lopsshelena lembrei de vcs.💕🙏💕😘", "adkins.bryce": "I don’t understand, if we stoped using fossil fuels the global economy will crash.", "engmspotting": "Greta said everything that us young climate change activists wanted to say but couldn't because of the ignorance of the government. Powerful speech Greta!", "aalii.ciiaa": "Can’t believe this girl is 17 😯 I though she was like 13 but that’s not a bad thing", "hsfromthe5": "I can hear anything she is saying i think it’s my phone", "ian.vrw": "what", "andremoreiratrickz": "Meu bem, cala bico", "stayhumble_10": "@edm.vlk good Morning", "hankmody2701": "OMG bist du behindert geh arbeiten oder mit Freunden spielen du kleine Göre 9,8 Millionen Follower 9,8 Millionen noch so behinderte wie du 🤮🤮🤮", "sporthelden98": "Good night‼️", "zzuannnsss": "does she go to school", "robertforejtek": "Kundooo", "daviskantor": "@gretathunberg Keep doing what you’re doing and never let them bring you down. You are great", "iam_vladimirovich": "💩💩💩", "major_teds": "Prety as always", "lucastcunha": "@matheushunger_ escola que é bom ela n frequenta", "mattb_118": "You have absolutely no idea what you are talking about. You have yet to preach facts.", "hedemalmcarl": "Greta youre growing up youre soon 18, we have to pour beer on them for tye reward for idiots", "to_be_prismatic__prismacat": "Konsum ist das Problem, nehmt Euch mal ein Beispiel an Greta. Keine auffälligen Markenklamotten etc...", "fex.136": "Go back to school", "_mathew_priv_": "You have autism you should be in the special ed class not doing this bullshit", "x_cod_xxsuperstar_xx69420": "Ima go outside start up the good ol f350 7.3 power stroke diesel and roll some coal in honor of you cooking burgers out your ass", "_sobol.ek_": "Хуйню пиздишь, иди в школу", "patrickraleigh_": "Shut the fuck up", "stevenjdoylebooks": "The truth is so sad. Thanks for your cutting words and persistence. The tide is turning. We have to win this", "kodey_shoemaker": "She doesn’t write these speeches herself. She don’t even run her own social media pages. She is just a puppet, and you all follow right along.", "cristal.ny": "@limabass", "stealyourbitch444": "bull shit", "adamchappelll": "Fax your not helping anyone or helping the word but wasting taxpayer dollars and your 16 16 you dont know what your talking about so stop the money we are wasting on you we could be donating that money.....", "panfo10": "👍👍", "bigpete_007": "H", "esti_bsr": "Bitch", "leandro._pdl": "Have you friends?", "roman.sinkevych": "Use this comment as a dislike (Gretta, you should teach economic)", "l.lxnq.cx": "No Hate aber was will sie machen sie is net gerade besser und wir werden uns eh net Endern also und jetzt kommen diese 0815 Leute und sagen lass sie doch sie Macht was bitch wir leben in Deutschland also bitte Last es wir dürfen unsere Meinung sagen also bitte halt die fresse du 0815 Person danke 😘🙄", "nikibagnacauda": "😂😂😂", "h.nur_1998": "America,ısrael shows itself by producing nuclear weapons!!!", "veudl15": "#mistmaz", "charbel_7_": "Omg i hate people who only know how to run their mouth", "really_mellons": "Io inquino quanto cazzo mi pare your mammate is troia", "verta716": "👍👍👍", "l95marsh": "Slag", "aighnabil": "Fagot", "jan_bruceta69": "mr beast is better", "nicholasjones_": "@nickfloan so inspiring ❤️", "badymer": "Знаешь, Грета, вместо криков ты могла бы заняться полезным делом. Ты только и делаешь, что говоришь такие же пустые слова, что и остальные люди. Ты посмотрела на тех людей и научилась только говорить. Сделай что нибудь полезное для природы, покажи пример своим одноклассникам и друзьям. Заявлять о себе нужно не словом, а делом. А пока что ты- как назойливая муха, которая жужжит то же самое, что и остальные мухи вокруг,только громче.", "yourlsd": "Please back to school...", "melvin_triple_og": "That's what a time treveller would say.", "mdm110301": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "dusty_balls82": "Go to school kid.", "oksana_27031": "🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🧩🤢🤢🤢🤢🤢🤢", "willwelsh8": "Almost sounded she read that off a piece of paper that she hadn’t written 🤷🏻‍♂️", "fusaro.matteo": "I want safe the world, but you (Greta) are very stupid. 🖕🖕", "dara_dwinanda06": "❤️❤️❤️❤️❤️", "petterssonjoar": "❤️❤️❤️❤️", "antigruen_": "Lange Rede, kein Sinn", "kingalber_20": "Greta is a shit", "l.supercraci": "❤️👏", "scr1pt_clan": "Hahhahhahhahagahahahahahahahhaha!", "jaytm_": "Greta takes private jets", "red_rose_house1": "Usually people can’t change without money this world, we all don’t like situations on our planet.But rich political people don’t care,they only still money.It easy stay and read about problems", "rafaeladamov1": "👎👎👎", "danburchell": "😂😂😮😮😮", "cohen_fendyk": "Shut up no one cares", "amelie.wsl": "@lxzx2506", "canlanaestrella": "Congratulations, take a photo with mature and you're the best", "chronic7drifter": "Just very bad", "fortnite.bestof1": "Sterb an krebs du schlampe", "jamesscott7663": "Great 👏👏 Greta, you're my source of inspiration 💞💞🇨🇲", "53marco_": "Wie wärs mit machen statt nur reden🤔", "userunexisted": "u complain bout people damage environment but you did nothing bout cycle or shit. Just stop your bullshit and back to school.", "daddy._.davito": "I don’t care because I know damn well I’m not gonna live long enough for the world to go to shit", "ryan.carr16": "Jokes on you i don’t have children 😘", "elmatiw_ssj": "No se le puede creer ni lo que reza", "_poeface_": "Kids these days... have every right to be angry. 👏 You’re an inspiration. 🙌", "nadinsheen": "🙏💞", "gagejbruce": "You don’t sound too enthusiastic. Also, these arguments are becoming empty. Where are your statistics, facts, and supporting evidence? Everything your saying is too broad, we need REAL/PRACTICAL solutions. I’m starting to believe you’re just a motivational speaker at this point", "______maruuu______": "Сдохни пожалуйста 😂 Ты бессмысленная пыль Просто пыль,которой не должно быть", "yzafx": "👏", "raylane781": "You will prove to be the greatest hero in the history of the world, keep up the good work.", "figuragrata": "why reading from paper the words which are supposed to come from heard? Looks extremely unnatural.", "__89__s": "😆🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "baston1975": "Zero because nothing will happen. Climate change is a myth and a billion dollar scam.", "gerardo_resendiz.g": "😂😂😂😂😂", "animals.r.mypassion": "Wow, you and Beata are two totally different people! You are the scientist, and she is an artist!💟💟💟", "kristinegrace1665": "She is so stupid", "milogoesmoo": "Hi I’m milo! 🐶 follow me for GOOD LUCK & CLIMATE CHANGE ❤️❤️❤️", "riang02": "💙💙💜💜", "jjtaw": "I’ll tell them if there actually were a climate crisis then climate activists like you ought to be fully accountable for your huge carbon footprint", "teddy_wdx": "@goniceuh encore 😂😂", "harry_garner2017": "Go back to school", "0scar.lopez": "Lest we forget the Australian fires were caused by arsonists trying to push Gretas agenda", "phuzzyknutzz": "Shut up", "gang_abstinence": "Nope cause of drought and overpopulation dima dumby", "aniafashionkochetkova": "Die, stupid scary slut", "shtz_pxscxl": "Shut the fuck up", "joonaaltonen": "New Adolf Hitler is born🔥", "xx_lilia_m_xx": "@gracie_.adams @cerys_harts6 I'm telling my kids this was the president hahahaha!! This bitch be slaying the game... Imma tell my kids this hoe is the reason u r alive ... JOKE", "e_facil": "Quem e mais feio ???? Pyonglee ou Greta Thunberg???? 😁", "privata_ma": "@_1amiraa oherreguuuud har värsting huvudvärken aiit vi fattar du stor upp för träden o naturen men hon hära säger samma skit 24/7 wla gabartan stinker säkert för att ma dushenin", "mgranada_150": "She’s right about climate change but come on lmao", "_max_lewin_59": "Bet this kid ain’t even got a geography GCSE, British kids faze up😂😂😂😂💪🏻💪🏻", "sansalellergezen": "Stupid", "maniac_mangler": "Fuck you", "ameliamaranga": "Shush", "ir_is4410": "💯", "rohanharish": "Still some people around the world are suffering with poverty. They didn't have a proper food and shelter .So many childrens are struggling for their education. Those people can't able to do #climatestrike .They need food,money and clothes.Some group of people around the world don't have a proper transport,communication and health service and they need humanity. So , 1st @gretathunberg should protest for #humanity.It will be the solution for all kind of problems around the world. Spread the humanity!💖💖", "the_red.wheelbarrow": "I will tell them i didnt care about it that much at that time😂", "lucasperez_067": "Diesel manda", "alvaroariass._": "I wonder que tu hicieras algo de verdad y dejaras de vivir del cuento", "ciurariu_daniel09": "😂Lasa politica si fa ti temele pentru scoala!!!", "14dominus88": "GREAT ACTRESS!!!", "fabiostefanizzi._": "Halt einfach mal deine Fresse man😂😂😂", "itzz_giuliaa": "The climastrike must be the first theme in all countries!!", "meryee1m": "@burcoux", "semihden1z": "@stevo.siciliano @m6sinan wie kann eine Stimme schon so abfucken", "dr_chim_richalds_1983": "😂😂😂😂😂", "hybridoma47": "Ugh", "irfan_ks_": "Ok now do it without a script", "itsfuckingfedee": "Link in bio donate here!!! gf.me/u/xggd6v", "iam_kwaven": "we need more words to see if the leaders would then listen 🇳🇬🌍", "kotek.sebekovich": "Левая хуета", "brayd76": "Liberal puppet 🤡🤡", "real.jay.al": "Just another government test dummy trying to act smart. I guarantee you she will be giving these speeches for the next 20 years and will accomplish nothing.", "lateamom13": "Ok greta", "raffaello.rizzi": "Go to school greta...", "_lxl_642": "Hœ", "messiasanjo": "fight for our world. Thanks Greta", "rafaelnogueiraz": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "lo.n3_ly": "MEKITARONLAINFACIAAAAAAAAA seguro la Greta en realidad es otra niña penosa de la derecha o de los liberalistas 😞🔪", "commonerstale": "@mrterryrod I think she should know how you feel 🤭", "marielsagi_": "Thank you Greta ... so much love and commitment besides your courage, exceptional human being, a lot of strength for all the people who help you and for your family 😘👏🏻👏🏻my respect and admiration from Argentina Mendoza, a giant kiss and huge hug !!! 😘😘 😊😊", "jetlir86": "Är så tröt på dig och din jävla propaganda om att värden är på väg under!!! Jag kan garantera att vi kan hålla på så här i 1000år till och inte ett skit kommer hända.. trött på alla er miljöpartister!! Jag kommer aldrig åka miljövänligt eller ta tåg ska till och med köpa en gammal jävla disel bil bara för att.. jag hoppas fler gör det med så vi kan vissa er att inte ett skit som händer!! Och alla dom jävla bränderna som händer 80%av dom är anlagda INTE PÅ GRUND AV NÅN JÄVLA MILJÖ.. hoppas folket vaknar upp snart och slutar lyssna på dom här idioterna!!!", "ali.husseini.03": "you have a powerful heart ❤️❤️❤️", "daniel.schons307": "Zionist", "chaps_1996": "Brilliant, very powerful & passionate 👏", "toby_bush124": "Be quite", "x_unknow_user.x": "Bring dich um", "adaqoa": "F**** kid. Go hell Bi***\" 🔥🔥", "aug1972": "🗣So many thanks 🙏 Greta", "onlyalexelmslie": "What if the world ends before you have children?", "legitbos6": "What have you accomplidhed by doing this shit. Tell me", "keita_yamada_kun": "Greta. Even if we continue to complain about the need for global warming countermeasures, we cannot achieve our purpose. Everyone is trying to earn money to stay alive. Such people can only think about getting money. If people are banned from working to emit greenhouse gases, many people will lose their jobs and prevent themselves and their families from continuing to survive. There is a need to find ways to create huge business opportunities and address climate change. I make that suggestion. He also commented on President Trump's account.  I propose a project of human migration to space. For example, a black hole engine will be realized. Many people will think arrogant. However, real technologists do not think that it is ridiculous.  Emigration of humanity to space. No matter what happens in the future, some humanity will survive.", "wehrmachtflavoredjuulpod": "Honestly my child can commit feetus deletus and so can i so climate change aint an issue", "_monica__": "God “Money” always wins out.", "rasulov5095": "what an abomination🤦", "plague_doctor5318": "Fuck you SUKA TUMBLER", "leox.1902": "How dare you", "kerdizheng": "@social.justice.alves OTHER: it is really sad that Greta Thunberg, a TEENAGER, is taking more action against climate change than most adults. The injustice is that the people responsible for the destruction of our planet are doing nothing to fix what they’ve done, and the generation after them are the ones who will suffer the consequences.", "idsers": "Детство у тебя блять забрали... ты в Саратове неделю проведи. Хуйня ты беспантовая.", "tigerman_mc_cool": "This is the kind of leader in the left wing, they speak a lot and never do nothing", "yulin3520": "m", "murrayfromjoker": "favorite actress", "guillermiinaa_": "❤️💪🏼", "pitasokirewa_": "Your face is annoying", "tacosandtaffy": "Hate when people use little kids as posterchildren for their movement. What shes saying is right, BUT shes a kid and knows nothing. Shes reading off of a script, written by someone that isn't her. Way to use Pathos in order to try to push people to feel a certain way!!! Insane.", "4x4mountain_man": "She is psychotic lmao", "daniiel.barbosasilva": "Oq q essa escrota faz pelo meio ambiente além de gritar feito uma retardada ,,??", "efrederick5482": "Trump Train next stop 2020 re-elect.", "earth.plus.me": "amazing speech greta!!", "hallie_mae3212": "You’re a puppet on strings being tugged by your daddy. Come back when you’re educated and you’ve studied so hard that your facts outweigh your emotions. #trump2020", "outlaw.095": "Fuck u🔥🔥", "trevorlwelch": "They don’t care bc they’ll be long dead before the have to face the facts", "_martzel_": "Blabla", "fitz_freo_2nd": "I shouldn’t be up here 🤣", "anorawrites": "From your lips to a global initiative.", "freehu4": "And what do we tell them when our economy is falling apart but our environment is a-ok? That we took action to save the environment with no thought about the economy that keeps people alive in important ways?", "austin.mendezz": "You are a puppet", "reet.su": "Shut the fuck up", "0903diney": "🤦🏻‍♂️ sensacionalismo barato!", "foxbaby16": "@taylormoulton how dare you!", "communist.peter.griffin": "Oh look at how much I care about her speech", "romanm1ller": "Уёбище 🤣", "barney_mathews": "@katie_gettins This is the dance i was telling you about.", "vap177": "Главное педиков не защищай", "reiferrr": "Dude I fukin love steak", "kindtraveler": "💪🏼👏🏼👏🏼👏🏼👏🏼", "memas.home": "У меня на странице мемы )", "ahsen_gzr": "How dAre you", "mika.sx125": "Junge junge wer will die denn flach legen🤦‍♂️🤢🤮", "geored85": "She reminds me of the girl from resident evil lol", "paolop79": "Ah Lesbica!!!!😂😂😂😂😂😂😂😂😂ma vaffanculo imbecille 😂😂😂😂😂😂😂😂😂😂 #trumpforever YOU SUCK! @gretathunberg", "jgnegrob": "Enferma mental", "mr_schneebly_2020": "Bla bla bla bla bla bla", "ben_xnnp": "I totally agree, I live in Australia, Melbourne, My house is still in flames, Everyone else thinks “Oh it’s just another fire” Umm No, The world is changing, We have to act now!", "_k8ngkofp0p_19051": "@dedekvenous", "benne_schmidt": "hOw DaRe yOu", "mata02_": "🛴", "peteandras18": "Clown 🤡🤡🤡", "srecko_kostic___": "How dare you", "vrbskymichal": "Fuck you ass holl", "spuge_69": "I tell Them prank bro", "eleanorfuckinghartvigsson": "Go and die fuck a horse", "directradiovoice": "I’m sorry I made fun of you when my grandma asked me about you. I don’t know what I was thinking. Pierre brought you into this mess. Now I care for you. Now, it means you are either a try hard philanthropist like I am or an altruist, and I respect that very much. I admire your courage.", "marinakohler131": "You are blessed, you are the voice of every heart that cares and we love you.", "fitness54dvices": "🤮🤮", "wwherearetheavacadoo": "Ur always on newsround.", "k.i.t___k.a.t": "👏👏👏👏👏👍👍👍", "weareamericanpatriots": "She just reads a script provided to her be others who wrote it. Most of the time she doesn’t even give valuable advice, just restates that’s it is an issue. Really wish someone like her would come up with an actual solution", "shortkidx3": "So talk? Instead of help? You're so smart you dropped outta School to become a joke.", "joeneticfreak": "IDIOT...your parents should be arrested.", "joannemini1020": "Lmao", "beaaaxz": "my hero", "beatricekeul": "G R E A T ... G R E T A", "bilotta_davide": "Ma la cosa bella è che ti invitano pure", "joao_13_official": "Shut the frog up Greta 🔥", "shervin.2579p": "👏👏👏👏👏👌❤️", "binnoellwanger": "PIRRALHA 🖕", "salami_463": "👏", "ebnusahab": "Great Speech Greta, ♥", "lalalalalalaljj_": "How dare you", "ezequiel_cnc": "Dude the fires were started by over 200 people", "janainafernandes332": "Me desculpe mas vc não entende nada ainda e só uma criança mimada", "mannecw": "You’re Baddd Ass.... thanks 🙏 ❤️🔥", "manuelviveiros": "I think this child needs to go back to school and learn something", "mansurmariaalice": "Lucky you to be born in Sweden. Your voice is heard everywhere. I live in Brazil and the president does not care for Nature, environment and the Rain Forest.", "hasseltornet": "👏❤️👍", "marcos_avalcante92": "Vai procurar uma lavagem de roupa 😒", "jcarloss83": "Pirralha", "_chubarovvv_": "Go fuck stupid bitch", "ds77783": "❤️❤️❤️", "moxamdh_nuur": "🖕🖕🖕🖕🖕🖕🖕🗡️🗡️🗡️🗡️🗡️🔪🔪🔪🔪🔫🔫🔫🔫🔫", "tonydetroit": "I don’t know what’s more pathetic.. The adults listening to an uneducated child or the liberal media for spreading false propaganda about global warming.", "ss.jakko": "Asså du suger på att stoppa allt no cap dina fkn tal hjälper it", "jstra82": "So hilarious people listen to this little retard. 😂", "kostimpakos": "Ρεεεεε φύγε από δω ρεεε μπρο!", "shanquan_": "Aquire sum drip", "veyxi._": "Climate change isnt real lmao", "ashredincurry": "All of these comments just prove how humans struggle so much to work together to do anything worth while. We are a virus and we wont destroy the planet, the planet will rid itself of its virus just as any healthy system does. How do humans go through life feeling good about so much wrong? Whether there is climate change or not, take care of your fucking home!", "mucelinjoias": "Interesses políticos é algo incrível... envolve até crianças. Triste realidade que ninguém observa.", "guanshanzui": "Notre Dame bitch", "ana_rita_font": "Procura estudar pirralha😠", "petit__fauve": "Where are her parents doctors and the caretakers who clothe her. What a sad story for a child with Aspergers. 🙏🦋", "bethanyb679": "Good work", "bazstclairart": "Sad", "de_wet_04": "How dare you", "nico90thanatos": "What you want Little Child 😂😂😂😂", "shpakandrei": "🤦‍♂️LOL", "xelapwc": "Hypocrite", "volkhgorynych": "Невежество 21 века 😏", "jessejamesweedman": "YouTube \"Greta Thunberg Incorporated\"", "destroythesystem": "Stupid bitch shut The fuck U u brainwashed bitch DIE", "arora.eyberg": "👏👏👏😢", "dionne_6": "@lise_boschman12 haar insta 😂", "ryan_paradise": "I'll be sure I cut off my catalytic converter in honor of your speeches 😉", "thestephstanford": "We support you. We support and choose Earth!", "joe_wnu123": "This girl is the reason i dont feel bad wen i litter", "olleg2222": "Мать жива?", "pepelude": "Niña!tienes que leer más!sobre la edad de nuestro planeta!y sobre la edad del ser humano.....seguro que te sorprendes!", "alfredssontobbe": "GRETA IS A MAZING 🙏🙏🙏♥️♥️♥️", "r0b3rts_": "Like I say on very single one of yours speeches, this is great but where’s the fucking solution to these problems", "____pretty___boy____": "Может ты пойдёшь нахуй по дальше сначала отучись потом вякай 🖕🏼🖕🏼", "eewerton_araujo": "Ninguém liga", "sn_102er.2": "Endlich mal ein vernünftiges Thema", "amelie_wltr": "🙏🏼🙏🏼🙏🏼🙏🏼", "aoodnes": "Finish higher environmental education and then say something!", "gallagherpersson": "Who wrote that for you to say little girl. You should really lookup what you're talking about before you regurgitate what you read from your notes. Good try but no one can take you seriously as a goon for AOC. I hope you can lean the truth about all the lies you were told. Good luck child", "jonasjazzgot": "She's only reading what her dad wrote, that's all she do, and yet she's the person of the year.", "rudenko.st": "Ебать ты конченная. Земля тебе углеводородным топливом", "proudtobecroat5473": "Ti si poremećena......", "devon_hvh": "Hou je bek kech", "paniukhnoanatolii": "Кто нибудь уже ей скажет что она имеет сдвиги по фазе? Её уже лечить пора.", "alex_lys6": "Задавите ее камазом. Самый наивный и \"больной на голову\" человек!!! Еба, это же так просто сказать \"Австралия не гори\" опа и она уже не горит👏👏👏 И в пожаре люди не виновны...", "ellie.davies.10": "How many more innocent lives have to be taken for this to be taken seriously ?", "tamazisujashvili": "😭🤮", "ufoglobal_italia": "❤️", "gian.nks": "I disagree but ok", "sebastianperez496": "Estamos con tigo de mil corazones y amores ust deberia ser presidente mundial de todos los presidentes si así se les puede yamar imnorantes acaba planetas... Adelante con toda hermana dios te dará todo lo que nesesites para tu camino🙏", "danialkhaliff": "👍👏👏👏", "ahhh_its_abair": "Why isnt fact check on this", "its_.ryan123": "Shut the fuck up you cunt", "yes.sixxty2": "больная дyра", "piscescyan": "🙏🙏🙏🙏🙏🙏", "nsd582": "How many diesel generators will fuel your electric cars! How dare you!😂😂😂", "zero.waste.vision": "👏👏👏", "angier2a": "Bravo🙌🏻 ❤️", "jeff_da_potato": "HOW DARE YOU", "denilson.gomes.581": "Vai estudar pirralha ,onde que vc entende de política mundial.", "gage_minner": "Ha look her people are trying why don't you go to work at putting the flames out not speak out on something only God can fix I'm a day not your words nor ur ideas shut up and go back to being a kid u don't do shot but speak on this (they need to take action) same shit \"they\" are saying why don't you do something since your so special", "el_tio_matt": "Dice @auronplay que saludos que te quiere guapa", "matheuslmas": "É com escript é fácil, venha pra luta aqui na nossa Amazônia, você não aguenta nem uma semana 🇧🇷", "jared_seiya": "You are a very good actress😂😂😂😂", "prajay_jain": "They keep Deleting comments which are not in her favour otherwise the comment section would be opposite.😑😑", "carmona7555": "Spoiled brat", "shoaib.azeez": "Awsome speech Greta 👏", "isadankers": "❤️", "kuki_chillz": "How dare you", "fernandot.h": "‘How dare you?’ 😂😂😂", "__lisaripia1": "ya'll males are just fucking jealous that a little girl has more impact than you ever will, retarded cunts.", "vigort9": "Who is paying for your PR? You're pathetic attention wh....re. Get educated.", "eva_franco_g": "Me encantaria que los discursos sean subtitulados en español 🇵🇾 éxitos siempre", "rohan.06_": "Go to hell", "juliet_tango19": "Our climate had little impact on what happened in Australia. Criminals (aka humans that intend to do evil/harm) created it. 🤡", "grazivaliatti": "Falou a riquinha que tem cara que paga minhas contas de um ano kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk", "petschinator10": "Greta stfu and go to bed", "owen.collier11": "I think I’ll keep rolling coal and smoking tires and doing all that fun stuff thank you", "azalia_aguilera": "How dare you🥺", "lalithamanirajasakar": "😢", "pattyggou": "I really think that you should be living your youth in a normal way. It will be to late when you realize you lived your life as an adult since you were just a child. Sad."}