{"gretathunfischberg": "Idi nachui", "od5964": "Hipócritas", "lxxa00": "Go to school another I kill you", "janetnebraska": "All i see is fake faces😮", "parketovy_drak": "kinder mafia krista boha", "karan5516568": "She’s so freakin fake", "tyessia14": "Amazing 👍👍👍👍🔥🔥🔥🔥🔥", "bahram.1372.m": "💩💩💩💩", "bortaaaas_": "Du är 17 år gammal wow förlåt men du liknar å va 10 år 🙄", "edith_stina": "You really fight a lot for the climate and I love that.You have made so much improvement and you have also got me thinking💪🏻💪🏻💪🏻💙💙💙", "joeflannery1": "🤡", "lory_angioletto02": "Zucculooooooo", "barakatyounis": "loyal moon smile is hugging our heart .. our voices isn't heard but we respect your wonderful personally .. thanks for your exist in our world Miss girls @gretathunberg", "fabi_ing._xetro": "@holzerjess", "hilario_sabao": "Dislike", "hermes_top": "🖕🖕🖕", "elisabethdesvalois": "Oh qu'elle est idiote", "tj_dj01": "Love your work, keep it up", "hunter_adcock_": "Clown ass", "giuseppesassi": "You are gross, especcialy your face, kill yourself", "nsuhanitski": "ugly ass", "diegodesouzaromualdo": "👏👏👏👏👏👏👏👏👏", "alle_sousax": "#f4f #sdv #followme k", "quantumlillith2": "Every level, every step, let's keep moving forward. There are so many links to every chain and each one 🖤 is important to be looked at and made new. 🌕❤ I believe we need to have mandatory brain scans by trusted people/equipment......................... and put people who.................................................................. scientifically have brains that care to work with human rights and all matters of............................ sustainability!", "ma01007": "😍😍😍", "ohmyitsjesus": "Go away", "american_savage": "God Bless America #trump2020 🇺🇸", "matteo_pirson": "Sale pute", "d0m3.rpg": "Haha lach so dumm weiter", "lw_1501": "greta ist zum islam übergegangen", "balexandruo": "Come to Rumsnia Grets", "imad040__": "Pute", "philipfransen07": "@jessmacsween Sorry sorry 😁", "memes_in_your_butthole69": "Go back to school greta", "maghrabii_2002": "You are amazing❤️❤️❤️❤️❤️", "18800_kolya": "@________daryna_________ Греті тунберг 17 років...", "rruby.vb": "Greta your a hero 🦸‍♀️ 💕💕", "585.jake": "Gay shit mega big", "sandra.krosman": "HOW DARE YOU HOW DARE YOU HOW DARE YOU😂😂😂", "leon.sr_": "Plastic", "christineroedelius": "People are afraid to listen to the truth but gradually more and more people will open their mind and say to themselves:\"\" I do not take the plane i go by train..... Or \"i will eat more vegatable instead of meat... I DO NOT DO THIS OR THAT BECAUSE GRETA WOULD NOT LIKE IT..... LETS TAKE LITTLE STEPS EACH EVERY DAY, TALK INSTEAD FIGHT - THANK you Greta-all the little steps eill become a cloud of hope and peace and the rain will renew the world", "worldrecordarctic": "Like my post ❄💕", "smamancio": "Você não estuda ??", "momokonohi": "As much as I appreciate Greta‘s efforts in fighting climate change, those demands only treat the symptoms but not the cause. As long as the worlds population continues to grow (1928: 2 billion to 2019: 7.7 billion) nothing will ever change. Even if each of us limits its CO2 foodprint to a minimum, it can‘t be reduced to 0. The only thing that really would help, is to stop having more than two kids (basically just replacing ourselves)...", "renatinhaoliver00": "Pirralha", "blake.ig.w": "How was the journey? Take first class or sit right on the floor?", "idontshutmymouth": "of course, the crisis has never been treated like a crisis.. because there is no crisis!! the only problem that we have on our planet is the massive boom of the african and asian population", "lisbethduport": "Bullshit", "andrers26": "Parece o e.t , o extraterrestre daquele filme antigo...", "ka.t.0": "no miau", "rock_wallaby56": "DUMBERG !", "_guido_033": "I like co2", "weco_world": "Goooo", "nowactivism": "honestly an inspiration to all", "__cadu____": "Pirralha", "soham3823": "Please expect something good! Healing.", "fxcking_lit": "🚮", "_.m4rkus._": "👎", "italyheals": "Awareness is plenty high. People don’t want what you’re selling.", "matveybelyaev": "Outside", "vasodeaguacaliente": "Qu", "_shkoda_13": "Suck", "shooting2302": "Go back to school", "romankleutin": "🤮🤮🤮🤮🤮", "elshan_50_50": "Wooww ugly face", "morten227": "Find a docktor😡", "mariadelsolmusic": "Keep going, Greta! You are a beacon of light in this planet and we love you! 💜💜💜", "swefenborg": "https://www.aftonbladet.se/nyheter/a/70gwLv/v-ledamoter-vill-ge-greta-thunberg-fredspriset", "al3x.krs": "❤️❤️❤️❤️❤️Wildddeeeee müttzeeeee❤️❤️❤️🔝", "samak0veyy": "No hate or anything but like is all she does is go to rallies and crap and not actually like invent things to help the invironment? 🤔", "backpacker_carl": "Support you from South Korea 😀😀", "siksa_kubur123": "How r u lit girl 😍😍😍😍😍😍", "nikhaad_soisob": "🔥👏", "_tobcas_": "Ritardown", "leane.dcrs": "😒", "angela_werneck": "👏👏", "hacer_klein": "Wunderbar😍👌👏👏", "annadevins62": "Fascits making a cash grab.", "tiemespandaw": "if the earth is getting warmer what are those clothes for", "radda.klimatet": "Hej vi är en klass från småland alvesta vi har beundrat dig sen du började. Hoppas du ser det hät. Vi följer i dina fotspår.<3 <3 Vi undrar om du kan följa oss!!!", "squish65": "🤮", "hoomanshamsbrd": "تویه دخترلوسی که تو لوکس ترین کشوردنیازندگی میکنی وخوشی رده زیردلت چزاکشورهای ما نبایدمثل سوئدبشه؟؟؟", "slomoro": "Trying to combat climate change is not economically rational. Educate yourself.", "nancyglassmanartist": "Not addressing climate change is irrational in every way, including economically. A true education includes learning about the natural forces that are determinate for all life, of which, we are just a piece.", "deborusso96": "🔝🔝🔝🔝", "jedi_marcus": "#MIDDLESCHOOLDROPOUT #ClimateHowxDownie #ClimateHoaxClown 🤡 @gretathunberg", "rustemrianov52017": "Какие же вы глупые", "jackm_234": "God created d world he has d power 👀🖕🖕🖕🤡🤡", "voitucol": "🌍👍 c'est les petits ruisseaux qui font les grands fleuves 👍🌍 il faut persévérer...😉", "ams1983": "doomed to failure. You know it well, you are nobody and everyone will remember you anyway, run to school because mom and dad will not forever wipe your ass, stupid girl.", "_stevey.jay_": "for all of you liberal tree huggers who believe this crap.... here are the FACTS  CO2 Makes Up Just 0.039% of Earth's Atmosphere https://sciencing.com/percentage-carbon-dioxide-up-earths-atmosphere-4474.html And humans only contribute 3.4% of that 0.039% of CO2. THAT'S IRRELEVANT https://www.dailysignal.com/2009/03/27/man%E2%80%99s-contribution-to-global-warming/  All of the sources that are PRO climate change don't talk about percentages, but particles, because it sounds like a lot when its in the millions. But when you compare these particles to the rest of the gases in the atmosphere, CO2 amounts for 0.039% . The earth always has been and always will change. THIS IS JUST A LIBERAL POLITICAL SCHEME AND ALL YOU DO BY SUPPORTING THIS IS WAIST BILLIONS DOLLARS. https://www.co2nsensus.com/how-much-money-is-spent-on-climate-change-research", "marisasykes13": "Thanks for the inspiration!! Love and support ❤️❤️", "johauer": "Did you drop your brain on the street??", "gerard.lo": "Esa niña se ve diabólica @__barbc", "andrewborisych": "It is a pity for the sick girl. The absence of a brain in her head is reflected in a similarly ill Europe. A mentally abnormal person is a threat not only to the family...", "matteo.davolio": "Succhiami il cazzo stronza", "elvis_2708": "Du schlampe", "_jonas1927_": "In German we say: Geh zur Schule du Göre!", "lucasmajurana": "🇦🇺", "matteo.canaruttogatti": "Hi!👋 I am an Italian boy who just created a petituon on Change where ask' s the Italian goverment to don' t release any CO2 by 2030... Could you publicize it? Pls🙏🙏 http://chng.it/7s7dGCdCks", "massimo1188": "Io sonp giorgia", "mike_bravo06": "Go to India or China if you wanna be taken seriously, you socialist little authoritarian Soros agitprop puppet. @gretathunberg", "religiousheretic": "Oles a pichi", "alexsevenrings": "i'm sure you'll change the world to the better and better.", "cherry_767": "Trump2020🇺🇸", "jungamerican": "crack environmentalist", "uebachpalenberg": "man sieht dass du deine periode hast!!!!", "gabriel.amor_": "Go to school", "branimax000": "🤮🤮🤮🤮", "cry65ssy": "Gorgeous Greta🍀🍀🍀", "fucdapols": "Is that a synthetic jacket?", "manxn_25": "❤️❤️", "ameliavx_": "@pat.tokarczyk", "williamlehtihet": "Du är dolig", "owanjudeo": "Nice smiles", "sonaa.me": "👍", "daviddegier": "Kkr", "veljko_veljko": "How about china and india and there pollution ? How come your not talking about that ? Your a joke.... just another tool that politicans are using", "sporthelden98": "🤦🏻‍♂️", "trubois.botman3b.x9_s5_6j1l": "🤢🤢🤡🤡", "sizilianischemafia": "Karadagt supermatkt mega nice", "iry_foxy": "So proud of you and umm question. Which renewable source of energy can power most countries? I'm just curious.", "egorillaa": "Пизда тупая", "houstonianspetson": "All that long hair. How much water and products do you use? Women are the worst offenders Id destroying earth and yet you Damn men. Please look in mirror", "crazyhearts2013": "You and your lovely surrounding, keep the good work and I as a filmmaker, inviromentalist, recycler, animal and plants lover,vegan and kind I'll help and show more knowledge to regular people.🎺🎺🍃🐛🌱🌻🍁🌷🍒🌹💐🌺🍂🌷💋", "horowitzaaron": "Why don’t you lecture China and Russia instead if you actually care.. which you don’t.", "irisjulyane": "❤️", "basreederss": "@fabdeflab are you changing the world like her? I dont think you are bitch", "seannputt": "get back to school", "valery4fun": "Ля, какая жалкая персона🤮", "inmess10nante__": "President Trump was tough in Davos. He mocked clowns.", "zxandrei": "Stupid girl, go back to school!!!!", "vegasarielle": "Bravo darling! 👏", "world_health_charity": "Hello, my names Harry. I live in Australia and have decided to try and make a change. I know it’s not anything yet but with help from people I can grow this platform to reach global awareness. Would you please consider sharing my page to help create sustainability for the future generation. Thank you!", "yu.carniello": "You did a very good job Greta!! The planet is very precious and deserves a loud voice like yours!! Go Girl!! 👏👏👏👏👏👏", "carlossz1": "School: lose, lose and lose", "bellatravelblog": "Check out my account? I’m trying to increase my following 😃 I run a unique eco-friendly blog. I’d love it if you could check it out and follow if you like what you see. Thanks! ♻️", "urfather6900": "Ugly as fuck", "semih19fyr": "Jag knullsr din mamma din lilla horunge", "bonilhaluciano": "the imbecile, what's your next antics?", "suzydenisecarlson": "Fake fake fake!!! Go away little girl", "ann_mariya_alby": "👏👏😍", "nathan.bnf": "🐄🐖🐐🐤🍽", "ecology_world_love": "🍃🍃🍃🍃", "richie_buttery2006": "How dare you 😂", "marix_clx": "@marc.hlr", "gordon_jfraser": "Get back to school, puppet!", "elan.gm": "I dropped a crisp packet today get rekt", "formulastorica": "Fuck you 🖕🖕🖕🖕🖕🖕🖕", "josephine.gnw": "Salat mit Thunberg", "mx250nevio": "Greta du alte kippenschachtel was geht", "xmelihadik": "👏", "denis_33er": "Kahba", "tahirsuvari_": "Tipini sikim", "tayevans_55": "#gretakilledkobe", "l95marsh": "Slag", "toby.es": "Fck the world, lets use more plastic", "vanikarle": "Du siehst aus wie 10😂", "manyaexot": "Greta, fuck you", "nataodyvanhik": "👍👍👍", "erich.chevy": "Trump 2020 🇺🇸", "dima.kharitonov2017": "Я из России. Рад что ты хочешь чтобы мир стал лучше.", "_war_rev": "Crazy sick girl", "vontsch1": "Figg die", "offline_avonturen": "U stupid #fuck! Go to school and learn about climate, how it works and how it does not affect our life. Thanks to brainwashed heads like u i'm no longer allowed to drive my gorgeous 30 year euro 0 oldtimer which i have been WORKING and saving money for since my 18th birthday. Thank God for global warming. The sun is the main driver of climate change. Not u. Not CO2. #savetheclassics #nolez #grandsolarminimum", "mauricio_ribeiro20": "Where's @georgesoros lol 🤣", "adam_an__": "U look 2 lol", "levfriluftsliv.se": "Greta Lyft det stora problemet med hur mycket koldioxid nötkreaturen släpper ut. Se Cowspiracy för inspiration. Du är fantastisk💙💚", "alexandre_gbx": "@nathan.bnf 🐄🍽", "demonicvalkyriev": "Come to Texas, we’ll show you what real global warming is, shove your face in the sand at 108 degree weather", "otimedetodos": "White Human", "glenyson_mafra": "🙄", "heyarvy": "Stfu stay in your country, you’re a child trying to tell people that have alive way longer then you what they should be doing. Stfu you rtard.", "alexandre_veschambre": "Lovely !👍💚", "la_wowmom": "#gretaInc", "_petaradenkovic_": "Najebem vam se svima mile majke", "sergegeanclaude": "salut", "dqxvg": "I chume vor dis huus chlei go gäsele mit mim anti öko töffli", "logan.is.a.dork": "there 👏 is 👏 no 👏 crisis 👏 stop 👏 fear 👏 mongering 👏", "sponsormeachicken": "You are AMAZING, plz, dont EVER let anyone tell you, or \"Bully\" you into straying from your path= looking out for our shakey world, Go, you, you have my support! 💚NZ supporter!", "jbsailahoy": "Everyone should strike for the environment!", "gyeongsun553": "😍", "brasso_col": "pack of idiots", "chernoff.sasha": "Ебанутая 👏😂", "_elliot.j_": "How dare you", "_endi04_": "😂😂😂😂😂😂😂😂😂😂", "cindyp125": "I know this doesn’t relate to this post, but I have to give thanks to @earn_with_lisatrade who made it possible for me to earning $10,000 weekly. Thanks allot miss Lisa @earn_with_lisatrade", "79.leonida": "🤮🤮🤮🤮🤮🤮🤮🤮", "badritetemadze": "Such an inspiration and I do support whatever she does!! But it's a shame for the world leaders to need a 17 years old school girl roaming around the world and striking in order to face the truth and go for action!!", "partyananas_0.2": "Geh dich vergraben 👋🏻👈🏻", "udntknownothingbouthappiness": "What do you want to transmit with that picture?", "luissqf": "The challenge to the bucket of ice", "willh.it": "Соси хуй, овца", "vanynegr": "Может сперва закончишь колледж?", "ggga.aal": "Ты тупая дура, что ты знаешь о жизни в России, только и умеешь языком чесать, истеричка", "finn.cfl": "Fridays for hubraum❤️", "fabi.ksm": "Down😂", "zloy_roy": "#gretasavepaper", "amelie.wsl": "@lxzx2506", "canlanaestrella": "She's afraid because it's a butterfly that prefers to be only recognized by the onu", "tapjankson": "@anggana541 She don't give a f**k! She don't care about the Corona virus or antibiotic-resistant bacteria, which will soon be the world's greatest challange. Then it doesn't matter if \"our house is on fire\"", "rodriguez1serapio": "👏❤️❤️❤️", "phuzzyknutzz": "Go to school you uneducated muke", "conrad_d92": "Why do you look so young at 16?? I'm not throwing shade I'm actually confused", "kechoshiu": "So when do humans put aside their profits and stop pollution?", "1_dlowe": "🖕🏽🖕🏽", "scottylondoner": "Do some campaigning in China next, they are causing untold damage to the oceans and environment.", "anton439": "🤡🤡🤡", "shtz_pxscxl": "🤢", "ingmaribogatic": "You are right Greta! Never give up about the future!", "lukion_": "Fotze :)", "mariavitalinaarrua": "Oiko la itavy'a que te sigue😂😂", "onemillionofus": "Keep pushing🔥💯", "spwiseguy": "faker", "adept648": "Why are you so stupid?", "mikefla_tenn": "Climate change is Fake News", "al3xduv3tvem": "Damn greta u ugly af du ser ut till o va 12 du fkn gör d för pengarna du måste ha papper för tal fan du keff dålig. Hur ska en sån liten kelp som du fixa detta. 😂 But keep up the World people not this little kid du gör d för para. Du spenderar inte dom. Fattig nacas.", "igor_meowmeow": "The climate stole my tail 😢🔥", "bearmaximus": "Trash", "grace.koea": "Courage brave jeune fille ❤️", "rikibauxi": "🤨🤨🤨🤨🤨🤨🗣🗣🗣🗣🗣🌰🌰", "svg_vo4ka_one": "Тупая дебилка👍", "sexocet": "You’re a weird strange child. Maybe go back to school and actually learn something.", "davidreynolds352": "Boycott China", "maxmart.in": "Who asked?", "bergstrom0503": "Du ser ut som en 09", "mbennett302": "Why aren't you going to Russia, China and India. They are the ones that are causing most of the problems", "a_few_road_trips_and_some_food": "Fuck off you european dog", "luisiba31": "Mira niña tú lo q tienes es una hostia q vas dando lecciones cuando ni siquiera vas al colegio ni has trabajado en tu puta vida , porq no vas al colegio y te dejas de gilipollezes", "garrettkte82": "I thought if the world is getting hotter you shouldn’t need to dress in a coat and scarf", "kebisek_j": "Back to school kid!", "betao.betao.102": "👏👏👏👏", "jooaaaaaann": "Bbsita❤️", "sacheehl": "You’re annoying as fuck", "adam_van_os": "#trump #trump2020 #trumpforever", "renanleitau": "Chto delá'? Ask the title of an 1863 Russian novel: 'What is to be done?' The author was a political prisoner and - in the Gulag, - he expect. Even today we hope ... Wait, Jane Fonda had a great idea! She put it in a video!!", "coletrain4_": "Shudnt u b n skool?", "rickymoore_18": "We as in your parents", "titouan_9431o": "Eh nique ta mère tu mchauffe grosse salope vas à lecole", "der_ewige_schnensch": "lebendiger Abfall", "lyrical_portrayal": "💛🧡💚You", "kilian_reiche13": "Wie alt ist sie, drei?", "juniore_briel_fanpage": "H", "monsieurfortuna": "Go back to school kid", "caalmeidaco": "👏🏽👏🏽👏🏽👏🏽", "abombated": "Greta senti me again, levami un dubbio perché me se sta dislocando la pacchiacca pelosa: ho saputo che vuoi studià allora è meglio concentrarsi sull’asfissia dei topi nelle fogne di Roma capitale (#savethetope) o la tragedia zoofila dello slittamento unclockwise delle trote del Malawi (#unslitthetrout)?? Sound off in the comment section below. Grande continua così, pensa a salvare il mondo #australiahatesyou #riseofthephoquetwentytwenty", "dr.richardk": "You are an ignorant, mean little degenerate troll...you are as ugly as your disgusting non-smoking face. Go back to school, learn something and shut that face!", "_lxl_642": "Ugly", "mantocaz": "This is another one of \"your\" posts written all by your precious father, right?", "catherinerobinbonnet": "👏👏", "saft.graffiti": "I Like Trains Greta", "noah13012": "Hässlich", "selected_jpeg_works": "@stephenmerchant 🔥", "rkazmier": "Zero emissions immediately. There’s a reason no one takes you seriously.", "dvcxjfdhxgf": "🤮🤮🤮ты рожу свою бачила?", "dergachevofficial": "Балаболка", "twiga269": "✊🏻✊🏻✊🏻", "hava_.hh": "i love your face #no hate", "dsch1derinioc": "Fuck u", "nikitabilibin": "Fuck u", "growtrees4planet": "If the majority of the people in the U.S. stopped going to work and school and started revolting against the system instead, which is causing all life on earth to suffer, then what can they do to control us? We outnumber them. The reason they continue to have power over us is because we let them have it! We can do this. All of us. I can see it coming soon. Those of you that feel the same fire growing inside of you, Act now. Nobody owns Mother Earth. If we all stopped funding and depending on large corporations then they will shut down (Walmart, McDonald’s, Coca Cola etc.)", "wqx123890": "Wow😮", "_hogix_": "How dare you", "sharonsft172": "@maya_shrz hübsche❤️", "maya_shrz": "So pretty 😍", "cleber.araujo.9421": "RAAAACISTA", "rodrigocarmo": "Why u dont Talk about China??? Less Teathre 👎🏾", "xx.vladimir.a7": "Jesus Christ you are so overrated, you are doing nothing but talking crap that no one listens to. Go to school, study science, develop something that will actually help fight climate change.", "jessicachristinaaf": "Pirralha, cale a boca! 😠", "antonsteinstein": "Gretas Eltern haben ja ein Buch geschrieben. Das ist gut so, aber ich finde, man sollte wegen der Umwelt (Papierverbrauch) Bücher vor allem digital lesen; so wie diese hier: https://www.hjb-ebook.de/49211/kaiserfront_extra_8_aufstand_in_irland_sinn_fein_und_ira", "eugenia_just": "We have to fight for the climate", "ianalexblease": "Anybody here have a PhD in science, climatology, geophysics, chemistry, or cosmology ?", "sandermorken": "How deare you", "itsfuckingfedee": "Link in bio donate here!!! gf.me/u/xggd6v", "muskan.lalwani_": "❤️", "mirways_": "Детство у тебя блять украли. Хули ты лыбешься чмо?", "greta_hater": "Bella come la fame in Africa", "arkaaaadius": "Who the fck gave you the right to speak without having even the most basic education 🤦‍♂️🤦‍♂️", "_jul_u": "♥️👏", "once_upon_a_life_world_": "Poor girl....", "denyshapoval": "Кончита🤯", "_.nguyen.m.david": "Cutting off fossil fuels completely is a very large demand and unrealistic. It sounds good theoretically but is not practical whatsoever", "jvubob": "I think your global warming", "boogie_bunny": "Зүйтэй хичээгээрэй дэмжиж байгаа шүү 😃👍🏻🙏🏻💪🏻", "karina.miotto": "OH YEAH!", "billredolivefalk": "That sounds well!🌻🌹❤🌼😊", "wayofthewater": "https://www.davidicke.com/article/562830/clintel-good-news-greta-no-climate-emergency", "bikers_heaven.345": "🤮🤮🤮", "paulboyden": "So proud of you Greta.❤", "jaboc.oppman": "Söt", "marcelotedim": "🤮", "r0bert.edwin": "abla senedn korkuyom 😎", "danielj6969": "dumb bitch 🤡🤡🤡", "_just.tucker_": "You look like the fst kid from \"Cat in the Hat\" that beats Cat with a stuck when he's acting like the pinata.", "larshovingg": "I still love eating dutch meat like Frikandel its very lekker", "aspvera2007": "❤️❤️ 🌏🌎🌍", "flightjomppe": "Fly Qatar Airways! Qatar Airways =Always the best😋", "azucena0022": "Ya hueles greta", "jon.jonidaa": "You're so discusting", "lilliemaehalpin": "as you can tell she’s staring at me and pulling this face", "olgairisb": "👏❤️", "_heydan_cars_": "How dare u", "chase_sabs": "Hey Greta go back to school bud you are not helping anything 👍", "fletch_44_97": "You are amazing Greta, never give up 👍🌎", "nailbender3.0": "@gretathunberg poor ignorant political puppet", "robsonpal": "Idiota de mais kkk", "_theycallmeartist_": "💜💜💜💜💜", "shengbofujing": "🙌", "stephanieekayy_": "@matttheging is your biggest fan", "musings_goodthings": "Greta how about starting to address food waste - major contributor to climate change and a change that each one of us can implement now. We are most of us guilty of this.", "feni333": "This is true Greta is the beginning. It is the beginning of change. 🌏🌎🌍💙💚💖💫😎✌💖💞💞💞💞💞💞💞💞💞🔥", "alexandermoiseyev": "Какое чучело🤦🏼‍♂️", "neoncandyco": "This is inspiring. Follow us, Neon Candy Co., and see how we’re replacing plastic consumption and researching plastic product alternatives. Las Vegas local company. Much love -Shaq ✌️🌎", "linusc64": "💚💚💚💚 💪🏼💪🏼💪🏼💪🏼", "doctor_oetlul_013": "Ga toch lekker je aardappels schillen joh.... @jdm.tim ofnie", "stu_legault": "🤣😂🤣😂", "kindtraveler": "You are amazing and an inspiration to ALL! Keep shining your light and raising your voice. We are so inspired by you, keep up the most excellent work. 👌🏽✨😘", "amypics1122": "👁You have got the Right Idea and You have got One Up on the Comatose Clueless drunken into a Stupor by their False Financial Wealth which is Boring, meaningless and Annoying at best. Good to EXPECT NOTHING from the Walking Dead and FOCUS Your Attention on Promoting an Immediate SHIFT to ELECTRIC VEHICLES WORLDWIDE, SUSTAINABLE LIVING and 100% GREEN ENERGY NOW. Promote a 100% BOYCOTT and DIVESTMENT from of ALL CORPORATE INDUSTRY and PRODUCTS. The Masses HOLD ALL the POWER by their CHOICES and YOU CAN INFLUENCE THAT NOW AS YOU ARE ALREADY DOING ! Brava !! ☀️🌈🌎🐾🌍☀️🌏 Above All Find Your Inner Peace and Power and ENJOY the PROCESS ! LEARN: Timelesstoday.tv ☀️ 👁awakeisme.com🐾", "memas.home": "Хуйня 👍", "yourlocalgingergurl": "@chief_philosophy_officer", "julia_kawinska": "Go fuck yourself clown face", "freitasdario52": "VC NÃO PODE CONFIAR MAIS EM NINGUÉM MAIS!!!... PODE SIM A MUITA GENTE BOA NESSE MUNDO .", "yodajihad": "Go to China and india", "iamarletteg": "👹", "gleiceofficiall": "Miriam Gleice👑 Elle Fanning👑 Greta Thunberg👑 🇺🇸👑🇮🇱👑🇰🇵👑🇨🇳👑🇵🇹👑 🇯🇵👑🇫🇷👑🇬🇷👑🇹🇷👑🇪🇸👑 🇦🇴👑🇦🇷👑🇱🇷👑🇨🇦👑🇦🇺👑 🇦🇼👑🇦🇽👑🇦🇿👑🇧🇦👑🇦🇶👑 🇧🇩👑🇧🇪👑🇧🇫👑🇧🇬👑🇧🇭👑 🇧🇮👑🇧🇯👑🇧🇱👑🇧🇲👑🇧🇳👑 🇧🇴👑🇧🇶👑🇰🇾👑🇧🇸👑🇧🇹👑 🇧🇻👑🇧🇼👑🇧🇾👑🇧🇿👑🇦🇹👑 🇨🇨👑🇨🇩👑🇨🇫👑🇨🇬👑🇨🇭👑 🇨🇮👑🇨🇰👑🇨🇱👑🇨🇲👑🇦🇮👑 🇨🇴👑🇨🇵👑🇨🇷👑🇨🇺👑🇨🇻👑 🇨🇼👑🇨🇽👑🇨🇾👑🇨🇿👑🇩🇪👑 🇩🇬👑🇩🇯👑🇩🇰👑🇩🇲👑🇩🇴👑 🇩🇿👑🇿🇲👑🇪🇨👑🇪🇪👑🇪🇬👑 🇪🇭👑🇪🇷👑🇧🇧👑🇪🇹👑🇪🇺👑 🇫🇮👑🇫🇯👑🇫🇰👑🇫🇲👑🇫🇴👑 🏴󠁧󠁢󠁷󠁬󠁳󠁿👑🇬🇦👑🇦🇲👑🇬🇩👑🇬🇪👑 🇬🇫👑🇬🇬👑🇬🇭👑🇬🇮👑🇬🇱👑 🇬🇲👑🇬🇳👑🇬🇵👑🇬🇶👑🇬🇧👑 🇬🇸👑🇬🇹👑🇬🇺👑🇬🇼👑🇬🇾👑 🇭🇰👑🇭🇲👑🇭🇳👑🇭🇷👑🇭🇹👑 🇭🇺👑🇮🇨👑🇮🇩👑🇮🇪👑🇦🇩👑 🇮🇲👑🇮🇳👑🇿🇦👑🇮🇶👑🇮🇷👑 🇮🇸👑🇮🇹👑🇯🇪👑🇯🇲👑🇯🇴👑 🇦🇱👑🇰🇪👑🇰🇬👑🇰🇭👑🇰🇮👑 🇰🇲👑🇰🇳👑🇦🇫👑🇰🇷👑🏴󠁧󠁢󠁳󠁣󠁴󠁿👑 🇰🇿👑🇱🇦👑🇱🇧👑🇱🇨👑🇱🇮👑 🇱🇰👑🇦🇸👑🇱🇸👑🇱🇹👑🇱🇺👑 🇱🇻👑🇱🇾👑🇲🇦👑🇲🇨👑🇲🇩👑 🇲🇪👑🇲🇫👑🇲🇬👑🇲🇭👑🇲🇰👑 🇲🇱👑🇲🇲👑🇲🇳👑🇲🇴👑🇲🇵👑 🇲🇶👑🇲🇷👑🇲🇸👑🇲🇹👑🇲🇺👑 🇲🇻👑🇲🇼👑🇲🇽👑🇲🇾👑🇲🇿👑 🇳🇦👑🇳🇨👑🇳🇪👑🇳🇫👑🇳🇬👑 🇳🇮👑🇳🇱👑🇳🇴👑🇳🇵👑🇳🇷👑 🇳🇺👑🇳🇿👑🇴🇲👑🇵🇦👑🇵🇪👑 🇵🇫👑🇵🇬👑🇵🇭👑🇵🇰👑🇵🇱👑 🇵🇲👑🇵🇳👑🇵🇷👑🇵🇸👑🇦🇬👑 🇵🇼👑🇵🇾👑🇶🇦👑🇷🇪👑🇷🇴👑 🇷🇸👑🇷🇺👑🇷🇼👑🇸🇦👑🇸🇧👑 🇸🇨👑🇸🇩👑🇸🇪👑🇸🇬👑🇸🇭👑 🇸🇮👑🇸🇯👑🇸🇰👑🇸🇱👑🇸🇲👑 🇸🇳👑🇸🇴👑🇸🇷👑🇸🇸👑🇸🇹👑 🇸🇻👑🇸🇽👑🇸🇾👑🇸🇿👑🇹🇦👑 🇹🇨👑🇹🇩👑🇹🇫👑🇹🇬👑🇹🇭👑 🇹🇯👑🇹🇰👑🇹🇱👑🇹🇲👑🇹🇳👑 🇹🇴👑🇿🇼👑🇹🇹👑🇹🇻👑🇹🇼👑 🇹🇿👑🇺🇦👑🇺🇬👑🇺🇾👑🇺🇿👑 🇻🇦👑🇻🇨👑🇻🇪👑🇻🇬👑🇻🇮👑 🇻🇳👑🇻🇺👑🇼🇫👑🇼🇸👑🇽🇰👑 🇾🇪👑🇾🇹👑🏴󠁧󠁢󠁷󠁬󠁳󠁿👑🏴󠁧󠁢󠁳󠁣󠁴󠁿👑🏴󠁧󠁢󠁥󠁮󠁧󠁿👑", "retardmemetard": "Mr. Beast deserved better", "maline_enilam": "💚", "amejosefina": "🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌😍Grande gretta", "peteandras18": "150 private planes? 🤡", "maryanne.mareikura": "❤️", "agusbrandauer": "@santiagolaurens", "kohanie.hossein": "روانی", "th_bier": "Anybody with a mouth can make a demand...", "emmacroft79": "After watching a documentary I'm shocked that one of the richest countries in the world do not have drinking water #helpflintmichigain", "_mar1am_164_": "Hur känns det att skolka", "vincenza526": "You fuckin bitch. You have bo clue what you're in for in the future. You're a fuckin idiot", "jrclervoixjr": "Try not to speak AT leaders but speak to them. Remember after all they are leaders and some are very egocentric and hard to convince or just don't care. Make your point yet don't raise your voice too much too often. Do what the heart tells you not what people or peer pressure expect of you. Trust a few not all cause the world is full of trickery and man made evilness that serves a few then hurt the majority. Thank you for your courage. Read my first published book of poetry and essays on global and spiritual issues to elevate self/each other/family/community/and the world 🌎 🌎 It is soon to make a global impact. Book title: Emotions In Motion/To Rise Above  Pen Name: Robert Mir'beau", "ksusaaa_7_": "We will never give up!!!!💪🏻", "joao_13_official": "Give up🔥", "saidou.abdoulaye.9": "We'll win i know, fighting is all that we need. Never give up.", "ali3716__": "❤️❤️❤️🌹❤️🌹❤️🌹🌹🌹❤️🌹🌹🌹🌹🌹", "anon__immortal_": "🙄🤮", "mfay12": "Stay strong😇💪", "kentonkplett": "Go to mommy", "wortwein": "❤️", "lucho1955": "👏👏👏", "lisztogram": "thank you 🍀👽", "wild.romi": "❤️❤️", "depretative": "Bye Greta 👋", "yanxiaomoy.h": "you need more homework🙃", "todorrrow": "What did she do for the environment?", "lukeutah": "If we decide to become a raw food vegan, we may end up increasing organized crime in south American countries because we cannot live without our avocados. If we attempt to eat only fruits and vegetables as our main source of calories, we may end up importing them from all around the world, from countries that have lax or nonexistent laws about the use of pesticides on plants and around the humans who work with the crops. We burn up tons of jet fuel to bring these fruits and vegetable to our casual Sunday morning brunches, releasing millions of pounds of carbon dioxide into the atmosphere so that we can enjoy fresh fruit in the middle of winter with our friends. One ton of burned jet fuel emits over three tons of that greenhouse gas. At some point we may end up throwing up our hands and giving up on a specific diet, and choosing to eat whatever feels right to us at that moment. “If I just eat potatoes and carrots for the month of December, I am being kind to animals and to the plane", "michaela_borg": "🔥Håll glöden!!!!", "bilotta_davide": "Vorrei essere felice come la ragazza a destra", "robertjasper_official": "I love this picture and admire your courage 👍🍀🌱", "joannemini1020": "Lol", "ateliepyenetto": "du ser ut som en störd och väldigt oförberedd person!", "totoby.oficial": "🙌🙌🙌🙌🙌❤️❤️❤️❤️", "duckillz": "Trump 2020", "karllybelarmino": "❤️🇧🇷", "thiagofeijobfc": "Fuck it", "willkinn": "Racist", "aghi__privv.02": "❤️", "_.ah.m.ed_": "Do u have autism @gretathunberg", "horaciolimaking": "👎🏿", "johnson777cab": "Things are changing, the climate crisis is now mainstream in the media, but I agree with you, it will take a while. Keep it up Greta👍", "weareamericanpatriots": "Everyone has been told it is an issue. It’s not awareness that is the problem, it’s that what you are asking for is unrealistic and impossible without decimating a countries economy", "roncoristine": "Many are grateful for your courage. I have only respect.", "_wkt_72": "1 vegan meal a wk does me nicely 👌🏻", "denisfighter": "#gretasavepaper", "e.weiss44": "Stfu", "rossoneri_899": "Looks like a little girl with 11 years😂 how dare you!?", "bay_woman": "Keep going Greta’s!", "jailton1286": "E aí , Pirralha", "bols_tibetains_alsace": "🙏", "kewcioguzek12": "Back to school", "huh_matthew": "There is no crisis quit posting shitty content and go back to school", "phoenix.hagen": "💙💙💙", "karivdheide": "🙏🏻🙏🏻🙏🏻🙏🏻", "kitiuta": "❤️", "evangeline.mgi": "Do not give up!!! 👏👏👏💪", "katedonnellyklink": "Not giving up!! 🙌💯", "beeruswic": "卐卐卐卐卐卐卐卐卐卐卐卐卐卐卐卐", "ninitx": "#Mundo La ugandesa #VanessaNakate acusó de racista a la Agencia AP por eliminarla de una imagen en la que aparecía junto con otras activistas climáticas. El medio se defendió diciendo que lo hicieron por \"motivos de composición\" de la foto. La joven de 23 años se ha destacado por su lucha en contra del calentamiento global en África", "_lucchetto": "Ma quanto cazzo sei autistica?", "lucybersten": "Thats right! 💪✊", "dacrane": "Crisis actor", "adowns.lax": "Shouldn’t you be in school?", "muratozclk14": "you suck", "noahfreakinjones": "STFU", "3_wheeled": "🤡", "_clown_sasha_": "Грета Тунберг позволь задать тебе один вопрос ™™™ какое тебе дело до России и её экологии? Ты живёшь в Америке и тебе не особо нужно волноваться о других странах ™™™™™™™™™", "v_d1891": "😂😂😂🙈🙈 Тупее в жизни нет создания", "thebeastisaac": "Climate change is a myth 🤙🏽", "taindsonconceicaodo": "Parabéns Greta, nós brasileiros te amamos.", "theresecarl": "✊✊✊", "tori_shtondik": "Дауниха", "tijswouters_": "🖕🖕🖕", "remou.ffm": "HoW dAre YoU", "swdt._": "Hochnäsige Zicke!", "johnbagwell12": "Burn in a huge fire", "n1ckerr._": "You say that you’re 17 but you act like a bratty 5 year old", "cle_mens_original": "👍", "m_sssyy": "how dare u", "amirkhanov_rr": "Да ей похер на экологию.", "28ue8wnbs8": "vai tomar no cu caralho", "ibrahim_hassan690": "Mr beast tairay say laakh darja behtar hai", "b.m.o.v.i.e": "If fires, flooding, and new viruses weren't enough to convince anyone that climate change is happening... I really dont want to see what is next", "shelley_merrell_": "I just felt like coming here to thank Mrs @roma_thornton for making my registration on her PLATFORM a success. Atleast, I can now invest my funds and earn everyday without stress from the comfort of my home..thanks for the business relationship mam @roma_thornton", "20street00": "Did ya have your mom proof read ?", "robertdingle3715": "Things to do?? Ok, GO BUY AN ELECTRIC/HYBRID CAR! 60 mpg’s from my hybrid!", "tbaker.02": "do you like @realdonaldtrump?", "jhennings86": "you aint doing shit but telling everyone what we already know. go back to school.", "_brandonr_": "Stupid bitch", "hexelucie": "🤮🤮🤮🤮🤮🤮🤮🤮", "c.m.3.n": "All you do is complain", "sein_maedchen_16.01.2016": "And we will never give up too @deutscher.zusammenhalt @chrisaresofficial 🙅🏻‍♀️😂", "sy_parks": "Stfu and go to school", "realdonalddavie": "You’re also a political climate change protester", "sevenraysofblk": "We don’t have to wait on lawmakers tho... A massive global hemp planting spree & a little bit of this: @thevenusproject could go a long way... just saying.", "anarcopuunk": "In the future we will fight against governments as in Terminator", "luiisssfuentesss": "Otaku", "tomas_cost07": "Racista de merdaaa", "_josi_lgh_": "Greta Thunfisch 😂", "ante_1208": "She s 17 why she looks like 11🤔", "kathyfoot66": "Don’t give up Greta. The world needs your focus and your relentless spirit.", "marcelomelo08": "How dare you!!!! 😂😂😂😂😂", "frazer_h.w": "Stfu", "lima.danielarodrigues": "Greta😍", "_khushimahajan_": "Yes we gonna never give up🙏", "standup_tragic": "Ignore the right wing denialist trash...they are bigger and more toxic pollution to humanity than even plastic.", "elastelamil": "🤮🤮🤮", "ruben131980": "👏👏👏👏", "neff.nancy": "I'm not giving up!❤", "yasar_625": "🙌", "bertram.amtoft": "kan du læse det her og forstå det", "riconepom": "who are you in the bread line?", "call_me_luciii": "Spasitelka lidstva @terca_marcikova 🖤", "avongrol": "You are incredible!!!", "big_instrument_and_toys": "❣️💕🙏👏👏👏", "living_in_the_fields": "🙏🏻🙏🏻🙏🏻 You are amazing!!!", "rustyleffel": "Listen to the Science", "tsuki.fx_": "what is your response to the corona virus?", "ironic_joke_yt": "Go back to school bruh 🤦‍♀️", "aleksandr_ruso": "You just stupid little girl", "avb.0318": "🤡", "_you__are__perfect": "Загляните к нам, вдруг вам понравится 🌸", "judith_b.go": "👏👏👏👍", "massachusetts_official_": "Come to Brazil", "_sasserole": "haha weiners", "gartenrebell": "Every step has its own beauty ✊", "simon.bxl": "Continuez comme cela 👍. Et n'écoutez pas ces vieux aigris qui donnent des leçons mais qui ne peuvent pas les mettre eux mêmes en pratique . Bonne continuation.", "clerema": "Parabéns! O NÃO nós já temos. Estamos sempre em busca do SIM.🙌🙏✨", "natanaelmaciel31": "Pode não ser agora. Mas daqui a 100 anos as coisas vão está bem feias. Qualquer crise vai ser sinônimo de guerra. Imagine o oriente médio, deserto, muitas pessoas, poucos recursos, buscando água potável no mar, obrigados a planar em estufas, obrigados a racionar a água, produtos caras e tantas outras coisas. Veja as guerras, crises e protestos são constantes. Sem o petróleo eles seriam miseráveis. Agora imagina isso em escala global. Se queremos saber o futuro veja outras regiões e civilizações, as coisas já estão acontecendo.", "marta111flores": "✨", "59emmanuel": "Your a shame to humanity, racist", "intiiandres.ag": "Eri pura weonaaa greta culiaaaaa", "mcoumbe7": "Stupid socialist", "jxs_wbr": "Wait she's 17? Wtf she looks like 12😂", "paco_a.n": "How much money do you earn with these? Thank for anything. Study and work, we have 2 people that are doing something to change the world, and you, what are you doing for change? @gretathunberg", "lsd_krempel": "Why greta looks like a Alcohol Syndrom Child?", "slipsthefrenchie": "You go Greta!! 🤗❤️💙💚", "vahhtangovtopcheg": "НА МИТИНГИ ХОДИТЬ КАЖДЫЙ ГАРАЗД,А ДЗ СДЕЛАЛА??🤬🤬🤬", "cristophe_b": "🤮🤮🤮🤮🤮🤮", "alesssandraaiello": "It's so absurd... but, from Sicily in Italy, in my own small way I keep going following you 💪💪💪", "gabrielfernando_dm": "Pirralha", "captain_tinnitus": "I have a question: Until now, i never was in Davos Switzerland. Is it nice? How did you reach this location? By train? I do indeed almost of my ways by feet (7300kms p.a.)", "manuelaravalli": "👏👏👏", "evangelista_hpacheco": "Nice!", "shanquan_": "NO DRIP", "doghousebruges": "Stay strong 💪💪💪💪💪", "modernnetzero": "🙌🏼🙌🏼🙌🏼🌿", "dnxbxhxbx__": "How dare you", "cristianborr_": "Que verguenzaa das", "tu_puta_madre162": "Illa duchate", "mr.cheese98": "Demands 🤣🤣🤣🤣🤣🤡🤡🤡", "bobbysouaid_": "Lol climate change isn’t even real", "ozan_azadi99": "V8 BiTURBO", "jstra82": "Anyone who does not recognize this child is a puppet of the elites is brain dead 🧟‍♂️", "magnus.hedman.37": "\"Gretha, You've one voise för all of us climatfighers and activist outhere who all had you to thank you, both because your compation for the people and the society, but also that you never give up and give us hope. Thanks.", "official_smalltunez": "Fuck you bitch... YOU RACIST 🖕🏾🖕🏾", "andersson2099": "Heja Greta!🙌❤️", "huntert1125": "🤡", "moxamdh_nuur": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🔪🔪🔪🔪🔪🔪🔫🔫🔫🔫🗡️🗡️🗡️🗡️🗡️🗡️", "reckless_jelly.v2": "Its time to take direct action 😳", "leogilbert007": "We. Will. Win 👊🏻👊🏻", "tonydetroit": "No such thing as global warming. The hilarious thing is the uneducated adults supporting this hoax. Just because the globalists at the U.N. say something, doesn’t make it true.", "1987_kev": "😂😂😂", "jukukool": "Happy Greta! :)", "javids5410": "Go back to school", "maxshihh": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "joern2003": "❤️", "ospinacoffee": "Bravo 👏👏👏", "stephen.buterhouse": "Shit", "no_nonces_no_no_nonces": "🔴🔴🔴🔴🔴🔴⚪⚪⚪🔴🔴🔴🔴🔴🔴 🔴🔴🔴🔴🔴⚪⚪⚪⚪⚪🔴🔴🔴🔴🔴 🔴🔴🔴🔴⚪⚪⚪⚫⚪⚪⚪🔴🔴🔴🔴 🔴🔴🔴⚪⚪⚪⚫⚫⚫⚪⚪⚪🔴🔴🔴 🔴🔴⚪⚪⚪⚫⚫⚫⚪⚪⚪⚪⚪🔴🔴 🔴⚪⚪⚪⚫⚫⚫⚪⚪⚪⚫⚪⚪⚪🔴 ⚪⚪⚪⚫⚫⚫⚪⚪⚪⚫⚫⚫⚪⚪⚪ ⚪⚪⚪⚪⚫⚫⚫⚪⚫⚫⚫⚫⚫⚪⚪ ⚪⚫⚪⚪⚪⚫⚫⚫⚫⚫⚪⚫⚫⚫⚪ ⚫⚫⚫⚪⚪⚪⚫⚫⚫⚪⚪⚪⚫⚫⚫ ⚪⚫⚫⚫⚪⚫⚫⚫⚫⚫⚪⚪⚪⚫⚪ ⚪⚪⚫⚫⚫⚫⚫⚪⚫⚫⚫⚪⚪⚪⚪ ⚪⚪⚪⚫⚫⚫⚪⚪⚪⚫⚫⚫⚪⚪⚪ 🔴⚪⚪⚪⚫⚪⚪⚪⚫⚫⚫⚪⚪⚪🔴 🔴🔴⚪⚪⚪⚪⚪⚫⚫⚫⚪⚪⚪🔴🔴 🔴🔴🔴⚪⚪⚪⚫⚫⚫⚪⚪⚪🔴🔴🔴 🔴🔴🔴🔴⚪⚪⚪⚫⚪⚪⚪🔴🔴🔴🔴 🔴🔴🔴🔴🔴⚪⚪⚪⚪⚪🔴🔴🔴🔴🔴 🔴🔴🔴🔴🔴🔴⚪⚪⚪🔴🔴🔴🔴🔴🔴 / ﾌﾌ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ム/// / )\\⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀Y (⠀⠀| ( ͡° ͜ʖ ͡°）⠀⠀⠀ ⌒(⠀ ノ (⠀ ﾉ⌒ Y ⌒ヽ-く ____／ | _⠀｡ノ| ノ｡ |/ (⠀ー '_人`ー ﾉ ⠀|\\ ￣ _人'彡ﾉ ⠀ )\\⠀⠀ ｡⠀⠀ / ⠀⠀(\\⠀ #⠀ / ⠀/⠀⠀⠀/ὣ========D- /⠀⠀⠀/⠀ \\ \\⠀⠀\\ ( (⠀)⠀⠀⠀⠀ ) ).⠀) (⠀⠀)⠀⠀⠀⠀⠀( | / |⠀ /⠀⠀⠀⠀⠀⠀ | / [___] ⠀⠀⠀⠀⠀[___] follow me I'll send u this, no homo", "yu_8ku_jordanfamily": "A fucking kid who does not know the difficulties of adults", "ernieecowar": "Such ignorance", "katerina.ish_": "Gate good", "_.antoooh._": "dio boia che brutta", "avahoekstrafan_cupcakes": "❤️❤️❤️", "pidi1983": "Fuck you Greta arschberg", "7fjef": "she did nothing bruh", "de_wet_04": "Splish splash your opinion is trash🤭", "rosyresendezo": "👏👏👏👏👏👏👏👏👏", "mael.xxl": "Bitch", "rolfsgatan": "Heja Greta", "old_account_xzr": "U little african", "cnt.lauraa": "How dare you", "xelapwc": "U make me sick", "ernaeva9": "Zu witzig dieser kleiner Furz😂", "ga__yooni1996": "👏👏👏👏", "sidewalkdarlings": "AT #LondonFashionWeek  Bubbles: #Atimeforaction. Pose  Charlemagne: Walk[#Foofighters]ing #LFW #SS20 sidewalk, like #TheKingofRockNRoll[#PrefabSprout] is Bubbles: #sustainablefashion, #ecofriendly and #ethicalfashion, are what we're, erm, squeaking, about  Charlemagne: ... no need to wonder; er/Style's/Rocker/Oh; the #flamehaired, #SidewalkDarlings FM’s all-week-absconder #rock #discjockey, now masquerading as a #fashionweek #bikerjacket, #fedora, #bikerboots, #rocksack, #longskirt, #longdress #clotheshorse and/or appreciator,to showcase his incarnations of the bikerjacket, and #firstdates aesthete featuring rocksack and bikerboots", "klerksrob": "💚 #StayStrong keep up the good work, it's necessary. With your amount followers we can create chaos. The power lies in creating chaos on the internet. A few hours at a day or week time, lying the internet down. Demanding opening up the #Clean_Energy_Industry_Sector which holds #Jobs and #EconomicGrowth the theme that the politicians always talk about. 💚 Every ones future is at stake, why should we keep quiet when this is possible? They don't mind killing our habitat, why listen to them any longer without real action? 💚 We have just 1 life to live 💚👊", "mariamiahakansson": "Heja heja. Tack för allt du gör Greta! 🍒❤️🙌🔥😍", "shikhamangal8": "So true...as if the world needs more warnings", "peemelie": "❤️", "begreenhacks": "We stand with you Greta 🌱", "fanaccountidk2": "FOR MOTHER RUSSIA", "leon_5106": "Hässlich", "fairconnie": "Never stop. Just never stop.", "moresagequalsmoreswag": "Looking pretty good day", "salviamo_sto_mondo_perduto": "😍😍💪💪", "renancribas": "Why u didnt talk about australia u son of a bitch!", "zxchnsl": "I wish i got a molotov for her.", "jiwalaut": "It took about more than 1000 years after early greeks scientists assumption that earth is a sphere to sufficiently scientifically prove it and accept it. Even though there are still people publishing that earth is flat 😳 same with many scientific discoveries... seems like the average human brain can digest and get big discoveries overwhelming his routine and beliefs. Hope it won't take as long as we have limited time to act...", "_esec_": "Маленькая долбанутая девчонка", "albi_li": "Малышка училась бы лучше в школе,чем впустую воздух сотрясала🤦‍♀️", "irene_29032008": "🔥🔥🔥🔥👏👏👏", "nesserjoseph": "Greta thunberg is a big scam artist she's an attention whore.There is no way Greta would have the attention she gets without help from the media. Greta is the type of girl that we all knew in high school, she doesn't have the looks for the popular guy to date her, so she goes to the extremes to get his attention, we all know what that is! Greta's extreme is to be an attention hore instead of the other kind of whore.", "clemens.kl": "THE CLIMATE CHANGE DOESN‘T EXIST!", "karolayne4002": "Force🙋", "lea.cxtt": "You are so Beautyful", "alexandr_lavik": "Gretta i Will hate U😈🤩", "earthdayeveryday.id": "You are amazing! Never give up!!!", "ylva.jonsson0418": "W👍🤗❤️", "hadighaderi75": "😂😂 👍😂", "jesuirr": "kebyze som ty sa zabijem 🤠", "x_h.milton_x": "You are making a change! It just takes a while ❤️", "buraangel68": "stick to the science, a dwarf. you only yell at the corners. stupid Scarecrow.", "kian_man_crabstick": "Save the turtles", "melillojanine": "Change is coming!", "salomepony": "💋😀🤩", "theeyesbear": "I see changes comming from the economy side (those are good at looking at facts) but it will take continuous pressure from our side to keep the motion going and accelerate it.", "danielescobardiaz_": "F*** You", "jameslreid": "YES", "simonweberts": "Hässliches Entlein", "marcos.klein.165": "You are grate. Continue the work. Porto Aegre. BRASIL", "hipocrisia.reversa": "Shut up! Pirralha 🤣🤣🤣", "karennefores": "The world will be eternally grateful to you and all of your efforts. Thank you!", "annsofi_jonsson": "👍🏻🙏", "baldaufjoachim": "❤️👏👏👏👏", "idsers": "Ты хуйня☝️", "lazaros_xristou_": "Ρε παλιό χειμερινό Γκόλουμ θες και σκουφάκι ποια νομίζεις ότι είσαι;; Θα πάω να πάρω το τρακτέρ και θα Βαράω κόφτες έξω από το σπίτι σου χωρίς εξάτμιση!!!", "zomonacohair": "I am with you, you are amazing! Keep on educating people with your voice💕💕💕", "maniekbaniek": "Too bad Greta didn't know what to say without script. Even Putin doesn't support her, world is more complex than how dare you.", "edguardoh96": "Please follow us, we will follow back! Start up looking to plant 50 million trees and raise 100 million bees by 2030!! We need your help!! If you’re looking for change & growth, it starts here! Together we can fix the world, We’re your trusted Non-Profit in US who will post every batch of trees planted (first planting = feb 24th) and later on every colony of bees created!", "cluelessebo": "Vyzeras jak bezdomovec", "simoncollins08": "Thanks for your dedication and inspiration. I’ll keep trying to make my generation understand.", "hanspardoel": "❤", "inked83.sl": "So hypocritical. Talking about climate change (which is not real) and fly everywhere and create massive carbon footprints all over. 🤣🤣", "mozcan58": "Evet her boku biliyorsunuz", "niko_stgt_": "Du warst schon als kleiner Junge hässlich Gretel ❤️ du denkst ich schreib dir was gutes wegen diesen Dingern 😍 aber ich sehe dich und kriege das kotzen. Geh nachhause mit deinem Klima wir Menschen zerstören uns sowieso selber. Akzeptier es du hast keine Zukunft ❤️❤️ wenn es nicht Klima ist dann Krieg wenn nicht Krieg dann virus. Heulsuse ich hasse dich", "geigenbergeringrid": "❤️👏🙌", "rachelmain7": "❤️🙏😍🧚‍♀️", "michael_greta_sv": "💖", "pedro_vitorlm99": "🤢🤢🤢🤢", "augmented_reality_ar": "❤️❤️❤️👏", "parvaz_6757": "We will No give up", "vendelalundh": "Greta gris", "dannyleetaylor": "🗽🤳..🕳🕯", "rodriguezdiosmarys": "Guapaaas❤️", "chris.ulf": "❤️🙌", "oscarmacca1974": "We need to join in a collective consciousness and it will happen. Be a beacon of light🙏🙏🙏", "lina_cantieni": "💪💪", "soren_feistel": "😘😘😘😘HELLO TO EVERYONE HELLO TO YOU HOPE EVERYONE IS FINE ALSO YOU HOPE EVERYONE IS HAPPY LUCKY AND HEALTH HOPE EVERYONE IS NOT ALONE OR SAD HOPE EVERYONE IS FINE EACH DAY FOR ALL TIME I LOVE WRITING VERY MUCH GREATINGS FROM GERMANY SAXONY KISSES AND HUGS 😘😘😘😘😘", "shadmehr_rahimi1380_": "👍", "aagamjainuk": "we must reject the perennial prophets of doom and their predictions of the apocalypse.' 'They are the heirs of yesterday's fortune tellers,", "romster_the_monster12": "YES Greta", "mauro_cesar_bandeira": "Greta you are future girl. 💙 you Love my princess💗💗💗", "la.revolucion.vegana": "GO VEGAN 🌱💚", "sibsm1": "They seem to expect a 16 year old to do and promote the work of adults/scientists and yet they still use abusive language to put you down when you do. Ignorant people use hateful language. Keep ignoring them and continue to share the message of the climate emergency. We have seen wildfires in Australia, flooding in Indonesia, earth quakes In Turkey and apocalyptic looking locust swarms in Africa. When will people start to take this climate emergency seriously? If not now, when? 🙏💖🧿🙏", "morfee": "Пиздеть не делать... Лучше бы реально начала хоть как то помогать экологии, чем просто с плакатами ездить...", "stefan.grynge": "👍👍👍", "ameliehalt": "last night i had the strangest dream 🕊️", "ufoglobal_italia": "Bravissima continua cosi 👏👏👏👏", "ecogazeta": "Здравствуйте! Санкт-Петербургская газета \"Общество и экология\" приглашает Вас на нашу страницу @ecogazeta. ⠀ Вот уже 20 лет мы существуем и работаем над улучшением экологической ситуации в Петербурге и стране, пишем об этом, добиваемся результатов. ⠀ Поддержите наш развивающийся блог. Мы всегда готовы к сотрудничеству. Также с огромным количеством материалов Вы можете ознакомиться на сайте по ссылке в шапке нашего профиля.", "gibmaklopapier": "Kann man dich klären ? 😏", "044trifan": "🤢🤡", "aleksandr__nov": "Лицемерка рано или поздно, получит по заслугам!", "radkokeleman": "🤣🤣", "fabarretoc": "Kkkkkk. Vai ESTUDAR 🤣🤣🤣🤣", "littledesignhaus": "Fabulous Greta! Yes it will take time but we need to keep pushing. Thank you for your wonderful efforts 😊💗", "dload25": "Ебанутая", "allxdlex": "aids kind", "vidsrn": "#apnatimeaayega", "evgeniij_kj56": "Gretta fuck you.", "lonely_pearl_": "Slay that runway", "idk.eamons.priv.ig": "Crop any black people out of this photo?", "_raghav_mathur": "How dare you", "karine.schiff": "👏👏👏👏👏👏👏👏", "ethandk____": "Virgin", "ailurone": "Droppen urholkar stenen!...", "poethicc_.bby": "Yeeees 👏🏾👏🏾", "n_0se": "Гретта сосатб", "bracken_03": "It is not a crisis and never will be stop telling us what you think and do your research", "ethan.k0000000": "Go to Bejing or Delhi where the government won’t bend over backwards for you retarded cause", "4lif_cikmi": "How dare you?", "emissionvault": "Important work!👏❤️", "era_obey_tom": "The reason we got passed the ice age was because of climate change don't be an idiot", "oliver._.edwards": "Congratulations your the worlds youngest boomer prove me wrong", "tammie_nz": "Will you post the REAL pic with Vanessa Nakate or just the ones with other activist that look like you? Will you support your fellow activist Vanessa the person as passionately as you do the planet?", "aaltjansmits": "@timon.floor ouwe fanboy", "__soemi": "Hässlichi fotze", "filippafaldt_": "Jävla kex", "wildivinity": "❤️", "suzankardes\nVerified": "Verified", "theonlyoneandrealsosa": "6.2 Liter SAUGER V8 und ich drück Aufs Gas und mach die Nachbarschaft wach.", "voltmetr900": "Fuck you шлюха конченая ебал твой рот", "funny_monarhist": "You dont think to fix problem, but just say.", "welsh5209": "😘👏👏👏", "zurichdakar": "Respect for speaking up!! Where is your voice re. Vanessa‘s case?? 🤔🤔", "sehunloveclub": "ur a time traveler huh", "noemiluzflamenco": "Thankyou!💓", "leonardo_de_bernardini": "🤢🤢", "yusufkaraduman7": "💩", "volodya_4hokagi": "Gretta, please save paper", "annamranda": "And more and more people will join. And make better choises.", "cobe_wavvz": "Small little racist Becky..they cropped the little black African girl from Uganda and you kinda happy with it.. we African wouldn’t support you..deal with ya crisis in Europe...", "kadranben": "Hi.Great Greta getting greater with her engagement.", "danleyv0416": "@flow_youtub3 vibe check", "2_a_arts": "Ебанушка безмозглая :)", "fwehr": "Was hätte die Greta den Dinos geraten. Denn die Klimawandlung bestätigt nicht seit heute sondern schon Milo.von Jahren, denn sie wieder holt sich immer wieder.", "trinestormer": "💗", "erik_heib": "🤮🤮", "timur_e": "Что ты знаешь о таблице Менделеева? Или забастовка до уроков химии началась?", "lisa.yore": "Agree! Never give up! Keep your eyes on the prize! ⭐️ We want a world to live in! 💙", "empandaptyltd": "Thank you @gretathunberg for being such a brave advocate of change 💚🌍💚", "tonymorettinl": "Yes Greta, keep going", "philipmcmaster": "❤️from #SustainaClaus.. if you look carefully b", "kaagjekalekut": "How was your meeting with Soros, he must be so proud about your acts, his investments starts to work", "alexandrmedvedev1990": "Иди учись", "brunogutierreez_": "Go to school 🐨✖️", "ahhh_its_abair": "Make me sick u do", "erica_camper0": "Kan du skriva på Svenska?", "solumkarin": "💜💜💜", "yes.sixxty2": "конч 100%", "dsdiane": "👍🏻👏🏻👏🏻👏🏻", "elske_brault": "Economy itself has to change. From „more more more“ to „just what you need“.", "kaffeeglotzer01": "👎👎👎😢", "cheeki_brreeki_blyatv2": "I found a Caterpillar while typing this", "classwarandrevolutiondances": "Love ya bro! Go get em ! Mother Nature bless ! 🦁❤️💃🏾💚", "eetuu_k": "how dare you", "spec.alpha": "Y’all know this is her parents writing the post correct? All her speech’s are from her mom as well.", "sylvieganter": "🙏🏼♥️", "heavy__boy": "Fuck you", "deo_volente_uio": "Go ahead. There's a bunch of people with you!!!", "roberto_cx_teki": "🥚🥚 s", "doris_reinhauser": "Some people like animals more than people. Scientists fear that some animals at Kangaroo Island are extinct after the fires. Perhaps more humans will change their lifestyles after this?", "marleyxmarr13": "Stupid little bitch", "smumph54": "Keep going!!!!💚💚💚💚💚", "danielcochran25": "Money is power, power is money,it’s the one thing they listen to.Boycott", "seansmith504": "Yes but your plans are not reasonable nor are they an actual solution", "justaboh": "💜💜💜", "pacificppaul": "Et de la photo prise à davos où on a supprimé une de mes sœur car elle est noir de peau 🤷🏽‍♂️🤷🏽‍♂️🤷🏽‍♂️🤷🏽‍♂️ @gretathunberg", "fert_monkey": "Why don’t you answer the simple questions? Who’s paying your security? Who are those people protecting you from difficult questions? Who are those people that assaulted reporters and who is paying them? And how do you expect to garner support from those that are more educated to see through you; if you choose not to answer?", "gediminas_handzel": "Nobody gives a shit go to school 🤦‍♂️", "makvaerk_art": "🔥✊⚡️❤️", "ayayron.pm": "I LOVE YOU GRETTA!!!!❤️❤️❤️", "lisa___dancer": "Go and die.", "fsb_nikto": "Fuck you noob asperger🖕🖕🖕🖕🖕🖕", "hashim_bruh": "bruh stfu", "chrisi_g__": "Wann löscht du dein Account du blöde Hure", "estebanruelas.lv": "Keep pushing, keep going!", "krabkrabovich96": "Ей Грета, там большие дядьки опять заседаю не по поводу природы. Всего лишь из за какойто болезни. Нужно срочно завалится к ним и сказать какие они эгоисты!", "ullajw66": "Hang in there Greta 👍👍👍👍👍", "wastetowonder_india": "👏👏❤️", "atreetobreathe": "Un persona = Un árbol. Conoce @atreetobreathe y sumate al plan!", "tuesday_maybe_": "Lil punk azz", "ranti_adepoju": "🙌 everyone have a part to play. We are all victims.", "traum_girllena": "❤️❤️❤️", "anarchozwerg": "Are you going to address the press photo where Vanessa was cut out?", "br0die_thirdy": "🤡🤡🤡", "rj.riley_": "you guys say how hardworking she is but she does nothing but whine. She has made zero progress. No one actually listens to this baby. Shes like a fly you keep shooing away bc theyre annoying", "gudbritt": "❤️👏", "dan.dass": "👏👏💚💚", "no.poverty2019": "You just want to skip school, that’s the only reason you do this", "tjbarker0600": "Imagine cropping out a person of a photo because they’re an African-American 🤡🤡🤡 Fuck you Greta, rot in hell bitch. -Sincerely, TJ", "_hjonk_am_goose_": "How dare you", "joaopedro.possas": "I m Love 🌍🌍🌍🌎🌏🌎🌏", "quiquemonnerat": "So sad about the racist case with the photo ;(", "6ixnna": "fart", "emuduckie": "Lmao why does it look like girl in red in the background", "peterval1323": "So many things still being fucked up in the protests", "kassmihelich": "❤️👏👏👏", "dr.henriquekeller": "PARABEINS VUSSE LACROU 👏👏👏", "top_beauty.mx": "Why don't you stop ordering and start making clear proposals. it's very easy to make controversy but I don't see your proposals", "_brody_yt": "The ability to speak does not make you intelligent.", "_bpole": "Clout chaser", "koaran.and.japan": "👍🐝😊", "jack._porto": "Go to china or India where they don't even have emission laws", "ilias_xif": "Man it's so sad because everyone keeps promoting you and no-one understands that they system does it because it isn't afraid of you. You can easily understand this by the fact that politicians speech who are trying to save the environment isn't being heard anyone. Continue do your think but stop giving a show every week.", "i_o_n_el": "You demanded to stop all carbon emissions. Are you fucking insane you said we have to have a zero carbon emission our entire economy is based on fossil fuels and carbon to run, if you take that out the entire world is going to go through a Great Depression. Am I the only one here who sees that all this girl does is complain and yell “how dare you” to people who have twice here age on not solving a “problem” when she’s not offering any genuine solutions like c’mon people we can do better", "noellemary": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "st.even5229": "Friday for diesel", "gage_minner": "Fuck u Mr beast is better", "oann2": "Go! Greta!", "lilkittin65": "ABSOLUTELY!!!!!!🙌🙌 👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏💖🌍🌎🌏🌐🗺💙", "rosiescbd": "Thank you 🙏", "supervegetablu": "Atomic , nuclear and chemical weapons all around our globe.... we stack our old ones and try to create faster and better ones... around the world. Peace is an illusion therefore you must have weapons ready pointed at all directions and all directions have weapons pointed at you for us all to live momentarily world peace...... WE LEFT A BOOBYTRAPPED PLANET FOR OUR KIDS TO DISMANTLE ....Our old minded world leaders are blinded because of all that arrogance. We have BAD timing because of global warming and our own pollution that we are ignoring.... THE GOVERNMENT has a bigger budget for defense and space programs and not for saving the earth...... why is everyoneso blinded... the earth only has 1 direction left and that is global warming... we just accelerate it . We need measurements fast. This is not for tomorrow. This is for now! World leaders are old guys from the '70s they don't know any better .... seems like our children are going to take care of the mess themselves 😢 It is not like any single leader is going to be a game changer..... no miracles for us... Help earth click here >>>{ @savearthnow2020", "sallyftg": "Good on you Greta", "nick_youtube_offish": "How dare you", "neno69_": "Trash", "sossazi": "we won’t stop till’ we get enough🙌", "alicesproul": "We will never give up!", "villavicencio1877": "Let go Greta 👏👏👏👏👏miami USA we support", "morgana_the_minidob": "👏👏👏👏👏👏👏", "sarrandramamede": "Pirralha", "thetrumpfund": "18 with a goal. Donating t shirt profits to the cause. Link in bio 🐨", "keita_yamada_kun": "The price of the product is set to labor costs. The professional ethics of ascetic Protestantism interpret that engaging in professional work is God's command on humans. Companies are obliged to hire and engage in labor and pay wages. However, there is no need to pursue profits. Anime Thunderbird's International Rescue is professional work? International Rescue does not pursue profit.  Isn't this a second industrial revolution? Humanity will be freed from the constraints of profit hunting and will be able to engage in various projects as professional labor", "tawnymaclachlancapon": "We CAN never give up.", "sumit_mishra302": "Love u gretathunberg", "joaovasconcelos01": "😂😂😂😂", "boutiquemoha": "💛 🌍", "elena_abarca97": "No te rindas! Muchos estamos con vos!", "azalia_aguilera": "Will be watching you hahaha🤡🤡", "jacobtaylor2034": "Go back to school, kid. 🙄", "lazyrussian": "Stop exploiting this kid", "leeleegcrush": "👍🏻🌱🦋💪🏼💪🏼💪🏼", "justinmayheww": "i get what you're trying to do but the only thing you've accomplished is damaging the future of your education. go back to school and try again when you have a legitimate education and you can make a real impact on something important", "achangeisachance_podcast": "We will keep going!! 💪💪", "alanofsydney": "Never give up, Never give in , act ourselves, vote, take control", "ryan_mailman": "Global warming aint a thing its a big climate cycle you have the warming period then the cooling period the hot stages then the ice ages duh", "leo_lamonato": "Vtnc menina fdp q culpa o sistema econômico sua vagabunda tomara q vc pegue hemorragia interna no fígado", "elizabethvargasisababy": "We've got this!", "6o4.vz": "shut up autist", "designbirdstudios": "Be braced by life Greta. You are asking and have created a great experience for yourself. Your boldness and courage eis unmatched. Never doubt it. Ever.", "ab_smith55": "Go back to school donkey!", "vickynel.3": "💚 🌍 💚 🌍 ❤️ 🌍 ❤️", "sophiabenedetti_": "❤️👏", "cody.meyran": "Your so brave for coming out as Lisbon. THE LGBT LOVES YOU 🏳️‍🌈", "1lizardman": "👍👍👍👍👍👍👍👍😁😁😁😁😁😁😁😁🤘🤘🤘🤘🤘🤘🤘🤘", "_momager": "🙏🏼👏🏼👏🏼👏🏼", "mirvanw": "For you and so many of your supporters it is a huge sacrifice you are making on behalf of ALL humanity. I am so grateful and you inspire me, every day. 🌷💛", "dctyyz": "THANK YOU ❤️", "emgalesloot": "Never give up, all the young people, you inspire me and others to support the changes needed. We will remember the politicians who fail to act.", "climayderecho": "Desde Colombia un abrazo", "nataliafenizi": "😍", "arri.osss": "No one likes this dum bitch", "tiont": "💪Never Ever💪", "littlebeetroot": "Right behind you 🌈🌏💜", "logancox01": "U look dumb", "elenpronslouislx": "Fake News", "2ndgendave": "Stfu", "sal3366": "Let's put words into action! Hear & Action!", "sturdy.jer": "You don’t deserve anything🤡", "jimmyheadbans": "fuck u greta dumb lil bitch", "idk_.mati_": "🙌🌍💛", "ninjahairline": "Trippie red?", "thiaguigunksss": "me gusta la carne 😭😭", "reptile_child1": "Just stop, you never even visited india or china with the worst air pollution and you wont go there🤡 cause of the type of government and your scared", "dichayhecho": "🙌🙌🙌", "joieruble": "👏🏻👏🏻👏🏻👏🏻👏🏻", "gustavopbarros": "🖕🏿", "keramik_holz_kambium": "Mach bitte weiter!", "ojstarkey2004": "Ngl all this talk on climate change is pissing me off, I understand that the climate crisis is serious but I’d rather spend my time trying to help slow or cure malaria seen as 5 children are killed from the disease every 5 mins, focus on the present before the future, sort out priorities", "chabinidze": "You should be going to school!!!!", "ayzamir55e": "I don’t know who you are and I don’t want to know, I just want to write about the Truth, you spoke and said that you destroyed your childhood, then look in Kenya to eat young people like you and at your age girls sell themselves to eat to live now compare your childhood and theirs", "garett_jordan": "Lol thanks for implementing dumb policies that don’t change anything, and making us pay for it- using American tax dollars. Great job👍🏽 17 years old and as left as they come, might want to re-educate yourself.", "stjohnestate": "Why did the crop the black girl our of the photo smh racist people ain’t shit", "hon1169": "You’re awesome girl 🙏❤️xx", "katiacnevess": "😚💯👏👏👏😍💖", "kerler10": "🌹❤️👍🏽", "ethanchangy": "Bruh how u 17 when u look 5👺", "warrenbeebe": "You’re a boner", "ljmb60": "👏🏻👏🏻", "lesncvc": "❤️❤️", "militaryforce": "When you going back to school?", "ruby_14200": "Please...speak about Coronavirus!!!", "rohan.06_": "Die in a hole", "lilj_adventures": "Great work @gretathunberg You are an inspiration for us all", "jet_driver22": "Go to school", "jimsmoparfarm": "Puppet, face it , you have no idea what your talking about , your somebody's idea of a bad Joke 🤣", "barondottttt": "Love that smile.", "mtza_gs": "👏👏👏👏👏👏👏", "katieinashell": "Please endorse the Green New Deal in the USA! It would be an amazing step to leading the global movement for addressing the climate crisis adequately and would draw massive attention to the leaders like Bernie and AOC who want to pass these changes. I know you don’t think it involves politics but everything involves politics on some level and with the climate crisis we need leaders like Bernie and AOC to properly lead this fight. Thank you.", "dmxlina919": "Guarra", "bradyb0wlin": "Greta Thunberg, more like Greta Poopberg", "jay_chubacka": "https://www.theguardian.com/world/2020/jan/24/whites-only-photo-uganda-climate-activist-vanessa-nakate", "vigort9": "You're uneducated moron. Finish your education. Take economics 101 to say the least. Just some lowlife with no morals or wisdom. You're a joke.", "pryce122": "When you realize that people legit set Australia on fire to show climate change you guys are definitely showing some good wtf you bastards killed millions of animals to show there is climate change sickening", "fortzuh": "Climate propaganda tool. You are just a tool for the leftist agenda", "caesar_xvvx": "You look like 11 years old"}