{"claracostass": "@jairoloopezz 👏🏽", "kezziaonyangorobiwilliams": "❤️❤️❤️Yea guys ❤️❤️❤️", "cowboy5871": "👎👎👎👎👎👎👎👎", "druggie_productions": "Lets take pictures of ourselves 'protesting' and post it on our own hastags and social media to make a difference", "nathan773250": "Ol peg sure loves this stuff", "thomasmayer07": "Nice you darling dear🔥", "_.iinniiggoooo._": "@disneychannel", "dreeeewwwwe": "👎👎👎👎👎👎👎👎👎👎👎👎", "polimeros._prasoulis": "If i drew an H on your forehead Kobe Bryant would have landed his helicopter", "187fh": "Voll die scheiß Aktion von der Bringt eh nichts", "joezeramoeder": "U are using paper and paper is made of threes", "fly_high_isaac": "Fuck the trees", "moicanno": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "daniel_ramos_of": "Trump 2022", "bengilby92": "No one asked", "veroo.gell": "Don’t use the paper the tree dead", "kellykennedyschlorberg": "🇺🇸💜", "depifanov089": "Please, save paper", "araberin.44": "Kahbaaaa", "espaco_priewilker": "Comunista ridícula😡😡😡", "axel_lubbe": "I💕U", "alina_sergeevna0074": "Хватит уже а", "ishaansahay": "How dare you!", "ardayldz3": "Tırnağına sokayım", "our.homeland": "You´re doing well, the school strikes. The earth does not need eternal and later highly paid Students. The earth needs help!", "sambrooks501": "She's been out of school for so long. No wonder why she keeps being stupid", "helene.falk": "Du är verkligen dum", "toky0._d": "Don't destroy my planet,destroy my pussy", "daniel_gard80": "Go to school", "dennislav7": "Que fea ere cagondiooo @dzhoshkunfr", "dodgelover7264": "Diesel", "aeroflot001": "No shut up", "alia_bouamar": "HOW DARE U!!", "bawar_.krd": "Kahbachen", "_malu.711": "Omg du hübsche ❤️❤️❤️😍", "josuerosarioperez": "🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴", "alexandrebrar1": "Fgj", "jeremy.rstck": "Wie kann man auf ein dummes 17 jähriges Kind was downsyndrom hat was nicht mal zu schule geht hören", "gandrud": "Nobody cares about you!!!!!?!?!!!!!!!!!!?!!!", "alonsoestrela29": "we only have one planet🏄🏻‍♂️", "gloria.stano": "Wait Greta i’m writing this message no for protest versus you but sheets where you are writing are in paper and I say save the world but if you consume the paper for writing two lines and post this paper you contradict yourself. I respect you.(sorry for any grammar errors but I’m italian and I don’t know very much the English)", "benjy.6": "Squicker", "artefakteris": "чмо", "hugobugoab": "Hur tolkar du denna Kris?", "pips_1960": "Greta go home Strike in deinem strohbett gehe mal richtig arbeiten sowas kennst du nicht nur schwätzen und schwänzen das ist deine Zukunft auf Kosten der arbeiter pfui", "mehmetozgor_": "@suledrgn @iremthemiserable görün bakın bu benim torun sana çok benzeyip duru şule gacı", "u.k.t.81": "🖕🖕🖕", "lialexn.777": "Ебнутая", "ultranegrotoad": "please lick a toilet seat", "j_r_p_photography": "🤬😡🤬😡how dare you, people die here. you only want attention 🤮  do you understand PEOPLE DIE", "lylagrumann": "@katy.jones12", "66.odi": "Richtig gruselig bist du", "leon.d26": "Stfu Gay bitch", "wahlbor": "I love this face ❤️❤️❤️", "rickybagna_02": "Hai la fronte gigante", "kellyostendorf": "Lillek jong", "cb_951": "Go help in Wuhan! Please🤣", "lkupsin": "Young lady, focus on your homeschooling!! Enough about Climate Change!!", "sustepsa": "#F4F #SDV #FOLLOWME ksksksks", "kyr1akos.xx": "This thing u are holding in your hand is a paper. Paper is made of wood. Stop using the paper.", "ez_ethan_t": "Lets agree Greta is a boomer and Corona is a bomber for greta", "christo_aus_deutschlaand": "🦷🦷🦷🦷🦷", "farhadhossain575gmail.c": "Nice", "gonzalesmarcodominic": "#YeahYeah🐦 🔥🌟 #girlPOWER #HeForShe I wish I could make the World LISTEN! Femme Leadership will HEAL The ❤️ #Earth 🌟 #SaveEarth 🌹 #SaveLives Clone these #WonderGirls 🌈 #girlPOWER #GirlUP #GretaThunberg #Malala #AnneFrank #janeausten #JoanOfArc #femmePOWER #femmeintuition #ERANOW #equalmeansequal #USA #EU #Europe #UK #France #Sweden #MiddleEast #Africa #LatinAmerica #WORLDWIDE #fridaysforfuture", "aschatzmann": "Go to School", "eddy.fvm45": "Greta save me plenet👏❤️", "lbf2612": "HAI ROTTO LE PALLE 😵😵🤫🤫", "theeternalpantry": "♥️", "laurabianchi06": "A belle et clima mo sta bene quelli a morì semo noi mo non l'ambiente si capit(per pochi)(sto per creare una guerra)(scusate per lo sfogo)", "tasmanianwalkinbarefoot": "Happy days 👣💙", "evakamtsiouri": "Give us a break!", "crogy92": "You do realize that thanks to these quarantines, smog levels in cities like NYC, Beijing, LA, etc. Are dwindling right? Maybe we should do this every year lol", "fernanhomann": "@shellmardelplata", "guidomatomatini99": "Streg", "motherplug": "Y u wasting paper whilst fighting for the environment", "jozibeararts": "❤️🤩Thanks Greta", "nikrebolj": "Jebem ti mater", "balexandruo": "Good morning @gretathunberg I am fine i sas with a and flue to this winter but i am fine new how are you? Have a very good day and happy week take care this coronavirus is very dangeros every day get wors #GlobalClimateJustice Sending love from Romania #GlobalClimateJustice Thank", "memes.ols": "🔥", "wene_beinhart": "Use Edding for better reading 😉", "leoneoneonprivvv": "omg the paper ur using contributed to deforestation x", "__._andrei.___.___": "Ce Urâtă ești smr familia", "riding9high": "@gretathunberg my 4yr old Grandson could also write his Alphabet 😂", "sadece_gercek_tarih": "Come to turkey and turkish teen you fuck kdkdkdkd🤬", "_simon_brxckner_": "Fuck You Greta Thunfish", "val_jsoares": "👽🤭🤪", "namastesamsara6": "Nervt", "lomaxmelissa": "Keep up the movement. Just safely. We love you you Greta.", "sarusarusingh17": "👏", "3_ethan.brennan_3": "Learn how to spell lol", "dante.tracy": "Sorry I don’t speak pewdiepie", "hydrosecta": "Skol", "misskushprincess": "Girlll just stop it already. Enough is enough", "jasm2323": "LMAO every kids dream to not go to school. U sneaky snake😏", "kvs4life": "penis", "yeetus876.31": "U smell like doodoo", "ilyushadolzhkov2k20": "Oh no!! She wrote it on paper! while killing a defenseless tree 😟", "isabelle_rosu": "👏👏", "mr_baskey08": "Why dont u fuckin mimd ur own business 😆", "emre_altan.2007": "Kağıt israfı niye yapıyon oç", "ilov.e4389": "Cessa schifoso vo caga", "shmsedin_krass": "You are a lil kahba", "un.antiexemplu_": "@secilaltunbas_", "fuchs3872": "roll it! and plug it in your a..", "eddydredd": "Хватит убивать деревья ради надписи", "kamil.durski": "How posting things online will change the climate may I ask ?", "kasafirkaptures": "You don't need to, a couple of weeks of lockdown has done more for the air quality and general environment than 20 years of green protests!", "bluedevil1006": "Dieses Ekelhafte Balg soll endlich die Fresse halten . Das intressiert Keinen was die Trulla zu melden hat. Nur Geldgeil und Aufmerksamssüchtig !!!", "gundersonzhana": "Awesome idea @gretathunberg . Now include others to voice their FRUSTRATIONS at 3rd world countries who cause more damage to our planet than most western countries 😅👍", "pooya_.jafari": "fuck you crazy", "villads_tj": "May I ask, what’s the point of a school strike? How does that tell people about climate change?", "dalin_dal": "Go to school ok???? You can’t make excuses for unwilling go to school", "harryy.cook": "You created corona virus", "planet_mat": "Go back to school you idiot", "gera.guy": "Go to school dumb bitxh", "_adamomalley_": "@aleksiangerpuro my man👊", "pedro_stanley1": "Maybe Corona virus is nature's way of dealing with over population as you climate activist seem to totally ignore this no 1 fact of over population main cause of climate change, now please tell the third world and religious people who have average of 7 children, point the blame on them not the western countries under populating as well as offering solutions.", "youjustlaught": "K", "lexnxn__": "😆😂😆 Makes me piss this girl does", "stchingov": "❤️", "the_king_of_sverige": "Don't talk shite.", "thehimanshu7_": "Tumse jyda environment ko saaf #CoronaVirus ne Kar diya hain bitiya @gretathunberg", "dmitriitelevnoi": "Заняться нечем! Достала уже всех! С пеленок только вылезла, и учит жизни!", "eduardulyanov001": "Держись Гретта!!!!!держись!храни Тебя Господь!!!!!!!!", "camal_camalov": "Don’t write on paper!!!", "domshki": "Corona does more for the climate than you in 83 weeks 😂😂😂😂😂😂 you're the most bullshit in earth 🤦‍♂️🤦‍♂️", "douglascouto55": "“Nicolás Maduro recomendou uma mistura de capim-santo, gengibre, sabugueiro, pimenta do reino, limão e mel de abelha para combater o novo coronavírus.  É a cloroquina chavista.” 😂😂😂😂😂😂 OLHA O SOCIALISMO FUNCIONANDO 😂😂😂😘😘😘", "sungrowngardens": "So are you standing outside your house? Cause everyone dam near home school now", "denisdenislav": "nej 2028 2023 börjar problemen med världen att det kommer att finnas tsunami något som inte hade kommit förut gäller också för Europa.", "myasir23": "♿😭", "xavier_finstaaaaaaa": "You Are wiritng on trees.", "adiajgies": "😍😍❤️❤️👏👏", "anthonycurioso453": "This might make me sound like an idiot but what does that sign in the first picture say in English?", "johnsciarretti": "Ok I’m sorry. But if you think that striking by not going to school is going to save the entire world and solve all of its problems, then you are seriously mistaken. School if where we go to get educated so we don’t host ridiculous strikes like this. Encouraging other kids to use the excuse of climate change to not go to school is a terrible excuse for kids to be lazy. I’m sorry but school helps people become more social and learn to help our communities in times of need like this. You and your parents should be very disappointed that your using this as an excuse to not get a education. In fact, if anything you have been disrespectful to to educators all over the world by hosting this strike. This is not how we solve our planets problems", "_gabrielemontalbano": "Ugo", "ajai_patidar": "Lock down due to corona viruse is healing mother earth , a bitter truth . We need such lock down annually with out any reason , this will help to reduce global temperature , few lock down annually throughout the globe make a big difference.", "olegatrigger": "Тупая нахуй ты бумагу тратишь", "ma01007": "313", "agan_tbk": "Fotze", "diyar_kartal1": "Yavşak", "xaander_h": "Well, everyone is school striking now lmao", "deutsche_memes_official": "Follow my meme page for funny memes and posts", "mole.can": "Skol", "_wisemansaid_": "QUOTES OF THE WISEST MEN THROUGHOUT HISTORY🧐 CHECK OUT MY PAGE AND FOLLOW IF YOU WANT TO CLAIM DOSE OF WISDOM DAILY🔥🔥🔥 WISE SAYINGS BOTH IN RUSSIAN AND ENGLISH❤️", "maxim_ivan_andreich": "Ипть ты страшная конечно)", "harleye.06": "Shut up", "future_celebrity_daniel13": "I luv how she’s using paper", "rebeccamagnell": "så bra av dej finis bästa du❤️", "chupa_chups_92": "because of your posters people destroy trees even more and there is a lot of garbage after you", "lysovvolodia": "Привет", "___angry_queen___": "GRETA SAVE THE PAPER", "bastianschmegner": "👎🏻👎🏻👎🏻", "theoholt1_": "Mans writing that on paper what does paper come from?", "earthq.1234": "şu malın 10 milyon takipçisi mi var cidden böyle dünyanın mk fikir fukaraları barbar iki yüzlüler", "fufufufuksksks": "Сука ебало оффни", "_gabe__beck_": "go kill yourself", "jan_vrsovsky": "Liar!!!!!SARS-CoV-2.👎👎🤬🤬", "namoa_61sn": "Schule schwänzen geht heut nicht mehr nh @gretathunberg", "natuseki": "Do not go to school does not save the climate! There are many other ways to get people to think about climate!!", "_alex_wrnr_": "🤢🤢🤢", "alissa.rs10": "That climate shit has stopped now it’s corona time", "roccoanthonyd": "We need plastic bags. Reusable bags are helping to spread the Chinese coronavirus. Very dirty.", "iamaclam": "啥b", "generalfelix": "please get corona", "romulus_sax": "@gretathunberg It’s time for you calm down as the whole world is fighting against the deadly virus. Please stop for now, that’s how you can help. Thanks!", "mapache_coon": "Che chamaca castrosa haste paya", "nisarg___4_6": "Attention seeker bitch", "nav.rishi": "Bakchod bachchi", "eizeek": "STOP USING PAPER!! CLIMATE CONTROLLER!! PAPER = TREE!", "til.knt": "🤢🤢", "aidan_massey7706": "Coronavirus helps more than you", "krzysiek_xnx": "I hope someone actually kills you", "s.987._": "Climate change does not exist she only does all of this for money in my opinion", "n.d.2007": "How dare you", "jonas28.02": "How dead are you😂", "rowanweldon2020": "Does that sign mean that I support climate change because I love burning fossil fuels and ye nans toes", "austinobrien": "Propaganda", "19nathanoffiziale99_08_12": "Jätte läskigt barn😵", "dogankaya_03": "There is no school anymore", "physicsandfiore19": "Go to school and stop being a dumb piece of shit", "rob__9i": "Jag trodde inte att vi i Sverige har så sjuka människor på huvudet som du", "mariepatrice3": "Ton climat c'est pas notre problème petite chérie", "h.westt_": "Go to fucking school after this crona shit", "meat_action_together": "Join MAT and spread it!! ✊:#MeatActionTogether. 🔥LINK:https://mat-meat-action-together.bubbleapps.io/ 🔥SELECT from options : 0g a day ~ meatless monday. ✊We are non-profit platform and our goal is to make 1 Million people join MAT.", "ga.briele4582": "🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "dopememer": "What?", "ojanitoo": "👏👏👏👏👏👏👏👏👏💫💕💕💕🌹", "jvfdhjhgf": "Sad to know that many people are naive in front and such a perfect girl!", "iamguglielmodetoma": "Ahah", "saretta1306_": "perché stolkerare il clima?", "merid32": "Greta does not waste paper; it is made from trees, which in turn are oxygen.", "tonnyg2010": "Om du vill skolstreja varför när du vet inte ens om de är sant", "gingeritus__2a": "Puppet", "hannah_louise_1606": "Haha okay", "yungmidtgaard": "You're a psyco", "robbieyoung2010": "Ok", "sodiqov_0990": "👎👎👎👎👎👎👎👎👎", "banann.a": "🔥", "muhammedatta2019": "You should have not lied for attention regards COVID. You are at the end..... beyond the end of your function as manipulated busybody. Stay on your psych medications, and become quiet.", "maximilian1124": "Corona hat eben auch was Gutes: endlich Pause mit diesen unsinnigen Streiks, die zu gar nichts gut sind.", "lihmaan": "Lern Deutsch du hässliche Klimanutte", "youngbarnetfoundation": "💜", "dio.crist0": "Yeaaah, go strike with corona virus, fucking stupid girl", "feni333": "Everyone patience and tranquility. Without fear or panic. it will all be over soon. Be supportive and united. There is so much to do. 🔥🔥🔥☀😎✌💖💞💞💞💞💞💞💞💞💞☀🔥🔥🔥", "amadei_matte": "🤮🤮", "isabellaadamsson": "HOW DARE U THAT PAPER IS FROM A TREE 😡😡😡", "ina_green_v": "❤️❤️❤️❤️🙌", "e.t.n.a": "Thank you for this because i was looking how to be a part of it", "khurramshahzadkhokhar786": "You are not activist just makes publicity", "alywayde": "Hope you die.", "jhansen9001": "#covidgreta", "dreamy.rae": "U can’t even spell climate right on ur pic", "earth_is_a_treasure": "Why not use this moment to point out how bad it is to abuse animals for food or pleasure? COVID19 came from wild animals through a horrible practice of illegal trade. Eating and killing animals is just as bad for the environment as flying. You need to shift your focus #Greta. Schools are not to blame.", "jakob.tillberg": "Aha week 83 of a mentally ill child not in school, protesting about the climate.", "johnvegan1": "Are you aware of the fact that you might have killed hundreds of people? Thanks to your useless speech at the euro parliament now people have died", "giancarlobinetti_": "Ma per piacere", "alunredstaruk": "get a life you muppet", "ben.richens": "Stop being nerds and go back to work", "korduskacper": "Covid 19 did more than you all screaming climate-teenagers will ever achieve...", "milan.zecevic2": "Doctors confirm if you have the virus or not and not you, you are just suffering from a lack of attention !!", "uwu.nikory": "💚💚", "haines1701": "Hi Greta, u are amazing and u should never stop protecting the planet. Slowly people are realising that we need to change together.", "zak123_x": "People stop being horrible u weirdos if u dont like what she post then fuck off", "genderneutralbeauty": "I’m glad you are not bothering anybody with stupid strikes. Go away, boring fool. 🤮", "mikefla_tenn": "🤡 Crazy liberal 🐀", "joline.soderstrom": "snygg!!!!!", "a_b_kara": "be child greta. be child. you can not be hero. you just be project.", "michael_machyshyn": "everyone gets sick, and even dies. Is she special? She was treated not in the forest, but with the help of modern medicine. what is she opposed to? she introduces posts on instagram, uses it. and Instagram is the same phone, the manufacture of which spoils the climate. it's funny", "john.ball02": "No way r u 17 you about 10 years old you little rat", "ot_.38": "Shut up u neek", "sjoerd.v.vliet": "👍", "richard_stolhofer": "Skap", "fintan_walker": "Hi I just wanna point out we need electricity to use phones and laptops so it defeats the purpose of going online and spreading the word", "fabian.tmt": "Fuck you", "peretjatko__16": "Asberger", "riverpixieart": "@gretathunberg seen my previous mssge in ur previous mssge?not into answering huh?bc i have no big enviromental sign?spent 4 hrs trying", "retarded.fights": "❤️🔥", "papyangy": "Here schools are closed. Strike is no more an option", "gonzagilli": "@arielabruno culiada JAJJAJAJJA", "jlo1ny": "LOSER 🖕🙄", "captainjamsie390": "Why should we be responsible if you go to school or not? Its not like you been to school ever", "breakdownplastic": "Maybe Covid 19 is the biggest crisis we’ve ever had to face. What do you think @gretathunberg. The world never shut down for climate change. Yourself, your friends, celebrities... they cruise around on private jets polluting the world and judging humanity for destroying the planet. And in comes a virus and shows everyone what the real threat is....", "steph.fis24": "u suck", "mateocarlborg": "hoppas du dör av covid 19", "davidreynolds352": "Skolstrejka för alla barn som inte kan gå i skola för att globlistiska giriga vill utnyttja deras föräldrar. Kunskap räddar klimat. Och jobba för att bekämpa fattigdom och orättvisor. Bara falska människor och hycklare umgås med dig för att inte bli kritiserade. Sedan flyger vidare medan barn svälter. How dare you.", "lafuyiah": "You're so cute 😘🦋", "tomiacurp": "unos problemitas", "maralemn": "Study at home.", "felipemarcolina": "and this virus didn't destroy dreams and the whole world, or was it so in the Amazon", "forestrydude": "Your Asshole disease kicking in again...STFU cunt!! Useless insect...", "0marth": "👏👏👏👏", "southfreshboy": "Usa un pennarello così si legge anche da lontano 😉", "zhigley": "LOOOOS ARBOOOLEEES 🌳", "daniil_salnis": "Иди нахуй со своим климатом", "onlylonely69": "🤦‍♂️🤦‍♂️🤦‍♂️", "stop.the.left": "For the truth about Greta, YouTube “Great Inc”", "amar8.0.8": "I love you❤️", "the__real__conservative": "Litally who tf cares", "gabriele_malciuc": "Tu per scrive ste cose sprechi dei fogli di carta e poi vieni a rompere a tutto il cazzo di mondo di non sprecare e di non inquinare", "laos4477": "she is freak", "hvco": "Shut up 👎👎👎", "buddha_berlin": "by the time klima is not the point especialy corona let us think. leave us alone miss Greta", "viitiisecades_": "Ay don anderstan", "cabanhalascanarias": "The world is already on a full scale strike if you didn’t realized yet, plus you should be posting something more positive about it, like how this “global strike” , by your sponsors, are cooling the planet.", "jamesmadden89": "Stay indoors", "bfke36": "Fuck your bs ass strikes 😂😂😂😂 they are💩", "mathews_watercolors": "At the very moment the world has bigger things to deal with right now than the climate. You don’t agree?", "pacidupre": "❤️❤️❤️❤️", "raeraynerae": "Lol hear you got sick. YAY you deserve it. Will you blame the older generation again ? Useless POS KID.", "m_ond_matz": "Greta du stinkst", "riccimarco.it": "❤️❤️", "murican_hansen483": "Oh, maybe that's why you dont understand climate change, you've been out of school so long you missed the lesson which would've kept you from embarrassment", "ganymede22": "It's amazing how many adult trolls are attacking a child who just wants a better world to live in. She is not hurting any of you. Seek Help your comments are beyond disturbing.", "tkf_fin": "Literally looks deranged or bacjward", "kudryaviy1121": "Ты хуле на бумаге рисуешь? Для кого блядь доски и мел придумали ебанутая?", "koronovskiyy": "It would be better if I taught lessons, but I did not suffer from garbage", "luca.bosshard": "Troia c’è il coronavirus fai stare tutti a casa", "davorghini": "Online is better because people can block you easier.", "smoke_kaufbeuren": "Ugly", "masonblyth_": "i’ve been to more funerals than days you’ve gone to school", "onurkaan.oe": "How dare you", "xjfgkju": "Девочка вот я постоянно задаюсь одним вопросом, ты уебище?!", "stanislav__erkin": "👎🏻", "maic_medeiros21": "Nana do nana do guarana", "youaresodarkkk_": "@d.rey666 you are his crush!!!! Please marry him!!!!!", "kongegata123": "Gå till helvete fan! Du pratar nonsens, galen! Du är inte längre nyheter! 💩💩💩", "smarrig_vegansk_mat_": "❤️❤️❤️❤️", "marcusbreithaupt": "😂", "cv23nc": "🤦‍♂️🤦‍♂️", "chuckie1974": "Sorry, but you can't say you passed the virus until it was confirmed to you by testing. I had the similar feeling, fortunately IT was regular flue.", "f.allach": "Did you noticed you writing on paper...🤨", "sesr21": "gay", "_official.rezon_": "Digger Bild machen wo sie neben Gepäck sitzt im Zug für Fame aber in Wahrheit first class fahren.#Abschaum", "vilmavieira5242": "A dama da natureza desapareceu.. 🤣 🤣 🤣 🤣 🤣 🤣 🤣", "matias_.beltran_14": "Ese papel mato a un arbol... :(", "tasostasoulinakos": "🖕🖕🖕🖕🖕", "joyce_camoes": "Waiting for your hate speech against China!!!! They are destroying the worlds dreams and people’s live. But, we cannot disagree that they are more efficient then you... “smart girl”🤣🤣🤣🤣", "eemirboz": "ORRRPOSPUU COCUGUU", "_nanno_stuntrider_": "Ma scusa ma non ti occupavi del clima", "temuujin_142": "Coronavirus helps more then you Greta🐷", "definitelynotmasonluebke": "This is wrong to suggest missing out on education to promote climate change kids need education and little kids don’t need to be activist be kids", "kirppv_": "Тебе пора в школу", "ariana_desimone": "😂looking at people’s opinions and seeing them get bashed for it.", "tasfishy": "Climate change. Giant hoax.", "marvinjo9": "Ökonomisch ist nicht immer gut alle Diesel fahren und ordentlich die sau mit Abgasen rauslassen 😮🧨🧨🧨📛🔥", "roksiguzda": "@juliatyrpin", "vanesik_9": "A furt strajkovat by chcela", "tuijaannikajarvinen": "Yeah right, now you're also a doctor 👍😂 So long as doctors has not taken any test of you you can't say that you have a Corona virus. You seems to do what ever to get your moment in a spotlight 😂😂", "x5bb.a3ud": "🖕", "emma_dilemma._": "Hey queen. Girl you have done it again, constantly raising the bar for all of us, and doing it flawlessly. Id say im surprised but i know who you are.", "spondumeister": "Mitä vittua tuo tarkoittaa", "trad_o_manster": "Det blir intressant att följa vad som händer med klimatet nu när folk konsumerar och reser mindre över hela planeten... 🌏", "viktettan": "❤️Fina du 😍tänker alltid på dig vilken oerhörd stark människa du e", "patrikfitzo": "@gretathunberg strejk varje dag nu för de som går i skola. Vile bara informera 😎", "_qundak_": "Жаль у нас так не прокатит🤔", "gamay7": "🖕🏻", "nicholaskenney_": "Lol 83 weeks without school? Nobody cares 😂 your just hurting yourself. Get an education.🤦🏻‍♂️", "dodge_ramtrucks_potsdam_": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "thomasilmilanista": "Ovviamente c'è l'emergenza del virus e tu pensi a ste cose. VERGOGNA", "gretaif": "Nå fikk du skolefri ja!", "fad.1": "please get yourself isolated permanently, you're not relevant anymore", "saiyora_hairdresser_kokshetau": "Глупая", "dalientha_alien": "Everyone worship Gaia.", "alerosaario": "Go to school bitch!!!", "jcmyrand": "United we can flatten the curve. @gretathunberg", "trapleyy": "Climate change isn’t real 🤡💦", "_.yarich._": "Пиздуй в школу блять,оце молоде тупе несе всяку хуйню", "mameliandrea8691": "Stay Safe Kid.. 🙏🙏🙏", "shrewskii": "Imagine spending your whole life fighting against something that doesn’t exist.", "marcstevenwatson": "Where's your other placard @gretathunberg?", "arthur_agviar": "Aperta com eles gretinha", "clodagh.02": "no❤️ @exitedgator23", "giovannilucat": "I’m crying for you 💪🏻❤️", "n_x_c_k_": "School? No?", "drinkwraithenergy.com_kiwi": "👏", "varpalki": "🍓", "bil_sene": "spoiled little bitch", "t.privv.v": "I'm pretty sure no one cares what this bitch has to say😂🤷‍♀️", "adicleison": "Whats can corona vírus? Amazônia vc sabe criticar né.", "valzilske": "lisa Simpsons just stuped things do it", "cagatfs": "❤️♻️", "flamecopretendo": "Corona virus is a climate lol", "epy.666": "THE CLIMATE IS ALREADY CHANGING CUZ EVERYONE IS INSIDE DUMBASS", "emi_the_ceo_of_rebounds": "Gay", "ermieez": "Do u shave ur coochie @valeriecalandra_", "mara3564": "@gretathunberg You didn't complain that the Brazilians were destroying the Amazon now you complained to China that they are destroying the planet ???", "lilskiti": "Fuck gretathunberg 🖕🏿🖕🏿🖕🏿", "sandradeehart": "Can you spell or is this another language ?", "kotian.hitesh": "Our principal of the school ST AUGUSTINE'S HIGH SCHOOL IN INDIA THE SCHOOL OF BLESSED EDMUND RICE is encourageing u a lot👏👏👏Our principal is mad DONALD TRUMP too😠😠", "eliii.38": "was machst du eigendlich wenn man nicht demonstrieren darf wegen corona?", "deepa.raghavan": "@gretathunberg you have a platform goddamn use it spread awareness on self isolation, that is the need of the hour..!!!! if we come through this alive.. I shall hold a sign and sit next to you..", "peter.cates": "Ur 17? U look like ur 12", "sosthenes_mjr": "Sonhos roubados são os meus dois ovos enrugados!🖕", "ramondbakker": "Hello , why did you are in silence about the chinese virus crysis ???", "andresilvaribeiro123": "Atacou tanto o Brasil e o USA mas não fala nada da china q espalhou o vírus pro mundo todo 👏👏👏", "culenovax_b": "😂", "rogeriorosco": "Cadê você? Pelo jeito não vai ser o clima que pode acabar com os seus sonhos... Vai ser um vírus. E você não vai se manifestar?", "imdevelopers": "В Россию, на Шиес. там полигон мусорный хотят сделать и засорить среду.", "moonchi_d": "There's a global pandemic going around and all she cares about is climate change dude😂", "laucoax": "Greta abbiamo capito ma cosa continui a fare ste cose quando c’è la pandemia oooooo riprenditi sore", "kjk5258": "you're bitch", "p0pr0stu_azej": "Oh yes, when is coronavirus pandemic we need talking about climate😂🤬🤦🏻‍♂️. Why you don't talking about staying home etc.?🤦🏻‍♂️🤦🏻‍♂️😠😳", "alexandreedecker": "Imagine having a pandemic right now with possibly millions of elderly people dying, which fought for their Countries in the II World War, etc. and some autistic kid is still complaining about the Climate like there are no other priorities", "uptdatemypaypalbalanceeveryday": "I update my paypal balance every day", "tarin_khan16": "İt's sad yet a massive breathtaking moments for the earth. Look how it's giving us a clear picture of the earth who needs break from us sometimes. İf we can quarantine for this long time then why not once in a month. This can make a lot more difference to the earth. İt's big yet a small step if we think about it. İ know you can SEND MY MESSAGE TO THE PEOPLES WİTH POSİTİON..", "mattiaarachieli": "A sta testa de cazzo", "robeeriooo": "will the streets fight coronavirus no?", "andre16costinha": "Coronavirus is your best friend", "vladbndrv": "Гретта иди нахуй", "fafandthekid": "covid is the best friend of the climate @gretathunberg", "stefan.frye.731": "❤️", "vauxhall_corsa_posts": "Do we not have better things to worry about like the coronavirus", "geekyfaisal": "Please stop immediately", "akdoga_n": "Helal olsun okulu asmak için iyi bahane. Biz bir gün okulu astık ertesi gün her teneffüs tek ayak üstünde bekledik. 😀😀", "nikolaj_jarden3": "How dare you", "paolop79": "You are the black swan! I hope you can 💀 soon! SHIT! TRUMP IS THE ANSWER! We are great! AND YOU ARE A SHIT!", "semmadest": "Let strike Greta Thunberg for climate", "renanleitau": "\"The general population [...] doesn't even know that it doesn't know,\" said Noam Chomsky. Nobel laureate José Saramago in his \"Essay on Blindness\" wrote: \"We are blind who, seeing, do not see.\" We have had the Climate Crisis hidden by false denials. The COVID-19 treated with irresponsible childish humor. It is not possible to hide lethal crises. It is not wise to play with death.", "the_lovely_bad_thing": "Easy during the quarantine AHAHAHAHAHA", "dil_mah1": "Quando vai na China perguntar: \"How dare you?\" O mundo espera... vai lá.", "_xx_.m.a.r.c.e.l._xx_": "du bist hässlich", "michelelee71.ms": "LAUGH WORTHY", "artistartist2323": "CORONA shows how you can save the nature not Greta", "fake.bri.lamouchi": "I don’t think that the climate is our primary concern at present. I’ve said before that you should cut the governments some slack as they’re doing all they can, but they’re simply too busy. Now we’re at the point where your strikes and protests are going to go unnoticed, as everyone apart from your fellow mental patients will be focussing on helping members of their household, working from home more than ever before, and for key workers, they must find your protests insulting. They’re doing all they can to help stop this virus, and then ungrateful children like you go and say ‘We need to stop using fossil fuels’.", "kj_apa.fanpadge": "Fuck you🙌", "holy_wossa_oda_so": "Scheiß kind", "giuliafollii": "Daje che co sto corona il cambiamento climatico sta sparendo", "dv.die": "No. #fuckgretathunberg #fuckgreta", "muzaffermmh": "you be at home piece of a shit", "zara.ahs": "Why striking for school when there is no school because of a dangerous pandemie", "_taekebi": "Thank you Greta !!", "vavahsmith17": "Olha A Pirralha kkk", "noor4685ali": "👏", "_nawfsideplaya_": "Awwwwww shut up. Your whining is not going to help with climate control. If anything this virus is what we needed.", "dragonsparx": "Why do you still have the facial expressions of an 11 year old? Aren't you 17? Stop with this attention seeking child acting.", "patrick_roches": "@gretathunberg hey 👋 since you’re trying to saved the world 🌍 as you’re qualify as scientists 🥼 👩‍🔬 , I’m wondering if you have already the cure for COV19 virus 🦠? We all know that you been all this time studying in the scientific 🧪 projects we wondering if you developed the vaccine 💉 for coronavirus 🤪🤪🤪🤪 lol 😂", "vl_ad5749": "Заебала уже со своими протестами, плакаты ничем не помогут", "azizbecks": "In short. She has been saying that we humanity should stop exploiting fossil fuels, and our industry alters the climate. However, as we can see now, because of the virus people has stopped working in those spheres which Greta was against for. It resulted in getting better water canals in Venice and air pollution in China lessens. So we can see that the Earth can heal itself in a short time. Nevertheless, you can't imagine how people are close to big crisis for people don't have a job, factories are closed, industrial activities has been closed. Zillions of people depend on it. In the end, just imagine how big harm can make to the humanity @gretathunberg ideas. I hope my message is understandable.", "sonofbrecht": "How tf you gonna strike if you're at home anyways? Bruh", "___p_r_o_m_o_d___shashika": "Top", "barbie123barbie": "Ma smettila! Ora i fili che ti tirano, cosa ti faranno dire? Circondarsi di persone ricche, ecco cosa ti piace.", "soplop18": "Bruh you are using paper save the trees environmentalist", "fabriziocurra_": "E DICO PORCODIO", "stoppeukafval": "STOP BUTTLITTER", "lucjafice": "masz dziecko twarz kosmitki Moze jestes nie z tego świata i ratujesz Ziemie? Kochanie, nic nie zrobisz tylko ewentualnie zadbasz o swoja karierę a potem Cie przekupia albo zniszcza. Tak działa ten materialny świat globalistow. Ale oni jeszcze nie wiedza, że sie pomylą i historia ponownie zachichocze. Świat w materii trwa krótko Niech Cie Bog ma w swej opiece", "allysajuddofficial": "We're learning about you in English and geography your epic 😘", "utkars_casm": "@gretathunberg Can you please strike in Wuhan (China) ?", "ale.com.ar_": "PROGRE DEL ORTO", "maik_schrank_": "If you want a change now is the chance", "cry.tearz": "My girlfriend @zoe_ward33 wastes food!!!!! How could she. Please find solutions and stop this madness", "zanos_7": "@gretathunberg ur wasting paper u bitch", "westmountvintage": "HEY GRETA CENTRAL BANKS ALL AROUND THE WORLD ARE PRINTING MONEY OUT OF THIN AIR FOR US TO CONSUME...TREES DON’T GROW OUT OF THIN AIR. DO YOU THINK IT’S OK FOR THEM TO DO SO? BY THE WAY YOU SHOULD BE GLAD OF THE ECONOMIC SLOWDOWN AS PEOPLE ARE MORE CONSCIOUS THE ESSENTIALS OF LIFE AND STOP THROWING THINGS AWAY AND POLLUTING (ESPECIALLY WASTING FOOD). WE SHOULD LIMIT THE CENTRAL BANKS OF PRINTING NON STOP MONEY BECAUSE IT AINT HEALTHY FOR THE WORLD.", "lolalamont36": "Lol get over ot", "giuliomuscas": "Don t use electronics ,dont use cars ,dont go to work , just collect from the ground ,what mother nature always give us for free ! Thanks for open my mind !", "marcelinoalfredo10": "My pretty girl, I wish there were also quarantines for climate change and help the poorest👌👍👏💗💗💗💗", "harrylakhian": "I guess god is listening to you, that's why right know earth is healing. #stayhome", "fabriz_the_cheese_": "Yass", "giampaolo_jpv": "Hai rotto er cazzo sgorbia!", "truth_of_fashion": "FOLLOW US!!!", "ethanhenderson15": "I hope u get Corona", "aprenda_ensine_": "A China não destruiu seus sonhos? @gretathunberg", "drip.ordrown69": "My favorite tard", "erickcorrea.8085": "Se pronuncia sobre a China que destruíu varios sonhos", "nickromancerandnecronancy": "Looks like god mandated the school strike for everybody.", "indiann_gay_boys": "It's done... go school now ❤️", "mr_cook1es": ".___.XD", "basot789": "Kunem ku tertak gloh!", "sn1tch_9ine_": "Corona is more useful than you", "forsell_marianne": "🦋🦋🦋🦋", "bigarne1": "U little cow. It every teenager dream to get off school and you just use climate as an excuse? What if all the parents went on strike and refused to feed all u little terrors?", "cintia_laramelo": "Tá sumida hein? Cadê você não vai falar com o xingling sobre corona ?", "gugasgama": "PAU NO CÚ!", "evah_33": "I’m sorry I don’t speak dumb", "mranimal1": "Greta I know our one smart women and have been thinking about this. Since this virus pumped the breaks on the world to just think. Use whatever you can for ammo on how just these last few weeks have helped the world BREATH. Like this story https://www.npr.org/sections/goatsandsoda/2020/03/04/811019032/why-chinas-air-has-been-cleaner-during-the-coronavirus-outbreak love always Animal", "sabrinacolome": "Greta! Please speak a bout de ilegal market in China, where develop the covid19", "arnaldomeneses": "I thought I was going to show up at the Communist Party conference in China to defend the world from the Chinese virus", "samolirei": "Your litle piece of s#@$$$ where are yu now for take a word with the china", "alejoguerrero12": "Callate no joda.... pinche titere... vaya a dormir no joda", "lucasriedi10": "💩", "_at_14_": "Your a cunt", "da_oewin": "🤡🤡🤡", "marcelo25vm": "You👉🏼💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "cleber_wescley": "Idiota!", "0b102d2": "Thankyou Greta for being you.🏄🌺❤️.we will do our best.", "bg4082": "Keep following Greta clowns as Jordan recorded the coldest tempature \"ever\" on record.... Ya global warming my ass uncle Al... Oh wait \"change\" and we will tell the sheep every event is crazy change.. 🤡🤡🤡🤣🤣🤣", "jc_zaqui": "O covid não roubou seus sonhos? Ou você só sonhava com a Amazônia?", "tadeucarlos2010_": "Fuck The climate!Where are you now?Talk about China your fake activist!!..How dare you is My ass’ 🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "luucufer": "Stirb dran", "constante.ricardo": "💩💩💩. Não vai aparece na TV , idiota.", "edsoncial": "#viruschines não afeta o meio ambiente??? Pessoas não são importantes?? Acorda!! 👿👿", "coronavirusf": "Hey👨🏽‍✈️, Stay safe and help spread info to avoid covid-19🦠 😷Follow for daily update on the coronavirus🦠", "avatarroku4200": "Greta made my pecker stink", "zaur_orcuev": "лечись дура", "yasibhb": "💩💩💩💩💩💩💩", "nofolow.dm": "@sofiasidlovska follow pls", "luisaug4": "Corona picareta", "kgokyurek": "no flight ✈️. no factory, which fuck the environment. almost 0 emission in the World. Corona made your dream real. 🤗", "thiagorezende86": "Stay at home, you cause a lot of confusion !!!", "samy___2001": "Fuck Capitalist! We need communism!!!", "mybedtimeis9": "We should stop breathing to produce less carbon dioxide. With less carbon dioxide there will be less greenhouse effect and global warming will stop", "gigimatador44": "👉🤡", "georgepalin_": "💕💕💕💕", "wallacedemourateixeira": "O que é pior o fogo na Amazônia ou o covid-19.??? Quem matou mais?? Porque está calada.??", "gioneliaschopfer": "@gretathunberg you made this out of a dead Tree?! Thats not okay! Litteraly YOU", "thebeastofvalhalla": "Stupid little girl, you look at what this disease has done to the world, we have stopped flying and stopped driving and look what’s happening, you annoying little cretin", "deisy_css": "🤢🤢🤢🤢🤢🤢🤮🤮🤮🤮🤮", "marciaassisandrade": "💩💩💩💩💩💩💩", "rosoqo21": "Корявка ебаная", "eq.cn": "Nobody like retards", "tamaraa_sep": "Minha querida cadê vc? Cadê Macron nessa crise do seu país. Salve a Itália. Coronavirus helps!!! Mimadinha hipócrita.🇧🇷🇧🇷🇧🇷🇧🇷", "vildson.dias": "Só sonhava com a amazônia.", "sydlrwsymhmdlsyd": "❤️❤️❤️❤️❤️❤️❤️", "dali0220": "STAY HOME LITTLE GIRL!! PERIOD", "gabrielgddias": "Os comunistas não estão roubando seu sonhos ?", "samuelmendes921": "Vai falar do corona não ?? Escrota", "salvadorrg": "Sobre o covid 19 nenhuma pala contra a China só observo!", "willianrasch": "Não vai se manifestar agora com o coronavirus, pirralha, deve ter ganhado uma boa grana pra falar da Amazônia...", "eggdognog": "Ay uks on lockdown, no more climate strikes", "mert_watches_naked_kids": "U look astonishing 🦶🏻🦶🏻🦶🏻❤️❤️❤️❤️😘😘😘😘🤩🤩🤩🤩🤩🤩🤩🤩", "megastar_989": "Хули мне эту дуру инста показывает", "ayazpalma": "Corona Virus did more to the environment than Greta Thunberg", "zmarceloz_": "DESTROY MY PUSSY, NOT MT PLANET", "thanouliss__": "Αντε ρε γαμησου μαλακισμενο γαμω μας επριξες να ουμε", "vrooblin": "Nobody cares", "edwinchezg": "😂 Stay ignorant just the way you are now", "yuriii.alberto": "Doesn't the Chinese Virus steal your dreams?", "craudiomir0": "förstörde inte Kina dina drömmar, brat?", "world_record_toiletpapers": "Let’s respect the toilet papers during the COVID-19 (Coronavirus) and let’s set a new record! Like the toilet papers!", "nichar1208": "Youhv got what you wanted at last😒", "kolorful_skys": "What a useful idiot", "l.simunoski5": "🤡🤡🤡", "rodrigocarmo": "Why u said nothing about China 🇨🇳 Covid19????", "tyraangelitamaria": "Save the #fosterKids... they get raped more than jail kids and babies in cages!!! 😷😷😷🌻🌻 #COVID2020 #giletsJaunes #tyraWikileaks #HelpThePoor #SethRich #Agenda21 #caliPride #iPodLife #KaliefBrowder", "griwalo": "Жопу рукой подтирай", "tanner_spence": "Good luck getting Into a university or a job when you turn 18 and all of this goes away", "gooeylet": "When a virus does more for the country then you do", "leandro.brandao.16": "Where are you @gretathunberg this epidemic don't stove your dreams ?", "crip_simp": "Corona Virus did more fore the Climate Than you in your whole FUCKING life", "nickalnotnickel": "This is doing literally nothing to help the climate", "martina.laurent": "Attention hore! People die all around the world! Just shut up, really, you suck", "marinelleguillot": "💪 @ysolieguillot @aurelineguillot A vous de participer !", "monikitarpm": "Oi gatinha que ia salvar o mundo ,que iria lutar pelo planeta,agora ele precisa de você,essa pandemia não te faz quer lutar 🤔🤮", "b.stat02": "Coronavirus has done more for the environment than you have 😂😂", "georgerji45": "Your mother fuck", "the_meme_therapist1": "Fucking sperg", "xbergerx": "Wenn erwachsen bist einen Beruf erlernt hast kannst reden anfangen !", "charbel_b99": "who cares about climate change right now! plz stop it, we should be striking about people still going out and getting other infected. whats wromg with people, right now mother earth is healing while a huge number is dying. i dont think governments care about what you will be doing these days until the corona thing ends. this is now a wise movement. you should be stubborn on just one cause in life, you should be involved in everything that affects us.", "aleksandr_mytischi": "Greta! Read my letter please: https://drive.google.com/file/d/1VcTCGsf-ViW0GgMgHoNdZQZS4iaRGdVS/view?usp=sharing", "direitaminasitabira": "E o COVID-19, tá sabendo? Não vai questionar a China sobre?", "bruno_giannotti": "Where is you???? Chinese corona virus dont stole your dreams???? Litle liar", "comrad.pepe": "Poo in urinal", "ahmed_random1": "Coronavirus has done more for the environment that you have done so far", "361mario361": "Alle liken die wollen das sie Schule geht", "salamibrot_187erzz": "Greta piss dich", "only.to.follow": "Corona has done more for the environment than you ever have", "carina_i708": "Sorry, but didn’t you think that in this times it is better stop the strike. Doing a little break from it. I think in this days it’s better staying at home and doing things for ourselves.", "_redpillin_": "STFU already @gretathunberg", "leogibbii": "Por que vc não foi pra China manifestar com o Corona vírus? Hipócrita isso sim vc não passa de uma criança mimada que nunca passou dificuldades na sua vida. Hipócrita mil vezes Hipócrita", "its_not_me_its_her": "Jetzt könnt ihr helfen bei der Spargelernte zum Beispiel, Schule ist eh aus", "cassiotdecampos": "Were are you know worthless girl!!!!! At Home doing nothing!!!!", "gracia_rh": "👏👏", "after_midnigth_or_not": "@gretathunberg The World 🌎 never had before this Environment Impact, as these last weeks!!! What you are asking for months, People and Governments are actually doing and the results and the news for the Environment are great “thanks” to the “CoronaVirus”!!! They showed for example, in China 🇨🇳 , satellite pictures before the this Virus started to spread as in last December, and Now in March!! What a difference of the toxic smoke 💨 !! All this, because the cities that were in quarantined, and couldn’t using cars, they closed factories 🏭 and took other Important procedures that were Essential for the Well Care of Health ! They must show more and more this Positive Side on the Globe being more clean as never before!! If I’m wrong with this information I ask sorry for the “ignorance of the subject”!!", "yssirhxc": "Funny how folks like you touted \"climate change\" during the devastating California wildfires when PG&E have now taken responsibility 🤔 what about what \"climate change\" (we now all know it was a huge group of people) did to Australia? Sounds like a bunch of bullshit to me, and people like YOU, greta, are creating hostile situations that are causing thousands of human and animal lives lost all while you make BANK. Your parents should be ashamed of themselves!", "8_akl_8": "Whey you die?", "johnnieemms61": "Good STREJK! Keep going at it.", "ramtin1971": "Greenhouse is off,coronavirus is on and economi destroyed. And your parents jobloss in very soon.Are You Enjoing Now?", "evannreyna": "can u like shut up?", "adam_lucann": "Šak si zatiaľ piču spravila covid19 spravil viac pre prostredie jak ty", "jacob_sandefer2": "Funny how you’re advocating for something that’s a hoax by the government to get you to pay more taxes", "mnr.6_ia": "Bitch", "eckertdani": "Hey girl, not a single world about Coronavírus?? Tou live in tour own world, something not real 😖 because you made a very bad talk about Amazon Forest.. so shut up forever", "lfy050216": "If you have a bad brain, you have to treat it", "ngvie17": "riposate in pace, rest in peace, game over Greta, no more money for you and your parents 🤣🤣🤣", "tommasoofalcier": "Secondo me è tutta colpa tua sto coronavirus", "agirre_telmo23": "Tira pal cole anda", "julian._.fwit": "The corona virus did more to the environment then you.", "noahxba": "Lan du piç geh mal zur Schule du orusbou", "smetsjozef": "❤️Yes we keep staking action, I do it 👏", "cashpad.it": "Great work Greta san👏❤️", "whereis_k_a_t_e": "all you people will get uneducated, etc, fail exams, in 10 years time, how will you support hour families? doing low paid jobs?? or greta will subsidise?? greta is dangerous - her ideas will have a negative impact, on, you, people. And, no, the World will still be here, as it is, no matter what little greta is preaching", "cadetanthonylong": "No wonder why Greta is so dumb, its week 80 something of the school strike. She is also a crybaby Swedish fish. Europe is a big shit show to laugh at.", "erik_jonsson_va": "Lmao lyssna inte på greta, lyssna på corona", "k.hitoshi.0101": "nice🙌day👏👏👏", "michel_parke": "🇧have you made your protest to the Chinese government? Many people dying and you are silent! Your hypocrisy has no limit!🇷", "jonnwells": "Cade voce agora para gritar na onu e falar que destruiram seu futuro,tem medo da china,com toda certeza que sim", "projeto_marvivo": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻 STOP", "1245r7": "Bitch 😂😂🤣🤣", "ele.gb": "Corona virus covid19 has been created and intentionally spreaded to erase your battle, our battle for planet ecological salvation.", "enderilhan19": "Tipine atlim", "grossigrazia": "Bella vai in quarantena e togliti di mezzo che ci hai rotto le palle....", "aviation.leon": "#howdareyou people died and you made school strike 🤬🤬🤬🤬", "westonlowry_16": "What a freaking hippie", "kaffeeglotzer01": "👎👎👎👎", "copollaandre": "Where are you? Covid nee you", "danielcarvalhorito": "And about china?Now All dreans were stolen,and now Greta 🤔", "ahmetysf07": "Boş muhabbet", "melineh.ma": "I hate you😡 Do you know why? Because of all this disaster happened after your speech and governments have begun to reduce the number of people in the world", "definitely_not_somanshu": "Shut the fuck up no one cares.", "tio_betto": "Fuck you idiots", "fixi_hartmann_": "Bitch ass hoe", "save_.the.planet": "😍🌱🌹", "_.youknowwhoiam._": "But we should be staying at home", "lucamalagoo": "Ades at ze cuntenta ca stem tuti in cá", "lorenzo.luvino": "bukki le fatt tu o corona virus e ric a vrita", "scottylondoner": "UK schools are shut now, because of the coronavirus. I'm worried that your strikes may have helped to spread the virus by people travelling and then meeting up in large groups.", "daven.0806": "FFF-666", "majik_8668": "Пидаразенок", "michamgil": "When are going to say something about the Chinese government? Or you just say against the USA? Or Brazil?", "kevin.rooth": "Grogg o luder greta bjuder🤘", "izael_ferreira17": "Cadê você pirralha ??? Sumiu do mundo 🤦🏻‍♂️ menina só tem hipocrisia", "kevin_2.5wrx": "The coronavirus has done more for the environment than you have", "david10.04": "Love it!!", "21.60.79": "Stupid young people", "anna.08_ies": "Nu när Corona är i hela världen 🗺 så kan man strejka", "falko_debolster": "Climate is safe now nobody on the streets 🤣", "joshburrola": "LMAOOO", "helene_glesnes": "You’re so inspiring and kind, i love u and you are so Nice and beautiful, hmu on dm if you wanna be friends:)", "paul_of_kent": "Greta wanted this to happen it’s her she is a witch ! Burn the witch !!", "jimdonahueimages": "Hi Greta, not sure of it has occurred to you that the changes in people’s lifestyle now with Coronavirus are pretty much what you have been asking for and the world needs to reduce climate change. You can already see the clearer skies and people are staying home even from school. The real question is how we can keep some of these changes in place after things return to “normal.”", "leamarikunze": "I love you 😍", "hugojaferreira": "Really? Can media stop giving importance to this girl?", "batmanyourhero": "Thats an joke right???? Grerta are you serious dude???", "tim_rearick": "People staying inside has done more for the environment then Greta complaining 😂", "matteooamato": "Non usare il telefono", "socraatees": "Where did she get the paper from? From a tree? Ironic", "ivaldi.alessandro__tuono.rider": "@polespargaro your ktm isn't happy of your like at this post!🤣", "toyotas.worst.nightmare": "Join me, as we raid TOYOTA to get'em cars back in Need for Speed! We will bring'em cars back no matter if TOYOTA likes this or not. Join us, in this mission!", "emrahcoban": "U happy now? Almost no planes ✈️", "verena_van_der_woodsen": "I like your work. But girl don't u see that now climate is getting benefits from corona and also that now - facing all those problems- a \"strike \"is nothing but inappropriate- or let's say stupid? ...", "loveaslaw": "https://www.hkrdi.org/en/human-perception/ please check the video that explains the source of the perceptive error of separation in the world master of gifted kids web. Hope we can design fast enough the world we want to live without waiting for the ignorance to tell us what to do", "annica983": "❤️😍🙌🔥👏😢😮", "vincenzo_ava": "2 month of corona virus did more than hundreds climate conferences. The point is we are to many on this planet", "malagonjr": "Una cosa microscópica te ha quitado el puesto", "ay.dnzx": "🤦🏽‍♀️", "88admiral88": "👎👎👎👎", "lula_muro": "And what do you think now?", "victor5to1": "Calla puta", "ging_memesv.2": "Why is a virus doing more for the environment then you", "y.db.y": "🥩🔥🍌🐢🔥", "3skov": "U R DUM SUM", "deepesh2050dj": "corona has done what you dreamed f", "carrie.jarrett345": "At least Covid 19 is having positive effects on the environment! #Gaiaeffect", "memesifloden": "Follow@memesifloden", "me.against.uu": "Fuck you, you ugly cunt.", "paytonbendy": "You’re not striking anything right now...", "join_greenery": "🙌🙌🙌🙌", "dom1ng0.en.fuego": "Álvaro, chupa pico, te lo meto por el pico por el pico, y me dice despacito despacito", "evvelocceoff": "Most of the schools around the world are closed by now but it’s the thought that counts I guess.", "krisztianruiz": "Дура тупая, за тебя уже природа решила все.", "isaakartist": "Stop wearing plastic gloves for protection from the coronavirus greta says its bad for the environment.LOL", "virginiajolin": "We don’t need Greta - corona is there", "at_costa": "Why don’t you attack the President of China? Where have you been? What are you hiding from, you puppet! 🤮", "vivi.future": "Your book is the best book 📚", "lavendar899": "Greta, we need solar cars asap. https://electrek.co/2019/06/25/lightyear-one-solar-electric-car-range/", "andreslyoficial": "😂", "nh.shenanigans": "👏💪🏼💪🏼", "alexgornhardt": "A virus is trying to kill humanity and you talk about climate shit ? 😂", "w.j.s.s.1983": "Hooo I found you.Where are you now talk about covid-19???", "earthx.ai.zilliontreecampaign": "School strike... ??? It’s closed everywhere.. locked in.. 😉", "batcountry4444": "Coronavirus has done more for the environment than you ever will😂😂😂", "coronavirus.i.will.find.you": "I WILL FIND YOu", "eugilvan_rocha": "I Love you", "shivamqz": "Corona virus did more for environment than Greta !", "leo_fb35": "Corona virus helps nature more than you, george soros puppet🤷‍♂️", "imnt.sad": "@naufalcrisandie_ calon politikus, ngefollow nya ginian", "thatblackf150_": "the corona virus is helping to reduce pollution more than you have. a disease is better than you at the one thing that you do.", "olle3345": "Vvjc", "rafaelssmo": "Cadê você falando que a China acabou com seus sonhos ? Era só por causa da Amazônia ? 🤔🤮", "michael_manchester": "SOMEBODY GET HER OUTTA HERE!!!!", "pablo.de.vinatea": "🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️", "carvalo69": "Go fuck youre self bitch", "philepevonduckens": "She may fight for climate change but the Corona virus does a much better job at keeping humans in check", "happyturtleskissing": "🙌🙌🙌", "julliana_cappucci": "🤮🤮🤮", "caseydrice": "How do your parents not get in trouble? My kids miss more than 10 days I’d have a court order and fine.", "vishal_92841": "Hii", "eleisonjunior": "Esperando um pronunciamento seu sobre a China 🇨🇳", "manuelviveiros": "Morons", "scooby_snacks_n_memes": "No offense but the corona virus is doing more for the environment then you ever did", "osvaldodurez": "Where are you Greta Thunberg? don't let the coronavirus steal your dreams 😂😂😂😂", "alinecampos2810": "@gretathunberg Cadê toda braveza nesse momento? Gosta de atacar o Brasil nem oportunista.", "ryan_evangelist": "Pirralha 😂", "martina.arigoni": "Do you always use the same sign or what ?", "ivankopati4": "Ты это, нахуй иди дура блять", "carlos.rocchi": "E ai ... vai ficar caladinha sobre o COVID 19 ? Oportunista do cacete.", "carlosotoca": "Yo también voy a hacer huelga en mi trabajo.... a ver si tengo la misma suerte que tú", "omaroselimo": "What could not be done by protest, plea, begging or nagging is achieved with a microscopic organism God heard your prayers @gretathunberg #climatechange #covid_19 the earth's human lysol #schoolstrike4climate #theearthstrikesback cars stop running parks and beaches and mountains get to rest and take a break from us. We had to be #quarantine so the #earth could rest.", "annie_l._mercer": "Thank you for your dedication. This pandemic shines a light on the climate issues. I only hope we listen.", "mustafa.hamsaunie.1": "Idiot", "aeedrawings": "Sorry I don’t speak Italian", "linea.e.larsen": "♥️👏", "lxtz._": "What exactly did you accomplish again?", "its_paulw": "No one takes this girl seriously", "dylanbebbspamm": "Don’t know if you’ve noticed but Covid-19 is kinda the reason why the planet is healing tremendously", "giacobar2003": "You are just crazy", "99savayy": "Stfu", "anticoronavirus1m": "Hi, im the anticoronavirus. Hel me getting 1 M followers for the world, help me save the world sharing and following my account.💉❌🦠", "cris_perim_": "Cadê a salvadora do planeta? Essa epidemia não rouba seus sonhos filhinha?", "reportedcomet7": "How are you supposed to strike without going within 6ft of people and spending the virus? #libtards #coronamemes #coronavirusmemes😂😂😂", "fabsi.schmid": "Covid-19 has done more than you have done so far.", "bluestatetrumper": "Corona virus has done more for the climate then your fake school strike that no one even cares about.", "helalboy44": "Thank you for Corona 😷😉", "luke_campion78": "I thought I schooled you already girl you ain't about this street life gomie we gon go for bangs so", "dag_ovchina": "@phyto_chemic 👍", "emersonkabeleira": "Cadê vc GRETA 🇧🇷 agora com esse corona viros 🇧🇷🇧🇷😷☠☠☠", "laura.roth123": "Now it's coronawar", "williamsaval.97": "Tá daí aonde está essa piralha agora? Tá desfrutando da sua fortuna enquanto o mundo morre", "tiago.marquess": "Falar mal da Amazônia é fácil, fala mal da China agora, quanta falsidade", "yosoyhelin": "@fridaysforfuture.kurdistan", "ale_araya.s": "Esto no sirve de ni picha, chamaca pura mierda vaya comase un boli helado con caca", "alex_cutillo04": "c sta u coronaaa fraaa @domenico_ciccariello", "rgoeman": "Hi Greta, my belief is that Planet Earth is taking already \"revenge\" on the Humanity that is mistreating it. Climate is part of it. But that this pandemic doesn't stop you to continue your actions. Stay safe Greta..", "y.maxii": "🤮🤮🤮🤮", "claudiograzevedfalcao": "#livetrump 🇺🇸🇺🇸🇺🇸🇺🇸", "appalachiadreaming": "🙌", "mariasundborg": "❤️❤️❤️", "girin_fx": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "verkanicevska": "Diktiga Greta!du e best.❤️👏👏👏😍", "supersoniclevel_": "Ok bitch", "yungcuate": "Have you fixed climate change yet? Corona virus did more smh", "daniel_rodriguez_188": "When a virus wins you at climate change war 😂", "nico_b1995": "Haha Fanny : forced People to take pictures with phones, which are at the opposite of « environnement friendly ». I must admit : very clever 😂😂", "upxmxnyu": "Corona", "willonn1": "Knappt ett planjävel i luften ändå strejkar man", "willzt": "Pndja", "heltonselhorst": "Procura-se: greta 🤣🤣🤣", "jeffersondavila_": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "accatton": "fuck you go study", "m_a_r_t_i_n__z": "Jdi s tím už do zadele♥️♥️", "jjmalone01": "Climate strike online! You do know using your phone, streaming Netflix etc all cause problems for climate. You force kids to strike from school, now we have the Corona Virus stopping kids go school. We'll done ruining kids futures yourself hey. Idiot. Do things responsibly and properly. Your just a deluded exploited kid. Causing more damage to climate with protests. Protesting is OK, but let's face it you'll never be happy even if we went back a thousand years in a time machine.", "josh.garcia19": "YOUR A CLOWN", "agri.dog.weld": "Climate change is fake", "tiagosarga": "Vai la na china... e reclama do Covid 19. 🤣🤣", "__madelynbaines": "shut the fuck up climate is fake and play with barbies bitch", "limping.nut": "TRUMP 2020", "renanfracaro": "Eu greta, fala algo sobre o corona virus!!", "auroragiverney15": "No need to strike from school. They are mainly all shut! I think you need to be promoting for people to stay in and stop thinking like this virus isn’t extremely bad rather than school strikes!!!", "hypershame": "Corvid19 is the earths way of striking", "blayne.101": "You’re irrelevant", "josepibass": "I'd rather have coronavirus than listen to you", "graemealejandro": "@gretathunberg - Now is not the time to put your energy into this. Use your fame to encourage people to stay indoors, respect governments and whatever else", "stefanolunardellii": "Alà scema fa sito", "robberto_and_milena_atzori": "Dear Greta.. My friend @fa_arra said to go to Africa.. Thank you", "m6uric3": "🙌🏽🙌🏽", "phael_nargui": "A Suécia fechou as escolas? 😂😂😂 Tu não serve pra nada.", "joiv_joel_eck_": "Zur Friday Future kannst du eh nicht mehr gehen du dummes Ding", "phedra_gm": "👏👏👍👌🌺", "shadow_hunter_445": "The coronavirus is doing more for the environment then you have ever done and ever will do", "e_l.o_d.i_e": "Pupuce", "amymegahertz": "Greta tell governments not to bail out airlines, hotels, or cruise ship companies but to use the infrastructure and money to get everyone internet and devices and focus on mass transit.", "mimiii_mimiii_": "@cyberink_waui", "eugesanntana": "Menina acorda! Que mané clima!? A gente tá vivendo uma pandemia! Ninguém pagou pra vc pra falar disso não!??? Ah tá! Entendi...", "gabyciolini": "and hard to believe, but I know you and the Antichrist", "nandesblack": "Go to the tv nd do it some show", "dremergencyroom": "Thunfisch", "s_makhsatullaev": "Грета канжик уйингда утир кисиб", "rastawitdigrabba": "bro we dying and this kid wanna stop the damn sun from shining", "wotan_2504": "🤢", "lala.anthonyy": "Does she know that she only has followers because of the memes", "crisrodrigueso9": "Heloooo, Darling! You haven't said anything about the corona virus so far, why? Why didn't you blame CHINA? Why did you not campaign against the Chinese government? Did you worry so much about the fire in the Amazonia and now you won't worry about the virus?", "berglundtorbjorn": "fint", "homeedteenblog": "God will \"bring to ruin those ruining the earth.\" Revelation 11:18", "punkrockman_": "Good work Greta", "annesofieegnell": "👏", "talksserious": "Hey guys. Sorry if you hate self promo but can you please check out my feed and help me grow. Thank you very much ♥️", "maya.cello5": "Swipe left before y'all comment oH BUT CORONA thx", "stoicmicky": "I bet it was you and your dirty Chinese Communist friends that spread this around the world", "manelforking": "You should get of your phone because it has lithium batteries and they are destroying ecosystems", "juniiormartins1984": "Por que Greta não ataca o governo Chinês ? 💩", "pile_drive_theory": "Yeah , they're all on strike now. But keep the act up, while the countries you hate figure it out , rich girl.", "conservative_crip": "I think you should come up with a new slogan for your poster it’s getting kind of old. Maybe you could make one that says “Don’t get into a logical argument with me because I won’t be able to respond to your argument!”", "bendouzz": "@karimdahir", "lil_doggo77": "Corona did more than you", "jxmcguinness18": "Looks like the Coronavirus is more eco friendly than you", "sil1via2adri3ana4": "👏l👏👏l❤️", "xxaliciaelif": "❤️", "melikaramelidou": "Greta since everybody is in quarantine call for a full strike online, not just a school strike !!! ❤️", "krikters091": "Covid19 did more for the environment than you", "mouhamad.br.sy": "@gretathunberg Won't you charge the UN a retaliation against China for infecting humanity with COVID-19?", "leo_kubota": "Hope you don’t need to sell your boat for food.", "isabelmedeiroscabral": "@gretathunberg o mundo aguarda ansiosamente sua reunião com @ximjin", "daniel_arce_martinez": "🙌👏👏👏👏🌏🌎🌎🌳🍃🍃☁️🙌🙌❣️🌍", "cashtreams": "Let's fight this together!!! 🙌🙌", "dylan_archer_xd": "What are you going to do now that schools have closed?", "laloba__red": "Oh go away!!!", "marca_peixe": "Would you like to save the planet? What are your actions about covid 19 ? What are you doing? Why dont you make a public speech about it?? Cause you are FAKE 👎🏼👎🏼👎🏼👎🏼", "etamagnusson": "Det är som om jorden skickat in oss i våra rum för att vi ska tänka över vad vi har gjort. /Corona", "llukiccc": "H*** @txm1114", "jaybailey160": "Carbon emissions have gone down by 80% because of the virus. So, no one cares about emissions Rn. Also, we have people’s health to worry about.", "instajuodulyte": "Stop this finally. Polipropilene mask help save people. Long live plastic!", "francesco_giraldi": "Sa zoccola", "izaquemagalhaes": "A china destruiu o sonho do planeta todo , seus sonhos, ou você só sonhava com Amazônia?", "bambamwilly": "Corona virus is helping the climate 🤪👍🙏", "crowffeine": "Now we're all striking for climate! 😂 You did it!", "andrewbates_16": "Global warming isn’t real🏳️‍🌈", "art.of.akt": "You know why we have corona? shut up your face for all time!!!!!!!!!!!", "econewz": "Follow us for news on climate change!!! 💚♻️", "jlnl22": "Chingas a tu madre vividora!!!", "josh_mcnugget": "Shut up you dumb whore", "amin_bejaoui_7": "Sei dawn e hai una faccia da ano", "__.ancan.__": "Í AM proud of u great😂", "m.levada_bjj": "Comunista de Merda,grita agora contra o governo chinês em forma de protesto como gritou se dirigindo ao governo brasileiro quanto a amazônia.", "bigvicz1": "The #ChinaVirus did more for the environment than #gretathunberg", "portu_goal": "You should campaign against, wars, poverty, child abuse, domestic abuse the innocent ones that are afflicted by the opression of greed and help with fighting diseases and world hunger. Instead of telling people what they should eat. That would make a bigger difference.", "_joaomotovlog": "Tá fazendo o que na luta contra o corona Vírus, dona @gretathunberg ???", "cavanleemedlock": "Hey Greta", "bene.105": "Are you sad because the virus did More for climate then you??? It‘s so funny that you think you can change the climate with your tears when you speech in front of famous people.... you‘re so dumm as fuck!!! BITCH", "onishigraciedubai": "Hey Greta! Where are you talking about coronavírus? 🤷🏻‍♂️ Talk about Brazil is easy, talk about China now stubborn girl.", "diasjurandir": "@gretathunberg 🤮🤮🤮🤮🤮🤮", "1776__sons_of_liberty": "Why are politicians that push climate alarmism buying land on the coast? 🧐", "thereadalongfamily": "How does a homeschool family with a loose schedule strike? See, the lesson plan for the day would be the strike...", "sserega18": "Чмо", "markelpi_": "With asperger's", "sofia_ilardi": "Fuck you", "lauradiaz5479": "☀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🌻🌻🌻🌻🌈🌈", "sofie_persson34": "Nu är du glad va? När flygbolagen, resebolag etc går i konkurs.", "ronalyollero": "Hi @gretathunberg have you ever look at the sky these past few days? It seems to be clearer than before. I am wondering how huge the effect of this wide community quarantine and or lockdown around the globe. But it seems the earth is really taking a break. I support you always, keep on going. -R All the way from PH 🇵🇭 ❤", "cesarucomp": "It is a pity that they have not listened to you and more so that it is the only way but at least that this time of less contamination serves so that they realize the change. Greetings.", "elena_tsoukas": "Lisbon", "bandanabones": "Why don't you shut you retarded yap, get shit faced drunk and make another fetal alcohol child like your slutty mom did?", "aaronmarz": "Wash your hands you guys 🧼", "_.r.phillips_": "We ain’t got school though", "lxrx_xoxo": "Junge geh mal in die Schule lern mal was alter", "centerpartisten_fp": "HOW DARE U", "piotr.urbanowski": "All the world is on the strike with you, Greta. Even more than you expected.", "soggy_biscuit.mp5": "When a disease does more for the climate then you", "chico.babyxo": "How is climate looking now that most factories have stopped and people are staying inside", "sabineschulze50": "Die soll lieber dazu aufrufen, damit die jungen Leute keine Partys feiern, sich nicht zusammen tun, Abstand halten, sich an festgelegte Regeln halten, helfen bei der Versorgung älterer Leute (Einkaufen), Tiere versorgen.... Da täte sie weit besser dran!!!", "darlingchocco": "Since flying and travel have been minimized can we get some figures on our carbon output? I’d want to know if we’ve improved even a little.", "hyde_enterprise": "This robot is a waste", "jumpingmpjopa": "coronavirus", "rjminas": "If you think about it coronavirus benefited more the environment than she did", "wisney_bjj": "Estamos esperando seu protesto contra a China por espalhar doença pelo mundo,."}