{"alena_datsko": "Как же вы задолбали этим равенством! Когда начинается равенство, тогда теряется уважение как к женщине. Мужчины перестают ценить женщину как хранительницу семейного очага и воспринимают ее как равного себе мужика! Ну уж раз равенство, то подраться можно на кулаках.... Равенство же! Почему же женщины возмущаются от побоев? Они же равные соперники... Могла бы и сдачи дать. Вы путаете много понятий! Дать женщинам профессию на которой раньше работали только мужчины? Ну может не спроста это так было? Или бабы уголь бегом пойдут добывать в шахтах? Да есть свои проблемы в обществах, свои устои, традиции. Зачем из - за кучки феминисток все менять? Поменяв это - мы теряем семейные ценности! Люди уже семью ни во что не ставят. Так давайте же полностью уничтожим институт семьи! Останутся только лесбиянки, геи и феминистки. Да.... Это определенно тот мир, которого мы добиваемся.", "moicanno": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "zikicboris": "Far from equal from man??? Bitch sit yo ass down", "stefko_kincl": "Co je ty svině", "mmi1ica": "how a young girl can become so powerful.. Iluminati.. 🤢🤮", "lesjoyauxdevictoria": "❤️", "federicabambaci__": "❤❤❤❤❤❤", "lucas.sanchezof": "Bajale al faso", "techn0cringe": "Who is putting this propaganda in your chickpea brain? How much do you really know about this being 16 years on this Planet.", "soccer_of_news": "🤖", "yilmaaazsaygi": "🔥🔥🔥", "evertonmecanic": "Braba", "jemoedervriend004": "She said: 🟨", "bianca.pigozzi": "qua ha le trecce🔥 @anttonno__", "harry_son___": "stfu", "senpaiofallmemes": "Roblox", "alboqx": "Why are your pupils so big??? 👽", "aguss_leoon": "I love you 💖", "lucy._.isabella": "big head hehe", "llkeeg": "Lmfao how are men and women not equal?", "andinstagram": "@mulander @schofiao det var det här jag pratade om i lördags, men inte kunde sätta ord på!", "benjamin_beech": "Feminism is a lie. We already have equal rights. Statistics show that men are more outgoing in the workplace, as the ask for more raises and put in greater hours. Statistics dont lie. And honestly, I respect women and I would a whole lot more is you stopped shoving feminism into my face.", "polimeros._prasoulis": "B*tch yo head is more square than my bmx's rims after i tried to jump a 7 stair. Get yo ass back to school", "colin_jenkins__": "Fuck this shit she ain't even a women she a kid", "streladantas": "#fuckgreta", "patrys_92": "@dennis.zy aus gegebenem Anlass 😁👌", "albertto.mdzz": "aféitate", "annaxeng_03": "💩", "aleenakeepa2": "I would punch ur stupid ass", "axel_lubbe": "Wir sollen alle \"Zuhause\" bleiben!? Warum bin ich dann jetzt nicht bei dir...!? ^^", "mule.line": "👏", "mohsen.sohrabian": "💚", "jeniksmerdik": "Lies, lies and lies like everything you ever said @gretathunberg", "maquina_praveen": "Your are not a women you are still a child girl. Don't skip school 😂😂", "ab_mirzaye": "🖕", "x.a.n.d.e.r____": "Bacc to da kitchen", "instawillians": "🤢🤢🤮🤮", "theyoursuspense": "Grecha Thuborg", "julian_w204": "Die gehört Weck gesperrt, sie macht nur scheisse 🤬", "firestarvalkyrie": "Wrong. Women and men are really close to equal, if not are equal in today's society. Feminists don't care and want to oppress men", "viktormorzhov4279": "Guten tag... Greta. I am dont like inglish. So... когда будут жрать твою мать и отца ты скажешь так и должно быть? Или ты поборешься? Болячки в твоей голове, к сожалению, от природы, а не от Б~Га. Живи свой день, пока не попадешь в ад (белую комнату)", "maks_rmn": "Ебало как в майнкрафте", "miafrancalacci": "@ka_luna_mc @arlethygomess", "iona_art_shop": "Great job girl 🙌💜💙🙌💜💙 Italy loves you 👏👏👏👏 how are u Greta? Thanks to be brave!! Forgive the haters, keep on rockin for a better world 👏👏💙💙💙 kisses from @iona_art_digital Milano", "bahram.1372.m": "💩💩💩💩💩💩💩💩💩💩", "hayden.828": "you didn't even finish school and you literly have autism, so even if women dont have equal rights, greta Thunberg personally has more rights than any man ive ever met and that is facts", "illia.nora": "Грета нюхала ромашки и упала ртом в какашки", "hanasazi": "Such poise and determination! I admire your strength and pray for a successful mission. Good for you putting the adults of this world to shame.", "onurfysl": "♿", "saeid.6395": "U so deserve to b a meme it's like u asking for it man 🤣", "mary_rocknroll": "🙌🔥", "cherryblossomsparadise": "ok darling", "sektenkult123": "Ugly. Get out of the publicity", "isidora.illesca": "You are right Greta we don't need celebrations or congratulations we need equality now", "sweetieselenagomez": "👏👏", "mozzi_swim": "And so tell me, what do you mean by ‘Global South’?", "tammyfromtaos": "You are amazing love from New Mexico USA", "braithmahr": "“StIlL fAr FrOm EqUaL tO mEn” ok bitch I could give a million essays of examples on how false that statement is. Mind giving me examples of where it isn’t equal? Also, as one example, which gender is always let off the hook or dealt with much less severe than the other when it comes to criminal offence? Hmmm yeah I wonder bitch", "hanno_hej": "Steve", "vevans.veez": "You Greta!!!!", "bayemalicksene": "De tout coeur Chére Excellence Mademoiselle Greta pour l'admirable trés magnifique publication ! Trés bonne journée internationale de la femme , et aussi , à toutes les autres femmes à travers le monde ! Elles sont plus que la moitié , et de la société , et de la vie tout court ! Qui éduque une fille (femme) éduque une société ; et qui éduque un garçon (homme) , éduque seulement un homme ! Leurs responsabilités dans la famille sont sans communes mesures ! La premiére école pour l'enfant dans sa vie est la Mére (femme ) ! Nous vous soutenons et vous encourageons et vous souhaitons bonne chance pour plein succé et réussite Chére honorable Mademoiselle Thunberg ! Et surtout , il faut en parler les disparités ( la pauvreté et les inégalités sociales ) ; c'est même nécessaire d'en parler , quand elles fond souffrir le monde ......!!! Le changement climatique et la dégradation progressive de l'environnement : leurs conséquences Chez les plus pauvres , surtout dans les pays sous-developpés !!! Beaucoup , beaucoup d'estime , de considération , et de respect Mademoiselle , énormément d'amour , et d'affection , et d'amitié , de tout coeur ! 💟💟💟💖💖💖🌱🌱🌳🌳🌹🌼🏁🍧🍹🎀🍻☔👍👍👍✋✊👊👊👊👊🎍", "naomijinjd": "U lair, how dare u! Ur heart just as ugly as u look like.🐍", "ludihau525": "Sweet girl on a nice photo", "misha_kostromenko": "🤢🤢🤢🤢", "memofootball01": "U are a joke", "blissfulbrynne": "Everyone laughs at you!!!!! Stop it and go play on your bike 😹😹", "aydind724": "Do flips on your tricycle little girl", "ethan_m66": "So much cap honestly", "ptrsn_given": "✊✊✊💞", "camilaarielefernandes": "Gestão ambiental", "ridtjejen._": "❤️👏 Du är så bra!", "giannhs_kyrimis": "Yes it pretty logical that in an immense catastrophe because of climate woman will suffer more because of their rights... As we know a fire for example because of climate change will burn only woman because they \"don't have equal rights with man\"... Funny though", "carspotter089": "ASSHOLE SUCK MY DIG😡😡", "graphic_patric": "🖤💫", "_mart1n_okk": "Jdi do pici nikoho nezajímas", "pasqualebalsamophotographer": "Wow 📸", "huseyine20": "You have two faces !", "tssa_demartino": "you,re so gute you are my everything", "anciisoo_33.klk": "Why tf u talk about climate in international womens day??? \"I'm sorry but it doesn't make sense\"", "aalexgzl": "Shut up you puppet", "j.petersen57": "Get back in the kitchen and make me a sandwich, women!", "anja.dtr": "You know NOTHING. I have seen your interviews and you are incapable to answer questions of which you don't have an already prepared written answer!", "emilyhollliday": "women are not oppressed", "miami_devil_x": "Who gave my dishwasher an instagram account?", "lil_simp_destroyer": "Go back to school", "gareth_b_": "🐷🐷🐷🐷", "bethaniepenna": "❤️", "simplotus1": "Poopy doop sloop droop retards", "ellen_longman": "Thank you for everything you do!!", "maya._dzm": "@zainab_jjaa die pupillen?", "zach_boe": "Equal rights =Equal responsibility", "zheka.amon": "Тупая", "michaelr.me": "Queen", "koshernaya_555": "Говори за себя - не надо говорить про все не Мы а ты !!!", "spencerjohnson83": "No u dont girls have tons of opportunities like u can be In the army votr and everything so that's bull stop playing victim", "nazaraliazizov1234": "💚💛💚🎂👍💍", "maxstn_": "Please give me one single right that women in the USA or Europe doesnt have but men do.", "wizzdaboss": "Fuck u", "zammsacone": "The Black Madonna is exactly right", "dr.mundo707": "forget the Humans they will never change their stupid life 🤣🤙🏾if we take all their money and we burn it down maybe this will change if god exist he will kill us all we are his biggest failure", "byvaet1": "Whahahhah", "gualtierialfons": "🎉🎉🎉🎉🎉🎉", "barakatyounis": "let's guess Dr @gretathunberg is thinking about the future of the earth .. 👌👌", "lucaswendtt": "environmental katniss", "theworldisyours.28": "Марионетка масонов", "xechox1": "EGGY PERSON", "ibudzin17": "😂", "sarahlleeeee": "Is she on drugs.?? Her eyes bruh.....", "fatboyfleek82": "Oh you ugly ugly", "alexis_gd2001": "Go to the school", "vultabrite": "🤤🤤", "ros.kosh": "Чё с лицом? Мать жива?", "dodgelover7264": "Women can't drive properly so get off the road all of you women and leave the Toyota's and Nissan's to the job of driving", "caitlinlynch._": "@retrograded.souls", "_de_1893": "Bitch🤬", "garrett_jenkins235": "You’re so ugly", "alia_bouamar": "HOW DARE U!!", "izabella_modelling": "❤️❤️", "kristian_nordnes": "@jonaswang5 du e svenske du skal liksom kjøra epa...", "pheonixfyre4711": "Thank for a beautiful and empowering message! ❤️❤️❤️❤️❤️❤️❤️❤️", "iamkakenamir": "Malsyngo", "20placebo20": "What does fixing the climate have to do with your gender and equal rights?", "sabinecanadas": "Very nice pic!", "david_vh17": "Hermosaa😍🥰😈🔥😉", "cali_venom91": "🤮🖕🤡", "peterbrito901": "Kd vc ta sumida?kkkkkkkk", "sebastar.official": "Ich bin eigentlich nur hier um sie auszulachen......wer noch ._.", "begreen.it": "Follow @begreen.it 🍃☘️🌿💚 #followforfollow", "v_ivan_p": "@gretathunberg shut up kid go back to online classes on zoom u little 12 year old kid", "pigstysky": "shut up bitch", "attractionnaction": "https://video.wixstatic.com/video/a0a13b_ceedf4dd3f7d47fabd5b71fe632cb933/240p/mp4/file.mp4", "dya1n.xtra": "make me a fucking sandwich @albino_gorilla_1", "xmichhy": "I like it when women actually think they have rights", "marilynmoonofficial": "Love you 💛💕✨", "andrezimleal": "Pirrlha da cabeca de cearense", "uffleckbat": "bu surat ne henry cavile benzemişsin aq @henrycavill", "brzozaja": "@chylciax nie wiedziałem że jesteś taka sławna 🔥💎", "dontbewithoutgod": "Go Girl ✌🏻💪🏻Proud", "reed_douglass": "Hate this bitch", "ronaldo.fonseca.146": "👏👏👏👏👏👏 guerreira parabèns pelo seu trabalho", "alekschepurnov": "Gretta are you satisfied? Airplanes do not fly. Trains do not ride. Everyone is sitting at home. Did you want that?", "alyona_kolesnikova_1": "кто вообще смотрит на твои забастовки,всем всё ровно делаей что", "tt.marlon": "@jacob_b_the_real Das foto ist echt nicht schlecht", "romeo._.ceballos": "U look like a fucking guy or rat", "__steeg__": "Bruh you look like Ben Shapiro", "yuliya161092": "Отвратительная 🤮", "rileysmekens": "Plz no your lies are corrupting the truth", "erik_koller_83": "@gretathunberg STUPID girl", "gugaamazonia": "Com esse rosto já dá pra fazer um filme de terror!", "cassidyschaefer29": "I am a woman and I am 100% equal to the men in my life. You need to specify, lots of women in developed countries feel equal, it is women in less developed countries that don’t have many rights.", "caiomoraess1401": "@carolgalhardo_ person of the year", "georgina8333": "Hermosa 👏👏👏👏👏", "aniomarova86062": "Ужасное лицо..... Псевдо", "lasonjbeld": "Ok dishwasher why u got instagram", "mynameisjanniklol": "You aren't a women. You are a child. You are 17 and you look like 10 haha", "iron_champions_family": "@buny_adventure.original", "ight._.fam": "This Minecraft skin looking fyeee no cap", "alexa_lio_15": "How can someone be soo ugly", "crazymonkeydeathtrap": "Damn you’re ugly as f @gretathunberg", "gearr.uk": "Call me a radical, but thw virus is doing so nuch more than the protests.", "_.mystxry._": "you are such a strong person. i mean im only a 2 years younger than you and i dont think id have the courage to talk to millions of people about this. we need more people like you. more younger people because the others will start to listen.", "doncolinoo": "You are a kid , Not a Woman .. LOL", "greg_mcgonagill": "Thank you, Greta.", "samy_s_life": "Pliss dont be soooo ugly🤮💩", "melina.mclk": "Iou", "chauhan_ved007": "Ghanta inspire Tere age se Jada toh Mai trees laga diye hai ....bakwas karti hai bass aur kuch nahi propaganda Chala rakha hai naumni", "christo_aus_deutschlaand": "🦷🦷🦷🦷🦷🦷🦷🦷🦷", "juni_bagenholm": "Du är sssååå cool!!", "tyessia14": "Keep it up ✊✊✊✊✊", "ivajra": "💚💚💚💚", "3mmeseb_der_v": "🤢🤢🤢🤢", "tm2929": "Ugly", "_bojan__4": "It is okey to be a White cis male.", "realsk20": "@kharrii1 add her to the family?", "junior_almeida1999": "Cara do mal", "i.filipp": "Дейви Джонс", "beatrizvoni": "#f4f", "cystilll": "power for the women. power for the women. tytytytytytyrytyttytyty", "amandapapadakis": "http://chng.it/6SKH2ttNDr please go to my page and sign the NO 5G", "bikini.oftheworld": "Crazy", "sex_and_sushi": "выходи за меня ❤️", "pprincess_peachh": "@willne", "hannahhbeatrice": "yaaaas", "_xi.63_": "You need a 🍌 in your puss....", "theeternalpantry": "♥️♥️🦋♥️♥️", "arasofsky": "Women are not equal to men, women are different than men, so are men", "har_ryprivate": "She got a @willne head 😂😂", "sarayllera_12": "Cuando te gusta un teen y te enteras q tiene novia @andrea_sobrino9", "its_just_lilyy": "Du bist so inspirierend", "usman_u_kay": "So this is Nature's care taking.. Just by posting selfies on social media.... 😂😂😂😂 ..", "_gkatsioudis_": "Steve?", "lucasdelicata": "Shut up. Not true at all. Women have many rights these days and to be honest with the bad history, take advantage of this claim. Yes in some countries it is still far off, especially in the middle-east. But this statement as a whole isn’t true", "teammavericksc": "You got enough equal rights to chat bullshit from a script on stage and get praised how much more rights ya want", "patclo8": "Troia sei contenta adesso?", "joel.andersson05": "What have you taken now 👁👁", "aydnsinem16": "😂😂😂😂😂😂😂😂", "centaureadepressa": "ok steve from minecraft", "tony_time_ufc": "🤢", "novermandoverman": "Minecraft steve", "rmyskaraosman": "kız aynı elbezi handana benziyo 😂 @mihribankaraosman1", "__.berik.__": "Используйте мой комментарий как дизлайк", "blackharty": "Not big fan of coal consumer🔥", "kenny_w48_": "Hippity hoppedy women are property", "joshthiedeofficial": "“Far from equal”??? Says the 17 year old, FEMALE climate activist that doesn’t go to school and has millions of followers. GIVE. ME. A. BREAK!!! 😂", "nadeghda__burlin_ignatenko_37": "🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬🐬😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😭😭😭😭😭😭😭❤️❤️❤️❤️❤️❤️❤️ @freerussianwhales", "connorball2091": "Wemen are the best", "mamalanda_i": "Рожа великой наёбщицы", "cjjcrx": "Вот это у тебя зрачки расширены", "__hz.ali__": "Steve", "_b_e_n_j_a_m_i_n_07": "women already have more rights than men in most countries except Africa asia maby a little bit but women are destroying society if they get the power look at merkel Germany has so many immigration problems women beat up by immigrants all because of women so men have to fix everything again ....", "soloveckis": "Because women are not so smart, it’s simple )", "arronmoffat_": "@jamesmckay02", "juandarklel": "🤮", "chann_boparai13": "U look like a Mona lisa painting by leonardo da vinci...", "matthew_sundeen": "This is bullshit how do u apply woman’s rights to climate change and btw women already have equal rights", "guylaine.rivest": "Love from 🇨🇦 God bless you !", "anonymous_a.k.47": "Ugly bitch!", "crissbernardes": "Where are you Greta ???? China killing everybody dreams and you are silent ???? Wake up girl 🌏🌏🌏🌏🌏🌏🌏🌏🌏🌏🌏", "undercover__fbi": "Damn this Minecraft update makes the graphics super releastic", "bennettw2": "You would delete my comment commie", "leandrobispotio": "@gretathunberg your os beautiful ❤️❤️❤️❤️👏👏👏😍", "cordaro_r": "Go make me a sandwich", "lysovvolodia": "Привет Сколько тебе лет Как у тебя дела Как здоровье", "john8verse12": "Today no one can say that another persons culture is wrong. Society should not determine morality. If so then when I ask \"Is it okay to kill a baby?\" In America I would hear \"That depends.\" Instead of, \"Life is precious and not a disposable article to be discarded.\" Colleges do not promote life as precious, least of all babies. They callously berate them as \"parasites\" instead of human beings. Many of my university professors have sounded their agreement which suchlike statements. Girls are in the womb if this may aid in perking the ears of the near deaf consciences.", "ake_mackin": "Who took this girl out of her natural habitat? The kitchen of course 😂😂😂😂", "diyar_kartal1": "Oçç", "1189andresp": "a facist exological murderer", "adiajgies": "Beautiful", "cooperis.typing": "u look so high 😂", "mariepatrice3": "Une tête à faire peur aux petits enfants. Svp reste chez toi.", "s.afaae": "She always looks so familiar to me! She looks a lot like Benny from my babysitters a vampire!!!!!!", "yyung_zz": "Kache", "saretta1306_": "eeeeee ma come siamo seri", "nicolassdoval": "❤️❤️❤️❤️❤️❤️", "karassf": "Ты че, дура? Ты что несешь? 🙉🙉🙉", "_den4ik._.slazaet_": "Ой шлююха", "w.026.020": "Asperger it is", "_danilkoo_": "Шоб тебя коронавирус уебал", "jonas28.02": "You look like michaelsoft with binbows", "alissa.rs10": "She looks like Steve", "jiza150": "IDIOTKA UND KRIPL UND TROLL", "genderneutralbeauty": "Please don’t come to Australia. We don’t need you here!", "garydhaliwal13": "13 or 35 at same time . how dare are you", "ina_green_v": "❤️❤️❤️❤️❤️❤️❤️🙌", "alvarooalcarriaa": "🤮🤮", "jaxie_2018": "Best wishes to you always", "farhan__khan19": "Minecraft face", "kizaxa": "shut the fuck up", "haiwbkdbwoxsb": "@prv._.rosalia model 💗😍", "prv._.rosalia": "@_official._.svenja model 💗", "arielabruno": "@gonzagilli sos vos? ah re jajjaj sos igual amigo ❤️", "jiamin_0405": "How dare you", "lethal_dancer": "Tu das weg!👿🤢", "ww7777qqq": "Ахахвхаха, наркоманка", "pat_roman_riot": "The next Adolf", "joshmac16_": "If u want equal rights join the fucking infantry and do all the frontline fighting let’s see if u really wanna have equal rights then", "yeetskeleto": "When I see this face remember I haven't thrown the trash out.", "dallapriaofficial": "Everyone thinks they have... 😂😂😂😂😂😂😂😂😂", "ben.richens": "What a square head", "cheese.doodles.se": "Marry me rebecka", "gilbertcoats": "Generally, men care about women and children as their assets. Women care for children. The climate crisis is inextricably entwined with gender inequality and injustice because men only worry about their assets. Not surprising that the children's revolution is mostly females. Greta, you've nailed it!", "seal400": "🌿🌿🌿💎🌿🌿🌿", "freetobewi": "Você é linda", "kongegata123": "DEMON ANTICHRIST 3 Gå till helvete fan! Du pratar nonsens, galen! Du är inte längre nyheter! 💩💩💩", "riccimarco.it": "❤️❤️❤️", "davorghini": "You must have some messed up dreams, I think you need to see a therapist", "rickylunlun": "Straight up propaganda", "leoschneider462": "Siehst aus wie ein Eierkopf", "donfrommiami": "Are you inbred or something? Weird looking!", "jefterfalk": "deve estar de quarentena!!!", "forestrydude": "STFU already cunt...", "l.pierpaolo": "Ma dove sei uscita, da un incrocio tra un rombo e un quadrato, guarda che faccia squadrata", "versage.10": "Kisssssd", "_nessx_nessx_": "She have so big Pupills in this Picture, like drugs haha", "leigha.clarke01": "@sarajanedarcy", "reid_minds": "Thank you Greta the great🥰❤️", "human_lazy16": "Men have it just as worse as women", "georgemichaleas07": "je men bas les couilles", "arthur_agviar": "Imponente", "wilfredcurioso": "How does Filipino national champion join your cause?", "upasnakarthik": "Absolutely beautiful! I love your eye colour by the way, it’s so pretty❤️", "gamay7": "🖕🏻", "luvee.n": "How old ist she?", "evannreyna": "women are the majority u idiot", "monikitarpm": "Menina feia", "0b102d2": "Mother earth 🙏", "zanos_7": "Get ur square head outta here", "bl4_.nk": "We really can though", "the_official_.jotarokujo": "Yet girls can hit guys but we can't hit back? lmao i do it anyways. I once knocked the fuck out of a girl.", "kot_maciek_stefan": "@julit._.a how dare you hahahha", "atheistpaganalliance": "Todays's *Saudi society. You are brainwashed, but this is a normal opinion in Sweden", "lennard9032": "What do you do now if the school is clost", "hernan7_mxt": "Eres feisima cabeza rosca", "_.sskitles": "А как туалетку заменить", "kehyarntky": "No disrespect but how are women far from equal to men u can say all u want but this is my opinion because this is soo fucking irritating to me soo many men are in prison right now because a man could touch a women on their shoulder and the women could say the man touched her breast and obviously people would believe the women. same way if a woman said a man raped her another thing i would like to say is i dont think women should be allowed to hit men same thing and men shouldn’t be allowed to hit women because i feel as if women abuse that law ive seen a girl literally attack a boy punching him in the face and he pushed her away she fell and then the boy got in trouble soo maybe you should put yourself in a mans view instead of just assuming that man are bad people dont get mad but this is my opinion", "michael_manchester": "WOMEN CANT DO THINGS THAT MEM CAN DO. MEN ARE THE FAR MORE SUPERIOR BREED. THIS IS FACTS.", "jonnyneedssome": "Bruh moment", "melissabarrbie": "Did somebody say LSD 👁", "bobssan_bobssan": "Ti kakva si malka kurva mrusna. Govorish za neshta ot koito nishto ne razbirash.", "danielgomezk1": "Você é a cara do coronavirus sabia..?", "d.y.l.a.n.n": "❤️", "sorovllecram": "She id alex from minecraft", "aveschuy": "💛💛💛", "sproutsofshawn": "#futureleader", "davidferrari88": "Só fala merda 🤮🤮", "matthewmcdonald02": "It’s funny bc national women’s day wasn’t even a full day", "kbartawi": "😂 STFU", "steviemorgan30": "Ur full of shit, not because ur a female, ur just full of shit", "elizaveta_sazhina": "🤮🤢", "stoicmicky": "The face of pure evil", "pile_drive_theory": "Damen is a girl.", "lil_froog1": "🤢🖕🏻", "_.und3rsc0re._": "Look at her pupils lmao", "always_augst101": "❤️", "emili_lanz": "@jack_uncino ma ti sembra sospetta🧐🤨😋", "luca_diotallevi": "@james_salerno_ lei ti osserva", "sebi____________________": "She looks like she snored some cocaine 😂", "lehecpec": "I want slap your face", "simararodrigues12": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "lil_bleach_1": "Stupid bitch😂", "abu.hajaaar": "Penis type beat", "dylan.ritz05": "👏", "lifeofsashamel": "Ебанина", "trance_nights": "Beautiful photo 💜💜", "rohan_yadnesh": "@nando.boukzir 😍", "s.xfsh": "Stupid girl 🖕🏻🖕🏻", "im.mishaa": "💪🏻", "patricio_fernandess": "Marionete de feminista....🤢💩", "therealnewtoncondict": "U look like a fucking lizard lmaoooo", "fxck.wxdss": "🤮", "dmddan211": "Stop fussing why women always be co planning about rights like they're imprisoned, you have many abilities men don't have", "volk2332": "маленькая къахба", "gutierresfonseca": "Ae vaca você sumiu, aconteceu algo?", "idolatrekombucha": "💙🌎", "bekindtoyourmother": "Please speak on racial justice also.", "23grizou23": "@___nadja___s", "_molotov_59_": "Бля ебать подсолилась", "reducewastesurrey": "Love your work Greta. Great role model for young girls (and boys) worldwide 💚", "maissa_bny": "@laura.j.esquivel 😍😍😍", "gameboy_coloured": "😁", "nader_sh_33": "Little clown", "n.ortiz5307": "shut the fuck up. You're a burger", "dangore9": "@nichola_lowrie 😬", "m_m_paun": "Thank you for being here 💫", "rj.barrel": "Yoooo can you make me my sandwich woman thank you", "raphaelkern0": "🤢🤮", "mason._.dube": "Sooooooo annoying", "sketchedbymaria": "Beautiful inside and out! ❤️", "lyndenjep": "🤡🤡🤡🤡", "saeid_ny": "Have your clothes made of non-synthetic fibers? Devices that weave your clothes used renewable energy or fossil fuels? @gretathunberg", "lucarvana": "stfu", "emilyandersson8": "you are so inspirational 👏", "chiaracarabelli_": "Mi scavi dentro con quegli occhioni", "h_mendes_2003": "How aren't u equal then 😂😂 u dont want equality at this point u want privilege", "rxtxfxjvob": "Is she after Drugs because her eyes are so big xD", "b4rnett": "How are women ‘far from equal’ to men? A load of nonsense and how do women feel the climate crisis more? @jamie_s_margolin - don’t know whether you believe the shit you’re spouting or you actually have any evidence to support your claims.", "raulsonn": "Shut the fuck up im embarrassed to be ur age", "iamisaxavier": "😍😍😍😍", "kypon_s_ali": "Мафию не играй да", "_xx_sophia_": "You are soooo Beautyful🔥❤️", "13thedreamoftodopibe12": "pendeja klaaa pesa", "urban_trask": "Snusk greta", "localooone": "TRÓ", "ekaterine.png": "The only reason women are not equal is the fact that we keep reminding about it the whole world and instead of acting we keep talking. I have always felt equal and acted equal and even if it is not recognised that way in my country I don't care. There is no long way to go, it comes from every each of us, our daily lives. There are women who manipulate men and act like they are weak but next day they go out in the world and claim men don't make us feel equal. We, women are not equal because most of these women don't do anything about it and just keep talking. Just like you, a person who has some infulence on the society. You keep talking and are another skrewdriver trying to fix something temporarily.", "polinaspringtrap": "Сука", "sara_mauriz": "https://es.m.wikipedia.org/wiki/Erin_Pizzey...", "ilya_privatni29": "Бамбук- это трава, а не дерево", "to_be_prismatic__prismacat": "Was kommt nach dem Wachstum? Post-Wachstums-Ökonomie kann das Klimaproblem und vieles mehr lösen. 🍀🤗", "loyal_matt8": "🤦🏾‍♂️", "american_pride_5967": "Someone hit her with a shovel", "klaura22": "Greta, you are a beautiful, beautiful soul. You have dealt with so much hate and yet you still strive. I believe you are a very special being that was put on this earth to help rise the vibration of the planet, and help us awaken. No matter how much hate is directed towards you, there is still more love and respect for you. Those adults that spread hate are terrified of the unknown. And that's OK. Those of us that know and speak the truth will be there for them when they are ready to understand. Sending lots of love and light from Canada 🇨🇦", "denasker111": "Equal rights means equal obligations. Don't forget it little G when you will be crying out for some change again.", "chri_falcooo": "@aasli.oez soll ich ihre Augen küssen??? 🤭", "hobday_36": "@chunky_lover7", "parketovy_drak": "ši glupa a može maš i vši", "usurerofnations": "Princess Greta Codex Alimentarium?", "_._kritikos_._": "Pussy", "jettrobertson88": "Haha we hate you", "v.perego.185": "Why you look like white trippie redd", "gustavobarbosa1353": "Gustavo's loving embrace !", "binesh.zamani": "اهه از این کثافت متنفرم", "rogierv3": "Bullshit", "5dn31rf_0n_3vah_i": "Make me a sandwich", "heliavinova": "Why is your courier open?", "kol_dem_": "Дура", "_12anonim34_": "Да пошла на хуй в школу, недоразвитая", "pammila727": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻 💚 #gogreta oh wise one 🌞", "tyre.christopher": "HOW DARE YOU", "carlygpark": "❤️❤️", "sergeimakarov01": "Transgender right activist", "mannyhu15": "I would like to see Greta as a villain in Mortal Mombat's next game.", "thepanter10877": "Bruttona", "mistico.valerio": "❤️❤️", "gandhar_naresh_shakuni": "What have you done for the climate as in an action you took for the betterment of the environment?", "viktoriaindy": "👌🏻", "foxy_slime._": "Go to China, hysterics 😂", "yg_redrum": "Go fuck urself u cunt", "sisista": "You are not a woman yet", "arina_bondarchuk": "What a beautiful, powerful, strong, wonderful woman!❤️ love you, Greta. I hope I will be your colleague in the future. I want to help our planet so bad, and my goal is to be a scientist-ecologist. 🇷🇺", "cowboy5871": "👎👎👎👎👎👎👎", "samueldelage": "The best voice for our world. ✨", "edgibbons88": "@tomneely16", "7monzoo1": "A fregar", "kandieblakestad": "Climate change is a hoax boo. Soooo sorry that soros is using you. Justice will be served and you will someday learn how our precious Jesus Christ aka GOD is going to establish his eternal kingdom on this earth. He will never let us destroy it. ♥️♥️♥️", "radionov_bmk": "Иди нахуй", "mariaczzi": "Hatfuu", "colby.orndorf": "This might be the ugliest picture I’ve ever seen 😭", "camoron99": "Maybe we will get lucky and she will get hit by a bus 🚌 🔥", "lunarview": "Bonkers.", "theporterhousepub": "What a load of twaddle 👎", "kroulitsch": "I go here for a daily feminist cringe and I can only recommend 😂", "mangoandrei": "Ba Greta...vezi ca vine tiru’", "oldstyle1973": "Sesi una cugurra @gretathunberg", "sjapjsndnaindna": "🤡🤡🤡🤡", "mlibo.xotyeni": "hero 🦸‍♀️", "matie____": "Amiga eri sueca", "jack_chew_chewie": "Why cant u exept the way life is ok", "carla.louise8028": "Ugly 🤮", "nm_jarek": "That’s right!! Let’s help those women out in Iran Saudi Arabia and Pakistan !!!", "cajup_shehaj": "te qifja ropt te qifja", "jukukool": "Beautiful model and photo for sure!", "sistarelli.scott": "helga thunaberger 😂😂 this kid is so serious about the climate shit but low key spread the covid virus at her prep rally’s for cool weather", "eevenden": "😒😒😒 @hotboyhenny", "wwrphotos": "啥β，初中都没毕业搁这装带善人？how dare you？", "robertmfalcao": "Here in Brazil nobody falls for your speech, fantastic, terrible actress that she is. By using what you know, what climate, you will protest against the violence in your country that causes alarm. Girl who skips class blaming time.", "hannahkimmeister": "You are bringing to us happiness and warmfull joy because you never lie to us", "_._eliteonovaa_._": "Awful", "dashamilosevic": "Point your finger to China little miss, the main polluter.", "andrey_sheckley": "Ох и страшная", "orf_and_hamster": "go to the kitchen if you're not learning", "artataprils": "A modern Mona Lisa! What beauty, inside and out!", "shadow_of_konoha": "Тупая обезьяна", "rhobbs05": "How do you know what women want, when you are not even a woman yourself?? You are a child!!", "deanjohnradcliffe": "I have some durty socks for you to cleen get on it", "viiola1990": "Bullshit! Woman here 😁", "albertopp10": "Gracias a ti quitaron las pajitas de plástico de Mcdonals, asquerosa 🤢 eres alta bruja!! Ojalá alguien se de cuenta del mal que le hiciste a la sociedad", "ar.shadzowx": "I respect women, but I will not respect you", "joesole_": "Pinging you Greta", "campbellberghold": "nine", "joecat6969": "No self confidence is the problem, not men 👍", "danitortoise": "💩", "am7n.1": "Ugly af🤣", "thomas_calatrello": "Good. Shouldn’t be.", "arshadraza972": "Gajiwifdhiieb iishwveuyrdwuiovhifusove", "christiangoddesses": "Will u plz check my Facebook wall I need prayers for ALL people rt now. Its under my real name currently Meghan Schmelz plz and thank Q!!!!!", "artvision.n.nu": "True", "jenniferyellow04": "Iam vegan and i campaigned for climate change online", "musician_piano_player_": "👍 Beautiful", "johninkster": "Shut up you paper straw shagger", "plazadeladignidadchile": "☠️☠️", "abraham.snks": "@r3ymon_4gu1l4r se parece a ximena nava xd", "maayancohenmarc": "Bueatiful human❤️", "garlapatibannu": "Princess of the Earth ❤️😍", "grizzlysgirl0709": "How old are you? Told what to say and do.", "isasim5": "bienfaitrice de notre planete!", "micahkrag3": "You are so retard", "chloeoscar7": "Mind your business little girl, go to the park, cinema or youth club. Leave it for grownup", "elmostiddies": "So many women and girls are disgraceful and devalue the need for rights in the eyes of men.", "mikhail_0911": "I eat meat, wear a leather jacket, ride an old diesel Ford and I don’t give a shit about the environment!", "_ya_zapreshayu_vam_sratb_": "Харя больной аутизмом , иди лечись , девочка", "1979.k.a": "mis Greta on a Kurd from my Cuntry l will always Follow your plans wish you luck\" lm from IRAN👍", "m0ustakas": "Women would be taken more seriously if there werent pieces of shit like you....", "perfecto1327": "Русских комментов нет что ли?", "tsoukalasnikos": "Ψόφος κακός να σε βρει!", "popkingates": "💜💜💜", "gs87.5": "By the way I think women are treated as equal why do you think they aren’t..?", "_blizzy24z_": "Mums ur face jarrs ma", "kevyn_y3": "Der seriöse Boss", "alyta_official": "I'm not a women hater. At all. Women are equal to men. But why one day? This means that women only get one day to themselfs and men the other 364. I don't know this, equality stuff but that isn't equality. And also How is this tied to climate change? some people say it's because most people striking are women. But that's the same saying that most people who die in the army are men. It doesn't say no women die it just says most people dying in war are men. It's just a statistical fact. But, I'm just a dumb 16 Dutch guy. So I should probably shut up. Thanks for reading!", "digital_shit": "💚👏🏻👏🏻", "tsethc": "Kys plz", "frankpelsoczi": "Face of evil!", "njimenezrueda": "😂", "aumtumne2807": "You are an ass", "sohamanjaofficial": "well said I also support in you in global warming I loved your speech at un and I like you a lot", "sergeybogonos215": "Greta, I'm not joking. I am scientist blyat.", "fuckkkuuuuuuu_n199a": "Fuck u", "tegke.xx": "My nigga that's crazy butttt i dont rember asking", "claradenniston": "WOMEN ARE EQUAL WITH MEN WHAT YOU TALKING ABOUT", "chamling_mukti": "She is the future ❤️", "downbeachroad": "Please go to Iran and push your cause. Easy to do so in safe spaces, but let’s see how brave for the cause you really are.", "tsvety_vvaze": "Stupid girl..", "erik_krupar": "🧠🤮💀", "ghamned_mag": "Fotze", "malazanski": "I don't know. Women are not equal to men. They are far more superior and important to humanity. Chivalry, patriarchy is maybe, I say, maybe, the way to protect ten women who can bring to the world ten brand new human beings to the world in exchange for ten useless men? I don't know. Worth pondering upon.", "minkoazuzik_": "Omg 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤮🤮🤮🤮🤮", "endearing_art": "How dare u??", "xinkai_nojytian": "You’re a joke", "jkn_bully": "Shut up with your bullshit", "veefourvandetta": "Women are treated far better than men, stop your bitching", "rainerwinkler5": "🤮🤢", "bxlxnces": "I sick 😷🤮🤮🤮", "namyatoff": "Хуй", "progib_bedrosovich": "Как уебал бы с ноги меж глаз чтоб перестала строить важную! Пизда ебаная", "elin_perssonnn": "Heja dig😍👌🏼⭐️💕", "ayush.tpps": "Go to school 😂", "ricks.ricktorium": "⬛head", "patches53": "It would have been the day before but the women couldn’t get ready in time or decide what to wear.", "cricholic_blood": "How dare you😂", "fuck_face_8.0": "HOw DARe YoU HOw DArE YOu😌", "hujeyou": "Иди домой", "paauwmitchel": "@itsjeboii_jesse", "jacobbrandd_": "What phone do u have cause that is a good picture", "robertcanada777": "Stupid little cunt liar.", "erichritter13": "Du bischt so a wüschte dräckhur🤮🤮", "imaginillyar": "This is everything, \"fundamental equal rights, not congratulations or celebrations\" So true!", "__hanyeh_": "💩💩", "xave_303": "Geh dich umbringen", "anastasis.savvidhs": "Βρε σύρε και γαμησου θα μας πηδηξετε στο τέλος όπως το πάτε", "stepan_sotnikov1236": "Messages", "bezer95": "Have you got a merlin annual pass shag?", "v_e_r_i_n_o": "Bro u look like smeagol", "kadinsusud": "This is hilarious 😂😂", "mohammadreza_kj69": "😎😎😎", "whereuatbih": "What the fuck is wrong with yall", "brendarcl": "very well said girl", "bester_chein": "Пошла нахуй дура тупая, женщины уже совсем охуели со своим \"неравенством\". Блять все гендеры ВСЕ ГЕНДЕРЫ РАВНЫ. Прекрати охуевать и требовать большего. Мне похуй, что комментарий на русском, захочешь - прочтешь, ебанная феминистка", "malejacabzfutureviolinist": "☺👏🏻🌳❤️❤️", "archie._.preston": "Her head has right angle", "inalcheg": "Владимир Путин молодец", "mikapolska20": "Un homme", "joelane246": "\"Today is #InternationalWomensDay\" \"what we women want today [is] not celebrations\"...", "steph.jahn": "Stunning babe xx", "through.ranias.eyes": "I really dont understand why people hate on you, Greta. You are the voice of the youth and you raise many sensible points as well.", "l.javierportilloycoello": "Uyy, qué susto.", "allan_j_bullock": "I hate this kid so much", "freiyis": "👏👏👏", "xo.lovecam": "@dababy was just treating y’all equal like y’all want then right", "_.jachyym._": "Bitch", "shaneg81": "imagine not getting a full day for women’s day", "lilli.fshr": "@romy.hft wenn man versucht einen auf ernst zu machen, aber dann bemerkt, dass man sein Käsebrot im Ofen liegen lassen hat, und man deswegen innerlich zerbricht.", "scrawny_.nag": "Get lost, puppet", "frankhighwall": "Ma quand si brutt", "muslimmus_": "Гретта у тебя аутизм ?", "_maximchik_228": "Страшыла блин", "artistabernard": "Hello Greta, I am Jorge Bernard visual artist from Argentina. I live in Tierra del Fuego. I am writing to you because I know your commitment to the environment and the policies aimed at stopping climate change on Earth. The action is URGENT. I want to invite you to join our artistic exhibition project called “Burning House”. It refers to our house as a body, habitat house and planet on which we live, which is literally on fire. The initiative arises from us, a group of artists and dreamers, to put on the table the environmental problems that put us in check as responsible inhabitants of this planet. The exhibition will be of all branches of art: painting, drawing, mural, photography, animation, theater, music, printmaking, comics, literature, cinema, etc. It also includes talks and workshops on conscious and vegan eating. A series of conferences given by scientists from CADIC-CONICET are also planned. I invite you to join in the way you can and want, it can be a work of art, either in physical form or via email, or a video message addressed to the people of the South Pole, a place so sensitive to global warming. I hope it is to your liking and you want to collaborate with us. I send you a big greeting Jorge Bernard", "edobolt99": "Sembri una maniaca", "akhilles_._": "Себал тепчи заебал тептин", "fairy_alien_mushroom_clouds": "Greta go back to school please🙏🏼", "offizial_pascal_05": "Zurück ins meer", "tchioo1": "airy_alien_mushroom_clouds i don't see why her schooling matters to you so much that you pray about it ! you aren't her parents.. she seems so much more educated that all these morons against her , her wanting actions so we all don't die ! she is very smart and i am laughing at the idea of praying for her ..", "zolotoi_artem": "Мать в канаве", "smartbeard74": "Thank you for all you do👍👍❤️", "james.uzgur": "@natasha_peters1", "pchistorian": "❤️👏👏👏👏👏!!!!! Equal, equal only! She-ro(s)!!!", "chicken_nuggers_x": "Wrong SANDWICH TIME", "mag1999gcgh": "💎🦋💎", "reportsinamissing": "I will make you regret this you fucking fake little ahit", "_krishnav86_": "I respect women , but you didn't anything practical to fight against climate change , you just speak nothing else !", "livinn4ever": "🤡🤡🤡", "oskar4181": "😍", "i.al3x": "U look like Alex from Minecraft", "1.micheeellee": "How dare you", "david.holfve": "Nahhh fuck woman", "divagrisel": "Lindo y motivador mensaje. Un gran abrazo de Chile. Saludos Grisel", "joe.martelli45": "Fucking Minecraft head lookin ass", "aaron_sullivan15": "Who’s script u reading now?", "andrewroyer3": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "camilladinegenkraft": "You are amazing Greta 🙏🏻❤️😇", "atg453": "Greta shut tf up we know you look like a fucked up shrek but go to school so we don’t have to see your fucking face", "filip2hora": "Retarded clown🤡", "kelemen_tominno": "She looks in her 50 s", "t_________________b": "Ugly", "jesse_anbar": "You are so. Dumb women do have equal rights and they have way less responsibilities. Greta shoot me a dm and I’ll end ur whole damn career", "hannahaqwa155": "@kadecampbell8", "linguicinha_blumenau": "Ok Mozão", "annie_scottt": "What a KWEENNNNN🙏🏼🙏🏼🙏🏼", "asher_the_amazing": "Ooga booga", "mattagent_photographer_": "Feel*", "111___oliver.graham___111": "Hey sexy, you want kids? To bad you don't have a choice", "nele1369": "@marja_majo", "voyzar_vac__": "Ты уже подзаебала", "verkanicevska": "❤️❤️❤️❤️😂👏", "hendrik.wdnn": "🤮", "ardayzc2": "Suck my dick greta", "glxrxx_2.6": "Benutzt sie jedes mal das gleiche Schild oder werden deswegen wieder noch mehr Bäume gefällt", "kpenrosedesign": "Are you for real - the page is about International womans day. If you look at your question what rights don't woman have is what you asked? How many woman are in top jobs in the war room? None - the folly of war belongs to 'Man'. Gender pay gap is real and you need to do some research. I said in my last response i accept that you don't agree. Your need to be right by lashing out at feminists and wiman in general Feminists and woman mostly are not men bashing", "jackielmcardoso": "beautiful inside and out", "4ek.11": "Какой бред ты несёшь? Отвратительно.", "momaartmignon": "❤️", "__ar11_u": "🍃🍃", "johanlandin94": "You are cute", "s.r.o.dzendys": "🤢🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "markus_sjostrom": "Snusk Greta äckel", "yunggrdma": "Have no problem for girls? Is that even English?", "dinaralingua": "Can you do some make up???? You are ugly", "robnphoto": "👏👏👏👏", "shbaykulov": "Fuck you", "beatricekeul": "G R E A T - G R E T A", "alina.o91": "Nigga do you shower?", "chicks_hossegorbeach": "Cot cot Cot 🐔", "therealcraigxd": "Damn girl u be looking kinda sexy", "stabilorose": "Et encore une photo de vous. Il faut photographier only nature. #cultedelapersonnalité #onlyme", "detrauschert": "🤣🤣🤣🤦‍♂️🤦‍♂️🤦‍♂️", "33jaketaylor": "2 words: affirmative action", "cmsa8639": "Stfu", "yodajihad": "How dare you", "veggieponymom1214": "👎👎👎👎👎👎👎 @gretathunberg “shame on you Greta “ for Still falling to educate your burger munching “fans” on animal agriculture being the biggest cause ..👎👎👎 you not only fail to mention it as the biggest cause , you fail to mention it at all.. shame on you! 👎👎👎👎👎👎👎", "ivanino_rubio": "2strokes are the best", "cheesin_you_": "Greta I would ejaculate onto your dead limp body after choking you till your air way is the size of a cheerio", "zakk_hallberg": "Men are equal to women in most countries but anyway happy womens day", "pueblodespierto": "@gretathunberg 🤡 YOUR ENTIRE LIFE IS A HOAX", "pritam_0001": "How dare you🤣🤣🤣", "lovecrymatt": "💕💕", "stainmatt_": "So cute", "vignesh_18vikk": "Woow 😍", "crazyhoopla": "lol at all the angry sad people here insulting a child trying to do good. get a life.", "tobbe_hansson007": "Snygg", "nathlie_queenbee": "My school is learning about Great", "bigarne1": "It is men that want equal rights, and we long way from achieving them.", "anvar_zinanov": "И что", "zaratejonander": "Right and figh your lenguages beti haurrerA!!!!!", "julius13112": "Hahaha what the fuck 😂😂", "banann.a": "kween! 😍", "itslancenot210": "Thats because ya'll refuse to follow up on the \"equal responsibility\" part. Want to be treated equal then don't be so thin skinned because we guys get fucked over everyday. Everyone is out for themselves. But you, you're just retarded.", "69_clarke": "You aren’t equal to men yet we don’t have a international men’s day 🤔 @gretathunberg have a day off will ya", "paullinkmann": "Thunfisch", "s11psytrance": "😍👍", "kumarashish112233444": "Very innocent 😍👍", "lytkin9651": "Курицы безмозглые😂", "suetully1": "Thank you for the good work you do💗", "rrroger_olv": "💘💙", "nutrie_i": "Pensandola BRIGIDO", "god.of.kids": "frau", "evelyn.luca": "#NOTAFRAIDOFCORONA ♥️♥️♥️♥️♥️♥️", "weeb_god": "GO SUCK A DICK BITCH", "floxewood": "Hello, flower seller here 💓", "_alvaro_troncoso": "Cubo maincra", "martinxgarbarino": "Caeza cuadrada", "terry.linton": "Shut the fuck up", "hamp_the_life": "And so no one congratulated u, hahhahah", "k.claudiaxx": "💯💯💯", "vegaaninenmaailma": "❤️❤️❤️", "hatboy_9": "Statta a casa", "susserk": "❤️", "evanbedford220": "square head", "maheentheglobe": "💛🖤💛🖤💛🖤💛🖤", "i.marat2000": "Русские вперёд", "garrettxjames": "Get a job as a construction worker or a bottom painter then all y’all females", "filbyyyy": "Bollocks", "uweullrich25_singer_songwriter": "Good is Clima Strike for the World Greta @gretathunberg Uwe Ullrich your friend and Ralf Ullrich Fatou Jassy is friends", "springglober": "🌹🌹🌹🌹", "_brody_elkin_": "I support women’s rights... to stfu", "queggs": "❤️", "usyankaranarxist": "I love seeing @GretaThunberg enjoy her $20M while 3 billion blacks& browns live miserable life w/o electricity", "ustelemovma": "Почему такие Болты?!", "adam_jackson99": "Men and women are equal though? 🤔", "drumendabassov": "U fucking stupid cunt 😎", "m0iniii": "@miranda.brk", "world_of_unconditional": "❤️", "klaiv.domi": "We cannot have climate justice without gender equality... What does gender have to do with climate?", "itx.sandyyy": "@_heubi_ist_kuhl_", "ce.li_naa": "uff wow!❤️", "brandonscales1409": "Nice Long hair greta.", "liza_gled": "Где русские? 💁", "zenonkobus321": "Dobry cock bro", "roeyperevoskin": "🙏", "princeshah29": "I Love You😘💖💝", "dj_serg_konev": "Иди уроки лкчше учи, активистка нашлась! Толку от тебя ноль. Попросту кричать, не предлагая ничего рационального, глупо!", "tensorflowv2": "How dare you !", "fjordi_boshku": "All i see is women complain about everything and when they achieve something nothings change they keep complaining again how unfair everything about them is. Its just in their nature! First women wanted to have the right to vote, they achieved that and wanted more etc etc. I am not trying to say that women should not have the right to vote or about everything else u have achieved but my point was to prove what i wanted to say! I just think that women's dont know what they want or what makes them happy! Even in the countries where women's and mans have equal rights all i see is women complain and that's the prove that whatever women's achieve will never make them happy. What i think is that greta should go back to school and enjoy this amazing years she is losing by doing this nonsense! Even tho i grow up in a poor country and didn't have what i have now i believe that that was the best years of my life until now!Humans will never be happy even if they achieve \"everything\" and the world will never be perfect no matter how hard we try simply cause a lot of thing sounds perfect in theory but don't end up that good in practice. Sorry if my English isn't very good!", "simoncheyen": "Go and sit on your parents armchair which costs 10000 euros and is from real leather. It has been proven to be the fact. Did your father started earning money already from monopolizing your name? When you will actually do something instead of speaking?", "graphsbynaho": "The end of ur caption so open my mind😭 😍👏", "emmy_2671": "Hässlich", "graf_sergo88_": "На мужика похожа", "daniieldelavega": "🖤🖤🖤", "kilroy011": "Equality is for losers prove me wrong", "jane_reoch": "✅", "almaktabah1": "🌷🍎🌷 Undergraduate and postgraduate and doctoral degrees are the most gifted to humanity. So Miss @gretathunberg seek knowledge.", "konsgriez7": "Uff model 🔥", "summer.blanchette": "why is everyone so mean to her !!!! she’s 17 and tryna change the world and most of y’all are in ur 20s sitting behind a phone screen doing nothing I don’t get it !!!!!", "ejrub": "Så vackert foto!!!👍👍😍", "ashirov.kemal": "women have equal rights... go and study at school", "my.0.lilly": "😩", "leon.andler": "😻😻😻😻😻", "xsaskaa_": "@leon.andler våran favorit!!!!❤️", "boredvet1286": "Yea, that's a load of crap", "s.lakvsghjdn": "Fridayforschulfrei Handy Herstellung auch Umwelt freindlich", "maartinliska_": "🤮🤮🤮", "elise.hagstrom": "Go girl💋💋", "kjv.believer": "Every famous feminist icon is a secret transvestite. 😔", "joline.soderstrom": "blir lesbisk av dej", "body_with_soul_1": "Looking good 😁👍🍀greetings from Germany 🇩🇪 Dirk", "aiman_rozzzzzz": "Cazzo guardi", "badboypopo": "🙌♥️💃🏼", "666yxm9": "жаба", "rohaibjavaid": "Osm", "sfjellet_": "Dahahahhaa thats hot", "thumbsucker420": "ur awesome", "champi_champote": "Nique ta mère greta, t’aurais été bonne j’taurais pas insulter", "an1.ba": "Is this a joke??? Men are far less equal to women in today's society. How many fathers get kids after the divorce? How many keep the house? How many are threated the same by the justice system(no due process needed, when the woman complains)? You are just a kid and your parents, who apparantly give you these clues, are just attention whores.", "lil_margulis": "[persona] Que presume de manera inoportuna, a través de su actitud o sus palabras, de tener grandes conocimientos, o hace creer que los tiene. \"recuerde que las empresas de selección detestan tanto a las personas pedantes como a las tímidas; el pedante habla siempre refiriéndose a lecturas (de él se dice que habla como un libro) y gusta de vomitar todo lo que ha leído, con lo que abruma a las personas con quienes conversa\"", "iamilroby": "Spacca coglioni non scendi in campo per il corona virus???", "neuhaus.fm": "Thank you for helping to make the world a better place !", "monika.ewa.sarnowska": "St Greta", "plantsandrocks": "✊🏻", "anabundanceofsheep": "“Fundamental equal rights, not congratulations or celebrations” - Can we talk about how it’s now politically incorrect to celebrate civil rights? The misconception that celebrating civil rights does nothing to help alienates ordinary people and those less inclined to activism. “If I can’t celebrate the contributions of women on International Women’s Day”, people wind up thinking, “what CAN I do to fight misogyny?” Yes, we need action greater than celebrating women in order to achieve equal rights. But saying celebration of women is unwanted drives away people who you would rather have listen to you. For every social justice cause, we must look toward what we still need to accomplish, but also celebrate how far we’ve already come. You want your audience to grow, Greta. We all want your audience to grow. By criticizing the efforts of millions of well-meaning people across the world, you are convincing nobody, and turning away all but the most committed.", "saeedmirzaie.co": "Fuck the world are you boss", "bierenbeul": "😫👌🏻", "ege_ates01": "#corovirüschina", "kaiser.kimyannic9": "You’re looks like beautiful Greta, Fight for the freedom more. 😁 @gretathunberg", "thor_elias": "🤍", "pinkninja_uwu": "BRUUUUUUUUUH", "blakeneypenny": "🙏", "aleksandraorlova524": "🆘🆘🆘🆘HELP @SAVE_ILYA 🆘🆘🆘🆘🙏🙏#Zolgensma", "andrianova_alena87": "@gretathunberg Hello! How are you? I am one of the volunteers. We are raising money for a kid with genetic disease SMA1! THIS IS A RACE AGAINST TIME! We have less than one month to help him to get a treatment. He has been sentenced to death without it . You can read all information and donate here on go fund me link. Every dollar is important! Thank you for your time and all your support! Help us to save this kid's life! Please share this information with your friends! Repost on your page or add to your story! We are grateful for any help! Have a wonderful day! bit.ly/saveilya 🙏", "golubevanatalia56": "Всем делала еще репост Юлиного поста. #Repost @save_ilya with @make_repost ・・・ Dear Cristiano Ronaldo! @cristiano @georginagio I'm the mother of a little boy Ilya Rozkovsky. He is your big fan. Unfortunately, my son has a genetic disease SMA1 - spinal muscular atrophy. The US has a treatment that stops the progression of the disease. As a gene therapy, ZOLGENSMA replaces the function of the missing or non-functioning SMN 1 gene with a new functional copy of the SMN gene. We have less than one month to help my son to get this treatment. He has been sentenced to death without it . Treatment with Zolgensma in the Nationwide Children's Hospital in Columbus costs $2 400 000. Our family and volunteers are trying to raise money since there are no funds available for treatment of this disease in our country. We are just an ordinary family and we don't have that kind of money. Please help us save my little son's life. You are our last hope. I really want to see my son healthy. I dream to see him playing on the football field. Cristiano, you are famous and powerful because people love you all over the world. Please share this information on your page or add to your Instagram story. In that case a lot of people will know about us and will be able to help us if they feel that way! Our PayPal is ilya_save2018@mail.ru Our GoFundMe link is http://bit.ly/saveilya My phone number +7(918)774-0013 Yulia E-mail: korinenko.zam@mail.ru #спасем_илюшу #save_ilya #илюша_рожковский #sma #zolgensma #ronaldo #cristiano #footballtime #footballplayer #championsleague #valencia #tottenham #uefa #finoallafine #cr7 #nikefootball #forzajuve #juve #juventus #juvemilan #football#илюша_живи", "schaeferhunde_und_hamster": "The devil-eyes....", "jouke_2006": "Dronken kut hoer", "meris.nm": "больная малолетка", "sz_d08": "😍", "danielleguittard": "Merci pour l'exemple que vous nous montrez. Il est grave quece", "vania_602": "Ебало как у моржа", "bennn.pearce": "Men deserve rights too", "benmcguigs": "How dare you", "ilyusha2804": "@gretathunberg Здравствуйте! Я волонтёр Екатерина Ключникова , проживающая в городе Ставрополь,Обращаюсь к вам от лица мамы Юлии Рожковской . У её сына Илюши редчайшее заболевание СМА 1 типа , но есть выход и это препарат #Zolgensma , но его вводят деткам до 2х лет , а Илюши уже 1 год и 10 месяцев . У нас осталось всего один месяц собрать эту космическую сумму в 150 миллионов . Обращаемся к вам за помощью 🙏 опубликуйте пожалуйста информацию о Илюши 🙏❤️ Чтобы не было сомнений мама готова по видео связи предоставить все документы и показать малыша . 🙏🙏🙏🙏❤️ Помогите нашему Ставропольскому малышу 🙏❤️ Страница мамы @save_ilya Там вся информация о сборе средств и документы .", "orthodoxmemelogian": "Corona virus", "matizpvl": "В школу не пробывала ходить?", "mykawka_": "@gretathunberg I am one of the volunteers. We are raising money for a little boy Ilya Rozkovsky with genetic disease SMA1 - spinal muscular atrophy. The USA has a treatment that stops the progression of the disease. As a gene therapy, ZOLGENSMA replaces the function of the missing or non-functioning SMN 1 gene with a new functional copy of the SMN gene. Zolgensma in the Nationwide Children's Hospital, Columbus costs $2 400 000.  We have less than one month to help Ilya to get this treatment. He has been sentenced to death without it .  Please help us save this little boy's life. You are our last hope. Cristiano, you are famous and powerful because people love you all over the world. Please share this information on your page or add to your Instagram story. In that case a lot of people will know about us and will be able to help us if they feel that way! Thank you! Ilya's Instagram account - @save_ilya Ilya's PayPal is ilya_save2018@mail.ru Ilya's GoFundMe link is http://bit.ly/saveilya Mother's phone number +7(918)774-0013 Yulia E-mail: korinenko.zam@mail.ru  #спасем_илюшу #save_ilya #илюша_рожковский #sma #zolgensma #ronaldo #cristiano #footballtime #footballplayer #championsleague #valencia #tottenham #uefa #finoallafine #cr7 #nikefootball #forzajuve #juve #juventus #juvemilan #football", "glindbarg": "Du är vacker.", "fix_everything_": "Вот же сука", "metrika.rostov": "@save_ilya 🆘🆘🆘😓💙help", "albinakartishkina": "@gretathunberg Always have a willing hand to help someone, you might be the only one that does! Please donate and share !🙏❤ bit.ly/saveilya @save_ilya", "svet_lana301085": "@gretathunberg ❤ 🌟 Просим о помощи малышу из Ставропольского края  @save_ilya Мальчику 1,10 ,но из-за генетического заболевания угаснет малыш  без лечения 😢 Родители стучатся  во все двери, многие уже не остались равнодушны, просим Вас не пройти мимо 🙏🙏♥ @save_ilya", "kseniavoronay": "📣📣📣Greta @save_ilya Need help ....Be a miracle for this kid ! Save his life ! Please donate and share !🙏❤ bit.ly/saveilya", "syr_bataysk_anna": "Как достучаться до звезд, когда и всем простым вокруг все равно, как поверить, что нам всем не все равно друг на друга, как не стать жестокими и равнодушными. Спасем всей страной ребенка, не бросим и не перешагнем, не закроем глаза, а скажем @save_ilya мы с тобой❤️❤️❤️😓💙 🆘", "veganhop": "Thank you @gretathunberg for all you do ❤️ please can everyone in the UK sign/share my petition for changes to Vegan legislation DM me for link ⭐ thank you SO much 🌱", "domk3": "👏", "cnxinqing": "行尸走肉", "cin_cin.98": "Go back to kitchen and stfu", "recordrednose": "Let’s set a record together for Red Nose Day on the 15th of March, 1 million followers and 1 million likes on the red nose post. We can do it!", "varik007": "Соска тупая", "canucook4me": "U should now, ur going very fast down under if u not shut the fuck up, you do the wrong travells, go to india and watch them throwing the trash directly in to the ocean!! .. Just for example gretli. And switzerland doesn't welcome u anymore..", "artistartist2323": "Forener People are also human", "wagatomoyo3": "nice", "__kazakova_anastasiya__": "Even a small donation can help bring a miracle to this child. Please donate and share!🙏❤ bit.ly/saveilya", "tina___vela": "Если у вас доброе сердце и вы хотите помочь ,то сначала ознакомьтесь с информацией, детей больных много, всем мы нужны, но тому кому осталось 10 дней,такой один и это @save_ilya Илюша Рожковский с г Ставрополь, препарат колится до 2х лет Илюше 22 апреля будет 2 года,мы знаем что сделав доброе дело ,оно возвращается вдвойне. Сумма 2400000$ это очень много ,но если каждое доброе сердце отзовётся мы спасем тогда ЖИЗНЬ . Илюша Рожковский ждет вашей помощи,до 23 марта у вас есть возможность совершить чудо", "max.schmit": "Lmao god took away an hour in international women's day so it wasnt even a full day.", "john.marie.98622": "BD @ gretathunberg forward, conducting diplomacy work firm..defi paradoxes.#.Belgium Europe.", "keita_yamada_kun": "There was a statement to me not to support this movement. A notification came. I tried to respond directly, but couldn't find the place. no problem. The people who participate in this movement are not stupid. Participants in the hard work will determine what is needed for themselves and their families. Greta is doing this for her own benefit. Everyone who participates in this movement is so. The benefit is that you continue to survive. No one can achieve this goal alone. So cooperate. Even if someone controls Greta and wants to control this movement, it will not be possible to control this movement. All participants in this exercise will judge this exercise. Participants will continue to examine whether this exercise can fulfill their goals. Therefore, I think that there is no problem at all.  I determine that the purpose of this activity is to keep the participants alive. Therefore, I think that not only climate change measures but also infectious diseases measures will be an issue. So I raise a problem. As the pandemic spreads globally, the risk of the virus making dangerous mutations increases. The greater the population of a virus, the higher the possibility of mutation. That's why I raise issues with this account.", "emmycuzme": "https://youtu.be/gzwQhT7jgr0", "1receipt_": "1receipt, a paperless shopping experience with one platform for receipts. Sounds interesting? Visit our website for more information: https://www.1receipt.io/", "graceschurterdamien": "Congrats greats words. ❤️🙌💪", "leon.why": "Facist", "w1adoz": "Бля иди поспи", "abidov.j": "GO TO SCHOOL😂", "hanshulth": "👏👏👏", "fatema_mandeel": "You’re amazing ❤️", "t_e_c_h_n_o_g_u_r_u__nds": "🤣🤦‍♂️🤦‍♂️", "obi.thy.homie": "Me waiting for Mongolia 🇲🇳", "depreshaan.mp3": "Mister beast for times person award 💪", "sabiroff95": "С хуя ли у тебя 10 лямов?", "gigi_mendesb": "*have to go to ww3* You know what,fuck feminism", "sosmaresias": "Maresias beach need help 🆘🆘🆘🆘🆘🆘🆘🆘🆘", "orozbekovvv": "Мектепке барчы ай кыз", "melodyxx2009": "I shouldnt be up here", "majitelpravdy": "Back to the shool or kitchen..®️😂", "ryder_childs7": "Ugly photot", "sir.kevin_nunezjackson3015": "#Gretardada", "kolecnisley": "dishwas(her) @ssophieekk", "skeeter_memers1": "Ayyye, celebrating our dishwashers", "camjirowetz": "arguing with this post is not a good look guys it really isn’t", "amarismariee": "you’re incredibly inspiring ❤️", "dhani_95sp": "Gender politic and climate change narratives wont be good combination, greta. Obviously ppl dont care about you, and you'll be gone soon. Just look at the comments below. The world cant resonate with your movement. Go back to school.", "chadstout69696969": "BABY U MAKE ME WERY HORNY I WANT TO MAKE POOPOO ON YOU PLZ COME TO INDIA SO I FORCE YOU TO MERY ME", "kellycoldwell": "Thanks for making people aware of what's happening in the world."}