{"6ix9ine_tr3iway": "Fuck bitch", "jowillll": "I cant believe how far you’ve come, keep up the good work! From indonesia 🇮🇩", "sa_ba2369": "Hello I love you can I speak with you because I same you and I leave in Iran but I will happy when u speak with u tnx❤️❤️", "moisestorresarriaga": "👏", "ladygwenuveire75": "I’m so sorry for the unbelievable amount of people who claim to be adults that are attacking you! It is so embarrassing to read, you see, most of these cruel people grew up huddle in the shelter of their homes, working dead end jobs for meager pay. They are too scared to admit or realize that a child is actually doing more for the world that they have done in their entire lives! You keep stroking and doing your thing! The world is FINALLY starting to listen!!!", "connerrr_17": "has this 17 yr old even hit puberty yet 😂", "fireworks.z": "For a person who doesnt go to school you sure now how to make sentences and speak wow aint jesus surprise by your magical speaking powers how did you learnt that if you refuse to learn alreadyy💜💜💜💜", "moicanno": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "fjuliano55": "Trudeau now only thinks of climate reform thanks to you", "piedmontboys": "Greta go to school", "jar0203": "Driveling Pubescent Pablum", "jdw.2004": "Anybody who takes her seriously is a retard", "soso.aux": "Please, Go to school, have good marks and have a good job! But don’t make bullshit like this!! 🤢🤮🤢🤮🤢", "pyro_sued72": "How dare you 😂😂😂😂😂", "lol_no_lol_______no": "Go to school", "alice.simass": "greta don't care about your haters", "sxthyxn": "If u care so much about global warming, then get of you lazy ass, do some research, maybe get a science degree, collect some data, find find a suitable solution yourself. It is useless getting people to cause a rampage on streets to raise awareness. I'm pretty sure we all know climate change exists. Stop criticizing systems, companies and hard working scientists. Do some work yourself! I'm not saying these systems are flawless or even good, but if u have a problem with it why don't YOU spend some time carrying out your own research and actually create solutions to climate change instead of telling other people to do so. Here's an idea, gather a group of people and do something yourselves (work) to directly combat climate change instead of screaming on the streets and telling other people to make a change. @gretathunberg stop criticizing the government and maybe try to actually make a difference!", "bettymariaparker": "Du är Bästtttttt!!!!!!❤️❤️", "mdataullah13": "Grata speech .I hope listen and take a action", "lawlorofficial": "Go back to school, you are a child. And have much to learn about the world. Thank you for standing up for what you believe in. But the United States will not make decisions about our future and the future of generations to come based off the opinion and words of a child. Your handlers should be ashamed parading you around like this to be honest. They’re taking advantage of you sweetheart. I hope god protects you and guides you through to be an adult and hopefully you can reflect on these times.", "aladdim_br": "and the oscar goes to ...", "narhurley": "This is gibberish", "jj_laxton85": "Climate control is a hoax this it utter bullshit Greta u talk sooooo much shit", "lucy._.isabella": "This is baloney squares!! ya hear me?? BaLOnEy SqUArEs!!! aren’t you the actor for news channels??", "_rybina_13_09_": "Маленькое тупое создание🤬", "honeydipps": "@airarebosa", "vmendao": "Where are you Greti Greti ?? No need to strike now because all the schools are closed ? 🤷🏻‍♂️", "the_notorious_spp": "😂😂😂 dumbest simile ever", "nasirykhaled": "She is mentally not ok . I dont know why people are admiring her .", "wanderwherewilfredis": "Soon as the usa abandons its commitments to the U.N/ nato and stops protectcting sea lanes, the europeans will be eating eachother fighting over every natural resource and drop of crude they can get.", "giovanni.a.s": "Мразь . Иди нахуй . Найти свои мозги", "chemistry_besit": "обосрись тупая гретта", "eng_naadaa": "❤️❤️❤️", "m.arymsalimi": "❤️❤️❤️", "augustompg5": "fuck off Soros bitch", "ivan_corobcov": "You can do all this talking but what the fuck are you actually doing to change this? Talking thinking your making a point is gonna do shit unless you actually go and try and change things.", "samubasabe.95": "u suck", "val__rocha": "👏👏👏👏", "crazymk777": "Vai ajudar a tua mãe em casa, pirralha", "the_green_gal": "YESSS Greta!!!🙌❤️❤️", "mihaela.pejovic": "Hahahahahah", "joshflamain": "Does she write this", "die.wahrheit.heute": "Muss die nicht zur Schule 😂", "imam_sunuzier": "@silvinovitasari18 kalau semua anak bangsa memiliki mental kayak gini.... Pemikiran kayak gini... Termasuk Aku.... Memiliki pemikiran dan keberanian seperti @gretathunberg .... Indonesia bisa maju pastiiii", "taxpayer_for_trump_": "🤣😂🤣😂🤣😂🤣😂", "hedelyespinoza": "<3", "b_nurs777": "the inevitable cannot be avoided or changed", "aiixaaa._": "aaa vos sos la de \"arte iu\" o algo asi ah", "ridzuanbinmazlan": "there you are standing in a airconditioned room releasing cfc", "pierre.ameil": "Pfffffff zzzzzzz rrronnn pschiiii", "gfoster200": "Her voice makes me want to go eat wood shavings👍", "ogshzzz": "Haha, this girl is a joke", "dypexastyle1": "Little joke 😂", "zana.149": "How Dare you ?", "shibuosuman": "👏🥀🙏👍🏾", "haydnsexy3": "do not give up I am watching your videos on YouTube", "persephones.blossoms": "Why are there so many hate comments?", "maria_dienerm": "🌍👌🏽", "_dangerous_15": "Тебя только что показали по телеку и я тебя в инсте нашол", "sleepypanda17_": "Don’t be sorry. It never has made sense, and it’s absurd in my opinion as well", "nikspanodimos": "How is she 17?", "i_g_o_r___l_y_a_m_k_i_n": "Stupid ass little dumb", "thomasandp": "We need your voice Greta keep it up. You can and you will change the world never give up!", "raj_kaur85": "@makeupbykirankaur", "reehaquino": "O que mais me dói e saber que eles compraram uma criança pra comover o mundo dos seus ideais, não passam de lixo humano querendo apenas lucrar em cima da inocência 😔😢", "scjc1112": "Can someone explain ❤️", "craigiandoli8": "Your a joke🤦🏼‍♂️", "junadiodati04": "Hello Greta my name is juna I'M italian love you 🇬🇧", "sofia2345098": "Ты крутая!!!!!", "theunconditionalconservative": "THE WORLD IS GOING TO END 🙄🙄🙄🙄", "ravindransperumal": "This is a very bold and open statement to us everyone...", "an.enigma.of.03": "This such a beautiful and important metaphor. I love your use of “your house” making it personal and definitely got to me. I’m not sure about anyone else. You are so inspiring.", "gustafspets": "I blås botian in november", "william_wei2020": "imagine what will happen if they did what you said. You won’t have cars and planes for you to go around and tell country leaders what they should do. The economy of the world will collapse why don’t think of the consequences of doing what you said?!", "opaliadesign1820": "La Greta è un’attivista plagiata “ecologica” del cavolo,molto ipocrita e opportunista", "jrilm_11": "MUITO OPORTUNISTA", "oopkkfyses": "ばか🙄🙄🙄", "serra.mafalda": "Amazing speech", "seth_p20": "ur gunna burn soon", "leoinsweden": "Check out mjolbyoartiet on insta it is nice", "alessio_pedini08": "Ursula von de leyer era impegnata ad abbracciare greta, nel periodo in cui l'Italia stava affondato la situazione da sola, con francia e germania che prendevano per il culo cibo e nazione. Solo ora si rende conto che siamo una comunità unita \"geograficamente\"", "3poderes1livre": "Atriz 👌👌👌👌", "s.__m97": "جميل", "spirest.rttd": "ебало как у канибала", "elyariti": "Yesss👏", "redhemi254": "🤣🤣", "e.l.i.s.a._._": "Okay I just don‘t understand why there are so many ppl saying greta is just a child that has nothing to say...it is her future...it is our all future. Maybe her parents wrote her speech so what? SO WHAT?! She has some honest words to say. Look, she is risking her education to save the world, she tries to get ppl to do something to SAVE THE WORLD...so shut up because nobody gives a f*** about ur stupid comments..thank u for reading bye", "escaped_from_a_mental_hospital": "Кто-нибудь скажет ей?", "ardayldz3": "Konuşmana soksum", "alex_venko": "Она с бодуна?", "riz3.ggs": "Hahahahahahahahahahaha", "gun_ster_rio": "это всё из-за того что у неё сисек нет", "nelsonnahuel1": "😪😪😪😪😪😪😪😪😪😪😪😪😪😪😪😪😪", "r_bhavesh_pratap": "I hope they listen and take action ,i appreciate your speech love & support from - India", "fanfiki_dlavseh": "🙄", "uncle_evki_and_davida": "Stupid girl 😱😱😱", "raytronic.php": "Ебанько🤦🏻‍♂️", "selfloveisthepower": "❤️❤️❤️", "byvaet1": "Whahhahah", "indie.mae": "Only each individual can change their actions to change the world! It takes each and every one of us changing our lifestyles from consuming less, producing more, becoming more sustainable and self sufficient! Policy makers don’t care about the planet, they care about the 💸 that grows on trees!", "mikey_higuera": "@isthatcherboi @t_rockbottom", "louis_aaron628": "Who doesn’t fucking call the fire department?? Greta just leave the work to the government can you please shut up", "yigitosmanaga": "🇹🇷🇹🇷🇹🇷2023 ccccc 2023 bor sevdalısı 🇹🇷🇹🇷🇹🇷", "ezbros_gameknight": "🤮🤮👎🏻 you are an idiot", "bovoldby": "😂😂😂😂", "rian_alves_014": "Pirralha", "b.eatriz_morais": "Sem comentários!", "nolan.pastor": "How big is your house 😂", "flolluminati": "oh shut up you fucking bin", "vaaaaaaaaaasilina": "👏", "dontletmy1": "Ojalá se logré algo con todo esto yque las grandes industrias deje N de explotar lo poco que tenemos sano..😢 @gretathunberg", "ernestmacnabs": "Когда делала домашку по экологии, но что-то пошло не по плану", "shopyyy_hamilton": "Greta - just wow! Namibia 🇳🇦 👏", "dele4glory": "Preach to them Greta", "prettylotonia": "Too all those saying she needs to be in school if the so called leader cared enough to treat the earth like they treat the economy then she wouldn't have to be there making that speech", "ulisescpa": "PUES PLANTA UN ÁRBOL! no solo te la pases en redes sociales y recibiendo donativos jajaja. Feministas millennials", "ps2hi": "this is a great analogy!❤", "_.zh__": "💚🌍", "mark.moulton.921": "❤️❤️", "womengoingbeyond": "Great speach❤️", "monicakuklinski": "Não vai falar da China! Pirralha!!!", "umekawakazou": "装你妈的大尾巴狼。。给老子滚回去读书！", "its_niiko": "Wtff ahahaha what a stupid bitch what I’m I even doing on her page.. but god damnn she is worst then jefry from game of thrones this little shit", "jeffreyli8397": "She needs to be at school", "267_ili_g03": "Disslike", "toma_musix": "you know you cant stop the earths natural course of cycle #illusion", "alexis_gd2001": "U need a school", "siniorzp": "Your school is gonna late", "liora.daniel": "Люди, что с вами не так? Грета хочет улучшить экологию на нашей с вами планете, это касается всех нас, а вы её обсираете. Вы не понимаете, что воздух которым мы дышим, земля на которой растёт еда, которую мы едим, всё это у нас общее и всё это влияет на наше здоровье? Очнитесь и включите мозги 🤦", "n1ckerr._": "Terrible speech it made absolutely no sense at all", "hyuiiua": "You are my idol❤️", "indigo__miranda": "you are amazing", "giuliomontevidonj": "DEEP STATE DEEP STATE DEEP STATE DEEP STATE DEEP STATE", "grafabra": "Прочитал её посты надеюсь ей известно что бамбук не дерево. Переживаю за китайцев. 😂😂😂", "isaiahj2019": "Have you learnt that chopsticks are made from bamboo?", "badgalizy": "Der Zopf macht dich auch nicht schöner", "obzores_del_myzhik": "Do you want to serve in the Russian military? 🇷🇺", "_xfabiannx_": "Mimimimimi", "valleychris": "She’s at least 32 years old. Agent Greta", "ghmmadeinitaly": "🙌🙌🙌🙌🙌👏👏👏🙌🙌🙌🙌", "barakatyounis": "respecting ,,", "aurelius.pmbd": "What her age", "smamancio": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "thtfurki": "Face transplant", "esa_.shojaei": "👏👏👏👏👏", "charles_sma": "@anais_gtte", "amorimeva": "Ridicula 😱😱😱😱", "ammadhx": "@_.millieeee OHhh just move on it’s getting boring", "ada_clark_2689": "💕💕💕", "popycca": "No worries guys apocalypse is just a few years away.:))get your life in order.:)", "daniel_gard80": "Who’s making you say all this retard", "attractionnaction": "https://www.instagram.com/p/B-MwPCrDxyc/", "makcimka_sytnik": "Dura", "valdecir_santa_ana_": "#GretaPirralha", "thomaz_freire": "#pirralha", "miaxkoot": "Climate change is bullshit...it's literally just the sun warming up like normal....Fuckin dipshits", "egersck": "Под наркотой серьеную речь не толкают 😂", "vultabrite": "🤤", "jikson_is_me": "😍", "theonewhoisalwayswatching": "🤢🤢🤢🤮🤮🤮🤮🤮🤮🤮🤮", "alexandra_hedwig.x": "Great speech! 💚💚💚", "__mihael.m__": "Mozes mi nasred protesta popusit klimatski kurac.", "nayharley": "Brainwashed fool", "kubacieslikowski": "No", "klausdergaertnerheadshop": ".", "ieatspidersalive007": "#youaresobrave #thankyou #iLOVEU", "oykegnerohoymman": "#oykegnerohoymman", "sporthelden98": "I hate you ;)", "rimi4.3": "Stfu", "evan_head81": "where’s you degree leave it to real scientists", "laasiaart": "We worried about covid", "getulio.silva1986": "@gretathunberg agora e hora salvar o planeta... Ou a pirralha tá com medo do vírus chinês?", "txredbeardtt": "Greta Thunberg Speech vs 1990 Nayirah Testimony", "ight._.fam": "Shut up, nobody cares, the world is already shitty mate", "srto.__alex": "Ostia pilotes", "the_dave_in_the_life": "I absolutely love the genius of this leader. Powerful speech, Greta.", "tanckgrbjj": "Você não ia salvar o mundo?? A hora é agora... hipocrisia é mato", "_leftists_hate_america_": "How dare you!!!!!😂", "theawesomeducxk": "ditt arbete är fantastiskt", "eliott.schkn": "Stfu so bad just go away", "natansmbr": "Peguemos o direito de governar que nos foi tirado, chega de política, chega dessa hierarquia, o nosso sistema tem que ser mudado e que o mundo seja governado por cada um sem divisões. Sem presidentes governadores, nós somos, não precisamos ser adestrados ou ensinados a viver.", "black_vesper": "...", "that_kid_conall_": "Amazing just amazing", "tyessia14": "Well done 👍👍👍👍👍👍👍🔥🔥🔥🔥🔥", "actuallyaliceinwonderland": "Nope not scripted at all💀 well done Greta!! Such an independent and unique individual🤡🤡🤡", "xlauren_powerxo": "How dare you @leanne_byrnes13", "yacuzhh": "Shut up square head", "megskawai": "@shanti.child", "asilnrkv": "Sick you are a fool fuck first finish school then you will be smart what the world needs to do, and this concerns those adult morons who sponsor and advertise it how did you fuck Hitler's granddaughter", "mattbosss": "Who wrote the speech", "belikerainz": "Du kleine hure", "novak_luka23": "Coronavirus helps more than you, it's time to stop", "leandro.araujo32": "Sou do Brasil.... #TudoPelaAmazonia. A amazônia é nossa 🇧🇷", "ldl_nunes": "Aí, pirralha, será que você tem coragem de criticar a CHINA com seu vírus - Covid,19, espalhado por todo o mundo , como você tem coragem de ficar agredindo governos de direita.? #VivaBrasil #VivaUSA 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸", "sh4h4b.m": "Good words but certainly written by others. #mediapuppet", "braithwaite__": "Why don’t you go to a party or something", "erdcorintiano": "😂😂😂😂😂", "waywardamelia": "*Snaps*", "abrahamlbz": "Mecaguen tus muertos", "mahdi._.seyed": "She's all talk but she isn't taking any action", "saniyabhusal___": "Regarding all the upcoming problems that we human being created , we cannot underestimate the heroes like you and us .if the process goes up like this then the day with a lots of solution is not so far.the only thing is to promote such a masterpiece to the world and join hand towards new world 👑😍😍😍we surely make it one day, all we need is unity ,love and support for each other.@gretathunberg you are becoming a role model of many like me .proud of you angel❤", "melli.4711": "Vielleicht hat gott dich aus gewählt, die welt zu retten, und weil dich viele Erwachsene und Politiker ausgelacht haben hat er das Virus geschickt um dir zu helfen", "krystof.musila": "this is was very impossible", "ha_wo_me_hu": "@13luemist", "gypsyeileen": "Amazing words, well spoken for such a young lady. 💕🙌🏽", "guidomatomatini99": "Stupida", "sher_ler_123": "Why does she sound and look younger than she really is", "claywolfe1": "imagine being this stupid", "jameslm18": "🖕🏻🖕🏻🖕🏻", "supportlgbt_meg": "HOW DARE U , U HAVE STOLEN MY DREAMS AND CHILDHOOD", "sayarahmad_yousafzai": "👍👍👍", "shaggers1025": "Dickhead", "vedanta_99": "You just keep speaking.. No actions taken 😑😑😑", "_simon_brxckner_": "Shut Up!", "lilmamdin": "Bu orospı cocunu ciddiye alıp dinliyor mı bide amk", "aidanfulton11": "your a pain the fucking arse", "harmony_love_soul": "😂😂😂😂😂OMG", "im_maxim4212": "😂😂😂😂😂 damn this is acttully so fucking funny my friend was right lmfao", "fodor_bence_mate_": "Awesome! May the force be with you", "alessandro_slr": "V8 bluber bluber🔥🔥", "connor.coww": "How dare you", "lilian.lupino": "You're Gods light in the Earth 💖", "har_ryprivate": "Shut up ya poshy bitch", "gal_ocepek": "go to school", "soldbyginanegron": "🗣Dear adults: take good notes. This is a LEADER. She is PRESIDENTIAL. Her leadership skills are on 10!🔥🌎🙏🏽", "xxvxcornxx": "wait she is 17 wow she look young bro i look oler than you and i am 12", "obsurdreality": "They they they, why don’t we take responsibility for this ourselves, it’s our choice to burn gas, use groceries plastic bags, not go solar, we don’t need more government enforcement. We need to unify, without government intervention for this to stop. 🍃", "paigealison_": "Great kid", "dante_r_2005": "How dare you", "amedo342007": "Кто её за микрофон пустил?", "eyupcaglar71": "Anayın amı", "lala_foreverxi": "Script written by her manager Indian man and her dad . Anyone can read it. Have u seen her interview one to one dumb as fuck and lying about not being on 1st class train in Germany. Stupid Americans r always fooled first", "sam_james1445": "I'm so happy you're able to read a script", "laura.jsv": "Ich bin ganz deiner Meinung!💙", "ous8454": "👏", "sped.joaquin": "I like the analogy she used at first I was like i burning house what? But the explanation was pretty great", "adiajgies": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "sineadcarroll_": "@tiarnanfegan_", "justindoiron_": "Tcheu callise de face ta faire la", "_rishab_rj_": "Teri maa ka bhosda teri ki", "you.smoke.boof": "Tf this hoe talkin bout", "patricktilsley": "For crying out loud! For all the people who think humans are causing climate change! That’s false. Just because recently we have had many fires and s droughts. Doesn’t mean our actions are causing climate change. We have been experiencing natural disasters for hundreds or years!!", "death_angelyt": "Ew", "erkan_dzgc": "Ağlak amk", "afrozkhxn": "❤️", "zoe_horse_rabbit": "What you are doing is amazing and I try to make awareness too but just can’t seem to be able to do it the way you do. Please keep doing what you are doing and no matter what keep going", "merid32": "Do at least something, do not shout from the stands! People take away garbage from the shores of the ocean, but no one sees this, sow the world from plastic, separate the garbage. Do something like that too. ￼", "z_h_.1": "💕💕💕", "lotusgirl22": "💚💚", "nurmelyajram": "Great speech but that’s all it is.", "jonas28.02": "Michaelsoft binbows", "momin.2": "❤️❤️❤️❤️", "alissa.rs10": "WE DONT CARE THE WORLD WILL DIE FROM U AN ONLY U", "amir_kkvnd": "گاااااه نخور", "130.susiii": "Salammm Tunfischh", "__zabi": "Shut the fuck up!!", "simmyfaulkner": "@_gracefaulknerfitness_", "ben.richens": "No one cares", "kevthestev": "Corona has done more for the environment than you do.", "danrburela_n_9": "Какую-то залупу несёт", "genderneutralbeauty": "Please see a doctor you need help", "mattia_carollo_": "Ma sparati in culo", "ina_green_v": "❤️❤️❤️❤️❤️❤️❤️🙌", "majinrose17": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "1.hannez": "#hategreta", "tenitskiy_official": "Долбоебизм🤦‍♂️", "lukasz25850": "Jestes nienormalna !!!!😡😡😡", "scott.mockridge": "Oh shut up U cunt", "drgs.eins.vier": "Downisparlament kes echtek", "davorghini": "Since you don't go to school anyway, did you get your parents to write that speech for you. I bet there were some big words that you had to pause and sound out slowly", "ghyacioh": "Sinceramente secondo me ognuno può fare quello che vuole semplicemente senza dover ascoltare regole sul inquinamento ecc ok le leggi per tutelare l ambiente ecc pero e eccessivo dire non usare cannucce di plastica ecc", "mny_dennis": "Idiots", "zstar.nb": "She's backed by media non of it is from here 🤦🏼‍♂️", "umar_khafizov": "Fuck off go to school and learn", "acinuajihme28": "Concern about ozone layer🌞", "shriramadaniya": "I don't understand your language but understand एन्वायरमेंट को स्वच्छ रखने की कोशिश कर रहे हो", "gra_alva": "💚🙌", "edudosreis.aricardo": "🙏💚", "thebeastofvalhalla": "Great speech, in fact let’s do all that as quickly as you want it and it will be amazing, will be like living with Coronavirus for the rest of our lives, locked up, unable to drive anywhere, unable to fly anyway and like you Greta can travel the world in our million pound yachts fucking idiot", "ichmagpommesya0": "Ich will nicht unverschämt sein aber unsere ganze Schule naja die älteren ab 8 Klasse denken das gleiche über dich das das total unnötig ist. Und du weißt sicherlich auch wie viele Menschen gegen dich sind DU MACHST DEIN GANZES LEBEN KAPUTT", "spilgrim1945": "How Dare You", "aldente_alexandra": "Mega cool 👏👏👏👏👏❤️", "isai.abdekr2003": "Greta fulfills my dreams something I would like to do for the planet.Thank you Greta you are like a sister", "bagas_surya02": "Thank you little angel👍👏🙍🙇❤❤", "officialx.mkk": "Shush", "ethanbeier": "I mean if the biggest governments in the world can’t contain a virus how are we supposed to trust them to change the climate.", "gourmetvoyage": "Você acha que teremos uma melhora no clima do planeta com esses dias de quarentena das pessoas em casa? Tem uma foto de Veneza circulando pela internet como se a água de la já estivesse mais limpa, é verdade?", "ginalolafalana": "You are the future!", "jamie_rjk": "🤮", "mary_so2005": "Great speech", "ibrokhim._": "🤦‍♂️🤦‍♂️🤦‍♂️пфффф", "tos0oe": "Грета Барецкая", "melineh.ma": "😡I hate you Do you know why? Because of all this disaster happened after your speech and governments have begun to reduce the number of people in the world", "rallfmaurer": "»the #roof, the #roof, the #roof is on #faier« :) <3 :)", "aveschuy": "Yes greta!!!", "batyrb9108": "🖕🖕🖕🖕", "petruscevic": "you are stupid you ain't going to do anything", "pbiingle": "You have great coaches teaching you what to say, hats off to you.", "mishaboss2000": "Lohushka😂", "calereadabook": "You are speaking a language I like to call bullshit, no one cares.", "tristatearea347": "😂😂🥴", "m.levada_bjj": "Pirralha comunista 🤦🏻‍♂️", "912e_ak": "I think you’re crazy. But at lest you clean up for me. in Alaska I do what ever I want. Shoot guns dirt bikes diesel trucks that I take all of the emissions out of. Btw trump is better", "neuro.om4r": "You built weird lmao", "poorhomiedylan": "square jaw square jaw square jaw square jaw square jaw square jaw", "w.j.s.s.1983": "Só gosta de lacrar kkkkk idiota.", "13danko": "Заткнись пожалуйста", "ernlp.aysbr": "Öhhh", "idolatrekombucha": "💙🌎", "isa_lw_haha": "@filizmarie15", "sala._boss": "🤡🤡🤡🤡", "maiza_daluz": "Cadê a Greta @mauricioarruda 🇧🇷", "jimmy_edginton": "Get back to school @gretathunberg", "helio_euzebio_de_paula": "😡😡😡😡😡😡😡😡😡😡😡😡😡", "taazweed": "Shut up please", "ajla_nova": "👏🏼👏🏼😍❤️ Greta du kommer gå till historien som en av de som räddade vår planet, om vi lyckas rädda den. Så stolt över dig tjejen! 💯❤️", "zavalyrot": "Ебанутая пиздес", "justus2131": "Was denkst du wer du bist", "emiliano.almaguer.75": "Puppet🤮🤮🤮", "friendorfoe219": "SPEECH Huh?", "etxebe04": "Alee ahí la Greta como la partee", "theogfarter": "You don’t make any sense", "vikkilowrey": "Here Here! Well said Greta", "lil_foreskin__9898": "You suckkkk at speaking your absolute trash and your delusional", "sergeimakarov01": "Hot transgender beautiful", "passed_out_brodoe": "How do you look 14 and 36 at the same time 😑", "vaclavskorpil": "🤢🤢🤢🤢🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "fox_moon": "Бля у меня овчарку так же зовут бля буду", "andreiramonov": "Мля иди джылом перекуси маленькая хайпушница", "malin_sk_": "Are you really 15-16 years? You look like 11-12", "oliver_miller_15": "Haha shut the fuck up", "lizamorris7": "Really good speech and I am reading a book about you", "gundersonzhana": "Go to Haiti, Mexico, Syria, Indonesia and do your ENVIRONMENTAL SPEECH to those countries @gretathunberg. That's where you NEED to be speaking and rallying against at.", "rsbagali": "😍", "jobe_77": "🤡", "very_crazy_girl_0": "Great speech. They need to listen and save our planet! We thank you! I am on your side!", "maxnewman_": "@mattiepearce", "xirclepulled_up": "No one gives a shit about ya fucking speech ya fucking fly on airplanes which causes pollution", "mokeeffe_": "Delete this swat", "dhuleep_": "All talk no work .shut the fuck up!", "sauvons_la_planete22": "i love you !", "_jake.p": "Hey Greta shut the fuck up", "noname_bmore": "😂😂😂", "ollstarr": "???", "drabbleguy": "The example of a house on fire is irrelevant, if it's on fire you put it out in the same way that if it was that easy to stop global warming we would. And there is also the seemingly unrecognized reality that these two issues are far from similar. She's not wrong, just needs better examples.", "tyre.christopher": "Go back to school kid.", "jan_luk10": "Du denkst auch du wärst die Schwedische Merkel alder äh Klima Klima äh Mimimi", "wiktor_matsson_thunberg_": "❤️😍 Greta. Wiktor matsson 😀😍❤️❤️❤️😘😘😘😘😘", "zazza85": "I sand to you all my love little creatures the knows exactly whot heppend in this world you can caounto on me my life is yours", "_._eliteonovaa_._": "You stupid girl", "pinegrenade": "well said👏👏", "mangoandrei": "Ba Greta....mai du te pe gheata ma@", "artataprils": "OMG! Thank you sooo much! I waited a lot of years for a comment like that! Instagram is better than a web site!", "its_l3no": "Great speech", "sagaanestrand": "Good job Greta👍 🌿", "julx_do_": "Dienstag for Diesel statt Fridas for Future !", "cowboy5871": "👎👎👎👎", "sentoza_6969": "Fuck off hoe", "art_w.a": "Who is manipulating you", "vitaliisediuk": "💪💪💪", "baruchavramshaul": "Greta, You have successfully accomplished what no one before you has managed to do nearly as well. You’ve caught the attention and interest of millions, as well as our respect and admiration towards your fighting spirit... which is contagious. You rock!!!", "mila__116": "🤢🤮🖕🏼🖕🏼🖕🏼", "alvarito_45": "Que repugnante", "abdullahyousaf1": "In case you didn’t know, there’s a virus killing hundreds of thousands everyday. Should we not deal with that first?", "viviancampfens": "@maudboegborn ❤️🥰💞", "musician_piano_player_": "Wise and intelligent young woman!!! Keep going!!!😉👍🙏", "svatoslav__": "Бля а ну іди нахуй", "kaja0171": "Hahahahahahahaahahh this is for stupid Western people", "amazingxavani": "CLIMATE CHANGE IS NOT REAL!!!!!!!!!!!", "kieran82625": "Wow imagine a kid stepping up what a cringey girl", "zaraacart": "@fukwiidit @staytuckd", "perseus121": "Please stop talking about things you dont understand", "damjan808": "you act good", "sena_6128": "🌍💚", "_ibragimovq_": "Greta when you go to the toilet do you use your hand? Or the clothes that you wear, if you have nothing to do, open the textbook !!!!", "its_ya_boi_strangekid": "Stfu honestly no one wants to hear a fucking 12 year old speech go back to the fucking kitchen and make me some fucking ribs ya whore", "paauwmitchel": "@tristanrietvelt", "my_name_is_connor_800": "КАК ЖЕ ТЫ ЗАЕБАЛА", "_bill_69": "😠", "zmarcelodias84z": "Vá te fuder menina isso que vc precisa.", "lea_heed": "JAG ÄLSKAR OCH INSPIRERAS AV DIG VARJE DAG!✊🏻❤️", "crankshh2": "Script reading puppet", "princeichan": "W🤣w.", "1979.k.a": "👌👍", "alexander_nagbe": "This makes me so motivated people should really get some sense in their head. #savetheplanet 🌍♻️🌏🌎", "moritzfellendorf": "Stfu", "boaventura.luan": "brat", "_s_k_i_z_e_": "Complaining haven ass it's how the world work stupid", "wesz.2k": "Fuck off", "turquois3_seas": "https://youtu.be/0bwLt_5t73g - type in \"Greta without a script to read from\"", "chrisraynephotography": "Children being used to push far left political narratives, that will end in the privatization of more natural resources and higher taxes. Thanks👍", "_philipp.official_": "Shit", "josh_baxter2": "No one cares", "hettie_thorogod_1234": "❤️", "nataliemaltsev": "😢", "williams_jmh_05": "Cállate puta", "ogredaddy3": "Keep speaking. You ain’t doing shit reading a paper that your parents wrote for you because our government don’t give a shit", "unitedstatesofwesterneurope": "Write your thoughts under the first post in the page.", "giovanny.e_14": "😮😮", "bonilhaluciano": "Will study and learn how to clean your ass. Stops talking nonsense and being manipulated.", "mansurov4life": "нюхай бебру", "klotzleonhard": "komm nerv nicht", "sam_h.a.n": "زارتتتت💩", "omarououououou": "Stupid", "fernandessydney": "These guys will never see it.. the ones who rule see calitalism...i appreciate yoru work...", "r_o_s_o_l_e_k_______pl": "XD", "reginald____flex9": "She shouldn’t be in this position. She should leave this to the adults", "milton_malmberg": "Shut up you are a hamburger", "mullally.robert": "Greatest talent at her age with high idealism & tact...🎯", "jackli7527": "Words don't make dream come true", "alexwu.1123": "她像小丑一样宣传无知理论，却不做任何有实际意义的事，竟然还被吹捧😂lol可笑至极", "habermannicholas": "Who is on your pfrofilr picketed", "hypergonadism": "I read the paper that my daddy writes while cashing cheques from Soros while ignoring the fact that my OWN country increased its emissions, because I am famous for being an annoying role model to introvert preteens. 🤪", "amanda.navinn": "💙", "drumstergroup": "♻️❤️🙌", "gusev.mik": "Пиздец . посмотрел эту дуру.", "_kieran_fotherby_": "How dare you, you steal my dreams", "_sophisticated_me_": "Just wow proud of you", "alexander_birch07": "Mabey corona is the think to worry about atm", "lucasbeemer": "😭", "__ar11_u": "great", "1.micheeellee": "omg 1.cuz lajka denna videon", "sasiiikann": "@____pack____", "a_roche03": "Shut the fuck up", "fffgggcfs": "@_davidbrant", "that.oreo.pickle": "🤮🤮🤮🤮🤮🤮", "sarah_h.b.r": "@andrea._blag._", "therealtrevorfo.x": "Reeeeee tttttt aaaaa rrrrr dddddd", "athilopes": "How dare u!!!! 😂😂😂", "edwin_lindberg5": "Its not a big deal😑", "mattshiddy344": "Why dose she talk like peanut butter is in her mouth", "sti.22b": "She talks so much shit", "_pxrkjiminn_": "@xalisax_14", "amimahal": "🙌🏾🙌🏾", "banann.a": "bars lowkey 😳", "charlie_mckay21": "“Hi I’m Greta I have no friends and pay money for followers on Instagram”", "xi_japan": "Niña el internet contamina el planeta", "shilohlemke": "You have inspired so many of us. Thank you!❤️", "matthew.wessels": "🚮", "thisishouwydoit": "Fuck you stupid child", "nilsson3333": "No 1 cares about nature", "lyapis_trubetskoy": "Чей ты проект??🙄", "dji_mavic_pics": "So mal soos n kol haas maar die wereld is gaande oor haar.🤦‍♂️", "bergqvistalma05": "The people need listen to you and do something for the climat! Don’t give up Greta, you’re strong👍", "its.fred5": "És uma merda vai te embora", "jtr253": "👏👏👏😢😢😢😢", "ce.li_naa": "😍😍❤️", "xleo_rgb": "How dare you", "pistacha_drawing": "Follow me please 🌹🌹", "emmaforever2": "I’m with you", "_noel_2409_": "Lost", "een_kleenet_menschenkind": "Old Song", "vladislavbogdo": "Иди нахуй в школу!!!", "hedbergalbert": "Save the world😍😍", "devpointlabs": "@pro ceisright19", "gymnast_roobster": "You are amazing ❤️", "obywatel_janek": "@maslotodelma", "max.mann_": "Din fucking autism barn fatta att dina föredrar manipulerar dig att de e någon jävla klimat kris, dra till skolan och bli något vettigt förhelvete.", "x.xorain.x": "Ameeron kee malala😂", "bitrock308": "2020: Non workers and failure of society called „activist“", "bahlimaster": "You are a Little vagina", "netflixfan__": "@ezgi8_dance 👏", "semihden1z": "Halt deine fresse", "4eyes1love": "Take out that paper and she will be nothing", "morgan._quinn": "@brooklyn.tannar", "varik007": "🤢 .!.", "ichalisher": "🖕ecohitler", "david.backes4": "🔥Sounds like the babysitter is correcting the bad behavior of parents.😢 But? 😮", "aussenrist34": "Заткнись нахуй и иди учись", "mrtlkv": "Abhahahah shut the fuck up greta suck my pee pee", "deme_demi": "Wow👏👏👏👏❤️🙏", "badboypopo": "Love your work Greta 🙏♥️ there’s a reason why they refuse to budge and take serious action - there are many dark and dirty secrets they are trying to keep hidden, the US in particular, and for good reason. There is nasty corruption spread throughout many governments around the world... they can continue to ignore us all they like, the reality is we don’t need them anyway.. we never did. Soon we will be taking matters into our own hands 😉🙌✊ stay safe!! 🤗♥️", "ccahblumatpac": "Тебе блять заплатили и заставили тебя это читать, чмошница малолетняя", "perry__das__schnabeltier": "The force will be not with you if you talk something that will never stops. So please shut the 🤬 up.", "peter.tdm": "Ugh", "_denis_87rus_": "Ебнутые!!! Займитесь делом!!!", "carter_ricks_13": "She’s brainwashed I don’t hate her I hate her family but I do hate her message", "austin_marvin88": "Liberal propaganda right here! Trump 2020 @realdonaldtrump", "jai_deep_": "We don't need you", "deep_cheema019": "She’s too young to feel about all this. I don’t know what is she up to but this shit ain’t real.", "igor.akanov": "Что ты полезного мдела в жизни.заебала уже всех🖕", "michael_bloomkvist": "Мдааа, с мозгами явно проблемы 😂", "shlomyd_563": "This girl doesn't believe in God", "jeffery____zhang": "种树去，要实干不要空谈", "john_gammeter": "This is dumb as fuck. 😂", "emanuel.kllr": "Shut up!", "d_weidert": "Boyan Slat>", "vladimir_balyberdin": "Greta, stop lie! Please stop", "genti_miftarii": "@qualibo Die Sharmutaa", "greekfreek77": "You’re a fraud !!!!!!!", "eromanick8": "What? Sorry I was chewing my steak", "ferabarzua": "Idiota", "meggie_the_miget_08": "So powerful 👏💚", "skeeter_memers1": "The Earth is flat", "agi__04_": "When you get to school, you will be able to know what you are talking about", "weslleybatistalima": "Bosta", "kuleshov986": "Заткнись уродина(Гретте)", "je_boi_daniel": "👎", "davidindicabudz": "What melted the last ice age?🤷‍♂️", "cedrikmachiavelli": "🖕🏽🖕🏽🖕🏽🖕🏽", "hoermster": "🤮", "zxcnm212757": "😏😏😖", "rowing_kayak365": "Иди блять учись!)", "anali_sa22": "Was kaufst du mich?", "killerkueen_": "I’m proud of this girl. Many young people aren’t focused on the right things. If you have a problem with her you are immature.", "connorrfranciss": "no one cares", "felu.krt": "So if u want to to sth vs the climate change, why do you use your Smartphone, which has got it's Energie from coal-fired power plants which creates also much CO2 pollution", "rizik.khl": "Shut the f up", "biggydibi": "She looks half dead :(", "zaharburtsev": "Речь отстой причём дерьмовый, удали", "mmhhsspp": "You are full of shit big time", "murlinkaaas": "juj nebreč", "_maxl_05": "🤮🤮🤮🤮", "big_hunt450": "Mentally unstable asshole", "agnes__persson": "This is a really good speech!! @julia__hagman", "_alexandergabriel_": "I don’t understand the earth has suffered 5 mass extinctions over the course of its time. None were ever caused by man made climate change. It seems as if the earth has cycles. The earth cleanses itself. Maybe were just in the middle of another mass extinction? Maybe it’s just nature running it’s course.....", "mr.vsevolad": "А мы русские с нами бог 🇷🇺🇷🇺🇷🇺", "kheranshuman": "Brat", "dbbdjdjrnrj": "Amazing speech!! 🌎", "ftte66632": "U even only talk and change nothing dafuq", "trooper_s3": "Halt’s Maul alte! Wir haben momentan größere Probleme als einen angeblichen vom Menschen ausgelösten Klimawandel!", "deletedaccdkskddbbd123": "go back to godam school the word is gunna end enjoy the rest of the time we have on this earth", "gk440gc": "FUCK OFF, RETARD. I HOPE YOU GET COVID-19.", "rudes888": "Great script reading skills !", "emilrog3692": "Пойду на охоту", "savegreenin": "All are trying to be speech hero. By speech possible to control climate ? Really funny concept", "a_a_ron_oldwomen": "Go back to school, please. It would be good for you.", "tildej20": "❤️❤️❤️🌏🌏🌎🌎🌍🌍", "max_a_16": "Stinkegreta", "puremagicbeing": "It brings me saddess that she is a puppet and no one knows the truth about her! It will come out tho and it's not her fault it's the people who are in her corner and getting into her ear influencing everything she is saying.", "nacho_clez": "Deja de jurar fama gretaaaa", "maya_lomerika": "@hakim_truth #follow", "justin.fkt": "Meine Güte gib endlich auf du Nervensäge! Du nervst die Bevölkerung einfach nur!", "edwin.whyte": "massive cunt", "letizia_menzen_": "You are amazing 😍❤️", "ok_did_i_ask": "Poopy butt", "ruslan__korol": "Всем похуй", "moditorino": "Kannst du nicht endlich mal die Fresse halten?", "levi_46920": "Gross", "johny_drama_": "Go to the school and learn much more about nature and biology ... u all , u r fucking idiots !", "yagoofroo_": "FUCKIN' GO BACK TO SCHOOL!", "skalasz1": "I really like you. But you change nothing. In time you will pass like tears in the rain. Earth doesn't need help. It solves every problem itself, like many previous problems. You should see it. Just open your eyes to history and you'll understand everything. Good luck.", "mix.dogss": "❤️", "kashap_099": "Задолбала уже иди побухай может мозги встанут", "iwi_aa": "blablablabla", "liukev1n": "bro stfu", "paris_smile111": "little girl teach the world how to live? go nuts .... why don’t you go to school why don’t you study .... another world politics and everything is in the money .... don’t distract people with your business, I understand that this is your family business ... but you still don’t grown up to give someone advice, study better and go to school ... does not complain about his life and does not complain about people and the weather ... millions of people are starving and dying and thank God that your parents are officials and stars and it is world business and world politics .... you would close your unpleasant face, a little girl like in horror films.", "scr1pt_clan": "How dare you!😂", "brian.larrain": "Sluta skolka och gå till dina SO lektioner 😂", "cornewitteeee": "@r.uben._ lekker de Audi van Bas laten brullen", "_thesugardaddy_": "At least learn ur speech before delivering it", "gangulaa1": "Сузе су ми кренуле....кад видим све те остављене облаке и капи кише....", "kelemen_tominno": "Could you stop her grandpa writing her speech over and over again ?", "say_3run": "Считайте мой коммент за дизлайк", "joe_hale234": "Like you only help yourself and scream at anyone who’s tries to help you", "cartiyayo": "You heard that ladies and gentlemen, “when your house is on fire you don’t wait a few years to put the fire out” - Greta Thunberg", "butters_actual_420": "Yep flying around and taking massive trains is very green of you, NOT your a dumb ass teenager being used as a political pawn being followed by naive mindless sheep , nothing more , you are wrong on every level", "janfazila": "👌 I hope we all make changes in our own capacity. 🙏", "kingsley.rpg": "@didee.gaspi oggi non é incavolata col mondo 🤪", "aimg338": "Im very sorry. Isn't she supposed to be in school, where the hell are her parents. My god what is wrong with this world. Plz somebody take her to school. This is madness.", "dndkkrtn": "stupid bitch you have no clue what you’re talking about", "berniesandersforallofus": "Future world leader!", "robertrobert7184": "👏👏👏👏👏", "danaradumilo": "Bla bla bla 🤮", "sofia.krusteva": "These are the parents ' sick ambitions. You must be crazy that you allow your child to leave school to talk things that will not touch anyone' s heart. It's just that people are thirsty for money.", "yanbagri": "An absolute legend", "babyinateacup": "Omg you are so great! You inspire me more everyday to burn more fossil fuels and destroy the environment, because if I didn’t we wouldn’t have you around to look ridiculous and give me my weekly fix of brain dead comedy.", "samueltansil666": "Nice", "johannes.mrtn": "Maul", "gazonokosilka.tt": "Эту швабру, уебать никто не может?", "quinakane": "Good baby have a kindness", "fullerton8272": "Fraud, scam retarded girl. Financed by Soros", "simone.tonnini": "Ah ma quindi ci volete tutti morti?", "its._.chan": "She needs a Newport and a straight piped Chevy SS 👌🏽", "jellycastelli": "go to school you retard", "79.leonida": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "yodajihad": "Idiot kid", "1.seaan": "Fucking bitch take up speech mic up your arse😂😂", "ayusoenardjo": "Europe is being ‘addressed’ by a child. Is anyone else even slightly concerned that this is even remotely OK? Why are people listening to a 17 year old Autistic girl who has skipped school, has no qualifications, has her FB posts etc written by her Father, an UN guy and is a front for the Communist UN Global Governance Agenda? The world's leading physicist (Freeman Dyson) passed away last weekend, and the press failed to mention that he was a prominent climate skeptic. Instead the European Parliament in Brussels focus their attention on a 17 year old with no science background. Europe is not the problem, so Europe can have you. U.K escaped, U.S Trumped, OZ Hates loud mouthed kids and ASIA builds new coal-fires power stations for the future. Why not see if you can get an audience with China, Indonesia or India? You are pushing an agenda to collapse Capitalism and usher in totalitarian, one world government. You don't write your speeches and cannot answer the most simple questions about your ideology? Watch... The Greta Thunberg Incorporated: The Exposé ... https://youtu.be/TTXdhTwO320", "paroika": "Идиотка!", "shay.cormac.1731": "Ur nothing without that piece of that paper", "orestis_51": "A rich crazy child will save the world..new order trash.", "ben.rs6": "Cool", "hydratedb01": "Cool story bro but did I ask", "harryy.cook": "Walk everywhere if you’re that passionate", "orrin_redshaw": "The earth is flat", "addison_plummer": "Can you shut the fuck up you dumb bitch climate change is shot and we’re just heating up from the last ice age. Your so stupid that you don’t know Jack shit because the time you could’ve spent in school learning it’s that climate change is a scam but you decided to be a dumb bitch instead", "russell2k4": "The earth isn't a home it's a fucking planet. It takes way longer for it to burn and climate change to take its course dumbfuck", "antonsmirnov2018": "Дура ебучая", "yessirnosirhi": "What are u wearing rn..........something that can ruin earth😐", "variztia": "Please read some basic Math and Physics, learn about the Greenhouse Effect, Climate Sensitivity to CO2, influence of cosmic rays, the IPCC reports (for example about the non-existent increase in extreme weather), and so on. Please stop spreading false panic and pseudoscience, and maybe go study something.", "mas_5219": "puppet", "_dheglin": "Nice speech written up by your fucking dad , you don’t know shit, stay in school and tell your stupid fucking parents to stop filling your empty head with bullshit.", "theokusetya": "Did your daddy write the speech?", "mane.off": "Please RU subtitles", "melanie.a.hamilton": "Don’t stop driving this forward! Thank you for your work!", "19dmitry9119": "Иди в школу доучивайся популистка малолетняя", "lauren_wuu": "Honestly her speeches really are impressive @_gabisaad", "og.spliff": "Come back to school 🤦‍♂️", "sistarelli.scott": "Ok but what they gonna do lol", "andrew.__.____": "Damn you need makup", "billypegler": "shut up stupid bitch", "sexocet": "Oh just shut up now you’re boring us", "hameeed579": "The ones paying you are the ones destroying the people creating viruses for depopulation.🗿", "gateskaiden": "Hairline looking like jo jo siwa, what is up with teenage girls", "annalizamarino": "Greta your presentation to the European Parliament had eloquence, intelligence and common sense. You are an inspiration to young and old. Annaliza", "paky_santana_": "Stai zitta figlia di puttana 😂😂😂", "matthewtheboss34": "🤡", "i_am_french_nobody_is_perfect": "La grandeur de la démocratie est de laissé parler ceux qui ont un dictact verbal. Est ce réciproque...", "cade__rogers27": "your literally 12", "bernardonickel": "Mimada e chata pra caralho", "can.otk60": "How dare you", "bikrammbk": "👍👍", "renj.a": "💯", "werkpapier": "Shut up", "gustalucas10": "You think you are in charge in the united states you are too small to be president", "fsenakorkut": "agzini yamultarak konhsma", "jaz_dpanabakerfan": "They better listen to u @gretathunberg your amazing", "dre_fitzz": "Bitch go to school you like 13 😂😂😂 @a_miller00", "evelyn_mairienkafer40": "Greta du wirds mit essel nur noch zu schule gebracht! Du möchtest das Politik sich ändern und zwar Umweltfreundlich aber du selbst hat kein Vorschlag wie man Umwelt und Industrie vereinbart. Europa ist ein Industrie Land davon hat ein Teil Europas ihre Wohlstand. Wenn sich komplett umstellt auf Umwelt schönung das wäre ein Rückgang! Und nicht zukunft orientiert! Ein Vorschlag hast du bist jetzt nicht ausser Förderung! Die man mit dem Industrie vereinbaren kann. Ein Vorschlag wäre besser wie man Industrie (Arbeitsplätze Erhaltung) und Umweltschutz vereinbaren kann und nicht ständig Forderungen machen den selbst nicht mal umsetzen kann!", "alfie_voice": "Did I ask?", "arvid.eklund1123": "How dare you", "riri.riri_riri": "Stop relying on other people to do what you want to do for you.", "thijmen_m": "@joeyvb_072 @boet_072 😍😍", "andre_quintela": "🌱🌱🌱🌱🌱", "jamescapss": "So are we all dead than? No people left on earth? Bc if u eat a meal and than watch a movie while your house is burning, you would die, idiot analogy", "berti87er": "Go to school.", "lotihoblefashion": "@29lorain", "ellinajohansson": "Snusk Greta kuk", "martin_120903": "#bullshit", "idealman7776": "Hey greta!!!! You dont speak for all people! Please keep me out of your evil, fear mongoring speeches!!! Fucking disgusting eco terrorists!!!", "nico.ebl": "Bitte halts maul keiner interessiert sich für dich.", "josip_nkc": "Please stop this. You can nothing change", "h.jan03": "Du hast doch nicht mehr alle Latten am Zaun!", "zwierzeta_na_swiecie": "😌", "abang_long_inamul": "Can i got your number madame 😊", "darker528": "She’s the lorax she speaks for the trees", "gaipanella04": "Its another problem", "iamjosema_23": "Sisi pero que si ganas tanto dinero dalo pa eso y deja de llorar con todo esto viva España 🇪🇸", "polski_typ_na_rowerze": "Ok but who asked?", "zaidisaid2020": "Au top miss.!", "bell_osama": "Vive tu infancia y no des mas por culo si no han hecho nada tampoco lo harán porque una niña lo pida lucha por la gente que no tiene nada que comer y la pobreza en vez del calentamiento existen cosas mas duras que si el mar se calienta 3 grados mas miles de niños mueren a diario por falta de comida y de medicamentos y nadien les hace caso y sales tu i te la hacen jjjjj acuéstate niña pija que te estas sacando miles de dólares por las tonterias que haces", "kacpi060608_": "Greta better go to school", "justaddbricks": "Great metaphor, really inspiration. I hope the world with act soon!", "david_gsxl": "#dislike", "johnny_wells86": "Boo", "cpey28": "🤡🤡🤡🤡🤡 #clown", "sandrorgoncalves": "👏👊", "insta.mxti": "how dare u", "halecenter56": "Go to your room!.. such nonsense", "makeitgolden": "I. Can’t. Hear. That. Word. ‘’Climate’’. Anymore. Thank. You.", "atreyikundu9": "Great👏", "juniorlee87": "Kinda funny how this kid is being used as a puppet but everyone “listens” because they’re so “woke”", "_.__.__.rosso__.__.__": "Clapped", "jelle_matthijs__": "How dare you", "nonixxx": "Politics make me 🤮", "irish_man_29": "How science effects climate???", "richkids__limited": "Please go back to school 🙌👏 and learn what is important for you.", "tom_hendrikse": "BOEEERRUUUHHHH💪❤️", "stuartnick01": "Would love to meet the puppeteer behind this poor girl who has been deprived of a childhood", "stefancantoriu": "who asked", "yaroslav_crimean": "Земля это наш дом мы должны не загрязнять водоемы не вырубать леса не выбрасывать мусор где попало вообщем делать всё чтоб наш общий дом земля процветал!", "sangalli_thomas": "Mercenary", "viktorvit388": "Она считает... А этой малолетней дуре есть чем считать? Она то школу хоть закончила? Или у неё дела пограндиознее, она неплохо живет и без образования?", "nathanpitre506": "This kid sucks.", "vialkov": "I presume they were raped by normality with no hope to end with this s**t.", "misterchiccocat": "@zerolalla", "stefavve": "C’ha accis noi abbiamo altri problemi 🤣 @ricciacla", "__cyyril__": "no", "sergiounreformedkys": "I'm not able to hate you at all even tho I know I should, don't ask me why ex dee. GL.", "matev75": "Dear Greta, Regarding the loss of habitat created by the climate crisis, the problem of desertification we have developed an efficient solution that can produce unlimited amounts of drinking water from seawater moreover, this oasis program even produces pure salt, and in this way it also generates a lot of money. Please, read the attachments for more information and if you have any questions, please feel free to email me! If you understand the positive effects of this project on the future of humanity, please send this information to world leaders who are able to put it into practice and want to do something about our future! Here is the concrete, great opportunity, let us reverse the desertification together, have enough clean water for everyone!! Clear Water from Green Energy - the Way of the Future; please bring the news to the people! https://drive.google.com/folderview?id=1h_idIw04BQ8U5cnlUCinyTgAvYrR3eoe", "skgupta.gupta.9026": "Dmdtmdbcmac👏❤️code", "alexgustafsson_": "Men skolan då:(", "elisa__re": "Okay, you are great at speaking and I admit that your speech is cool. But talking is not enough, we have to do something except listen to a young girl. It's amazing what you do, but we should all change", "__s.o.n.n.e__": "А я предлагаю послать эту Гретту подальше. Строит она тут из себя умную. Люди годами изобретают, открывают, исследуют- не получают ученую степень. А она тут расплакалась- всё, ученый!!! Ура-ура-ура! Родился умный человек!", "adam_gascoyne": "how dare you", "sorry_star__": "Stfu", "__s.22___": "HOW DaAREEE U 😂😂fs", "karl_beta": "👍🏼", "barzukaev_umar": "Ма ч1ох чам боцш таг юкх хьо, ша Асхабова Макка сан", "max_schelbred": "You are a meam", "the_botany_student": "😂😂 this world is screwed and I still don't understand why you get these jobs when there is someone with years experience and decades of knowledge.", "antonioo_guerrero": "#cringe", "sergioayala33": "Please follow me", "felixho621": "I am watching you hahaaha", "wouter.vdw_": "Maar niemand mag jou", "pieterhertsenberg": "@florisdeboer_ look!! Your rolemodel", "_.oxklin._": "How dare you", "pierisnapie": "Great speedsch", "_brendanlivingston_": "who what when where why", "maryslining": "👏", "misslaura_7": "Hey greta, what about 5G and chemtrails? Those do more damage than anything.", "jaund675": "Shut up bitch", "aidandibenerdini": "But the important question is How dare you", "charles_____________sutherland": "Wait but the world isn’t on fire", "cogiolino": "Good March 8 Greta, SMACKKKKK", "m.battendier": "Greta rilassati un po' 😂", "marcelfurtado1982": "How Dare You?", "valcanser": "Subscribe to me I'm an artist I don't have many subscribers", "surymc2018": "Back to School girl and learn more grampy 😁", "adkins.bryce": "“You said” “they said” is that really all you have to say?", "kkryszka": "😂", "prikpik_blutkut": "U got Asperger shut the cancer up💦", "ylmzaras0": "🖕🏿", "_liam_doyle_04": "@eoinnoone6 @shane_gallagher64 @matthewmaughan36 @_kyle_gallagher @eoin_mcdonnell04 @declan_langan_ no spoke no poke let’s go", "andreaairawan": "This kid is a joke", "theorypleeb": "GRETA, we need you to endorse Bernie's #GreenNewDeal and call out Biden's climate denialism while it still matters. Don't waste any time. The future literally hangs in the balance and we need the push. Joe is wholly invested in big oil and perpetual war. This is why Naomi Klein and Bill McKibben support Bernie!", "ali_mahamud31": "HOW DARE YOU", "gianisanagnostopoulo": "🌱🌱🌱🌱👏👏😊🇬🇷🌱🌱🌱🌱", "salar1218": "Go and do your homework little one. and try to speak less. Act your age. Like others", "ma01007": "0__707_909_1001", "smartwebdesignstudios": "La niña que vende humo y no una soluciôn", "t_pretel": "This girl has inspired me, going to make a change in life #MujerTeniaQueSer #AsiSoyYo", "save_.the.planet": "🌱🌎", "how_much_time_is_left": "Keep up the great work💪🏼🌎❤️", "sharipovaol": "Ебанута", "lambosedan": "Penis", "dietervenema": "Kech", "csadowski410": "TRUMP 2020 🇺🇸🇺🇸🇺🇸🇺🇸#MAGA", "gddnskfndr": "Love the smell of leftist anti scientific bullshit in the mornings😤😤😤", "amann.sx": "Wer hot dir ins Hirn gschissn", "onlyme.oofx": "Fotze", "katja.khz": "halts maul", "_proud_of_freedom_": "🐍🐍🐍🐍", "suddenlyabird": "Greta make a Molotov already ❤️ and join us in dismantling industrial mass society 🌈🔥", "lh_pilot_dincer": "You are a very stupid children,the Kids don't must to go to school .Belive me you can't it!", "_nikitozz1_": "go to school study🤣🤣🤣", "nandhadj_mnk": "As my part, I have an idea for increasing ice cover on cold regions, we can just modify the idea of @wangchuksworld ice stupa method, instead of making stupa, we can sediment soft snow by spraying the water in air at cold temperatures using motors. And for that we can use the wind energy which blows over those areas. Thanking you! Live and let live", "fridaysforfutureorlando": "Hello from Orlando, Florida! We strike as a united human family for climate action! Follow our page for more Florida related posts. 🌎🌎🌎", "bublzsoap": "im sorry but not to be mean but who dosnt call the fire department when there is a fire🤭😂😳", "tobias_von_p": "🥱😴", "cetintan1733": "🧠📽⏳🌎🌍🌏", "lion777_7": "😂😂😂", "lydavitiy": "You are bitch", "__fred_41__": "Молодец!", "manuel_diaz_mora": "Imposible no admirar a esta jovencita. 🇲🇽", "anita.nygren1": "👏👏👏👏😘😘😘", "nexerasibe": "😂", "toby_etc": "Celebrating International women's day and a beautiful young Scandinavian girl continues to shine Light on this 🌏 and cast away the dark shadows. 👏🏻 Thank you clever insightful GRETA THUNBERG. I know you will never stop. ❤️@gretathunberg x", "malikshan435": "Hy", "sebesta_pavel": "BRAVO Greta, amazing speech!!!👏👏👏", "daulet8077": "🤢🤢🤢🤢", "bayemalicksene": "Merveilleuse , fantastique et tout à fait trés formidable ! Toutes nos félicitations , et notre fierté pour l'impressionant , trés majeur et trés responsable , pertinent , et tout à fait pas si ordinaire ; trés intéressant discourt au niveau du parlement Européen à Brussels ! Nous vous souhaitons plein succé et beaucoup de réussite pour les nombreux voyages et déplacements pour les questions liées au changements climatiques et à la protection de l'environnement ! Nous continuerons toujours à vous suivre , à vous soutenir et à vous accompagné , partout où vous pourrez être , pas de souci pour la distance qui pourrait nous séparer , le monde est aujourd'hui un petit village vue l'avancée de la Technologie , et la performance des outils de communication ! De tout coeur avec vous pour l'admirable trés importante publication ! Nous encourageons la démarche pour la quelle ; nous sommes tout à fait en fase : la rencontre avec les plus Hautes Personnalités , dans les plus grands Sommets et manifestations au niveau Mondial ! Beaucoup d'estime et de respect , énormément d'amour et d'affection chére bien-aimée Mademoiselle Greta Thunbert , de tout coeur ! 💟💟💖💖🌱🌱🌴🌴🌳🌳🌹🌹🌼🌼🏁🏁🍹🍹🍧🍧🎀🎀🍻🍻💫💫☔☔☔👍👍👍✋✊👊👊👊👊👊👊🎍", "eexaan.ahmed": "CORONA HAS BEGUN", "shawerma_v_dote": "Какое же оно конченое🤦‍♂️", "cobus1": "What a idiot ! Listening you Greta is so depressing, nothing you do or say matters", "go.rdeev": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "vaithinadan": "❤️😍❤️❤️❤️😂🙌😂🔥👏😢😢👏🔥👏😍❤️", "byrne.kim": "Keep doing what you're doing Greta! You're a very bright young lady and the haters only hate because they are threatened by your intelligence. It's an ego thing! The world needs alot more people like you. Sending you love from Scotland 💙", "romahizmailov": "I'm in Russian I'll hold you", "lu_miere_rouge": "Gnagnagna", "danihastam": "🦠🤮🤢", "lenabrannholm": "👏🏻👏🏻👏🏻👏🏻", "naomimac84": "Stfu", "shuler.01": "Блять ребёнок иди в школу", "hop_siup_": "Ur shit", "eco_reusables": "Hi Greta and fans, So many people are complaining and protesting, let’s start taking action? It starts with educating corporations and organisations on how to become eco friendly, let’s start with these given they have the biggest influence and impact on us, individuals, please follow us in support :)", "soakupthesunman": "you know nothing about climate, law, nature, or physics, you class clown misfit", "nad.reeen": "@liklik34 Ini namanya Gretta, keren banget masih 17 tahun dah jadi aktivis climate change 😍", "lukemarshall735": "Oh oh scary oh oh shiver me timbers Shut up man", "kasmir.singh.1232": "Hi", "jake_harris_20": "😂", "__j1z.3z": "shush", "iasivol": "Vi älskar dig Greta, i våra hjärtan! ❤️", "_rickylr": "El calentamiento global iba a llegar de todas formas, solo lo hemos adelantado, ponte a estudiar", "risys9": "such fucking bullshit this kid thinks hes mahatma ghandi gonna get fucking enlightened", "vigil.is.beast": "Never cringed so hard in my life", "illyarusin": "Провокації", "joecat6969": "I’m always impressed with you 🙏👍", "vladisdive": "🤮🤮🤮", "ludocratis": "My pig is the real Hero. 🙌", "herba1957": "Why does this imbecile keep popping up?", "_top_978": "🐖🐖🐖🐖", "winniefey2": "Amazing! 👏", "s.longjohn": "👏❤️", "florentinomessner2019": "@81_johnny Mit diesen Worten wünscht Greta Dir ein tolles Wochenende 😜", "szymon_gawlowksi": "Go back to school you autist", "frederik.fast": "Fantastic speech Greta. Like all your other!❤️", "greenbullsaratov": "💚💚💚", "travelingphotography29": "You have no idea what you’re talking about girl! Stay in school!", "jasper_crawford4": "No", "luke_agnew": "Stfu no one cares", "_edvard_nazarbegov_": "Ae yleqal shiggaq", "angus_35": "Imagine giving a pointless speach", "pnumaticmike": "Fuck you, fucking bitch 🖕", "tamsin1961": "Brilliant ❤️🌏", "ilia.k1133": "given that you should study, and not go to obscure events where you don’t understand anything and don’t have specialized education. that is, your parents are not coping with their parental responsibilities.", "evachkkkaaaaaa": "это серьёзно кому-то нравится?", "big_buff_gorilla": "I feel like you need to mention how celebrities literally have the money and power to change our future", "eduardogoman": "Тп", "bigarne1": "Listen up Miss Thunderberg, u need to buy \"Beds are Burning\" by Midnight Oil. They were 30 years ahead of you but still wrong on the timeline. Do not fret, I have this all under control.", "decreasingeconomy": "Amazing", "_kingbarb_": "Wow wot a SPEECH you have such a way with words LOL 😂❤️❤️❤️", "andi.kohen": "Genia Total.", "copperbranchbrampton": "💚💚💚💚", "leila_ossi": "👏🏻👏🏻👏🏻👏🏻💗", "portiagermain": "Well said and that is exactly what they have done", "frhlynabh": "❤️", "human_volontary_extinction_": "Great speech austisto", "stevefontana72": "Trump 2020"}