{"lymedrogo": "@shelby_ronan @zennightsinc @jesse.barden @lymevoice @lymekhaleesi", "ryan_mailman": "thats only your world", "emeliemichanek": "🌟🌟🌟🌟", "luca.bhnr": "Fuck you", "jonny.merino_": "God let me fuck you", "dinks.andwhatelse": "My generation being brainwashed into believing the world isn't already too far gone 🌎✌️", "steph_houde": "Lol - the awkwardly long pauses ...", "fourthtrimestermomma": "@leonardodicaprio ❤️", "tinker8609": "👏🏼👏🏼👏🏼👏🏼👏🏼♥️", "ctisdall": "@seanmichaelt @stisdall", "gabicostafraga": "🔝🔝🔝", "123_abc_": "👏🏼👏🏼👏🏼", "sab_nguyen": "@kweedao", "pickursauce": "Powerful speech🖤🖤🖤", "annarulz24": "@igot555onit", "jojojojojojo_ralte": "Didn't she had autism?", "jones_2486": "😍😍😍😍😍😍😍", "bennyrossi_": "Good❤❤❤❤❤", "sebas.inti": "Thank you for your courage Greta", "kumul_nongo": "Oh my god! Thankyou ❤️😭 I will start to make changes in what little way I can. @gretathunberg Keep pressing foward! You are a warrior and we stand with you.", "cathlincanlas": "She’s the voice of the future ❤️👍and millions stand by her . #savetheplanetearth", "elia_by": "Why is she jerking the price off? @ardit.bel", "elven_york": "🙌 I'm one adult that's with the youth on this one. Great speech. This was music to the ears. Tell em Greta!", "alicednl": "@ribeiro_o", "mirshaonamissiontomars": "@didinotiti", "jessica.ruth.molina": "👏🏼👏🏼👏🏼", "heidi_scout39": "You have so much to give to the world, but people does not want to lesent. But what ever they said or do to stop you saving our planete , you must stay strong ,keep giving this wonderful message that you have. Because if not nobody will nerver save our dear planete earth 🌎 #savetheturtles #savetheearth #savetheplanet #savetheamazon", "hoorisltni": "I'm so thankful for your existence 🙏🌱", "gabyacon": "@gabifoures por tu culpa amiga !", "katierachek": "@khloekardashian", "itsjanehamilton": "my fucking heart", "arepocahontas": "You are so brave and so powerful in your words young woman. ❤️", "iamcassandrachloe": "@missmelania.g @chloegonon We have 11 years?!?!?!?!?!?! How come this is the first I hear of this WTF!!!!!!!", "montes.isis": "@rodhrly", "farahel.zein": "@kimkardashian", "davidmenchacaa": "@bumfightz", "danaglueckskind": "Everyone cries: rescue the world... but most of them still eat their meat, sausages or cheese... still take their car for every meter to go. Still throw garbage away on the streets! No one else can rescue the world. It starts with \"myself\". And if a lot of \"myself\"change: the world will change!", "linaamaja": "GOOSEBUMPS!!!!!", "libelllula": "💗💗💗💗💗", "kristina_litvinoff": "💖👏🏻👏🏻👏🏻", "alisonharrisuk": "@saskiachana @shireenact 🙂🌸", "miraaaaa7": "@boris9924 pogledaj ovo pa se zapitaj dobro", "jenny_anneli": "@theellenshow", "noworknan": "@teddygemmellhughes @_pleb.__", "jackyz_vegan_ara": "SO frickin' proud of you, young lady ... thank you for your strength and bravery 💚", "flyphoenixjackson": "I wonder if those in the audience really felt her... Maybe one or two... Unfortunately... I'm proud of her spirit, she and old spirits like hers are needed to set the course straight", "_bromann_": "@mr_boris_becker c’est de toi le speech ? 😹", "sofizirpel": "❤️", "clarizaefferer": "@monzaefferer", "gildabettina": "GRACIASSSSSSSS👏👏👏👏💖💖💖", "frikkyndead.inside": "noooo not she got it noo pls😂🤦‍♂️", "babetteluijten": "@richardvanginkel", "makingalifeilove": "God bless sister GODDESS! We stand with you.", "arantxa_pictures": "*our Planet", "instahan15": "@creads15", "raqaellaque": "Greta, I don’t generally comment to people that I don’t know but my admiration for you, your bravery, and your commitment to truth and justice compel me to thank you. Today I decided to tell my four year old daughter about you. We live in a rural setting in Colombia and she understands how precious our planet is and how people are destroying the nature that she loves to play in and learn from every day. We watched your speeches and she says she loves how you explain things. And she says hi. We support you and your cause, we too believe that rethinking and acting in a new unprecedented way will be our only solution to stopping the destruction of our dear planet. And we work towards your level of dedicated action every day. Our great gratitude to you.", "graceyone": "@trezposure @m_8e 🌏", "unique_empower": "Woow your brilliant and a great leader i admire you so proud of you girl 🙏❤", "saladgirrl": "@isaaccspiteri", "michellelllele": "You have impacted this world in a way greater than any money— or economy— ever has. Yes, the house is on fire. But you’re bringing a bucket.", "madein_hi": "@aspenpascua", "ca1alina": "❤️❤️❤️❤️", "magik_beanz": "agreed ☆ we are never better served than by ourselves. Stop relying on political figures and do your bit ~", "ritoue": "@maymurr", "nachhaltigkeitsbuero.huberlin": "Thank you so much Greta! This is a very very touching speech to many of us who been to the Hambi! It needs more clear words without anger saying stop what kills nature & harms humans, there is more than economy as it is...", "trisha.michaela": "@neeeeeeeeeeiiiillllllll", "emu.the.emu": "@goonihan she bad", "vilkenskam": "Tack för att du finns.", "vasyashapran": "Greate speech Greta! Didn’t know about you till today. You are doing great work and right work ! So proud that our planet have such protectors like you! Your words are so deep. I’m from Ukraine , and you know , I’ve even seen like of my friend under your video and it means that you’ve been heard even here and it is just amazing ! Because unfortunately very small niche of people in this country thinking about global , Earth , problems. Everyone focused on wrong goals, with politics situation even worse. Thank you, best regards 👍🏼❤️", "natalie.jea": "What a brilliant 16 yr old girl", "ketut_sintha": "🙏🙏🙏", "lola_descamps": "Waw thanks 🙏", "cristinacruznavia": "♥️♥️♥️♥️♥️♥️♥️♥️♥️", "peanutstorey": "@sjford_", "annylovesherlife": "@in_the_end_it_matters 😢", "jessicaverg_p": "@kingsmenz", "forough.saafi": "😍😍🙏🙏🙏🙏🙏🙏", "lillyotoole": "@danieldetrick", "karolindaguima": "@1mundoxver my girl", "detail.dus": "After her speech the viewers were able to win an SUV 🚙", "gg_viennapearly_official": "♥️♥️♥️♥️♥️♥️♥️♥️", "eco.x.warriors": "Im soooo inspired right now! Such a good speech Greta well done!", "_me.ne_vado.via": "👏👏👏👏❤❤❤❤❤❤❤❤", "chevy825": "Powerful", "izaemils": "❤️❤️❤️❤️👏👏👏👏👏", "taybayasin": "Wow!", "bhujel_sanjib": "@realdonaldtrump", "lhamhashtag": "🙌", "julielangdalandersen": "@peteringehan 🙌🏾", "illusionistd90": "🙌♥️", "ladykeef93": "@maureenmilne16", "badmoneypenny": "Please watch all these @family_ness", "godsgreengreenearth": "I'm in tears. Those celebrities looked terrified - terrified of the truth you spoke and terrified of using their platform to make a change. I hope many have been inspired to do better. 👏", "alexandraveronikapulkert": "Excellent! Amazing! We must stand together! ✊🏻🌸🌍", "hanjessica_": "@annareading__", "ancafeine": "Girl, you're amazing. Amen!", "mame.ibra.1008": "We are proud of you Greta.♥️♥️♥️ with yiur sincerity and Serenety Anytime, Anyway💚💛♥️", "tobymarshallofficial": "The greatest speech I ever heard!!! Stand up people, and listen to this. It’s very important.", "camillabrinck": "Wow... tack Greta för allt du gör för oss och vår planet!❤️", "uwisen": "Wow!", "lobeth.mh": "👏👏👏👏👏you are amazing!!", "alexandramornewyork": "@gretathunberg 🙏🏼👏❤️", "kellis159": "@siobhan.smyth", "rewath.chhetri": "@its.amnaali WE WERE TALKING ABOUT THIS JUST YESTERDAY!!", "unamidpen": "Amen!", "leuramusic": "@gaialovell", "nicolasdelamottelegrand": "You Rock!!!!!!!!!!!!!!let's all rock together!", "deggygram": "Yesss...👍❤️🔝", "meredithmarin": "@clairemthomas", "sofia.speciale": "👏🏼👏🏼👏🏼👏🏼", "stephaniejparsons": "@waparsons @julznh1969", "lifeasl1v": "@maximvdwal", "abcdeeefg": "@jpongasi", "puppy_lover_gms": "You are an amazing young lady", "amy.argyle": "@theedgeofeverything if you haven't already seen this amazing little lady!", "king.rnk": "The biggest crisis is islamaphobia u lost yute", "lena_sjostrom": "Fantastiskt 😍👍", "eloisejacobs": "You are incredible 🕊🕊🕊", "xdailyhorselife": "You're brilliant!", "natalimonica83": "Greta you amazed me. So young but such a big inspiration for people out there. Every single words that you said is true!!!! Respect. Hats off👏👏👏👏❤️❤️❤️", "hayles123": "@luce_coco", "la.pasita": "ANYONE can make a huge difference just by eating vegan. Anyone..", "nikole_et123": "👏👏", "shorties_for_hf": "I loved how you said all tgis,with cars from celebreties and 5 minutes later they gave another upcoming star a new car,that isnt even electric", "deysi__ramirez__": "👏👏 You are amazing! Congratulations @gretathunberg", "_amelie_1810": "It makes me sick that so many celebrities in the audience seem to take Greta's words as a big personal insult and won't reflect their mistakes (like traveling by plane, like Greta mentioned). I hope they felt guilty about their expensive dresses and cars and houses while the rest of the world dies. I really hope that at least some of them think about your heart touching speech and help saving the world!", "andrew_jho": "Is she German or Swiss or Austrian? I know that accent but I’m not quite sure which country it’s more dominant in", "go.green.yourself": "Greta you are amazing!! Keep going girl! We are behind you ❤️❤️❤️", "lizmorse_": "@raysta", "officialhendrawijaya": "Woww, such mesmerizing speech", "fathia__ahmed": "@mohamed_kadia", "boobspamx": "👏🏼👏🏼👏🏼louder for da people at the back", "taj_theartist": "Amazing !!! 🌏😍✨😭😭", "lunamoonthreads": "Politicians don’t care about this as they are probably old so their lives are already over. How about us, what will we do when our lives have just begun...😢", "angelica_jungle": "🙏🙏🙏hai tutta la mia ammirazione 🌱🐾🌲", "flora_v08": "You're a superhero😊☺", "aysehaych": "@dazzafromrussia", "nonecordoba": "@julimazzeo", "philippaborrowman": "@sarahmassss", "johana.mls": "🌷", "martapadeira": "@marianeumannoropesa", "tasha_gregoryx": "@charlottefothergill", "perspectivedepth": "Yes!", "imivonne": "Keep pushing for change. Your voice is heard. 🌻", "j.strauss27": "@mitchmeurot this girl is incredible ✨", "ezgihdemir": "💙", "eridani.francis.milly": "@mtkakarikigreen", "danielle_lione": "@terry.a.cornell @cassi_jj", "jesshuang._": "💜", "rowan.white": "@anguswhite_", "freaky_draw_": "Passez visitez nombreux", "sillysyll_": "@mattiamaino woah", "isabellharings26": "A true leader🌎✊", "puja_pankhania": "@rossatronic86 😳🙌🏼", "melodycarriilloo2": "A true leader ♥️♥️♥️", "roadshetravels": "@benwarrington man, I love this girl. What a total badass", "michael_peluso": "@shazia744", "modemarylou": "👏🏻👏🏻👏🏻👏🏻 Bravo 👍🏻", "artgallerybycogy": "👌👌👌👌👌👌❤️❤️❤️❤️❤️", "_dolmalama": "Tears in my eyes Hearing ur speech @gretathunberg", "mitte2501": "WoW...I am speechless. This speech is pure gold. Respect and let's fight together!", "hollyavington": "@realdonaldtrump get your ass back in the paris climate agreement", "armyadriani": "@hlmniaudy_ @selvy.ana @anastasyamarsela @widyctrnr_", "_shimmysammy_": "When a child is more sensible than adults, you know something’s wrong.", "gardens_by_design": "@gretathunberg You naikd that speech! Particularly the part where you said that celebrities dont use their voice to shine a light on out climate crisis as it would inflict on their \"right\" to fly around the world to visit their favourite restaurant, beach and yoga retreat. Looking at the faces in the audience I think it hit \"home\". Thank you thank you thank you for all that you do.", "familyofferns": "It’s interesting to watch this and see all the adults with such large influential potential, I feel like I can see in their faces that they know things need to change but don’t want to give up some of their luxuries.", "_jimispoe": "This girl is the most amazing human being on earth", "liquidbookshevles": "How can I help?", "ava_maurine": "You made the most logical explanation ever to save the world because it’s the only world we’ve got and the only world we have for next thousands of generations . Thank you", "phbookale": "«We live in a strange world...»", "juancarlosdelaccruzcastillejos": "Que grande eres.! Apoyo total a tu lucha desde Mexico", "arimormi": "@raachhell_19", "cm_mermaid": "✊🏻💚", "fostermurphy_": "What is the point of keeping the fossil fuels in the ground? So they can live happily under ground? Like wtf", "alinekeil": "@matheus_keil @_karesmatica", "meysam_keyhaniii": "🙏🙏🙏", "maximiliane.d": "What do you think of this price ? I mean the next winner has gotten a suv... that’s kind of an irony", "vonkanskonkan": "❤️❤️❤️", "sapinzon": "@ivanduquemarquez", "grasymirabella": "Mahhhhhh", "cristinahoede": "@papermeche", "t.hoesl": "💯", "loregonzd": "@caritordc", "rayito21210": "💚💚💚💚💚", "lukka.rom": "@finne.roen", "yxngxshy": "Why does she look and sound like the boy who keeps hacking icarly", "ecac123": "What a fantastic speech. What a fantastic lady 🕊", "smart_academy_pitesti": "Saying it as it is. What will there be after the lights and the claps? Will there be genuine support, Greta? I hope you will carry on, relentless and unstoppable, until we can reverse the damage and save our planet. Thank you for being sooo GREAT!!❤️", "mgranefelt": "❤️👏👏👏❤️❤️❤️👏❤️❤️❤️🌎🌎🌎❤️❤️❤️👏👏🌎🌎❤️👏", "this__vid": "ok nigga", "starstastic": "❤️", "kevin._.nguyen": "I like how we taking action on climate change. At least in Canada, the government are handing out tax money to large companies that make a high amount of profit that can afford to make their stores more efficient on electricity. They’re also adding taxes on fuel prices. There’s families who are already working so hard that are still struggling to feed their family and now they have to pay extra for something that (in my opinion) is ineffective, that what gets them to work. This is why I have mixed opinions on climate change. Are we pressuring the government to do something that’s not that effective on climate change?", "maxandmeow": "👏👏👏👏👏 keep doing you #amazing #wellsaid", "ttinarise": "@dr.shahirmasri", "cyrus.art": "Animal agriculture is number one cause of global warming and other devastating events that are happening. Animal farming and agriculture must stop. People must be vegan and leas to veganism. I recommend everyone watch cowspiracy documentary and such films to know how truly animal agriculture is hurting us and our future. Plus its the most selfish act to kill and suffer animals for our pleasure of taste.we simply can be vegan which is true love and care for all beings. 🌱🌱🌱", "trouble_in_disguise": "Eloquence and scientific facts? You have two things most US politicians don't", "zoeimmss": "amazing 🙌🏻", "stephaniehellberg": "You are amazing. Thank you for standing up for mother earth ❤️", "michelevillete": "Ohh my god she changed the world with that speak, yeah im sure know africa has food enought animals are living free and war not exist. Yeah she can sleep well tonight with her award and expensive dress... yeah its enought speak after an award about problems to solve them. Bravaaa claps to her !!!", "therealsarahspinelli": "I only want to listen to this little woman speak forever @charabp @og_gambocarto @emilycatherine573 @warewarestudio", "naturally_gwen": "@agnesdiamondsun", "lindarvidss": "👏👏👏👏👏👏👏🙌", "isabellassp": "👏🏻👏🏻👏🏻👏🏻👏🏻", "mirnamek": "Thank youuu❤️", "trexo0": "@daniellamatea", "khalid3lii": "I just start crying .. she is an angel ♥️♥️", "luannnachristina": "Sensacional 👏👏👏👏", "hannalynncamp": "QUEEN!!! I love you girl! keep fighting bc we’re with you", "theodorapan": "@mariamkass 💔", "hatertattoos": "Omg Amazing ❤️", "hhellber": "@ballatrazan", "laumantilla": "@agarrley", "tamara_balla": "@goraul7721", "mikkimay": "👏🏼✨😍", "christa.hodgson": "@hodgsonelle my man George was there!!!", "zucaurban": "@jacquelinerfcampos @je1207", "jonahaye": "@skye.r.regan", "ashhsa_": "@_noregretsgrets goosebumps", "jasmineinreality": "@masaihuntertv WATCH THIS😘😘", "bramko040": "Sluta skolka nu och skärp dig ungjävel", "lijanelife": "Thank you Greta @gretathunberg, I'm not words for describe my emotion and feelings when I listen you!! The world need to listen you in all languages. Parabéns Greta!! Felicitaciones !!", "saveourseas_sos": "Well done Greta! You would make a much better president than any of them🙌🏼🙌🏼🙌🏼", "soapoperaco": "https://www.etsy.com/shop/JdbReena?ref=search_shop_redirect", "__analima__": "@jordanestey1", "walterwide": "Vegan is the answer 🌿", "gabi_737_kulis": "So inspiring 😭😭😭", "brendagersch": "@gretathunberg you are such a good girl! What a moving speech! 💜💜💜", "silbermondauge.fanfiktion": "Okay...but if she had more influence what would she really DO to chance ?", "gzda": "♥️🍀♥️", "taraborkar": "@gurmehrmarwah thought you’d wanna see this", "letta_be_a_star": "Incredible!!", "dilaraendican": "👌👌👌👏👏👏❤️", "rosiescott_t": "inspirational 😻🌍", "samanthakattis": "❤️❤️❤️❤️", "emmafallgren8": "My idol!!!!", "hunterwell.s": "@jro.beast retard", "allthezeds": "@joeywiththegoodhair", "tia.b14": "@studentssayno", "youthinagreenwar": "We are so proud of you Ms. Greta! You have inspired our movement and so many young people in Canada so much.", "xiladif": "@mariotaenthoven @leilamcalister @farmerangusspier", "flifs": "@elena.spasov", "liziagopian_artesvisuales": "🙌💖💪💪💪", "cara.dreesen": "🔥🔥🔥", "kristin_the_third": "@leonardodicaprio", "rickyjank": "😂😂😂", "xisahuizinga": "❤️", "shojakhazaei": "😍👏🌷💙👍", "joaquina_manzana": "@mnailuj ella", "iza.syair": "thankyou for the inspiration 🙏🏻🙏🏻", "aasmasahotra": "@astro_nomi", "crisgenaro": "@gabicaraffa", "basch.tl": "@gymnastic_shit wunderts mich das du das likest", "khywn7842": "سلام شهرام جان ماکه نفهمیدیم چی میگه", "jayna_timmers": "You inspire people thank u greta for inspiring me ps. Sorry for my bad engles @gretathunberg", "r.uthyy": "Iconic", "anaferr.hdz": "💕🙌🏼", "dee_jg": "@jro.beast very retarded", "stinky_yellow_triangle": "I’ll drop everything and join Greta right now.", "abigail.makayla": "wow amazing", "mariana_del_peru": "👏👏👏", "ajosephpeterson": "@ptapping", "bilamare": "❤️❤️❤️", "mirjam_olivia": "@rebeccakesting", "robinhoodfuerarme": "And after That @volkswagen is giving a big SUV to the best newcomer - a bit paradox", "padel_by_magnus": "♥️", "timkreutziger72": "Ich hoffe das ist ein Aprilscherz dass die die Goldene Kamera bekommen hat...", "my.greenwardrobe": "Well done Greta! 👏👏👏 Keep going, the people are listening! Even if everyone would make just one small change, combined it will make a HUGE difference. 🌍🍃♻️🌳❤️", "jleighkitty": "@griffith3844 this girl is doing things🙏🏼✨💜", "marithaackermann": "Grattis!!!!!!👍😊🐵❤️", "chloephil91": "@ashleygurden have you seem this ? Amazing!", "kira.cauldwell": "@elliepudding", "petronella_98": "@feliciast0rm", "lobalinda.rae": "💐🙂", "miaclearyxx": "@david_bennett11 ugh this girl is amazing", "dieselpunkgirl": "And go screw yourself..... I'd never reconsider my position! I'm quite happy with my lifestyle choice! And out of principal now I wouldn't change even though years ago I was a veggie for a while! Sprouts are evil in any case! They are the devil's boogies! I know how to solve this issue, I'm gonna start a new trend that's gonna be even trendier than stating one is a vegan! I'm gonna call it shitgan! Where animals or plants aren't eaten but excrement is! There.....happy now?! Twat!!😠😋💩", "bozidara": "❤️❤️❤️❤️", "miah_kaitlynw": "You are amazing Greta! So proud of everything you are doing for our word and our generation! ❤️❤️", "s.e.re.na": "ma davvero ?😂 @notbizza", "hannschiiii": "You are amazing ❣️", "art_paula_marie": "@meoow_42", "least.waste": "Keep going Greta🙏", "luke_clarkes": "Damn 11 years all we got?", "itzorbz": "Making more sense than most adults and politicians. 💕💕💕✌🏽", "valentibarrios": "You’ve made me cry!", "kennet_ohlund": "Ett så helt fantastiskt tal och lysande framfört! Extremt imponerande!", "emelie_30901": "@c.e.l.i.n.e.e das is das mädel wo die brandt sich drüber uffgeregt hat", "ellie.angel.x": "❤️", "rosw637": "You're a such inspisration @gretathunberg ❤️", "dinalillian": "@marielife", "marielife": "@adine_gt @atlesoerlie @axeklafs @cathrineklafstad faen så bra", "juliette2112": "@warrenmcfarland", "knock_down_drag_out": "@randy.patrick", "hannnaholmbergg": "gud vad duktig du e ! helt otroligt :)", "fnolan08": "@firduantan", "priavmiranda": "Tapa na nossa cara, tão necessária!", "060marie": "❤️🙏🏻", "tati___su": "@oreshekhrumhrum", "mcq_": "@worth_simon i hadn’t watched this until now but even if you can only watch a tiny bit later, how great a speaker is she!!", "vgnline": "#govegan", "mamaharina": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kerstin_gerke": "@izaazariffin", "margareta_norberg": "SÅ BRA!!!!👌✊🌟👍🙌", "annikaharby": "Go Greta😍👍", "fck.jxnna": "KSKSKSKS❤️", "uleawesemeyer": "🙏❤️", "matheuslucinski": "@alexanderlucinski", "kate.harrison05": "@jennprattjp", "revistardverde": "👏🏼💚👌🏼💚", "karenkiten": "I admire you so much! And I love you so much because you foresee what many adult people don’t foresee. You’re very mature for simply knowing the basics of life, what’s right from wrong, and you stood for what is just the basic needs of human kind. Very simple, love and respect for nothing but our only home where we built our houses. Keep up the good work Sweetheart. Your voice is loud. Thank you for doing right, that’s more important than the kids wasting money on slimes that ended up throwing them on the earth. Thank you for very much. You are a very good example for the adults and the kids. Salamat!! And mabuhay! Well done kid!", "mmtheroadislife": "@jessmiaayala", "bi.yotch": "😭❤️", "iamerinreese\nVerified": "Verified", "j.lav.z": "@faridbooom @kareemc__", "elsadale": "😘❤️❤️❤️", "kira.marigold": "One of the most inspirational speaches I've ever heard. ❤️", "ana.campos2020": "🤩🤩🤩🤩", "_nicii_h_": "In wiefern wird unsere Zukunft denn zerstört? Was verlieren wir wenn die Pole schmelzen und es keinen Winter mehr gibt?", "leander_w": "Yeah those great protestants in the hambach forest that chopped down trees to make tree-houses and then threw their own shit at the police?", "fridasamek": "@emmedv", "higginscotter": "Awesome speech!!!!", "iamrieux": "@isabelle.munjarrrrrr", "erikachevellegrl": "Such a young, brave ,smart intelligent girl🌹🙌", "airamgalliani": "We want you on the top! 👏", "lheurecreative": "Bravo 🙏🙏🙏", "evyeriksson": "❤️", "mrsblissy": "@kellymcaron check this out", "raihanil.mutia": "@jennieaprsn", "carina_lonn": "❤️", "life.of.rosemary": "So inspiring thank you!!! 🙌❤️✨", "lucfct1898": "Your fucking 16 live your life", "yukina_513": "Nice to meet you Greta! I'm Yukina. Thankyou so much for your wonderful speech to people all of the world. Let's spread the Vegan life!❣️❣️❣️", "selinaxwaynex": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "anna_lings1110": "It was about time that someone is doing something. I personally have huuuuuge respect for Greta. Thank you for doing your best to save the world.", "mrsdestrade": "@theellenshow", "espacocoelholinsarquitetura": "👏👏👏 lindo!", "sarah282_private": "Wow you are so strong💪🏻", "rachelmarcohavens": "Bless", "resurebecca": "😭🙏🔥❤️ i really hope they would start to understand when there's still a chance to do something", "dasfraeuleinausdemwald": "Bravo!", "lilleyogahus": "Our Jeanne D’Arc .. You give everyone hope... we are behind You - and next to You... all the Way", "mariakaroliinan": "♥️", "mehmet.iskin.official": "👏👏👏", "yelizokur13": "@yldcaliskan Best speech ever 👏🏻", "bibiemireh": "Amazing wonderful I am in tears", "erniethebert": "Amazing Greta. Thank you so much", "feliceespinoza": "Wow. Ball!!", "nannyma21": "🙏🏻", "nataliaa.eng": "I can’t even begin to explain how much I love and respect you❣️You are so much more intelligent, wise, mature, and selfless than any of our world leaders. You make me speechless every time I hear what you have to say. We support you 100000% and I believe that you can change the world!!! Go Greta!!!❤️❤️❤️", "roam\nVerified": "Verified", "kimjonesx2": "Fantastic THANK YOU FOR WHAT YOU ARE DOING ❤️❤️❤️", "mrsheidiba": "Thank you for speaking the mind of hundreds and thousands of people! We need people like you!❤️", "carocollazoss": "Well said Greta thank you for inspiring us all. 💕", "amandajerners": "❤️❤️❤️❤️❤️❤️", "tordsand": "Lovely speach @gretathunberg 💖", "lina.elander": "@mickepettson Det var detta tal jag menade.", "fra_gello": "Greta, you're amazing. Thank you.", "platforminspires": "🙌🏽🙌🏽🙌🏽", "maaryi.chutney": "@mariagraziaburch", "theundergroundfunkycat": "🙌", "karre.nn": "@virginia_77_", "edwinr92": "@praxispty @costarecicla 👏🏼 vale la pena verlo", "sylvia.m.k": "Thank you, Greta, thank you so much 👏👏👏", "silviacrastan": "Well done! I liked the part where you told them that they fly around and want to go to the best restaurants. Exactly these people promote that capitalist life which destroys our planet!", "luthienben": "@helluvakhai Happy Birthday to us in advanced!", "sergioseverino_": "Such inspiring words🙌🏽 thank you for making the world listen 🌎♻️", "tydup00": "Hero", "breigeswift": "@loulabelle82 😘😘", "anormolie": "Fantastiskt!", "tania.guidolin": "🙏🏽 Please urge celebrities to promote climate friendly daily behaviour such as no more single use plastic & having their own cups, cutlery & bowls instead of take away containers ⚡️⚡️⚡️ we the people must act ! Our actions are the votes ...do not wait to convince politicians because we do not have time @gretathunberg", "kbrebz": "@joannietm", "_edoardosegatofigueroa_": "@alejandracorderoo", "anna.camnerin": "💪🏼 tack.", "vengelinski": "Please run for Secretary-General of the United Nations when you turn 18!", "asafthedog": "Preach ✨🙏", "ashleygarrod": "@helgiomarsson", "zomaaeon": "Brilliant🎯💫", "momio_redcat": "You are such an inspiration. You should be heard by the whole world. You are a Rolemodel for all of us. ❤️", "cdoninsta": "The smallest person in the room being the biggest person in the room. Makes me smile and cry and do more every time I hear you.", "kityfeo": "👏🏻👏🏻👏🏻👏🏻", "claudia_massaroni_": "@mileycyrus", "itsdanysgalaxy": "@gretathunberg 💗 I really hope you can help Pakistan , situation over there is also bad I really wish to do something but obviously I need found for it !", "missys_travel_life": "@tamsin._1 ❤️", "utrum": "What a great speech!", "piaaa.03": "Very good 😊 now I hope that more people are thinking different about travelling a lot around. That's an important point have never thought on yet!", "mitamoberg": "❤️❤️❤️❤️", "tottedotte": "TACK!!! 🌏❤🌎❤🌍", "esther_ibizaboho": "Amazing 💜💜...!!", "itsslotti": "@alexmx_23", "k_duub": "♥️♥️♥️♥️", "s.gisslar": "❤️❤️❤️", "annimailin": "YES", "nellewoodland": "💓🌸👏", "holidasies": "So inspiring!", "thedancingsun": "@lynnettekoki", "johannanomiey": "❤️", "mel.t_0505": "Ur such an inspiration!", "ohsyd": "Thank you 💕💕💕", "spacerover_": "well Greta, u are everyone's real superhero in this world.", "anaconstanzaracz": "👏👏👏👏👏👏", "yuchi_arte": "❤️", "eddan": "✌🏽👊🏽🌟❤️", "oxfamsverige": "Du säger det otroligt bra Greta! Tack för modet och kampen🌍", "aswedishcarpenter": "❤️", "sophievannoten": "@anouckvannoten", "heroes.for.heroes": "Wow! What a hero!🙌", "qilin.kirin3": "THANK U, U UNIVERSE❤️👏", "leo_lionheart_": "Got goosebumps and tears in my eyes. Thank you for standing up, for having the courage and for raising the awareness! Be sure, that we'll all support you ❤️", "gretaschh": "Go Greta!❤️❤️! #proud", "spinner0571": "Discours formidable. On ne peut qu’applaudir un tel courage et détermination. ❤️👏", "zaff_is_me": "Hei! Check out our services and our studio 🔥😉", "dicle_tigris": "👏👏👏👏💖💖💖💖Greta you are a strong beam of light. Never stop.", "loycem": "🌍❤️💪🏽", "twittloo": "Great Greta 👍👌❤️", "laurenmeii": "👏👏👏", "jiahui_esplendiyang": "🙌🙌🙌👏👏👏👏👏", "fredrikmholst": "Mighty good, Greta. / Messiah 🔆💚", "nico_chiodo_": "Ma vaffanculo", "crystalema": "@glynnfish2", "noplasticstraws": "My shero!", "_lisaklaiber": "Respect!!! Well done👍🏽👍🏽👍🏽👍🏽", "ishajhangiani": "@serenac05", "sgbsara": "You're are marvellous!!!! You're going to change the world", "johnnychangemaker": "💪❤️", "camillarekdal": "Fantastisk🙏🏼", "sinead_sheridan_": "@nadloumil @corinakofficial 👌🏻♥️", "aleemirax": "Non tenteva na pippa da fare perché è un cesso e si è messa a fare ste cose ma vatt a fa na zupp d latt", "sofia.w.c": "Du är fantastisk Greta!", "wannabemartina": "@whyklemmy take tje time & listen !!!!!", "mayleen_drl": "You honestly would be wonderful as our president of the world! You are so brave! Don’t give up,never. You reached so much! We all will fix this. Like you said.. There is still time and we are failing but we didn’t failed completely.", "peacelovegrow710": "😊😁👍🙏❤️", "lvty4r": "The hero we need.", "leonie_bttgl": "Congratulations ! You'r fantastic!!", "_.___.samira.___._": "👧❤👏", "valeria_alexandrovna_evgenia": "That brings nothing", "greenlfe": "We love you Greta 💚", "matthesbaust": "Bruh 🤷‍♂️", "palhed": "Tunga ord", "fabiefabie_": "Greta you're si amazing!! ❤️", "hi_my_name_is_kellyd": "Great job public speaking my love!! My worst fear is your greatest strength!! I know you will change minds, laws, and hearts for the rest of your life. You are a great person who will achieve wonderful things. Congratulations on your well deserved award!!@gretathunberg 👏❤️", "bymartinsdotter": "❤️❤️❤️❤️❤️", "xtinah01": "Go girl!!! Great speech ❤👏👍", "emmasirena\nVerified": "Verified", "sophjaxreed": "11 years 😱 @fayesian What about our kids", "roseneriksson": "❤️👍", "finalstraw\nVerified": "Verified", "emenic": "🙏👏🏼", "jini_pranivie": "🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏", "katarina.kaloczi": "❤️❤️", "vikenmdg": "💚", "maike_marion": "🙏🏻🙏🏻🙏🏻🙏🏻", "tdadde": "I will give you the key (Graphene).😉", "lara.ath": "keep on fighting! You are amazing‘🙏🏻", "kenito1000": "Eminem has joined Greta on climate change. https://youtu.be/plHn2pYRoMU", "chicco.jerikho\nVerified": "Verified", "x.slytherclaw.girl.x": "Great speech! Way more people should think and act like you.", "susan.song_v": "👍👍❤❤❤🍀🍀🍀", "swedenlisa": "💚🌿", "asicollaborate": "I’m in tears. What an amazing human being you are. ❤️❤️❤️", "nordic_of_nature": "💚🙏Thank you for being you and keep fighting Miss Greta!", "provinzprinzessinnen": "💯", "louisemccutcheon": "Amazing & Inspirational 💚", "jiye.suh": "The way she speaks is so powerful it makes me speechless...", "annkristin.art": "💖", "soazig_lvr": "Greta you are amazing ! I support the strike in France 👏👏", "luciamontes36": "💕", "ritonsrum": "✨✨✨✨", "_ukycc_": "👏👏👏👏", "thbcffzhbdrghbh": "😍", "rakel_magnusson": "Fortsätt kämpa, och vara du! Det är såhär världen borde vara, vi kan klara detta tillsammans!!❤️❤️⚓️⚓️⚓️", "takt_ticker": "🔥", "emineesawesome": "👏👏👏", "miatoressonrunemark": "❤️❤️❤️", "jael1957": "👍👍", "anouk.eileen": "You're speech has me crying. As an individual it seems not manageable and the ignorance of the majority of the population of the western civilization makes me feel angry, desperate and sad. From now on I will be more active, not just about my own personal lifestyle choices(which makes me feel quite isolated), but going out there and raising awairness. Thank you for all that you do. I admire your strength, your intelligence and willpower. Keep on. Someday, hopully soon more and more people will truly understand that we are literally setting our own house on fire.", "adamz_myth": "So strange Greta but you’re words give me hope ❤️", "littlehuntervintage": "@daniellepiat 🏹🏹🏹", "nea_0815": "👏👏👏💚💚💚", "alma_____rose": "U just made me a vegan", "thegreenmum": "Incredible Greta. I hope my children grow up to be just like you. Until then, I’ll continue to fight for their future 😢", "serosmoru": "@batifu @fuclaudio", "johnnyflans": "Just stop. talk about how you can help to fix the problems instead of the problem.", "saxon.winterspe": "This is bullshiza", "astroperson": "We are all taking action with Greta are we not?!", "doreenkistner": "Congrats Greta, you deserved it! Thx for your Engagement ♥️", "chinchintalu": "@javierrendonartista", "annatrubitskaya": "I just thought yesterday about close elections in my Ukraine and Israel with almost noone to vote and thought how better it will be if Greta will be president of the world.I vote you, not any other politicians!", "tove_hoglund": "Greta! Du är helt otrolig! Keep on influencing the real influencers 💪🌎❤️", "amymascardi": "@agusfaidella", "andrea.licata75": "great speech but wrong context?! https://www.tagesspiegel.de/gesellschaft/verleihung-der-goldenen-kamera-erst-klimaaktivistin-geehrt-dann-suv-verschenkt/24164272.html", "denisesmusic": "We need to help as much as we can. U are an inpiration", "tonye01": "@beadsbyzaza not too young to make a difference", "angel1salas": "i hear you and i feel this world dont feel the way we feel the importance to keep clean this world for our future fitizen, and most important change the way of thinking , big monopoly dowm few rich man are who decide our future", "clabeheva": "@ruizluisito", "shidolifestyle": "💚", "hozi83": "Wow Greta!! You are so intelligent and mature. You are the new voice of all humanity and hopefully other young girls/boys will follow your footsteps. Heja Greta!!!! 👏🏻👏🏻👏🏻👏🏻", "zahrarafaella": "Amazing! Someone whose speaches should be viewed by everyone!", "pattimomomo": "Phenomenal. Very moving and well done. You speak so well!", "rinahajrullahu2004": "💖💖💖😍😍😘", "paikea_rod": "🌎❤️👏🏽", "tant64": "Så imponerad av all kunskap. Bara din engelska är häpnadsväckande bra och att kunna hålla ett sådant tal utan att staka sig, tappa bort sig, läsa innantill. My god! Vad månde bliva av dig? Ditt liv känns ändå stressigt och jag hoppas du får all energi och feedback du behöver för att kompensera att måste vara vuxnare och klokare än oss vuxna. Oavsett hur du tar in all fakta är det du som presenterar och är ansiktet för miljökampen. Du är SÅ bra!", "aaronyoutherebro": "@josh_kennett @jaa.sson real shit", "katharinagrein": "Amazing Speech😃👏🏻👏🏻👏🏻💪🏻💪🏻💪🏻💪🏻", "redpoppyequus": "Love you Greta.", "joshfhill06": "Legend!!! 👍🏻", "spree_bogen": "😍😍😍Love you Greta 💪", "ceravera": "WOW❣❣❣ GirlPower❣❣❣Starkt❣❣❣", "achievinggreenness": "Go Greta! How many of those ‘influential’ celebrities in the room actually contacted you to ask how they could help I wonder 🤔🌍", "noah_the_lundehund": "💝", "natalie_visionary": "Such powerful words. Astounding young lady. Act now 🌊💗💛", "cheri.ewok": "@kerrydownes", "anandningthouja": "👸,,,👍👍👍", "crazyteacup": "Way too many great thoughts of people (especially at our young age) will never be heard... not because they don't say anything, but because \"authorities\" turn away and won't listen... I'm so thankful, you've found a stage and the audience to present your ideas to the world and therefore you have the possibility to really change something", "ashleighh.pxx": "We are a Small recycling reward scheme base business and we are starting to collect plastic from door steps and weighing them and exchanging them for rewards eg. coupons @bottled_rewards we are trying to go big upon social media so anything helps", "razmurpphy": "@anoousha amazing", "beorcauk": "💚💚💚💚💚", "mownaz": "@niagnou @simondeboeuf @louhannab", "julia.aulin": "Såååååååååå bra tal!", "pimperiotbuendia": "Ti amo!", "symp.thetic": "keep the good work❣️❤️", "likesch.flupst": "You are such amazing 🌱❤️🌱", "uteandreschak": "👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍", "suusja": "💛👍👍👍👍", "chiekouozumi": "Dear Greta 🌸You gave courage to me and others living in Japan to stand up for the world !! Climate Justice 🌸Thank you so much. I am a volunteer of 350.org Japan . I will continue to protest and act for the future.🌸🌸🌸💖", "ailucachela": "✊🏼💚 All the #vegan argentinian support! Really thank you for this and for all you' re doing! 🙌🏼", "babylxng": "Thanks Greta 💙", "ainhobilbao": "@txukum 👏", "annafents": "Greta, you are so inspiring. I could only hope my younger brother and sister grow up to see the world as you do, and challenge the generations before us with power and money to wake up and give a damn. It’s amazing how you so brilliantly tell it how it is 💕 keep on at it ✨", "hanna__equestrian": "@lilianbramley", "sara_hier": "🙌🙌🙌🙌", "shankyk007": "If there is no discussion on a particular topic then understand that the topic is correct ❤️", "mestmalin": "🙏🏽❤️", "anmtr_": "My hero", "von_wegen_anna": "Respect🙏🏻", "cerenmkuzu": "You are amazing! ❤️😢", "kamillapaulina": "Beautiful Soul ❤️", "merlington_": "❤️💕", "nerxhivaneceka": "👏🏽👏🏽", "ellenvingren": "Tack. Tillsammans är enda vägen framåt.", "tinadehex": "🌟🌟🌟🌟🌟🌟", "custodia.rocha": "👏❤️", "pirrepirtsu": "I would maybe know how to say this in swedish, but thank you for getting the voices of young people with dreams heard. ❤️", "esther_busch123": "❤️♥️😘💓", "jensterhed": "@emilyelinmargareta @verahedmo @georgieboy06", "bestr3dditmemes": "Was ist Erdöl  Obsolet", "yaggerr_tattoorr": "Greta ❤❤", "life_by_len": "You are Amazing 👏💙🙏", "thelonelywriter59124_": "This is beautiful❤️", "maria2002peter": "Hoch Achtung!", "sofiemothander": "Fina Greta👍heja 💖💖💖", "nouelina": "💖💖💖", "anna.blomberg": "Wow Greta, du är så stark, modig och klok!! Jag beundrar dig 😍", "e_v_e_r_y_p_i_e_c_e": "Du är fantastisk @gretathunberg ❤️👍🏽", "der.bremer1": "👏👏👏", "erik_spotting": "And after that They giftet a SUV To an actor", "claire_matheson": "You continue to drive me on. We are all with you.", "theadventuresof_bri": "@jacintamar2", "stellacleyo": "Awesome!!! 🎉👏👏", "invernadero.ilustra": "Thank you Greta 💚", "veganpoleoger": "well said!!! 💛💛💛", "_maarithaapala": "❤️", "thomas_ritchie100": "Yes dad amazing", "janermk": "Du är min största idol!", "jl.london": "The most incredible young lady, what an inspiration to us all ♥️", "frau_rau_": "Brave Greta! Please never stop fighting!!", "lindafagrell": "@rovilu", "anna_leat": "Queen", "jonas_frykman": "🙏🙏👏👏👏👏🙏🙏❤️", "audreyoart": "👏👏👏 Well done! Great speech! More people should face reality as you are. Keep going! Thanks for our future.", "jailineeee.castro": "@jimenezisam", "camillawallinolofsson": "Jisses, vilken tjej du är 👍👏👏👏👏❤️", "spencerudd": "Yess", "melissabalin": "#ItsUpToUs! @gretathunberg #WellSaid #klimatstrejk", "gita_meh": "I love you my child, you are the dearest thing happening on this planet 🌎 we are the residents of the Global Village. No borders, one earth 🌍 🌳💕", "hpantz": "@s.smolenski shes my hero", "suarex81": "Greta thank you for having the courage that none of our politicians have. Keep it up we are behind and beside you!!!!", "its_bish_": "Are you honestly trying to say that world wide, this generation is not on track to be the most contributing to this problem. Sure we haven't done as much damage yet, but we haven't been around for as long either. We are so reliant on things like electricity, that if it wasn't for us, there would not be such a big issue and it wouldn't continue to grow as quickly. Just look at the mounds of rubbish left behind from all of the school strikes world wide. Stop passing the blame and just accept that no matter who's fault it is we still need to live with it.", "bioworxasia": "👏👏👏 You are AMAZING! Thanks you!", "yollasiva": "❤️❤️❤️", "santiagobadillodelcerro": "@zaitchinsky esta chica me decías.", "mrm.yo": "Do u eat meat? Have you talked about the severe threats meat has on the environment?", "sherihoweart": "Thank you Greta!!! I pray that the elders can hear you and the rest of us who have been speaking out about this for decades!! You are indeed right! This is your inheritance and your great burden!! Be strong!! You are the future and if the future looks like you then there is surely hope!! 🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻💚💚💚💚", "leleveloso": "Amazing! Thank you Greta! 💚", "sebasyelo": "👏🏼👏🏼👏🏼 brilliant speech!", "khrisevangelista": "@dylevangelista 🙌", "caylie_chapman": "@aaron_grayson101", "evaqueenofkings": "So incredibly inspired by you young woman ! Thank you for your bravery, truthspeaking and grace 👊🏽💕 & thank you for speaking loud and clear! 🙌💕", "dunkyourtrunks": "Greta, we now must REVERSE climate change. We are already IN climate change.", "jornada.minimalista": "❤️😍👏", "dinara245": "🤗🤗🤗😍", "magliofederico": "DDondo hb j", "jtlong66": "@christybsch", "mandisuita": "👏👏👏👏👏👏", "lia_pallone": "@hellenitaly listen to her", "elsalozano": "@natyelizondo @gretapenagos @dhphotoblog me fascina esta niña! Y su speech demasiado conmovedor 🌎💝", "geun._.ha": "👏🏻👏🏻👏🏻👏🏻", "domipardol": "👏🏾👏🏾👏🏾👏🏾💙💙💚💚💚", "nathalie_fransson": "Starkt!", "the.vegan.baker": "@the.microphones", "sdsharma96": "Legend 🙏🔥🔥🔥🔥🔥", "hidlynne": "@rick_read", "embranna": "@katebranna she’s my hero", "ryan_from_earth": "Tremendous wisdom, thank you.", "big_x_cy": "Better go to school and educate!", "huguette_gallo": "♥️👊🏼", "laurynschneider_": "@gracelowe09", "___toasty___": "You are an inspiration.", "guzelligeaskartvanc": "Hak ettin. 👏👏👏👏", "lily.kwiat": "Omg! That was so beautiful I cried!😭😭 And so true.", "cleaneats_company": "What an incredible human being you are! Wow! I’m completely blown away by the power of this speech ❤️", "lu.ferreiro": "@lluvia_marin esta piba va a salvar el mundo, no tengo pruebas pero tampoco tengo dudas", "raelenekoot": "🙌🏼🙌🏼♥️", "jerome_power7": "@michaelflynn101 Tobin on the ball with the plastic bags", "chloemarine44": "You are amazing Greta 😘", "jositarios": "🕊", "gerdsland": "⭐️🙌🏻❤️", "emilie_carlsson": "Du är fantastisk!", "aja.lake": "💓🙌🏼", "maddie.norr": "You are amazing!! You are going to do so much and you are so inspiring! Keep doing what you are doing!! The fact that some people don’t even realize this is ridiculous", "monsweetness": "@anavanpelt @j_ul_z_ @itshimi", "abdo.boulbadaoui": "God ❤️", "rosarioleonc": "🙌🏽👏🏼", "alfonsosurf": "Thank’s ❤️🕊 Greta💐🌍", "gwenavyre.v": "Important words", "annanilssonsala": "Fantastic!!!!! 🥇 ❤️ You have open my eyes. I will take my summerholiedays in Sweden from now. NO more flying. Thank you.", "bina31018": "Marvelous", "stimmwolke": "👏🏻👏🏻", "zenrowing": "I want to be you when I grow up. You are an inspiration to me and all the world. Thank you for your strength and courage. ❤", "mariabattaglino": "You are amazing Greta !! Better future !!⭐️⭐️⭐️", "psychedelic_honey_": "🙌🏼🙌🏼", "wonderful_toys_pictures": "Thank you SOOOO much!!!", "brigidaliima": "❤️❤️❤️❤️❤️❤️❤️", "rileysloot": "you are incredible", "free.from.mind.control": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "sweetdelia": "@gretathunberg We are with you ❤️❤️❤️", "thinkbigrunwild": "You are the only person who really speaks the truth no matter who the audience. Thank you! Keep going and we will do everything we can to get more people to listen and face up to the truth. 👏", "postcards_from_a_life": "I’m speechless! Luckily you aren’t", "amamae.rocks": "Great words for a better future", "apaula_carneiro": "@rickfilho essa ativista que te falei! ✨", "all_about_adriana": "I see all of them watching so seriously and focused. Like, really touched. But I can’t find nothing about Greta’s speech on their Instagram-Accounts. For example @jessicachastain #jessicachastain or @karolineherfurth #karolineherfurth :( why? All I see, are spring-pics (oh wow, we still have good spring 😊) make up stuff and advertisement for you movies, or just yourself. #celebsforfuture", "elisabetcollin": "En underbar människa som vi alla gläder oss åt, för den hon är o vad hon gör för oss o planeten. 🙏🏻", "siwsko": "GO @gretathunberg GO GO GO!!! BARA DU HAR GÅVAN ATT FÅ VÄRLDEN ATT LYSSNA, VARA DU!!! ❤❤❤❤❤", "gunillaasons": "❤️💕", "viictor.jv": "Congrats🎉👏☺️ we're a little bit closer to evite destroy our futures❤️", "enje_jawher": "@vianhamakarem nana aw kcha 3umri 14 sala labo environment ish daka, gchkatrin kasa labo Nobel peace prize nominate krabit.", "ceara.ha": "@fonoti_80", "pri_pri91": "@emehh_l wow!", "xaviera.molina": "@caritoaah", "kathyfreston\nVerified": "Verified", "emana_ost": "What a brilliant speach! The people actually looked like they were listening and like they may care", "sonsuz_sarki": "If we want to win the climate war, we need to make sure that Commander Greta reaches more people. For this, we need to duplicate Facebook, twitter and instagram followers. Because this is the war of good and evil. Why isn't Greta's followers more than Trump's followers? ... #ff @GretaThunberg", "ash___white": "♥️🙌♥️", "veritytarsa": "Wow 🙌 @maciejtarsa", "wa.g.v": "Heavyyy speech, respect.", "____barbi______": "❤️❤️❤️", "jannicalehtinen": "🙌❤️", "bbccrr": "Amazing words ❤️🌎", "josemiroig": "@17danicarbonell", "doctormal__": "GREAT GRETA SHOULD BE PRESIDENT OF THE WORLD AND RAISE AWARNESS ABOUT CLIMATE CHANGE!! People we need to start helping the world 🌍", "krusidullen_i_krusboda": "🙋😃👏👏👏❤️", "flinalein": "@her_name_is_lea", "katharina.wgnr": "👏", "bodilbergmark": "💚👍❤️", "lexihutch": "You are the 21st Century’s most promising hero. Brilliant 👏", "be.sol.love": "@mental_kace", "wendy_veronique": "Brilliant! Please bring your message into Afrca. We need your intelligence and voice 🙏🙏🙏", "verenastn": "DAMN", "lennartoe": "❤️❤️❤️❤️❤️", "dobro_v_tvorchestve": "Ты потрясающая удивительная девочка ! Спасибо тебе😘", "kristiinkvam": "Wow, liten jente med store budskap❤️", "mrglans": "❤️", "linagow": "@iamsouz @sophieantonie_g", "eiraimyrseth": "🙌words", "mrs.loudsong": "@lauraxgrn", "basarfeldkirchen": "Good words..but only words...how can you accept a price sponsored by the leading industry destroying our planet?", "vicky.chavarri": "👏🏻👏🏻👏🏻👏🏻", "shellseaface": "@whiskey_monstah", "southhandcrafted": "Keep going Greta. 👍🏼👍🏼👍🏼❤️❤️❤️", "primallerina": "Such an excellent and powerful speech! I hope many ears will hear you and start thinking, changing and raising their voice too. Let’s keep going 💪🏼🌏❤️", "emilyyrxsee": "So young, yet so well-spoken ❤️", "helenmarylairg": "@shedprojects @bleecker.bob", "tiffany024": "Loveeeee this amazing little bright light in this human is so beautiful", "almalieckfeld": "🙌🙌", "unyouthfinland": "Amazing speech! 🙌🌍", "msthereseday": "🌷🌷🌷", "criscrass00": "What a beautiful soul🙏❤️", "julienmagic\nVerified": "Verified", "thegreenbeautyblog": "Thank you of reminding us to do sth! Everybody of us!!! 💚 Doesn’t matter with what we start it matters that we start to safe the planet....", "maarie.hei": "Respect!😧❤️", "linaa_rire": "👍🏼🌱", "lotte_wue": "Great speech!!", "wildblueyonder._": "Yes! Truth! So well said! Love the comment about celebrities not caring because of jet plane vacations. Your Amazing. Thank you for being a strong clear voice for the earth!", "stillnessdk": "How can We share this on Facebook?", "diegodelareguera": "I don’t now why everybody is clapping, they should be shamed.", "daniqueisaromanie": "@luana_nadine", "equinale_horsefilmfestival": "👌💕 Youth rocks the world 🌎Bravo", "dunialeonor1234": "Congratulations! It was really a good speech!", "mary.garetto": "👏👏👏👏@gretathunberg", "madretierrasalvaje": "@o_scarlos", "mightymoa": "Tack för att du säger som det är! Du är bäst! ❤️", "_.herah._": "YOU ARE JUST AMAIZING!!!! PLEASE KEEP RAISING AWARENESS EVERYWHERE TO EVERYONE💜", "marmianis": "❤️", "nin_gamer07": "Wow Greta! You show all the environmenally unfriendly people especially politicians the serious situation of our planet. You're doing an incredible good job that others should be guided by. Your speeches are better and above all more meaningful that those of many politicians. Thank you for the clarificartion for much people because it's still sad that much people for example politicians had only money in their head. You are an inspiration for all of us, you are not Greta, you are Greata! We all have to protect the earth because we all are guests and we all must leave a future for the generations after us! It's defenitely not too late as you said! Please keep it up Greta! 👍❤️", "aandwforever": "Good for you on believing something and doing something about it", "livnet30": "👏🏻👏🏻👏🏻👏🏻", "edvelinjessica": "Pena que não tem legenda em português / outras línguas. 😢😔", "antoine_foucher": "@clarabzll c’est dingue... tellement vrai...", "josephine.lbr_": "You should have to whole world behind your back. You have our heart and our support. You are smarter than the people we call our leaders.", "truespiritedvegan": "Well done @gretathunberg you are a true legend......much respect to you", "leiand1": "Good speak Greta 👍", "ellejobs": "@andershmk", "chrysaster": "♥️♥️♥️", "misensfoto": "👏👏👏👏💞", "pierre_simonsson": "Wow", "mary_diemmy": "Wow😍", "blondishme": "Grace just emanates from you. You are indeed a blessing. You deserved a standing ovation but the truth hurt some of them. 🙏🏼", "lind_mer": "@evysspammmm", "apa322": "Just amazing !!", "sliwakk": "🙏🏼thank you", "shannonomertasch": "@the_ascher Rhiannon", "luzardosierra": "❤️❤️❤️❤️❤️", "moon_whisperer15": "@analuciasierra", "lakrisfantomen": "Go Greta! The world needs your voice, with you we will unite and change the world, togheter!❤️💪🙌", "borjaduran_": "🌏💚🌏💚🌏💚", "emely_rabea": "You are the best woman at the world😍", "anna_ueberschaer": "Thank you Greta, for being who you are! ❤🌎👏", "einfach.toeny": "you're the embodiment of inspiration and you should be a role model to everyone. please never stop fighting and using ur voice!!! 💚", "pranswear": "👏👏👏👏👏", "joshua.zyx": "nice SUV 🤣", "adriana_fortheplanet": "❤️", "ronnerback": "❤️❤️❤️Greta.", "lildroni": "👏👏👏👏👏✨✨👌", "_rizzato_riccardo_": "Is true that you abolished Fridaysforfuture?", "leonixgl": "@emilyvverona", "poppypersonaldevelopment": "You are a true Heroïne and more of a Leader than many adults nowadays. Keep following your missin Greta and please keep kicking our consciousness! 🙏🏻💪🏻", "thewhman": "Full support here! ❤️", "ayad_love_": "هجم بيتج ماخذه اعجابات لو مليون سنه محد ينطيني بكدها😥 وللكلاب حضوض😂", "vitor_ferrap": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "mme_jum": "💡💡💡💡💡💡💡💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚", "zanderwoman": "@zanderrick", "knitrag": "Alltså wow @gretathunberg! Du är verkligen så grymt duktig och inspirerande!! 💪👏😍", "tureolssonahman": "👏🏼", "mariawalnut": "The point is: we are doomed. Nothing is going to change unless we change our own lives. We celebrate the messenger but most of us ignore the message itself :(", "lottasm": "💪🏽👏🏾", "nankani.rahul": "effective way of life...", "lugaiganis": "Your words have touched me, it's so sad.", "federica.ricciardelli": "Much respect for you, Greta: you're still young, but you're teaching life to adults... adults who are destroying our future. With your maturity, you make me speechless every time. GO GIRL! Support from Italy 🇮🇹", "gaia.lvg": "❤️❤️👏👏", "alexavids": "😍", "bergerutbildning": "💗👌🏼💗😪🙌🏼🙏🏼☮️♻️", "matti__l": "👍👍👍", "mmaryam8828": "I dont eat dogs, gush no...I Love animals,...u should watch Mamdelmannsgård...Swedish serie,...to see,...what is life....Google them watxh thephotos", "ayannacezanne": "Thank you so much 🙌🏾🖤 so much love in every word of truth you utter", "mindfulnanay": "@kwhy04 Swipe to watch full", "josephinejohansson": "You are amazing!❤❤❤❤", "margheritazippo_": "si", "floridarescuefarm": "Yes", "annika_wikstrom": "Fantastiskt bra tal på alla sätt!", "lucia.bortolami": "You're such a role model and a great inspiration.❤️👏", "maxad.michaela": "Go Girl🙌✊🏻💕🌱", "the_endless_j": "Thank you", "ailineriksen": "So impressing, Greta! Rooting for you and the climate 😀", "budderbrotundpeitsche": "🙌", "tondo_circulareconomy": "🌱⚡️👏🌎", "ebonys1956": "🌏💗💚👍", "ekpr": "👏🏻👏🏻👏🏻👏🏻", "schoko_baerchen01": "The best speech I've heard since a long time. You've made people more aware of the gravity of the situation than any politician. You do such a great job for our generation's future. #fridaysforfuture", "b_boshoff": "❤️❤️❤️", "tiinaeriksson": "🙌👏", "steff.luque": "Greta you are truly amazing", "glittertind1": "You're fucking incredible.", "gardmosonnergaard": "💚👍🏽💪", "francesca_murone_viaggi": "You’re GREAT! Thank you 🙏🏻", "backstrom_hagelin": "Thank you Greta❤️❤️", "ale.thea_": "An inspiration", "matiasasun": "Si ayer estaba convencido hoy lo estoy el doble. Por Greta. Por todas las Gretas.", "mama_mukti": "@gretathunberg You are truly #toocoolforschool 🙌 If your voice can’t change the world, nothing will. Thank you for being you! 🙏🌍🌱✌️❤️", "nadine_c.s": "@cornelius_1212 ! Ich wünsche mir so eine Tochter! Sie ist stark ♡", "fitooba_": "@gretathunberg you are setting an example for all the people our age to stand up for what truly matters, speaking as clear as someone can speak, and remembering us that fighting is still an option!! Greta you represent courage, accountability and hope! Keep doing what you are doing and we will stand up next to you❤️❤️💪💪", "mai_yasss": "I wish you all good luck Greta!❤️ I wish that some day we can meet and change the world together!! We don't got a planet B, the ocean is full of plastic, the forests are not a bin! We can change the world if we stand together!! I've been have been interested in the climate change for like 3-4 years!! Our generation (10-30 mabye) need to stand together, seriously!!♻️. 🇩🇰From a girl from Denmark🇩🇰", "ninaschwarzbach": "You have so much vision and courage 👏🏼", "marialorenarosales": "♥️🌱", "fridaysforfuture.miltenberg": "This was soo good👏👏👏", "ubbelius": "💪💪💪💪❤️", "justmesandi": "this shit is so true😍", "nette_lifebalance": "I love you Greta😍So proud of you😊", "mvrivmhvssvn": "Goosebumps, the poise and grace with which you talk and the eloquence of your words astounds me. You speak only truth, now people must listen", "mirjasnider": "🙌🏻❤️", "meghanjalirao": "@__freak0ne__ @sunnymewad if you trust me guys please watch till the end", "honeybeevancouver": "@megannicole1983", "madelein_beljaars": "🌍❤️🙏!!", "ingridgerstner": "excelent speech Greta👏", "that_annoying_activist": "@ellenbergstromss", "happyhagy": "Plz, people. Save clapping for when the speech is over. Words like this shouldn’t be interrupted.", "sabri_cangiaso": "Ella @diegoagustinvalentin", "beyooooooonce": "💖💖💖💖💖💖💖💖💖💖💖💖", "lyckobackens_levande": "@mathiaspettersson_ ❤️", "haaaa._p": "Same here in hk.", "florgomezgerbi": "You are BRAVE GIRL. Thank you 💖", "dalmatianmom7": "Du är grym Greta ♥️", "hobbymusiker1984": "You are a great role model Well done👍👏👏👏", "karinaxman": "👏🏻🙏🏻🌍💚💪🏻", "calmoslow": "Thanks! 👏🏻👏🏻👏🏻❤️💪🏻", "sk1nnyveg4n": "Thank you for being vegan @gretathunberg! Animal agriculture is damaging the environment just as much if not more than fossil fuels. The meat and dairy addicts think the world can change yet cant even change their diet... Thanks again for doing the right thing.", "mgo.sustentable": "👏👏🙌👏👏", "jeanbonvivant": "Respect et courage à toi Greta !🔥🙌", "anisa_maolia": "❤️❤️❤️", "jana_hkm": "respect 🙏🏼", "mfay12": "🙏🙏🙏🙌"}