{"flawlesslyfat": "You look amazing, happiness shines out of the photo 🔥🔥", "thebiggerblog": "You look so happy! Make sure to eat at my fave place. Simple but truly local like my grandmother cooks 🙏🏻 it’s in jalan dhyana pura and is called Warung Mimpi. It’s halfway the street. And at the beach there are some fun sunset bars (kids friendly) 💕", "bhappy247": "Beautiful pic ❤️", "duskonig": "Love, Love, LOVE!!! That joy on your face is radiant! Thank you so much for sharing this pic and your happiness! This’ll be a bright spot in my whole day!", "jem1ma81": "Radiating joy, you passed your smile onto me..thank you 😘", "countesssingingcloud": "🔥🔥🔥🔥🔥🔥🔥", "jenniperberry": "I’m just glad to see you enjoying a well deserved vacation ❤️. And that bikini is beautiful, as is the woman wearing it!", "nicolekr1": "I love the pure joy I see on your face ❤️❤️", "misskas94": "💜💜", "thisismeagankerr": "I love this, you look so happy and radiant!", "pettigrewdear": "This is honestly such a wonderful photo. Happiness is so important!", "deanna.rose": "This looks so fun. Always make time for play! 😍", "r3v0luti0nary": "🔥🔥🔥", "michelequelquepart_enfrance": "Vous avez de la joie dans votre regard plein de gros bisous 🥰😍💋💋💋💋", "curvyandcontoured": "That smile shows nothing but happiness!", "annatheapark": "You are radiating joy, this is so nice to look at", "almaglyph": "Those lil tassels and the two tone yellows!!! So cute!!", "schlossamantha": "💘😍😘", "perfectlyimperfectshiloh": "So happy to see you smile. Love the bikini 👙 and that pool looks sooooo inviting. Enjoy your yourself 💕", "risingabove_thenegative": "💖💖", "leplusmag": "Hi hun, We are a French page. Our goal is to give you news about the plus size fashion. Feel free to tag us on your pics to get reposted Hope to see you soon", "squeakmcgee": "What beauty!", "chronically_madss": "I love the happiness in this picture ❤️", "shreyabubna20": "This pic makes me so happy, radiates positivity and beauty💗💗😘😘", "magicalbertie": "That water looks so beautiful, I can see why you look so happy! Hope you're having a lovely time.", "scarylittlepumpkins": "Eeee I love that smile 😍", "wecallmelinds": "Love the suit!!", "somewhere_under_the_rainbow": "Get your joy!!!", "soffychubby": "I know you said it isnt about what you're wearing, but I abseloulty love that bikini!!!!!!!!! ❤❤❤🌻🌙🏄‍♀️🌼🌼✔✔ where did you get it?😍😍", "warna.rupa": "You're glowing water baby!", "missfield999": "This mindset changed how I felt in swimwear! It's not about the clothing! The clothing is just something you have to wear depending on what you're doing, it would be completely impractical to swim in full clothes. It's ALL about the fun you're going to have", "samerongen": "❤️", "thedisabledhippie": "👏🏼 you look wonderfully in your own skin and wonderfully happy", "coraglitzer": "Your face is pure joy and I love it! 🎉💙", "becsbarratt": "Have an awesome holiday ❤️", "grandmagehri": "You look so happy!! I love it! And love that bikini!", "missrachelrawr": "Looking so great and glowy!", "pictureperfect_yella": "JOY. Unadulterated JOY. You are SO deserving 💗💗", "nwhysae": "Great to see you smiling!", "sapphiresplendour": "I love the message behind this I love you", "samascara": "you look happy! what a great pic!!", "debiparna_c": "Best caption and even better energy in the photo 💟", "mme.petite.grosse": "🙌🏾🙌🏾🙌🏾", "bhavinigoyate": "@toniallum ❤️❤️", "fananabananaz": "Love the joy on your face ☺️", "imaliteraljoy": "You look happy ❤ and radiant and gorgeous ❤", "fullbellyalchemist": "That smile is everything!!!", "sukkisingapora\nVerified": "Verified"}