{"feastfulife": "❤️❤️❤️🔥🔥", "trixiedeluxe": "You are on 🔥! Love all the bikini photos!", "va.va.vieve": "❤️❤️❤️❤️❤️", "gravezmomzilla333": "Fuck yes! Girlfriend, you're dope af! You really moved me again. 💕🎉", "nicolemayb": "What a powerful story, thank you for sharing 😘", "parttimepinupgirl": "You're amazing 💖 and you look super incredible in the bikinis you've been posting lately, bond girl kinda style?", "chia.seed.raving": "Great reflection!! Thanks for sharing!!", "mskarlette": "❤️❤️❤️", "agnessamuel1": "🔥🔥🔥🔥🔥", "positivepearshape": "This is such a powerful message. I wish more people would know this truth, that nobody should wield power over you. You are perfect and valuable just the way you are.", "catherinechroi": "Very inspiring 💕", "pudworks": "The styling is spot on! You look amazing 😍", "urthalun": "If there's a pool, I'm in it! I had similar experiences growing up, thankfully I no longer have as much concern for what others think, especially if they're blocking my way to the water.💧", "flawlesslyfat": "This is amazing. All of it. I can't handle the awesomeness lady 🔥🔥", "alyssaroars": "🙌🏻🙌🏻🙌🏻", "fridasskold": "Thank you for sharing ♡", "imthecutestandthebest": "Wow!! 🔥🔥🙌🏼🙌🏼", "angelabethcan": "So happy for you that you were able to reclaim your water baby status!! 😍💖🎉", "frannamstyle": "👍👍👍. I'm always surprised by how many people have similar experiences. I felt so alone, so ashamed during the height of my ED. Now I know I wasn't alone. ❤️. That I'm not alone and I'm not the only one that felt that way. Xx", "megan.bunnell": "I am so proud of you lovely lady!!!!💜", "warna.rupa": "Powerful 😍", "steph_jordan_artist": "❤️❤️❤️❤️ a Great Inspiration", "patricia_mansfield": "awesome", "becsbarratt": "You are just the best ❤️ thank you for sharing and also that bikini is 🔥🔥🔥", "cedar.willow": "So powerful I got damn shivers. Wow. 💛💛💛", "glowy_by_isha": "I can never get over how some ppl are so mean ....", "grandmagehri": "You look like a mermaid super hero and I love it!", "meraphetamine": "It’s so true. We give our power to everyone else but ourselves. The minute we take it back it is electric. And the door swings open ❤️", "mitchel_jovial": "🔥🔥🔥🔥", "_chubbydane": "You have me sobbing in my bed now, but not tears of sadness or pity. Tears of movement, tears of pride in calling you my friend, tears of determination and urge to fight alongside you. Thank you for sharing! Thank you for your strength! Thank you for existing!", "michellehopewell": "That was so powerful. Thank you. Also thank you for being the bond girl we need 😍", "tmnesbitt": "🖤🖤🖤", "gvinegarette": "Whoops got away from me...what I was saying was...No matter our weight, illnesses, disabilities, mental afflictions or past feelings about ourselves we deserve Love and Respect from others but also deserve the self love that may have alluded us in the past!! Love you!! (Sorry about the skip in the post)", "s.aran.ya": "❤️", "fjolnirs_child": "I'm glad you were able to reclaim something you enjoy.", "alohaamy": "Not only are you stunningly beautiful, but your words are eloquent and moving and that’s why you’re so powerful ✨✨✨", "emmererr": "I love this. Also a big water fan who stopped around 15 and still sometimes needs to be reminded that I deserve access to that space", "jobellecee": "Girl, if we could all have that attitude. Why they think they have the right to comment or try to ruin someone’s fun because of their shitty little BS bigotries, it’s ridiculous. And that suit is IT!", "jenniperberry": "P", "daringfat": "rock on! ❤️"}