{"luckyladybread": "Thank you for this, and the story you posted. Needed to hear this", "m.j.money": "you are such a beautiful person and so resilient. love to you.💖", "glendaofalltime": "Healing and strength Prayers to you and all those who loss a child. Thank you for sharing your story to remind others that they aren’t alone. 🙏🏾♥️", "saaranna_": "❤️❤️❤️", "aarkay123": "I feel your pain. You’re not alone. Wishing you all the strength and grace. 💕", "grandmagehri": "Oh! I’m so sorry. 💔", "shamandaliie": "Thank you so much for sharing, Aarti. Sending some love to you ❤", "laurathechaos": "@lizamin ❤️", "aimee.brrt": "So much love to you, thank you for sharing 💕", "annathemostawesome": "Thank you for sharing your story ❤️ so much love to you guys and your angels 🌷 i had three miscarriages (i have no idea how to spell that) before and now i have no one to try with! So happy that you two have eachother ❤️", "icatspiral": "I'm so sorry. Hugs if they're wanted... 💗", "jem1ma81": "❤️❤️❤️", "sharustication": "Big hugs Aarts. I've been thinking about your IG stories all day. I hope the healing continues and that joy and peace always find their way to you despite the pain. 💜", "jenniperberry": "Thank you for sharing this, I know how painful it is. Wishing you all the best and sending my love.", "maggiemunkee": "My sister miscarried her first pregnancy last year. I've seen the pain firsthand. *offers hugs* my love to you and your husband 💜💜💜", "naturenerdandcoffee": "💜💜", "pictureperfect_yella": "💗💗💗 ⬅️thats our babies playing together. They have found one another and fallen in cousin- bestie love. Hugs to you! 😊", "nayona22": "Loads of love. I am all too familiar with this pain. Sending you hugs and love.", "urthalun": "I am personally grateful for finding you, across all these miles. ❤️", "glowy_by_isha": "This is something so close to my heart, numerous miscarriages later i had my rainbow baby. Lots of love and hugs .", "michellehopewell": "I am so sorry for your loss. I simply cannot imagine, and you didn't owe us your story but you shared it anyway which is a testament to your giving spirit and loving heart. 💖", "sarah_the_colourwitch": "Grief never leaves, it only shifts form. Sending love to you ❤️❤️❤️", "schmidt_storm": "My sister had a miscarriage about five years ago. To this day I still don’t have the right words to make it better, though I’ve tried tirelessly. I feel for you, and send love. 💕", "geekbride": "Thank you for sharing your story 💜", "singaporeactually": "I’m so sorry for your pain & loss 💕🙏🏽", "jennoden": "Thank you for sharing. Me too 💙", "wittykittyvixxy": "Tight hugs Aarti 🤗🤗🤗", "gingerlovescake": "x x x x x", "fatinternetmom": "My daughter was stillborn in September of 2016. We are lucky enough to have a happy healthy rainbow baby, but the emptiness never goes away. I never stop thinking about all the things our son will do that our daughter will never be able to.", "hollyreubs": "Me too. 10 years ago and 8 years ago. Always loved, never forgotten. Sending you lots of love", "sundarciriya": "Thank you so much for sharing your story! I know it must have been difficult! ❤️❤️❤️ I have PCOS so even becoming pregnant is a pipe dream and the reality is even if I did, as you said, miscarriages are common. You sharing your story and this post reminds me so much that we create our families and they can look so many different ways and still contain so much joy and happiness.", "laurenjade1983": "I have 1 baby I carry in my heart ❤️", "eatasnickersshelby": "I miscarried a year ago tomorrow. You're not alone and we care about you. 😔", "allisonkimmey\nVerified": "Verified", "nakedwithanxiety": "Sending you and your angel babies so much love 👼🏽💖👼🏽💖", "fukisonme": "You are not alone. I had two miscarriages also. I understand the loss. 👼🏽👼🏽", "parttimepinupgirl": "There are never the right words but sending you lots of love 💕", "rasath1": "I love you!!! I carry four hearts and I shower the blessing I got to keep with all the love I can...", "theletterzee": "Thank you for sharing so personally and bravely and vulnerably. Sending you love. ❤️", "gonnaneumeier": "Sending you lots of love. 💞❤️", "crazy.co_enterprises": "💛", "bodypositivehf": "Thanks for sharing your story 💕", "bxtchymacbeth": "Lotsa love and big big hugs to u 😘 🙆🏽‍♀️", "lookwatstrending": "Love n hugs...totally understand u"}