{"sian_morgan_": "Congrats! 💖", "therealcynthiaramsay": "That red dress from 2015 tho!!! 😍❤️🔥🔥🔥", "duskonig": "Congratulations! Here’s to many more! And thanks for sharing it all with us!", "jobellecee": "Oops, premature post syndrome. Anyway, I feel so lucky to have found you. I love how someone half a world away and many years younger can teach me to love myself more. Happy anniversary and thank you. 🥂", "maggiemunkee": "💜💜💜", "lilithnut": "Liebe Aarti Olivia, es immer wieder schön zu sehen wie sehr du dich weiter entwickelt hast. Ich bin ein sehr großer Fan von dir 😘😘", "aimee.brrt": "Angel 🦋", "thisismeagankerr": "I’m so grateful for you Aarti, you’re amazing. I LOVE that outfit in the 2014 pic! Happy blogaversary, my friend ❤️", "nwhysae": "Big fan since 2013", "shannonleemcneely": "Congratulations on a job well done ! 🎈🌈💖", "angelabethcan": "Loved seeing you through the years since I’m a more recent follower! 💖", "ssketchator": "Obsessed with the 2014 look!!! Of course, they're all amazing, as are you 😍", "angelspiritseeker": "you're a wonderful woman and I love reading your posts 💖💖💖", "parttimepinupgirl": "Happy blogaversary beautiful! I remember some of those early looks from curves around the world!", "secureinstyle": "I believe I’ve been following you for quite a while!", "momlycoddled": "Happy 7th Blogaversary!!", "kimberlyweiss": "That 2013 pink skirt is super fun! 😘", "missfield999": "Clearly you have always been FABULOUS X", "bethkoritzlpc": "That 2013 outfit 💥🔥💖", "jenniperberry": "Beautiful in every picture 💖", "xoshalo": "I would definitely still wear that pink skirt! Happy blogaversary ✌🏾", "s_hobaba": "Omg I've been following your blog since 2014 and you've just been serving looks and realness year after year. So proud of you boo 💋❤️", "my.fat.lady": "😍🙏", "therelatablefatgirl": "Congrats! 💙", "royal_rayel": "Congratulations!! 💕💕", "aftermyownbelly": "Ooooh I remember that lime green outfit! 💚💚💚Happy blogaversary!", "frannamstyle": "Congratulations and thank you for the opportunity to follow your journey xx"}