{"chroniclez_of_my_life": "So sorry to hear about Bindi.", "therelatablefatgirl": "I’m so so sorry. I’m glad she was so loved and you were able to be with her the whole time. 💙", "caros_little_corner": "I am so sorry for your loss!! Sending lota of love from Germany ❤️ the loss of a fury child is always tough 🐾 She couldn’t have asked for a better mom and will be your guardian angel from now on", "this_is_me_brittney": "Oh i am so sorry arti ive been hoping for good things for you. You were such an incredible momma to her.", "brendajwruiz": "My deepest condolences", "uncontrollablefatbitch": "I’m so so sorry 💔😓", "melou929": "Sorry for your loss ♥️♥️", "ypsicoco": "❤️", "jlynnebc1976": "So sorry to hear about Bindi! She may no longer be by your side, but she has left some ever lasting paw prints on your heart.", "nayona22": "Sorry love. I know how hard this must be for you. Sending you loads of love. It's never easy to have to make that decision. Her warmth and love will be with you forever.", "maryheartscec": "💔💔💔💔💔", "anjanabapat": "So so sorry for your loss. She's going to be chilling with my Chingi across the bridge. We'll see them one day ❤️❤️", "hdbhippiee": "So sorry, aarti:((", "itsgussy": "I'm so sorry for your loss. 😭💔", "loreleybee": "I’m so sorry. Sending you hugs.", "my.fat.lady": "🙏❤️", "jennybuddy": "Sorry for your loss. Positive vibes sent💖", "such.a.full.sea": "Im so sorry for your loss, sending you lots of love ♥️♥️♥️♥️", "crea8ting_mybestlife": "I'm so sorry for your loss. I just lost my baby boy this week", "lerem13": "💛 Sending you lots of hugs. I'm sorry for your loss 💛", "annette7warner": "😢💔🌈", "mepriyouwho": "*bear hugs* ❤️", "astutefiery": "So sorry for your loss xx", "angie_144000": "Rip kitty", "geekbride": "Such a difficult time. Sending you hugs 💜🤍💜", "janeyy_xx": "😭💔", "uglyasstroll": "Rest in peace and love lil Bindi baby 💗 we’re here to listen and love on you in your time of need", "summerinnanen": "Sending you love... losing a pet is so hard ❤️", "thisismeagankerr": "Oh Aarti, I’m so sorry to hear about sweet Bindi. Sending you lots of love xx", "salas_5_tree": "❤️ Bindi ❤️", "glendaofalltime": "Aww Aarti I’m very sorry about Bindi. Continued love, strength and healing to you and your family (((Hugs))) 🙏🏾♥️", "rachaelmarie72": "💔", "vepascoe": "So sorry for your loss. It’s so heartbreaking. Take care of yourselves xx", "fullbellyalchemist": "Oh Aarti, I'm so, so sorry. I wish there was more I can say. RIP Bindi 💔😭😭😭", "kosua14": "❤️", "nataszashaft": "Awwwww so sorry :( my heart goes out to you", "2much2nah": "I am so sorry, sending you love. ❤️🦋", "mun_zoom": "I can't imagine you without Bindi 💔 .....didn't know she wasn't well..😢 ...what happened..? Sending you so much love 💚 Rest in peace dear Bindi 💟😢", "maggiemunkee": "Oh Aarti I'm so sorry, sweetness. *offers hugs* 💜💜💜 love for you and your family", "kian_inwonderland": "aww, i’m so sorry 🥺🖤", "juliesnb": "I'm so sorry 😭🌹", "monst.ana": "My condolences! Goodbye beautiful Bindi 💔❤️❤️🌈🌱", "evolving.the.fox": "Aaaaaaahhhh.....the passing of a pet.....one of the hardest things I deal with in my life. Losing a pet to me will always be like losing a family member.....I’m so sorry for your loss....thinking of you today....💚💜💚💜😔", "asherscapone": "I’m so sorry. I’m sending you so much love today ♥️♥️♥️", "cassia_bloom": "I’m so sorry Aarti, i know how much Bindi means to you. ❤️ She loved you so so much 🌈", "ediesandwytch": "😢", "sinfulsonia": "Im so so sorry for your loss. This is one of the hardest thing to deal with. Sending you lotsa love 💙", "annathemostawesome": "Sending love to you and your family ❤️", "ealasaidh": "I am so sorry. 💚", "aimee.brrt": "Sending so much love to you 💛 you will always have years of memories and love with that beautiful baby", "mademepretty": "Oh no😢 I’m so sorry.", "ginabee88": "So sorry for the loss of your sweet Bindi. ♥️", "amandalee684": "Oh my heart....I'm so sorry...", "artybun": "She was a beauty", "nolwazinkwandla": "I'm so sorry to hear this Aarti. I know you are probably devastated but just know that Bindi lives on in your happy memories, laughs and love shared with you. You will always have those even now that she's no longer with us. Hold onto those in this time of sadness and heartache. Sending you so much love and massive hugs 😘❤️", "drmeowfulness": "Oh no.. sweet baby. My condolences. May you find peace and support during this time of mourning. ✨🌈😻", "snepal123": "❤️", "beccajo_justme": "I'm so sorry for your loss.", "substantial_woman": "RIP 😒❤️🙏", "michellehopewell": "I'm so sorry for your loss💖💖💖", "heatheramidwife": "Oh no. I’m so sorry for your loss. (((Hugs))) 😥💗", "rhaque85": "Im so sorry for the loss of your sweet girl.", "coffeeaddictx4": "So sorry for the loss of your fur baby. Pets touch us in a way no human can. Hugs to you and yours. 🤗😢", "111cormier111": "I’m so sorry 😿❤️", "junglbear": "I’m so sorry for you loss.", "polarlander08": "Sorry to hear your loss. 😢. My deepest condolence", "beususee": "Am so sorry for your loss Aarti", "lucy.lawless.sg": "So sorry to hear that, sending lots and lots of love. X", "coraglitzer": "❤️", "ssketchator": "So very sorry for your loss. It's never easy, but I hope there is some peace for you in knowing she knew your love until her last breath. She was lucky to be so loved.", "stephani.miller": "Oh no... I'm so sad for you losing your furbaby. It's so hard to let them go. You loved each other and gave each other so much. But I'm sure that she knew you were there for her at the end. You have my deepest sympathies.💓", "steellily": "So sorry for your loss. Losing a pet is the worst. ♥️", "mummymika15": "So sorry for ur lost 💗", "british_bombshell": "I am so very sorry for the loss of your sweet Bindi. 💔💔💔", "staceyjaneyoga": "So sorry for your loss. It’s tough to lose our fur babies. 😿🌈💗", "hellobhav": "Sending you all the love, Aarti ♡ take care of yourself in this time and be extra gentle with yourself, okay?", "duskonig": "So sorry for your loss. 😢🌈🐾", "sal2315": "So sorry /", "emmererr": "Really sorry to hear this Aarti 😔 thinking of you and Suresh 💕", "_chubbydane": "I'm so sorry Aarti! I'm sorry for your loss and for your pain and I'm sorry for all the pain she had to go through! Chucky sends kitty love and I hope you will find a way to support each other in your grief and pain.", "angelabethcan": "Sending you love. May you feel the piece of Bindi left in you that is connected to the piece of you that you sent on with Bindi. 💖", "positivepearshape": "Sorry for your loss. Rest well sweet girl. 💔", "fatandkawaii": "I’m so sorry for your loss, sending your family all my love", "zunestress": "I’m so sorry about your sweet kitty.", "powertoprevail": "My deepest condolences. You were a wonderful mama to Bindi and we’ll miss her chatting during your stories. ❤️", "sharustication": "I am so sorry aarts. I am sure you were the best mama Bindi could have ever had. Hugs and may Bindi run free in cat heaven", "sundarciriya": "I know the feeling...I am so so sorry. Sending ❤️❤️❤️~", "roses.and.reveries": "Sorry for your loss 😢❤️❤️❤️", "alohaamy": "Sorry for you loss, I can see she was as magical as she was beautiful 💖", "fatkidyogaclub": "😿 Condolences from me and Cosmo 💜", "herwonderland": "I’m so so sorry, love. Sending all my love. 💕", "jjohns225": "RIP sweet Bindi 🌈🐾❤️", "sarah_the_colourwitch": "Oh I am so incredibly sorry for your loss. ❤️", "autumnpfister": "I so sorry for your loss. <3", "marystoutntp": "Oh Aarti, I’m so sorry. 😔😢❤️💔 She absolutely is so very loved. Always and forever. Thank you for sharing her with us in your stories so we could see her too. We will remember her with you. ❤️", "busty_laroux": "Sending you love and hugs, wishing you whatever may bring you some peace and comfort 💜", "creativeearth.at": "I am sorry for your loss... Please take care.", "becky.r.1989": "So terribly sorry.I am glad she had such a kind home and family and so much love during her time here.may her memory be a blessing💜💜", "somewhere_under_the_rainbow": "Sending so much love for your grieving process", "inmyjoi": "Sending positive energy your way 🙏🏾🙏🏾🙏🏾", "xcohlex": "I am so sorry Aarti 💕", "j_hanali": "So sorry for your loss, what a beautiful feline. it sounds like you were lucky to have eachother 💗💗💗", "lioness848": "So so sorry momma. You gave her the best life she could have. 💔", "wonderdru": "I'm so sorry, darling mei. Sending you hugs, love and light ❤️", "caz.gaz": "I’m so sorry! ❤️❤️", "veludurga": "Sorry for your loss. Sending you strength, love and light💜", "jobellecee": "I’m so, so sorry about your little friend. She has such a sweet face. You gave her an amazing life full of love and warmth and comfort, you gave her a family. ❤️❤️❤️", "goddess_life_with_kimber": "🙏🐾💕🙏", "sakunthala_25": "❤️❤️❤️❤️🙏", "badasswarriorgoddess": "♥️😢💔", "singaporeactually": "🙏🏽❤", "kixes": "So sorry for your loss. 😢", "sapphiresplendour": "🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "slymekween": "Sending love and light ✨", "whenyoutrishuponastar": "🙇🏽‍♀️🙇🏽‍♀️", "tempehgirl": "I'm so sorry for your loss ❤️", "sojohello": "Sorry for your loss. Glad Bindi had a good home and was loved so fiercely", "mrsradfad": ":( 💖💖💖", "ruhi.rafik": "RIP😭♥️", "saimassalon": "❤️"}