{"michellehopewell": "This is so beautiful and moving 😭💖", "yippiekayayay": "Yay!! Gorgeous💙", "sensiblyyou": "I absolutely love the colors ! You look so so so lovely 💗!", "angelabethcan": "Can you do this for me everyday?! So beautiful!!! 😍", "wandering_astray": "Feel you. I have never felt Indian enough. I struggle with the language (Hindi) and I'm not religious so I've lost so many points on the checklist. But I'm trying to redefine what it means to me and I'm trying to follow more Indian women. Seeing how other people define themselves takes away arbitrary tick boxes.", "revady_n": "You are so graceful my dear. Love this and seeing you in this beautiful lengha and also love how much the hairstyle suits the whole look!!😍😍😘😘", "resetright_sg": "You look so lovely and vibrant doing this sweet dance! 💕", "thechristinacakes": "Beautiful woman, beautiful dance, beautiful message 💕", "hdbhippiee": "The outfit is so nice!", "sapphiresplendour": "You are such a natural. Love your eye contact and smiles", "otakumami102271": "You look beautiful and watching this made me happy", "minaaaa_98": "Omg you are so beautiful 😍❤️", "punkistanigrrrl": "You're so gorgeous Aarti! The dance was beautiful and I love what you're wearing too, absolutely lovely ❤️", "paunavarro95": "Them moves and this hair on you 😩❤️❤️❤️", "cwat13": "Beautiful!!", "badtameez.gulabii": "Beyond gorgeous!", "__mephoto": "You’re sooo gorgeous !!! 💕🔥", "maryfareed": "Beautiful outfit!", "nayona22": "What does it even mean to feel Indian though? I can't even find a way to describe it. It's not about clothing or religion or food anymore. You look amazing in that outfit and you dance beautifully!", "leelee_calderon": "Everything about this was beautiful!!❤️", "haleydegenova": "gorgeous", "patty.schoenborn": "You are so beautiful 💚", "therealcynthiaramsay": "Sooooo pretty!!! 💕💕💕", "pictureperfect_yella": "Everything about this is soooo life giving!!!! Yessssss!!!", "sambot253": "So graceful!", "deliriums_whimsy": "Such a beautiful dance. Thank you so much for sharing. Your hand movements are really graceful.", "sundarciriya": "I LOVE this! And so perfect for World Dance Day! Speaking as a Kathak dancer, Kathak is ❤️❤️❤️!", "pixelatedblonde": "I love everything about this! Your moves, your smile, your outfit 😻 I'm sorry you feel alienated from your culture, thank you for sharing it with us", "mandy.meow": "Beautiful!!!! I can tell you enjoyed that. Can see your happiness radiating from within 🔥❤️", "queen____sanam": "Perfectly perfect baby 💕💕💕", "coraglitzer": "Beauty ❤️❤️", "thevisiblecollective": "You look stunning", "singaporeactually": "Very graceful", "collywoodland": "No matter who you are, I love that you do it with a smile. I love the colours in that outfit. ✌🏻", "angie_144000": "This is amazing 🔥", "crea8ting_mybestlife": "Love the beautiful clothes and watching you dance", "roseminanazarali": "Can you please turn that last line of the caption into an art piece? I want to be able to be reminded of it every single day. ♥️", "ajcersrich": "Gorgeous!!!", "caros_little_corner": "You look stunning💕 ...I love the color and fabric! Sooo pretty! And you move so gracefully!! Thank you for sharing ❤️", "schlossamantha": "🌟 Soooo nice 🌟", "houseofcid": "😍 Beautiful dress and you should dance more, your face lights up!", "missfield999": "Oh. My Godddddddd you look gorgeous!!! ❤️", "astutefiery": "You look so so beautiful", "ssketchator": "I love how happy you look!!", "ashriiketchum": "😍😍😍 this was so mesmerising to watch!!", "mikikoftokyo": "Lovely ❤️", "gulatte": "I cried a little watching this, made me intensely happy 💗", "19_paupau_88": "I love your dress ❤️", "saalene": "You’re not alone babe! I don’t always feel very Indian in the same ways. But also classically trained in dance and Carnatic music. It’s beautiful to see you enjoy it 😘😘", "sukkisingapora\nVerified": "Verified", "bally_hayer": "Looking fabulous and go girl 😊❤️", "frannamstyle": "So elegant 😍", "mahabites": "So elegant and beautiful to watch. And the lengha is so pretty on you bub ❤️❤️❤️", "beccajo_justme": "Achingly beautiful! Stunning. The joy radiates from within. Thank you for sharing this with us.", "this_is_me_brittney": "This dress (sorry if that is the wrong word) is so stunning. The colors suit you so much ❤️", "lvernon2000\nVerified": "Verified", "self_ally": "AHHHHHHHH this was so beautiful to watch 🙌🏼", "soovertherainbow": "You move beautifully. Your outfit is gorgeous. And I totally can empathise about feeling an outsider in your own culture.", "rasath1": "Wow... kathak is a beautiful form of dance. I had no idea and Im so glad you shared that", "lucygurteen": "So elegant! You look full of joy ❤🤩"}