{"jennyhorror": "@toon_the_goon ❤❤❤", "usually_flannel": "@our.alter.native.freedom ❤️", "sharonnandakumar": "Thank you!", "georgiawhitefield_": "@courtney.__.williams", "snayhuh": "@allyenigma", "eledwardss": "@curvesbecomeher thank you so much ! My first day flew by and i made it. Thanks for the inspiration 🌸", "luscious_raspberry": "I needed this reminder so badly tonight. My life feels hopeless right now. Thank you for the kindness and love. 😊", "triceinreallife": "I needed this. I have made so many strides this year and since Sept have gone back to old insecure behavior. I have 5 weeks to end this year with everything that I have gained and letting it bloom. This is my season 🌺🌻 #canttakemyjoy", "badassbusinessbeauty": "💕 much love beauty", "francesca_jaffe": "Love this! I needed to read this today. Thank you!", "soosacy": "Word well needed this morning", "wittykittyvixxy": "I needed to read this today. Thank you", "joshikasharma": "November so far has not been sweet but just sour, and just when I was about to loose it tonight, I read it, thanks for the reminder 😁", "zabrak": "@biteythevillain ❤️", "chelseamorningbreezy": "@teririder", "lieska.guzman": "💕💕💕", "cgottowhite": "@kwright731 ❤️", "foragerbotanicals": "🌿", "hamspamwiches": "❤️❤️ much needed", "a.strother": "@krystalb91", "anurangi2004": "Proud of you dear! You did amazing this year too! ✨Me and my hubby had a hard time this year and still going through. This post touched me and I shaped with my hubby too😊", "challanska": "❤️❤️❤️", "caitlnmurray": "@wadiyatalkina.beet", "jenvyfox": "Thank you! ☺️❤️", "ambigaidas": "Just keep swimming Just keep swimming Just keep swimming swimming swimming🐠", "alwayschasedreams": "Man, you have no idea how much I needed that. Thank you, thank you, thank you!", "positivepearshape": "You know @becky482 it's been a tough one, but i know its going to keep getting better. Love you.", "nanthiniedas": "I'm surprised I survived the first half of the year to enjoy the second half....", "moore.phoebe": "Omg this came up right before I'm about to do a job interview. Talk about good timing 😊🙏", "thrillingheroics": "@flexinprincess ❤️", "glitteryfemme": "@truefat made me think of you 💘🌹", "becoming_audie": "Love this. This is a perfect break from the \"impending doom\" that comes from another year not be as successful as most of us would like it to be. ❤ keep being a beautiful inspirer of love and self care.", "justontheinsta": "Needed this. Thank you. 😊", "theveryinterestingjaime": "Thank you so much. I’m really struggling right now with stuff, especially finding a job. It’s nice seeing that I’m not the only one in a hard spot and I hope we can all get through this ❤️", "aimhigh_likejordan": "Literally... was on the verge of tears, about to exit IG to lay down to cry & I stopped and read this. Thank you 🖤🦄🌻.", "turbulent_advocate": "I struggle so much on Sunday evenings. And after a really busy weekend without a lot of downtime I was having a hard time until I read this. Thank you! ❤️❤️"}