{"myxxfly": "Thanks for sharing mama, this is definitely invisible to a lot of people otherwise", "nataszashaft": "Let's go punch some people in the neck!! Assholes!", "simeoneelissa": "It’s so heartbreaking , i experienced this as a fashion bombshell on fashionbombdaily. We have made a lot of strides in the + community but we still have a looonngggg way to go", "missrachelrawr": "This is ridiculous!!!", "mustangsallytwo": "This is ridiculous but unfortunately happens all the time. I fought back a bit this week because sometimes I just get tired of ignoring it", "rebekah_farris": "@curvesbecomeher Wowsa. Pay them no mind. Without being too cheesy, I just want to say you are frickin awesome. Anyway have a nice day/night", "hmchavez": "Shine on! ⭐️❤️⭐️", "janeeyreforever": "So sad. You are beautiful.", "kessibear": "It's funny how the people who write these comments seem to have no idea of spelling and/or grammar. It seems their IQs must match their manners 🤷🏻", "emalou76": "As if these trolls, posting their ungrammatical ignorance think you need any kind of validation from them. How sad. Keep being you. They are probably jealous of your happiness anyway .", "stinkyvelvet": "Yay for boundaries & not letting that shit get to you. You are great! 💓🗡🌙", "miriamhavard": "When I see you, I see a woman who is smart, beautiful, dignified and happy. You have beautiful brown skin. You have big beautiful dark eyes. Beautiful ebony hair. A beautiful, curvy form. You are degreed, happily married and you're getting that paper. The trolls see the SAME things that I see, they compare themselves with you, and they're angry,.........at themselves!!!!! 😘 LOVE YA!!!! 💖💕", "tiffifo": "People that are this angry and hate filled must really have some of their own demons to fight. Keep being you ❤", "misslfc77": "You are awesome these people are just shallow #keepinspiring", "r2facts": "Interesting @curvesbecomeher I’ve dedicated my life to Help People live a Healthy and balanced life, but not to insult or demean a person, that’s horrible. Stay strong 💪", "lovekristinchandler": "It’s really hard not to take comments like this to heart when they are so eloquently stated. 😂", "laurannklan": "When this bullshit happens I constantly remind myself - that's their shit. That's their level of discomfort coming out in petty fucking words and empty insults, one's they'll write and will never think twice about, because that's who they are. Those are the people who are so far from loving themselves they cant imagine the idea of someone else doing it, let alone someone with curves. Loving yourself is the greatest revolution of all. Stay strong sister 🖤", "raven_relics": "People have no filter and no respect when there's a screen btwn them and you. They're pathetic and sad. But as Byron Katie says, what they think of you is their business. What you think of you is your business 💜", "decembercrows": "The problem is... them!!! Sorry you have to see that stuff. You are great & inspiring. I love all you do. 💓", "meliqat": "I️ won’t “like” this post. I️ won’t like it because I️ am sorry you - and many others out there (here) - get unsolicited messages that are so absurd and cruel and WRONG. You keep doing you, it’s bringing light to more people than you may know. Love to you, Aarti.", "slsmf1971": "Their ignorance is blatant...too bad they don't have lives lol", "lorirambojones": "I get it too, a couple times a week.", "bodyimage_therapist\nVerified": "Verified", "fairydreamer89": "Ew. So much hate. You're beautiful inside and out. You inspire me so much. Sending love, hugs, and strength ❤️", "psitsfashion": "Other people's comments say more about them than it does about you.", "thickmadamiza": "The subtle art of not giving a FUCK! don't give a FUCK! ... XOXO @curvesbecomeher", "stephani.miller": "Some folks are so threatened by others who are comfortable in their own skin, the only way they can reassert their sense of self worth is to denigrate others. Pity them. And keep blocking.", "ana_farrah": "@curvesbecomeher I didn't realise this type of abuse existed what gives others the right to comment on how you chose to live your life. Shocking but like you said their comments only fall on deaf ears they are only making you stronger and more fearless! The only way is up 💖", "hoot_hoot_hope": "💖", "ushshi": "Yup. They have no idea that this is the day to day. Solidarity.", "sport_and_chocolate": "I'm really shocked how fast people condemn someone just because of his body. I'm ashamed of my one species. I think you look like a really nice person 👍 😘", "bethannnelson": "I’m sorry you have to even see words like this directed at you. Keep up the good fight. ❤️", "secondhandsmile": "I'm 'liking' this to send you love, I deffo do not 'like' the hate you receive. You are beautiful and you deserve better than this. I see you, and I appreciate your visibility ❤️ xxxx", "ginad143": "It breaks my heart to see how horrible and nasty people can be to others! But they’re opinions don’t matter, I’ve been following your page and think you’re amazing, keep being awesome, you look FANTASTIC! ❤️", "naturenerdandcoffee": "People can be awful. You're amazing 💕", "boleybubbles.houseofgrace": "Hope you find the strength to make it through and work towards your goals 🙈😘", "honeyiamgone": "I am betting the majority of haters are men. They do love to hate on women who dare to exist outside of the norm.", "nmg008": "You are incredibly gorgeous and a daily inspiration! Size does not equal self-worth or value ❤️ thank you for being a role model and daring woman", "heathers_key": "WOW!!!! I can't believe the ignorance! Big hugs. You are beautiful and a daily inspiration to so many!", "every_other_freckle__": "Wow! People really suck. They think they know everything by just looking at the surface and trying to fit everybody into their own ideas of health and beauty. You are so much more than their ignorance, and I’m so glad you don’t let them define you ❤️", "gulatte": "Today a man walked by me and mimed vomiting then said “how will I ever get I️t up again.”", "mapulicious": "I don't like to comment this kind of things because talk with this kind of people is like talk with a wall... anyway I think slim or \"healthy\" people don't understand something, be slim doesn't mean to be \"healthy\". I used to be a swimmer, but when I enter to the university I stoped to swim so in 1 year I got a lot of weight. Then years later I decided go to gym to lose some weight, and I did everyday like 3-4 hours of intensive exercise... but I could not lose weight easily neither... people who doesn't know I was doing exercise called me lazy and unhealthy... but I was doing my best to become \"healthy\". So I got tired and I learned to ignore all kind of comments because you only know what you do for yourself, we love ourselves, so no matter the size we try to look pretty, all women are beautiful. Just be happy and fabulous ;). @curvesbecomeher I really admire how strong you are. You are so beautiful! ❤️", "tropictonic": "The most hypocritical thing about comments like these is that they suddenly care about your health?? I don't see them bullying everyone who's smoking, or sunbathing without sunscreen, or eating processed meat... (Aka all known carcinogens..) But well, those don't affect their very important beauty standards, so they don't count, right?", "thewitchnextdoor": "😡 This makes me absolutely livid. You are a beautiful person, inside and out, but that goes without saying. I appreciate who you are so much. Thank you for holding this space and helping so many of us process this kind of nastiness with good humor and strength 💕✨", "sabrelily": "Omg! Forget them. Ugly people with only ugly things to say. You are beautiful! And super amazing to keep up this account - a beautiful person with a beautiful story. 💜", "frannamstyle": "😡😡😡 drives me crackers seeing crap like this. I’ve had some (although not much) myself. It’s horrible how people think this type of behaviour is ok. It’s not. I don’t read private messages from strangers anymore for this exact reason. & yes delete & block. But this type of harassment should be tolerated. Hope you are having a wonderful day xxx", "justlittletalks": "You are so strong and amazing!", "glendaofalltime": "Block, delete and ignore them! You're a beautiful person. Keep on being you. 😘💜", "w.korevli": "this needs a repost! i feel ya sister!!!", "l.jo.s": "Gah. This just boils me. You are full of light and love and are an inspiration. They can eff off."}