{"powertoprevail": "HAPPY ANNIVERSARY! I hope one day you have a chance to redo it all, exactly like you both want. 💖💖💖", "styleprism": "You look the prettiest! Yayyy for 10 years! It's not the pictures, but the moments shared together that matters! ❤", "iamcreated2create": "😍😍😍aint nothing like love! Happiest of anniversaries to you! Live,love and be blessed with many more years!😍😍😍", "ranidhaschainey": "Happy Anniversary baby girl! Wishing the both of you tons of happiness and love and may you be blessed with many many many more years together! You’re one of my favourite couples!! Stay your wonderful selves❤️❤️❤️❤️😘😘😘🥂🥂✨🎉🎉💐🍾💃🏻👏", "kandcsailing": "Happy Anniversary! I hear you about the studio shots. I'm not into posing. It's actually hard to get a natural looking photo of a couple friends, because they automatically pose when they see a photo being taken.", "m_a_3415": "Happy anniversary 💜", "clausencat": "Happy anniversary!", "therealtiffycee": "Congrats on ten years and the beauty that's within your love union!", "mrs_uwagboe": "So young! Congratulations on 10 yrs!", "fullbellyalchemist": "Congratulations 🎉🎉 I'm married two and a half years and it's hard, even if it's the love of your life. It's inspiring!!", "ilizahartley": "Your dress is so pretty! 😊 but why couldn't your husband wear his glasses? Did the photographer make him take them off?", "margotmeanie": "Congratulations!! 17 years can fly by when you’re with the right person!!", "srimkeit": "You look way more like YOU now, today! More comfortable in your skin. Happier!", "bhappy247": "Happy Anniversary 💖", "kamini_dubey": "Beautiful couple", "beancurdled": "Weddings are CRAY! I hope your 10 year anniversary is a much more relaxed celebration of your love that’s let’s you both be more authentically yourselves. 💛✨🥂", "mikikoftokyo": "Omg happy anniversary and many many years to come. Through that smile might have been saddened fear or anxiety or pure happiness. I see your smile and I see something you had then and have now strength. We learn so much from an object that does not speak. Pics teach us so much.", "anurangi2004": "Happy 10th anniversary dear!!❤ Taking studio photos can be annoying, but I love this picture! By the way, would love to hear your love story, if you would like to share 😊", "superwomanisgo": "Same contagious smile! Congratulations ❤", "naziyafathimaa": "Happy anniversary :)", "dtg_75": "Happy anniversary!! I love how you explain all what was going on. There is so much pressure in some events... We still celebrate the day we decided to be a couple as our day. 17 years next year, just behind you girl 😉😉💞💞💞", "baloo_moo": "Congratulations ❤️", "bawdyloveclothing": "Beautiful pose, but I am so grateful to be able to see how you and your husband really are and choose for others to be seen, not the version of perfection that your family previously pushed for in this wedding photo. As a team of queer femmes at BL, for us you are a constant inspiration and a reminder that it's okay to not be okay - it's okay to give yourself time to heal and that loving yourself is a process, not a constant state. Thank you for all of your writing and everything which you pour yourself into.", "crownthebrown_": "Permission to repost ? 😊♥️", "pictureperfect_yella": "Loud celebrating for your anniversary and the enduring power of your love, especially in a time where commitment is only based in convenient happenstance. I love you. I love y’all. I love your love. Yayyyyyyy!!!!! 😘❤️❤️❤️❤️😍😍💓", "oneheckofamama": "Awww!!! Congrats on 10 years! Wow!!!! 🎉", "that_desi_girl_": "Happy anniversary!!! 💕You look fantabulous in shocking pink 😍", "coraglitzer": "This is you? Wow, I didn't get it until I read your caption 😆 17/10 years are awesome, Congratulations!!", "mimir25": "So glad you shared!! 😁 Always great to know what is behind those smiles! 💗", "sofiarclz": "Congratulations on the love 💕", "jjohns225": "YOU LOOK LIKE BABIES! Happy anniversary 💜🎉", "yaynidhi": "You looked great then but it’s better now that you look AND feel great. Happy for you, blessed anniversary!!", "emmererr": "Congratulations on your anniversary!! Hope any 10yr photoshoots are a better experience 😉", "shasthrika": "Gorgeous.. Still...", "xoshalo": "Well, you two still managed to look so cute here! 😍", "thechubbytwirler": "Awwwww....you both look beautiful !!! Congratulations ❤✨😍", "totallytonirenee": "Happy Anniversary. Congratulations 🎉🍾", "thiru_2912": "waaa so sweet", "nebula_89": "Happy anniversary!! Congrats :)", "sapphiresplendour": "💕❤️❤️❤️❤️❤️❤️❤️🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽", "therightshadeofred": "Congratulations! Wish you guys years and years of happiness, good health and lots of love ❤️ @curvesbecomeher", "rocketnails": "Congratulations babes... you look gorgeous as always....", "sparklesandlace": "Happy anniversary!!!!!!", "singaporeactually": "Gorgeous then & now 💕💕 your inner light always shines through", "miss_eyeroller": "Happy anniversary 💑💏💓💕💖", "frannamstyle": "Happy anniversary xxx"}