{"glendaofalltime": "Reported, Aatri I feel upset for you. No one has the right to use a person's photos without consent and claiming it that it's their photos, this is a violation of privacy. Very sorry about this 🙏💜 ((hugs))", "smarterthanyouraveragesprinkle": "Reported. Creepy shit", "janiceacamacho": "Done!", "grimeandglamour": "Whoa!", "naturenerdandcoffee": "Done! 💕", "laurafrances888": "😲I'm so sorry this happened to you. What the heck :(", "snepal123": "It is really disturbing. I have reported it. I hope this gets sorted out x", "elesteerest": "Reported!", "heyitslisa.m": "Reported it! Hopefully if enough people report it, they’ll get the hint that it does indeed violate community guildlines!", "meliqat": "🤬", "megsmelody": "done", "holly_woods_roper": "God I'm so sorry this has happened", "jaxie1970": "Well, I commented on all the pics and messaged those that commented and I've now been blocked! 😔", "shiihshiipehns": "❤", "lisamwhyte": "It's gone!", "mrs_chauvette": "I reported it as well and got a message from Facebook saying the profile has been removed. 👍🏼", "trubblemakerindrani": "Profile removed message just received", "demaraxo": "The page is removed!! ❤️", "hannahcs1988": "I tried reporting it but couldn’t find anything. Maybe it’s already been taken down? I sure hope so! My account got hacked and taken over a week before my sons first birthday and it took THREE MONTHS for Facebook to fix the issue and delete the account. I wouldn’t wish that headache on anyone.", "claudiaodra": "Is not in Facebook anymore, i look for it whit some variants and did not find it", "brachellec": "Saw your story. Searched it morning. Nothing turns up. I think it is probably removed?", "mlaw812": "Holy shit this is awful. I’m so sorry. Just now seeing this and hope that it’s been taken care of.", "michellehess_m.a": "Did it get removed? I can't find it.", "powertoprevail": "Reported!! Ugh so sorry you have to go through this but glad you found out and hopefully @facebook will take action!", "jackieinseattle": "Reported this pos. Awful. I’m so sorry.", "_erfishman_": "Done", "rainbowchatman": "That’s so awful", "nataliemeansnice\nVerified": "Verified", "capicapone": "✔️👊🏽", "pictureperfect_yella": "Reported. They’re goin DOWN!", "shannonleemcneely": "Reported !", "yaynidhi": "Reported. What is this bs", "mahnoor_1990": "Done reporting.... its seriously so awful to see these kind of sick people doing this weird stuff.... hugs for you ❤", "risaroo88": "Make sure everyone writes her name under who r they impersonating then they will take it down", "amanda.j.howell": "reported. so sorry that this person is invading your privacy like this", "twacy_wacy": "Will do", "dianecastelo": "Reported AND went to their “professional” page for wedding planning and left a message to take down their fake page!!", "tess.eva_": "Done!", "ushshi": "What fucking douches, i hate when this happens it's such a massive violation", "sassy_latte": "DONE!", "kittehinfurs": "I reported it ugh. I have no idea what people like this think they're going to achieve by impersonating people on the internet! It's really disturbing and I really hope Facebook takes that account down soon.", "lauren_res": "Reported!", "blair000000": "Reported.", "acursivegirl": "Done! I’m so sorry, I hope it gets taken down right away! About 12 years ago my ex boyfriend did this to me on myspace and it was terrible.", "lady.cummerbund": "I've reported as well, sorry this has happened. Fingers crossed that it will be taken down asap.", "jeniffersandrasegaran": "Is it taken down? Couldn't find it", "haniamakesart": "I reported! This is horrible and creepy. Wtf. Its one thing for a person to pretend to be you but to add on using your photos with your family and friends. Thats creeeeeppppy.", "swissmarple": "Done, I hope it helps!", "stephdogfoot": "reported!", "fivefootfunandahalf": "I tried but it only allowed me to block the account ... which was frustrating because that was the solution posted under “report account” 🤬🙄", "ealasaidh": "Reported! Ugh, what bullshit!", "emmererr": "Reported, horrible thing to do but even worse when it's photos of your family!", "lioness848": "Reported, so sorry.", "singaporeactually": "Didn’t want to ‘like’ this post but rather just to send you a heart...can’t imagine how you must be feeling ...so violated.", "kissmyash0600": "Reported. So annoying", "ellieegoldingg": "Done", "adrianad44": "Reported. I don't understand why someone would do that. I'm sorry you have to go through this.", "thatoneyogi": "Done!! Wow!! That’s crazy!!!", "joyous813": "Done. So sorry this is happening to you.", "coraglitzer": "What the...", "miss_photo_fanatic": "Done! That’s so creepy. Hope it gets taken down x"}