{"shima_nunan": "Stay strong . Sending you angel hugs!!!!!", "janeeyreforever": "You are beautiful, strong. You even have a lovely accent. You are honest and brave. I am so sorry this is happening. Bless you.. Evil forces try to ruin our spirits by trying to Hide our light.. Shine on, shine on..", "pictureperfect_yella": "Love you Aarti❤️❤️ All the way from Buffalo, NY. Love is houses by NO bounds. Of course we jumped to help you. You give SO many beacons of light in our darkest moments. It’s a blessing to be able to show some minimal form of reciprocity. 💕 Love, Danni", "ealasaidh": "Glad the account is down! I was happy to help in what little way I could (by reporting), you give so much, it felt good to give back. 💚", "tate_harkness": "Oh no hunni! This is the first I've heard of it! I hope it's over for good. Big hugs to you. This is wrong and terrifying and horrible. I truly hope it's done with. 😐", "swissmarple": "😘😘", "cwat13": "Sending so much love and support. You have a community of roots holding you up.", "coraglitzer": "I'm so glad for you that it has been taken down!! We know that you are an human being, so take your time to rest, to relax, to process. Take what you need. We love and respect you and this will not change when you take care of yourself! ❤😘❤", "mustangsallytwo": "I am so glad it got taken down! What I find so frustrating is it takes others to get anything to happen, it is supposed to be a safe environment but you can’t do much personally about someone stealing your pictures and pretending to be you. I hope you got some much needed rest. I appreciate our friendship and love you 💕", "singaporeactually": "So terribly sorry you had to go through this", "rackletang": "No need to respond. I'm just so happy you don't have that to deal with anymore. Rest now, we'll be here when you're ready. 💖", "inzjehetprinsje": "I’m so glad the account was removed!!", "emmererr": "Thank goodness! Take care of yourself today and remember that no matter how much we love your work and your contribution to this community, your health and wellbeing always always comes first. Anyone who expects otherwise is being very unfair to you and also does not speak for the majority of your followers. Take care!! ❤", "kittehinfurs": "I'm so relieved for you!! *hugs!* 💗💗💗", "superwomanisgo": "I'm so pleased it's gone! Take all the time you need to rest and recover. I can only imagine how draining this experience has been for you. Sending you love and strength ❤", "naturenerdandcoffee": "I'm so sorry you had to go through this. Your honesty and sharing your story with all of us - I'm so grateful for. Take care of yourself 💕💕💕", "xcohlex": "I'm so sorry some scumbag did this to you. My ex made fake Facebook profiles of me years ago, stealing my pictures and saying revolting things about me. Even more upsetting was the fact that people were adding the profile thinking it was really me. After that I stopped posting pictures publicly and my social media is very private. I can empathise with how violated and grossed out you would have felt Aarti. You have a lot of support with all your followers, we love you and have your back!", "curvywordy": "I’m so relieved it got taken down! It’s wrong that it takes so much effort and so many voices to get these profiles and posts removed. Sending you lots of love and hugs xxx", "purplegal94": "Love and hugs to you 💜", "merkabahuf": "I’m relieved to hear it’s been taken down. I hope you are feeling much better, lots of love and happy holidays x✨", "dollykamdarkhokhani": "😘😘 take care my love ❤️❤️ a big warm and a tigh comforting hug to u 😘😘", "askdxr": "We love you and all your stories and posts they have truly helped us with so many issues like body positivty(because we have gained weight due to working from home), depression and seeing zady cheers us up we hope u never close this account because if u did instagram will never be the same😻", "nanthiniedas": "Lots of hugs and love 💕...", "knighthusla": "Stay encouraged 🤗", "curvesbecomeher": "Please forgive me if I don’t get back to all of you today, I would like to take some time to just rest because I was in such a state of panic and anger and shock last night. I honestly feel like I can pass out and I need to rest my head", "hautecurves_": "❤️❤️❤️❤️", "risaroo88": "This post gave me chills. And youre still standing. Happy youre feeling better.", "tina.masuda": "What an awful thing to happen! I’m not on your FB, but I follow you here and learn a lot from your posts. Thank you for sharing your stories of chronic pain. They’ve helped me to be more compassionate about this issue that affects so many. I hope that this fake profile business is over for good. 💕", "crea8ting_mybestlife": "You are going to get through this. I firmly believe with enough attention this account will get closed down. I pray so. It is so violating and then to not have anyone listen or act, amazes me. Facebook has caused harm to so many it's why I am no longer on it. Social media is an evil thing sometimes. Just know you have so much support. Continue to reach out and we will do what we can.💞💜😘"}