{"april_ionson": "👍👌🙌👏👏👏so awesome!!!", "curvesbecomeher": "@gsdmh hello Megan! oh wow a thinsplainer! you see, all magazines have are thin bodies anyway so me and my two gfs are having some fun being fat girls in bikinis. So take your opinion and move along Thank You!", "crybabytinaaaa": "Cute 😍😍😍😍😍", "theg0blinqueen": "@hailey_ducote the middle bathing suit would look so cute on you", "crisfenzo": "@thrautir are you 12? What's your deal? I'm truly interested. Small dick syndrome? So most of it is in your personality? No structure at home? Girls don't look at you so you're a woman hater? What is it?", "carolinaplussize": "So beautiful ladies @curvesbecomeher", "gracie.masters": "😍😍😍", "thilinijay": "Love this one. You girls look amazing and on fire🔥👌🏽Your facial expressions says it all. Beyond beautiful😍😍", "chloewaymack": "😍😍😍😍", "charm_creations_4_you": "Beautiful you girls are 😍😍", "alicia_laws92": "❤❤❤❤❤❤❤❤ my dear, you are radiant", "genevievesolda": "@marssmitty this is sooooo cute", "lilyeshah": "This is awesome!!! Love it!", "mutantxfactor": "Every body is a bikini body! @curvesbecomeher", "foweefowee": "@winnie_njogu ☺", "winnie_njogu": "@foweefowee niiiicwr!", "dorishusseni": "😘😗😙😍", "anvitagupta": "@curvesbecomeher hey Aarti! I went on to Magzter to check out the latest issue but can't find your piece in it. Is it out in the next issue?", "mariecharlottedb": "You look SO good! 😘", "escritora_compulsiva": "Ugh.", "doreenlnacht": "Good for you! People have to stop judging from the outside and concentrate on the inside. From the words of a very good friend of mine and world renowned song writer who can get anyone he wants 'That s*#t is so overrated!\" Amen brother! And thank you for believing in women for who they are and not what they look like! After 4 children of course my body isn't perfect . But a friend of mine who is a blogger and serious Manhattan photographer who did a nude photoshoot of me was so amazed how the women who have never had children and weigh 2", "beckaleidoscope": "I love this photo of you an indescribable amount!", "reeneta_dutta": "OMG! U girls look like goddesses! @curvesbecomeher @the_curve_edit 😍", "adjpants": "SO PROUD OF YOU!", "jezra_m": "I love!!!!!!!!", "elleesem": "Loooove this!!!!!", "fatbabyspice": "LOVE this", "mslindsaym": "Amazing! You all look so gorgeous!!!", "lvernon2000\nVerified": "Verified", "therealcynthiaramsay": "This is sooooooo amazing!!!! You all look so happy and beautiful!!! Lovvvvvve!!! 💕💕💕💕💕💕 @sapphiresplendour @curvesbecomeher @thecurvecult", "sapphiresplendour": "@flightofthefatgirl we had so much fun and that translated into the pic! Thank you lady! 💋😘", "jessiolivia": "Love this! Rock on beautiful woman!!", "inmyjoi": "LOVE IT!!! 🎊🎉🎊🎉🎊", "minimalists_page": "Gorgeous!!!!.proud of you girls!!😍😍", "iridescentkaleidoscope": "Aaaah, I'm so happy for you. Not only do you look fabulous but you're advocating the right message. 🙌 More power to you, Aarti. Always!💖", "ithadtobemaine": "I love this picture, it's so full of joy and positive energy! 💓", "gsdmh": "A bikini body can also be thin please don't discriminate", "mizwoochic": "@curvesbecomeher Congratulations!! I'm so excited for you 👏🏾👏🏾👏🏾", "full_of_freckles_illustrations": "i love this picture!!"}