{"sorkadeeyor": "@wickedmissy69 stunning? Wonder how'd you label fit women🙄", "noof._33": "Beautiful ladies", "mr.rafaelquiles67": "Be yourselves. ...your all beautiful women be proud and live your life happy 😘", "susanacunningham": "You are just looking for attention! You got the apology just move on!", "gracegarner": "You are all beautiful!!! I am glad you spoke out about what happened.", "jmtzs24": "Suck!!!", "pinoynoir18": "@instagram has a crap ton of double standards and its sad. You ladies are beautiful!!", "ajdoerner": "You gals are gorgeous!", "phantom_xart": "you're so beautiful! ♡ It's sad, that there are people who are so hateful against curvy women. @curvesbecomeher", "denii_lee": "@alisnettydelapaz 💕", "luisabu_": "@mariusm9797", "maediazdeiva": "Faaaaaaaaaaaaaat", "ana_stasia.tennis": "🙈", "mamma.perez": "Its a damn shame of the crazyness social media has, posts on how to harm oneself and create violence doesn't get deletes but tjis wonderful and natural photo does... Shame we live in this era of beauty shaming. Beauty is beauty and you three are a light in gray times. Continue on and be wonderfully amazing!!! 😘", "thehungryceo": "<3", "annakarlovcec": "You're so pretty & there're not mistakes in your body! You're beautiful how you are. Be strong!", "abbeyjcyne": "you are all so beautiful - thank you for doing it for the larger ladies (i'm on the larger side myself, not majorly but still not happy with my body)... i'm so shocked and angry that this was removed.", "jordan_v373": "I just saw this and it's sick that they deleted it. You guys are beautiful and strong, you send a positive message and look great while doing it.", "alorajoelle": "beautiful", "gaminicyril": "I love curvy of the like of you. in singapore all people who are skinny like a boy, close-minded and dotors who hate curvy so much. You three are so sexy and juicy. that make me crazy about you all, my dear girls. ;)", "sneakapeek101": "Oh by \"do\" I didn't mean... oh never mind.", "teeciewalk": "I can't believe this got deleted I'm glad you reposted it. 💕", "marckpearson": "mcdonalds anyone?", "sarahmeilyana": "Wow three gorgeous ladies tho 😍😍😍", "fashionville86": "😍😍😍😍", "yjf4kids": "So sorry that this hurt you. Stay strong...you and your friends are beauties!!!", "lmaaho_2": "Ok Instagram doesn't look at what picture it's deleting it just gets reports from an image and deletes it after a certain amount. Don't blame Instagram and social media blame the people who reported you????", "alexandra_victoria_coco": "@curvesbecomeher This photo is stunning.... I wishhh I had the confidence in me... One day, I will..! I have so much extra skin from gaining massive weight, then losing it, gaining half back, and now I've lost like 80/90lbs of the 150 I gained.. In a year!!! I definitely needed to find all these pages... You ladies inspire me so much!! Beautiful babessss!!! And FUCKKK ANYONE WHO HATES! They pointless to spend your time on... You are trying to do something to help people, and you definitely are! Much love girls 💗💗💗💗💗", "jessicaaaaaa___x0": "Get it girls!!!", "donnadoesstuff": "X💗X💗X💗X💗X💗", "angelmaida": "You give me hope for society's standards, be you forever and always.", "suzannepoulos": "@curvesbecomeher Just saw a repost from @vonfrankenstitch who kindly redirected me. I think you ladies look adorable, & I can't even begin to understand what happened to your account. Be beautiful, girls!!! 💜💚❤️", "sara.lynn88": "I don't see what's so offensive about this photo. There are ads on IG with girls wearing barely there swimsuits and no one bats an eye. You girls are rocking those swimsuits and I love your confidence! 😘", "donnablakey": "Have @instagram apologised for enabling the bullies?", "sharonsneed": "You 3 look fantastic. How I wish I could find the courage to wear any of these suits.", "yarner99": "Luv the lepoard print bikini #want", "scarrednotscared\nVerified": "Verified", "jessicachik_": "@itschlojo @katelyn_collins60 I want the cheetah one !!", "curvesbecomeher": "@bigdgrown38 STFU", "thecurvecult": "Thank you for tagging us! @curvesbecomeher", "sapphiresplendour": "Thank you to everyone you left a comment, reposted this image and who have been nothing but kind and supportive to us! Thank you!!!!!!", "chalkjourney": "I showed the picture of you three beautiful women to my daughter. What makes you the most beautiful woman I have ever seen is that you love yourselves. You are promoting a much needed positive social change. We are with you. I talked to my daughter about how as women our bodies change with time. She is 8. I told her most women have stretch marks and cellulite and that's normal. I told her we only see a certain kind of woman on tv and in magazines but we don't all have to look that way. We are all unique and beautiful in our own way. Its what's on the inside that counts the most. So Thankyou for being brave, loving to yourselves and others, kind, and awesome from the inside out!!", "looksstudio": "Way to go ladies 💯✔️💪🏽", "katiekaras": "Stay strong. Sending love and solidarity all the way from Michigan, U.S. ✊🏻", "ninilarouge": "You go girls!! 😍❤️", "mutantxfactor": "It's hot outside! Rock those bikinis & enjoy life 😍😘❤️ @curvesbecomeher", "schlossamantha": "❤💘", "itsmevlado": "This girls are just lazy and hungry", "xkiim.b": "you girls are amazing , don't listen to the haters 💞", "alicia_laws92": "So beautiful. Only question I have: where did you get your swimsuit? Super cute ❤❤", "iceecenichole": "I think yall are beautiful♡ be you don't try and change just because haters don't like the way you look.", "jennsgotcurves": "Thank you so much for this!!! I always feel like people are telling me to stop defending myself against body shamers and saying ignore it, don't stoop to they're level. I just can't do it. I have to tell them they are wrong. If no one stands up to this and only ignores it, nothing will ever change. Keep telling ig and the body shamers they are wrong every chance you get!! We should all be doing the same, because opinions need to change. This pic is gorgeous and should be celebrated. I'm so glad you reposted and took a stand!!! 🙌👏👏❤️🎉 #stopbodyshame @curvesbecomeher", "nicholeh0205": "Love this picture. I looked through some of the cinema and saw this quotation, but no answer. ..where are those bikinis from?", "psas082711": "Anyone that thinks this pic is wrong needs to take a look in the mirror. Your hate says more about you than those girls. People are very quick to judge, but rarely take a long hard look at themselves. Those girls have the confidence to show their true selves, while others don't even have the confidence to put a profile pic on their account..... Go girls! 👍", "s_herny": "Like 👆🏻", "billiejoesneck": "Preach", "_dont.follow.this.plz_": "@curvesbecomeher Ihre willkommen.💜", "celafiji": "@kawaiigen some people just need to go straight to hell. I wish I could posses such confidence as these women do.", "anthony.rhoades": "Beautiful ladies!! 👑👑👑", "furrymomster": "I think you're all fierce and beautiful af and I'm jealous of your amazing swimsuits!", "_kaytelyn": "All 3 of you women are stunning 💜 keep living your beautiful lives 💜", "sierralairds": "❤️❤️❤️❤️beautiful beautiful beautiful", "summer_the_mutt": "@x.h.x.n.n.x.h.x 😣 it's not an easy journey to fall in love with yourself and be happy with yourself but it's doable. Youre beautiful! One of the things that really helped me was starting to recognize how much negative self talk I really had and slowly started to catch them and change them to positive shit (or at least stop the negative and leave it at that.)", "rarajane": "Y'all look gorgeous!!", "_walkingwithgod_": "Why exactly? @burping", "lilasroseparis": "You have my support and admiration. 👏👏👏", "sowlejourney": "Beautiful lovely happy ladies! Keep being awesome!", "faith_raye": "I'd rather see this over the porn that is on here and so much other stuff. Why is women embracing there image in a positive manner bad when women and men that have porn not getting taken down? This is offensive to no one.", "gnartha_stewart": "Fucked", "mayelinepamel": "@gabyjimenez21", "vasilopoula": "#LeopardSuit 👌🏾👌🏽", "jedi_master_vivi": "@elwolf28", "_vi.xxiii.xiv_": "You ladies are beautiful. ❤️", "evelisacastellani": "You'll look flawless 😍", "jaimebutlerr_": "I want to know where that cheetah swim suit came from? LOVE IT!!", "pcojess": "I just looked through @instagram 's page and there is hardly any body diversity at all. Seems like the company needs a major reality check @curvesbecomeher", "m_maryam32": "Its ridiculous that they actually took this down, you're all beautiful. No one is perfect and people need to realize that", "maloupaul_jewellery": "I loooooove that bikini on the right! I want to have it!! 😍", "bunny_574": "Supporting u bcoz i am also chubby and i will never Like that anyone will report my pic @curvesbecomeher 👏👏👏chubbyness is a new swag haters 😎😎😎😎😎", "half_of_holly": "Let me get this straight....so this pic was deleted and trashy shit like @ladybug__espresso isnt being deleted? Really?! That is discrimination at its finest!", "lilizinhaaoliveira": "q belezas", "kays_mummum": "WOW!! @instagram....there are sooo many pictures of girls in swimsuits on insta..that I'm not sure how you can explain yourself for deleted picture above? Shame on you for the bad judgment!!!", "louise_madeline94": "Obviously Instagram doesn't like to show real woman, they can't handle the curves 😉 keep your head up lovely, and shake your booty at the haters 😘", "deathandglory_": "@whytneyyy i wish i could share this!", "momo.maldonado": "#beutiful", "jezlinviola": "@motherballsxz !!!", "jewelzjourney": "P.s. all threw of you look stunning 😘😘", "luciainfoodwetrust": "Supporting your cause and reminding you Mondays are shit and make people crazy! Don't let anyone ruin your Monday @curvesbecomeher ♥️ you girls rock", "eloujn": "You guys look great! Take a look at our lingerie! It would look great on you!", "forma.l.dehyde": "Wow... that is downright shameful what they did to you ladies. There's nothing obscene about curvy women. Smh. I've seen literal buttholes that IG won't take down.", "familievanderveen": "Ugh.. This makes me sick. These girls are lovely ❤", "kelpalms": "Gorgeous!!!!", "jessiebooboo1986": "If only I had their courage @mizjaxs", "head2heels": "Much love to you, Aarti", "rosewinder.k": "Caption ,👏👍👌 GOD Bless , You girls are beautiful.", "therealcynthiaramsay": "What the fuck!? That is absolutely ridiculous. I'm glad you're standing up and posting it again!!! You ladies are stunning and have just as much right to be here on Instagram in your swimsuits as anyone else!!! Keep on changing the world, girls!!! 🙌🏽🙌🏿🙌🏻🙌🏾🙌🏼", "k.risalynnn": "Absolutely gorgeous", "betty_crockerwannabe": "Honestly more power to you girls for even getting in the suits in the first place. I know damn well after 2 kids and dealing with depression, you will never see me in a bikini lol but you girls faced fears and even put it on the Internet and from there you even went on to defend yourselves which is beyond more than most would do. 👏🏻👏🏻👏🏻 #everybodymatters 💕", "alexiaochoa__": "@forever21plus", "risingabove_thenegative": "You guys look fantastic", "laurenmcaulay_": "You're amazing ❤️❤️❤️", "feministastic": "You're so inspiring! Thank you for what you're doing.", "ohhannahkaye": "Where did you get the leopard?", "mel_uhlenhake": "Yo you all rock those suits 😍 3 beautiful women", "monicathelabel": "Seriously, this photo was taken down?! I see porn, like full on porn and web cammers come up on my Instagram ALL THE TIME and THIS gets taken down?! Like is there an actual human person that 'reviews' the reported photos or is it just a computer that deletes reported photos? Good on you for putting this photo back up and enlightening us on the situation that just happened. This photo is amazing. You ladies are beautiful, brave and inspiring 💗💗💗", "cali_chelsea": "They need to stop with that hate", "nicole_bette": "That's weird that it was deleted. Are you sure? Did they message you that it was removed?", "pizza.diva": "💚💚💚", "najmah_95": "@curvesbecomeher this post makes me want to wear my insecurities out and own a bikini💜🔥", "ithadtobemaine": "This is crazy. Wow. I'll definitely repost it. How messed up do people get? I can not believe with some of the images out there I have seen that this picture is even remotely offensive. You all are beautiful strong women. Don't let it get to you! 💚💓💚💓💚", "goingforself35": "They're nice! To hell with what they're talking about!", "selftitles": "Beautiful 😍", "danielleamarx": "@v.monticello_ This is body shaming too. Please don't put down thin women in an attempt to bring plus size women up.", "angiemaco": "I think everyone should respect everyone!!!! If are not going around reporting skinnu people post they shouldn't but I understand their point of view so its a sensitive topic! Good luck", "rashidasmama": "Cute as cupcakes!", "jamieculjan": "Wow @Instagram ...again?! Kim Kardashian's nudies are acceptable but this- this empowering image of 3 role models is not? Shame on you!", "leenamazhar": "Slay🔥", "lydiadicksonblog": "Don't you haters dare! We got your back beautiful! 🕶", "camz.exe": "Are you for REAL? EAT SHIT HATERS.", "sinsacami": "👌🏽👌🏽👌🏽👌🏽👌🏽❤️", "wrapstarsheree": "You guys are gorgeous!!", "delorcakery": "#curvyconnyc", "blytheemens": "So beautiful! Xxoo", "dianarocksxoxo": "Big girls work!!!!! Slay slay slay 🌴💛💋", "tate_harkness": "Oh no seriously?? This is a great photo. How is this offensive? Women owning their bodies and being confident is never offensive. For shame instagram 😳", "ms_chrisiz": "love this pic!😙", "enaganguly": "three hotties!! 🔥🔥🔥", "thickathanabible": "What REAL women look like", "secureinstyle": "❤️❤️❤️❤️❤️❤️", "sagceries": "Insta is full of shit!!! Y'all are so gorgeous", "mademepretty": "You ladies are gorgeous. Simply gorgeous. ❤️❤️❤️", "sleekerscouture": "Queens! Slay! ❤️❤️", "yourstruelymelly": "I will repost when I get back from dinner. I'm so glad you are taking a stand and speaking out about it! And that you reposted as well ❤️❤️❤️", "moongdess": "beautiful 💛💙💗", "thatvegaschic82": "You 3 dolls are flippin gorgeous! Eff those fatphobia mofos", "karthigakarthi": "Beautiful", "_orangezest_": "Good on you for standing up for women everywhere. Keep fighting the good fight. You all look fab! x", "shayandbarry": "You guys look great☺ unfortunately there are a lot of narrow minded people out there....", "owensmommy091417": "Slay!!!!!!!!", "flabisthenewfab": "@curvesbecomeher dont mind them. Carry on the fight!", "_heyyylauren_": "Yay!!! I'm so happy you reposted this. @instagram needs to get it together...", "glendaofalltime": "Fabulously gorgeous 😘😘", "alyx.parker": "wth you all look awesome. all bodies are good bodies. shame on instagram for taking it down. keep posting! 💖👏"}