{"biancamedina__": "💖💖💖💖💖💖💖💖💖🇩🇴🇩🇴🇩🇴", "ma_vassimon": "You’re beautiful, and you look amazing in this bikini, love the colors!!", "jaderheredia": "@gabriela10m eso ta bien", "michela_skye": "I think you are inspirational and you should be proud because I am to afraid to wear less than a one piece in public. And you are amazing enough to go against the patriarchy and terrible people of the world. And for that I applaud you. Thank you for standing up for the \"curvy\" women in our society (me included).", "kittyworx": "Omgosh I luv how confident u are", "kimjongbil": "@gofergyerself", "anjie6": "https://anjiesharma.wordpress.com/2016/06/11/all-about-fashion-today/", "melanielomejor": "❤", "tiffermonster": "You look fierce. #fuckthehaters", "estercfe": "You look amazing!!:) @jjoanna", "val_toomuch": "Very nice !!! Where did you buy it ?? 💖", "merlinbram": "Awesome!", "escritora_compulsiva": "Estoy muy de acuedo con estar agusto con tu cuerpo, el problema viene cuando quieres demostrarle a la sociedad que estar delgado no es la unica belleza, pero empiezas a descuidar tu salud. No es lindo estar muy delgado, así como no es lindo estar en sobrepeso. Ninguno de los dos es sano.", "lanipontt": "🙌🏻 beautiful! Love those bathers too - they look amazing on you!!!", "globalcouture": "Looks super cute", "bjhfxnfckyjfotdj": "Couldn't agree more. Keep going 💪🏽💕✨", "alicia.renae.art": "You're gorgeous!!", "napxsugar": "@theblackkdahlia", "fernando5523": "Maravilha", "the_ultimate_cheese": "@curvesbecomeher I can't even put into words the amount of respect I have for you. You are beautiful. No, scratch that. You are GORGEOUS. Continue to be a warrior and continue to uplift your body and yourself. You deserve it.", "wafabywafa": "Good for you!❤️", "saleemmujahed": "Nice", "bluebellygirl": "♥️♥️♥️♥️♥️♥️♥️♥️", "pkniazi78636": "I love you 💋 😘", "day_nut": "you are beautiful!", "girlgerm": "I have to thank you and other body pos babes for my confidence in bikinis. No towel over me. Pic not taken while in water. Loud and proud xx", "xditaaa": "You look stunning!! ❤️ gives me confidence", "shop_the_curve": "@curvesbecomeher you are making me want to unleash my arms to the public for the first time IN MY LIFE , (im 29) thank you 💖💖💖 you have no idea", "bekahinpink": "Love it! Keep on keeping on! ❤️❤️❤️", "loooonahtic": "I extremely need that swimsuit! 😍😍😍", "kim_xx_": "@tamasamaru", "katrina_morgan86": "You are gorgeous!!", "cliffordsense18gmail.com_": "Sexy mama love it", "melbell25": "You look brilliant. I bought a bikini for the first time. I put it on and my friends said I looked great. I just stood there crying. I had been so terrified and I was overwhelmed.", "gabriela10m": "@jaderheredia_ valor", "palomaperezr": "❤️❤️❤️🇩🇴", "erickasworld4": "Love it!", "mrs.pritchard15": "Your beautiful, don't let anyone tell you different.", "erinklepper": "You are sooooooooo pretty!!!!!!!!", "wee_womble": "Where did you get the suit? Gorgeous on you!", "kishwhippin_inthakitchen": "@curvesbecomeher Hella pretty", "aditikatbamna": "I love YOU! 💖", "sarahfairnelson": "That's amazing👍🏼 Respect👌🏽", "stlouis_girlie": "I am so glad you posted this picture. We all have to support each other. You are absolutely beautiful girl!!!", "artiegram": "More power to you namesake! I'm a plus sized girl who would never in her wildest dreams think of wearing a bikini publicly, let alone be photographed in one. I really admire your confidence, and hope someday I can muster up the courage @curvesbecomeher", "palaktaneja97": "@harshitamalhotra24 check her page", "arianaarmijo01": "LOVE this post so much. You're an amazing role model in today's society. Keep doing your thing girl ;) you're looking perfect :)", "kimberlycaptures": "Beautiful girl 💙", "tommyleeoscar": "Read your story on the news here in Australia. .. i just want to say you are beautiful!!! Sorry instagram censored and removed one of your posts.", "ifaizshaikh": "U r an inspiration dont listen to the narrow minded world mind well tongue dont have bones @curvesbecomeher", "fashionandfrappes": "You look great and loved your suit! What amazes me is that Facebook and Instagram have all the time in the world to police women and their bodies but no capacity when there are guys making rape threats to women online. Take some responsibility @instagram!", "irisgorgeousness": "@curvesbecomeher where did you get the suit? Absolutely love it!", "bubujon": "Absolutely stunning ✨ thank you so much, you are inspiring👏🏻", "bentzen_4579__dirk": "I need to know where you got this swimsuit at! #yaskween", "missmehtaaa": "@sanchichhabria 👍🏻", "wensterwenz": "That is a beautiful bathing suit! Where is it from? @curvesbecomeher", "danz_by_nature": "You are beautiful. Big 🖕🏽🖕🏽🖕🏽 to those who have a problem with YOUR life choices. I think this bathing suit is flattering and adorbs. I wish I had the confidence to wear it. ❤️❤️❤️❤️", "mmary_berry": "@sari_gnz", "judybswim": "Get it lady! 🙌🏻", "rosemevel": "You are beautiful ❤️", "curvesbecomeher": "@dulzon Hi! It's from @swimsuitsforall :)", "sylviafgmnb": "I think I'm going to make me something like that", "aadamz81": "I love the suit. Where did you get it?", "anjari_jha": "@danztaruchika this level?", "rosesrrosey": "@pink_morena", "daylah28": "Only comments we should all be receiving is of acceptance and love. You rock mama. Get it Kween. 👊❤️👙👑", "ykc79": "I love your bikini. You look good in it!!", "stephanie_sherrill": "@laineym9 I want this bikini for da summer nowwww 😩", "r2facts": "Way to go", "abc123doremifaa": "U look fab!!", "brittpysar": "You are such a wonderful human being ❤️ beautiful inside and out.", "swimsuitsforall\nVerified": "Verified", "rrajez": "U look great ! Where did you get that beautiful bikini ?", "adjpants": "PERFECT ♥", "courtney_coaches": "😍😍😍✨", "carm724": "I need some of your courage you go girl @curvesbecomeher", "jelicasingh": "People who hate are people who envy you and wish they had your courage! No matter how many nasty comments people give you, YOU know you are AMAZING! And you have tons of people all over the world who admire you for being you, myself included. ❤️✌🏾️👏🏾", "thisismeagankerr": "This suit looks fantastic on you!", "honeymarss": "You look magnificent, and the suit is gorgeous ❤️😍❤️", "ithadtobemaine": "You look lovely. It's good to move on and leave all that bad mojo behind. There is nothing good to be gained out of it. 🎀💜🎀💜🎀", "aayoola": "@gladyslebbie do u remember agesssssss ago I tagged u in a pic of someone wearing it saying I like it....do u remember where from cos she hasn't tagged. Tia 😊", "maddiemeigs": "That suit is to die for and you are wearing it so fab! I love your attitude in the pic too", "babsinmac": "You keep doing you girl! I started following you when I got wind of all the crap. I work with young children and your self esteem, resiliencly, attitude is what i hope every single one of them end up with in life.", "demandaleigh": "Love the proud stance! You look powerful and beautiful!", "dulzon": "Where is that bikini from?? 💕", "merleboelee": "You are beautiful!! You are a inspiration!", "amayzin": "You look great!! 💛💚", "antigoniphotography": "You look fantastic! I love love love that print.", "kaylaflava": "You look AMAZING in that swimsuit! You are beautiful and perfect <3", "geraldine_brico": "You look amazing. Don't let anyone make you think you're not BEAUTIFUL ❤", "katstroudofficial": "🙌🏻🙌🏻🙌🏻🙌🏻❤️", "ohnoitsjustjess": "You're amazing and inspiring! I love that suit and I love your words!", "ankrime": "This looks amazing. You re such an inspiration to me!", "fathippiequeen": "You are so strong. Keep being positive. We love what you do and are so happy you share a little bit of your world to us. You are a true inspiration, thank you!.", "iamsheglobal": "You look amazing!!", "stefi18ian": "are u a psychologist?", "mina_rasoli69": "wooooow 🌹🌺😘", "k.risalynnn": "Gorgeous", "ammaranala": "😻😻", "kaos_personified": "Hi aarti.. M a plus size gal frm india and i so know what and how u feel.. Sometimes going through a day without any negative comments is an ordeal!! I really admire your zest for life and what u are trying to do through social media.. Please do not get disheartened!! The world will take its time to realise that beauty lies within.. Till then please continue ur amazing work and keep smiling!! Ur are beautiful and dont let these assholes pull u down!! U are way above these things!!! God bless!!", "odwallafemme": "You look and you ARE incredible", "vj219": "Love this suit ---you're beautiful! 😍👑👸🏽 great post too"}