{"holly.andthe.lionsden": "@lifes_a_blurr thought you’d appreciate this as much as I do ❤️", "fatgirlpoppin": "This post is freaking amazing and I wish most people would ask the hard questions. It’s like “you can be out of your box but only within these requirements” FOH #effyourbeautystandards 🤟🏽", "newmanjessica": "💯", "frannamstyle": "Totally! I’ve got to re-post this! X", "yazzehandtheratbags": "How do I repost this? 👌🏼", "siany1989": "Love this’", "almarocio89": "All of this", "tree_yawna": "Take refuge and find comfort- your body is your home!! We must accept our own nature before we expect to embrace the nature of others", "lovethereal_you": "Absolutely love this!💜🙌🏼", "countkissesnotcalories": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 yas!.", "ericajanael": "Word! Support & UPLIFT women of ALL shapes & sizes. From one small breast big tummy to every lovely lady out there. ❤️💪🏼", "christentebbe": "Excellent point!!", "sachdeva_anchit": "Size is just a number...", "mandy_hargreaves_": "Yes yes yes!! Too many women giving opionions on other bodies. Let's embrace the divine goddess every BODY has wrapped inside. Too much judgement and comparison. I'm. Not too skinny... I'm me. Our bodies are packaging for our delicious soul. Go in pursuit of full self expression, of letting your soul shine. Give up the bs pursuit the world delivers of who you should be and BE your gorgeous self.", "messybpusssytee": "So true! It's like its becoming harder and harder to fit these beauty standards and causing more body dysmorphia and pain for people", "valokugraph": "I’m glad that through means of selective reproduction, delusional people like you will be weeded from the gene pool.", "pongtrometer": "#scentofawoman 🌷", "g33k_boy": "Huh. I haven't thought about it that way. I like this idea way better.", "princesscakep0p": "Obsessed with this post!!! Thanks for sharing this, girl 💕💕💕", "kristyk_fatgirl": "I have a big tummy, no hips and big saggy breasts. I relate to this a lot. I think body positive is supporting women and men of all shapes and sizes - big , skinny and everything in between.", "brittanyamber95": "I’m big all over, I fill out well and don’t appear to be the weight I actually am.", "leahceliamac": "@paisleypick", "artofmisanthropy": "Fantastic x", "ohwizeone": "Boom!!!", "pdxfashionista": "I love all bodies. But that’s just me. ❤️", "ninapeel13": "Yesss", "kittythewomble": "@gemmaslittlelight", "trubblemakerindrani": "@rajeevrxb what say?", "sesamsamae": "🙏🙏🙏", "_myronia": "@cyclique_cleanyourcup je me suis dit que ça te plairait", "olaw1469": "Yes", "bodyposi.b": "Yes yes yes yes to all of this!!", "dtg_75": "🙌🙌🙌🙌", "voluptuousleah": "Thisss!!!", "iskra_tsaritsa": "Thank you for this! I couldn’t agree more!🙏🏽🙏🏽🙏🏽💖", "glowy_by_isha": "Love this and you have hit the nail on the head", "sogwladys": "THIS 🙌🙌🙌", "colormyflaws": "Round of applause for this oldie but goodie.", "frieddumpling": "This!", "kdbennett": "💛💛💛💛💛💛", "ladypsych13": "Yes", "smithythefishy": "YES YES YES! 💜💜💜 Thank you for emphasizing this point!", "thecephalopodess": "Amen", "iamsarahpotenza\nVerified": "Verified", "mazzasweet": "Yes 🙌🙌", "amandalee684": "Yes!!", "itsshantaatkins\nVerified": "Verified", "meaghf05": "Love love love this!!!", "cochineria": "@x.pud.x", "brujapxssy": "My last post is about this exactly", "emmapeercy": "This is amazing and says so much. ✨", "ashduhhope": "❤️ love this thank you", "j_hanali": "🤗yep!!", "_nati_mami_": "Those non perky are perky 😄😄❤", "lishamaree": "how accurate is that? something I've been noticing a lot lately is the love for plus size ladies but only with a flat stomach which is not that common", "p.s.kaguya\nVerified": "Verified", "curvywordy": "Yesssssss 🙌🏼🙌🏼🙌🏼", "afroafrikaa": "Awesome 👏", "leuryck_valentin": "So true! We need a lot of this!", "aftermyownbelly": "Really great post!!!! Xoxo!💜", "guayabakitchen": "👌🏽", "coraglitzer": "👏👏👏", "alliestrawberry987": "All bodies are beautiful 💜 I try to think of bodies as flowers 🌹🌺🌻🌼 Just because I think someone else's body is beautiful doesn't mean my body isn't because they aren't the same", "mettekpetersen": "Great point!", "risaroo88": "When you go through these pics and gotta teach your bf what they mean....one step at a time", "vitadibi_": "❤️ ❤️ ❤️"}