{"staceymillicentcarson": "Thank you so much Aarti for posting this. It’s brought tears to my eyes. How incredible sad it is that we hate ourselves and our bodies and it is ENCOURAGED by ridiculous diet culture and misinformation about health and weight. Much love to you. What an incredible warrior you are! ❤️❤️❤️❤️❤️", "snepal123": "I did not have an eating disorder but I almost killed myself trying to lose weight so I do relate to this completely. Sending you lots of love and hope you gain more strength X", "zunestress": "I’m always grateful to see your posts- hoping you’re feeling better!", "curvesbecomeher": "#bodypositive #bopo", "laurengord0n": "Admire your bravery and hard work ❤️", "kcb313": "💗", "sundarciriya": "Thank you for reminding me why I keep fighting against the toxic diet culture and learning to be ok with my body and weight just as it is. I have PCOS as well and went through a major weight loss 5 years ago- spurred on by the idea that the more I lost the more chance I'd have of finding someone who'd love me and caused by over-exercising, anorexia and bulimia. Although some might say I was healthier then-I disagree entirely as my mental state was full of depression and self loathing. I still struggle to be ok with my body just as it is-but I am so much better off mentally letting my body do what it can and accepting its limitations.", "srishangeetha": "❤️❤️❤️", "sritha2": "I feel the reluctancy for photographs, I still hate it and I hate photographers that don't read my no", "allsizebeautiful": "You were beautiful then and even more so now that you wear your true self. 😊❤", "amruta_nargundkar": "It is so wonderful to see how you love and respect yourself ❤️🤗", "lara.k.robinson": "love to you and your whole being.", "liisalouwho": "Thank you for sharing your story! It's brave and hard and painful to recover, and I am so happy that you have been able to ❤️", "trevtheblogger": "Thanks for sharing such a personal experience. I suffer from PCOS as well and can relate to much of what you stated. It is in fact a journey but you are obviously taking the right steps to overcome the negative self talk that we as women have on repeat.", "anniecris88": "Aarti, i was skinny growing up. But now I'm 56 and I'm shaped like my grandma before me, quite plump.... And i hate myself.... I try to think it isn't true but i look in the mirror and i disgust myself.... I'm too old to be doing this! I tend to dress gender fluid... Right now I'm going through a boy stage.... During this stage is when i hate myself....i want so bad to love me again.... Listening to you helps... Seeing this photo of you stops my heart because it's not you with your essence... I don't want to lose my essence.... Why do i hate me?", "punk_flamingo": "I fully understand your mindset then and now! ♥️ I’ve been a passenger on the weight rollercoaster and it’s not easy. When I was much thinner I was miserable in a bad marriage but happy with my weight. Now I’m in a fabulous loving marriage and am at my heaviest. I wish I could accept my weight and my chronic illness but it’s a mindfuck every day!!!", "_recoverystrong": "❤️❤️❤️i have struggled with fluctuating weight and i know how it feels to fight for acceptance of your own body. i’m just starting on the long road to recovery and your story really inspires me. thank you for sharing!", "mskimswanson": "@anniecris88 oops, posted too soon. I hope this helps a little. Remember you are here, you exist, you breathe, you are. You deserve t o live your best life without guilt or shame.", "mel_ziki": "Thank you for sharing....you are one strong lady💕", "kittehinfurs": "When I look back at the few photos I have of myself from my ed days, I can't even recognize myself. Yet, just like you I also have to watch out for disordered eating patterns, especially when I'm depressed. Even though it's been so long. But you've come so far from being the person in this photo! And you've kept working at recovery and sticking to your guns over the years. That's no small achievement 💗", "sharonkaurgill_": "You're inspiring. I don't know if it's moving to Singapore - but moving here I definitely feel like seeing thin Asian girls everywhere + some comments i have received for not being skinny, has brought some of those toxic dieting thoughts back. Thanks for sharing - I love your page. Xx", "khadine_k": "Inspiring!"}