{"stephaniesessentials": "#truth", "darshanapathak": "i experienced this so much with friends in high school which eventually led me to having panic attacks if i had to be around them because I did not feel safe or welcome around them. i still meet new people like this and i just keep my distance know because no matter how hard you try to educate them on their behavior, they have firmly planted themselves in being hateful, and its exhausting. fuck people like that. i would rather be in my own company than feel ashamed around people that are supposed to be my friends", "hannahgsart": "Yes!! It took me so long to get the courage to cut those kinds of people out of my life. Like if they can say horrible shit about someone’s body to me what did they say about me when I wasn’t around?", "usually_flannel": "There’s always that person who talks shit about everyone else and you know they’re doing the same to you. Not someone to confide in or consider a friend.", "itsshantaatkins\nVerified": "Verified", "emikos_unexplained_blogs": "Girl yes and they been gone out my life. No time for that.", "thatoneyogi": "Did you post this on Facebook so I can share it? Yes to it all!!! Trips me the fuck out!!", "kkj09": "In my FUCKING LIFE I will NEVER forget the \"friend\" I heard say this shit around me and then be like ughhhhh but not you GIRL! Haha no I've documented this in my head and know what you really feel.", "dianecastelo": "I used to have a friend like this...she still doesn’t understand why we are not friends anymore...", "sambot253": "Oh my GAH I feel this!", "born_a_swan": "So true!!!", "srishangeetha": "Oh yes! Totally!👌🏻👌🏻", "theplussizewomaniya": "Totally relatable!", "feltflanerie": "Yes🙌", "fruitbat5150": "💜💜💜", "baloo_moo": "Ughhhh", "merliahmermaid": "Yesss!! I used to have a bestfriend and she would bodyshame someone bigger whenever shes bitching about them. I called her out for being a hypocrite and then i cut her off! Dont need that kind of negativity", "emmrosexox": "@laaazyghost you were literally talking about this the other day 🙄🙄🙄🙄", "ver0ni_ca": "You know.. all these people are so concerned with other people’s body and can’t take a second to even look at their own life and realize how messed up it is is crazy. How is it that you have so many feelings and so much anger towards another person’s body in the way that they live their life yet you can’t look at your own life and try and fix that? It blows my mind how many people cannot mind their own body. They always have to have something to say about someone else’s body and the way that they live their life..! #lookinthemirror #yourefarfromperfect #startwithyourself", "yonehslanos": "YAS", "archu93": "OMG YES!", "deva_32": "Agreed", "deathstardarlin": "Had to face the same thing a few years ago. I wish them the best but that negativity isn’t for me. Thank you for bringing this to light 🙏", "goldihanw": "This is everyone I work with!! They slag off larger people in front of me and most of these people are not as big as me. They also criticise what others wear which also annoys me as everyone should wear what they want. #bodypositive", "metricdisco": "👏🏾👏🏾👏🏾👏🏾", "visithra": "Yep. They will pounce at your size the moment they have an opportunity actually. The hiding it from you doesn't last for long", "svehuti": "You know, I think I've never really encountered fatphobia in the outside world just yet. And before it is assumed that I live a sheltered life, I just wanted to also put it out there that it is quite possible that I may have developed this view because the outside world was never as brutally terrible to me as my own inner world. Inner world here being my family. They are the ones with the attacks on my rolls and the \"you'ed so pretty if you lost 10 kgs\" and the \" a guy would so want you if you didn't have blablabla\" .... Or the countless 'diet tips' given to me by aunties who are rather overweight themselves. For me, unfortunately ( or fortunately?) The outside world has never been as mean as my inside world. If that makes sense ...", "marire": "Yes!! This exact thing just keeps pissing me off.", "smalltownpen": "I feel you. 🙌"}