{"bainsy26": "Looooove this look!! Rock it!! 💜", "karbowiakrose": "Yassss", "suuspicious": "You look AMAZING!", "emicsimpson": "i LOVE this top 😍😍😍", "malvina_mmmm": "You look absolutely fabulous!!", "hautecurves_": "Love it!!!!", "mikikoftokyo": "Lol you are fine. Nothing to hide It’s cute on you and im glad you know that. Mine are huge and I’m like look u see them with or without the cut of the shirt lol.", "rosiefyn": "You look amazing! You're rocking that top! My boobs are a bit saggy too, but at double D's to DDD's they're not gonna be up by my neck lol.", "divayenta": "Caramba! Mucho calliente!", "nazirahashari": "😍😍😍😍😍", "thebodyloveseries": "👏👏👏", "sewards.folly": "😻😻😻😻", "mayamoonpoet": "You are so hot! So glad you shared this moment and rocked this look!!", "missdeedee1978": "I love it!!!! Slay! You give us hope, I too have saggy tatas", "ohheyitsmekatieb": "You look fantastic!", "baaprebaap": "I love how grungey this look is! Badass ❤️", "miss.ranty.saurus.rex": "The top is very sexy & cute! 🖤 You & your tatas look great! 🙌🏻", "risaroo88": "Yo holllaaaaa you look amazing", "edenjoykalom": "Saggy boobs are beautiful! I've got a pair of sagsters myself, and while I'm generally self-conscious about them, I need to remember that it's all just part of living in our world. Gravity, mass and all that. So it's kind of beautiful that some boobs are weighed down like flowers heavy with their petals ❤🌸", "kbgetshealthy1129": "Yassss! You are gorg! ❤❤", "kaytblue": "@curvesbecomeher love everything about this, but mostly your expression. Fabulous! 👌🏼", "itsjessdarling": "Love it! You look great!!! I definitely don’t see anything to be self-conscious about! You look gorgeous. But if it is something that bothers you, I totally get that struggle. Have you ever found a bra that makes you feel more confident? If it’s something that really bothers you, you could always explore more options that way! However, like I said I think you look great! It’s super empowering to accept your body and wear clothes that you like and not just because you feel that’s what society says you should wear!", "chandana_jaganath": "You look lovely 💕", "theallyandizzyshow": "You look fierce! That lip color is fantastic.", "liisalouwho": "So beautiful, so badass!!", "_takeme_as_iam": "Same girl. I never wear anything low cut for the same reason and there’s so many cute tops out thurr. 😢 but one of these days, I’m going to just go for it. ✊🏽❤️ very inspiring hun!", "leelee_calderon": "That is hot girl 🔥🔥 saggy tata club over here✋", "lovescrescendo": "That top looks amazing on you! I can definitely relate to hiding in my clothes before. It feels so good to be free and living as your best self!", "cosmicspider31": "That lip colour on you 😍 and your tatas look fine to me sister, let them stare, they're just jealous of your glam 😋", "amandalee684": "Wow wow hottie!!", "thehippielatina": "Hottie!!! Love this outfit girl!! 😍♥️🔥", "monstrance.ghastly": "You look beautiful! I have saggy boobs too, but we can’t let that stop us!! 😄", "ashlieelizabeth": "Girl yes", "thebiggerblog": "You look cute! Saggy is something you might see immediately; others don’t.", "native.body": "YES! You totally deserve to wear what makes you feel great about yourself. I can totally relate having hidden behind clothes a lot of my life... You look gorgeous! 😘💕", "sarasue": "🔥 🔥 🔥", "rosa_timmer": "Omg Please don’t hide, you look amazing in this!! So inspirational because I tend to hide certain curves as well. I see now there is no need to do that. Thank you! ❤️", "fattiesandfeelings": "woweee looks beaut! ♥️", "frannamstyle": "Awesome outfit 😍😍", "well.read.panda": "You look great! Love the lipstick!!", "tempehgirl": "This is such a great look!", "shasthrika": "OMG you look amazing... What's there to hide. Let's celebrate those curves", "polishhaunt2": "Fatbulous!!!!! Super love it.", "srishangeetha": "❤️❤️❤️", "antonieta30": "Looking good! I love that top😍", "p.s.kaguya\nVerified": "Verified", "jenny9624": "U look good babe", "geoneiluk": "Love you in that top! Don't hide yourself!", "curvylexie28": "Great picture!", "bopowomen": "This is 🔥", "mariaalicia24": "Nothing to be self conscious about. You look amazing, lady!", "foxwithfender": "At least you have tatas! I'm still waiting for mine... I'm 30 😩😂", "dionnepj": "Love the top 😍😍", "iridescentkaleidoscope": "Hot damn ❤️ so powerful and beautiful ❤️", "momlycoddled": "I love it!!! 💕", "ravjotmehek": "Love your outfit!!!"}