{"pictureperfect_yella": "I don’t have any record of my lifeless days. I destroyed all the pictures with the exception of the ones that don’t belong to me. Continuously loving and celebrating you my soul sister❤️💯❤️", "divayenta": "Gut wrenching and so truthful.", "snepal123": "...shared. I am so grateful to you and for you. More power to you ❤❤❤❤", "shannonleemcneely": "I remember that photo . You looked so unhappy, it broke my heart. 💔 You did possess the light you shine now . ⛅️🌤☀️", "coraglitzer": "You can be so proud of yourself about where you stand now 💪❤", "hxmsi_": "Thank you for this powerful reminder ❤️ It’s so important to have these difficult conversations with our families, and this gives me the strength to do it 💞 Aside from that- as someone who does have a sizeable ethnic wear collection (I’m an Indian dancer so I need ALL the indian clothes plz 😍) I know a few Indian brands that have online stores- would you like me to send you some links??", "krissinatra": "When I went to India to see my in-laws, I was surprised at the comments I heard from distant family members & friends about MY weight! MY body!!! Things that you never say in the US to someone because it's considered super rude & disrespectful! One day, I had a beautiful saree on, was all dolled up, looking super sexy.... & this random lady went right up to my husband in front of me & said \"so are you going to make her do a weight loss program or surgery?\" 😡!!!!! my husband angrily said \"why would i want to change someone this beautiful and vibrant? Don't be rude & judgemental\" And I said something kind of mean back to her.... but it made my husband laugh. NO free passes, sorry.... It's my body, I like it and they need to get over it!", "purplegal94": "💜💜💜🙏🏻💜💜💜", "sobbing_at_home_depot": "you are a warrior and a true inspiration", "weeshasworld": "Family always seem to hurt us the most in the name of caring and love 😞", "usually_flannel": "You are an amazing person. ❤️", "katjeevs": "I have actually married into a Sri Lankan family and my husband is soooo body positive and loving about every part of me but I do constantly get the questions about wether I am dieting or going to the gym from his family.. I have just stopped answering them tbh, because it’s exhausting trying to explain over and over again that I am actually fine with the size and shape of my body because it seems like a foreign concept. I was never a small girl and after years of dieting and trying every type of exercise imaginable to shed weight I decided to just accept it and learn to love myself (and this was just before I met my husband). My body has brought me through so much and has helped me bring two beautiful babies into the world, if that’s not good enough I don’t know what else is.", "fridasskold": "This is so important ❤strength to you, sister", "faithistohavewings": "I see lots of plus size ladies in the UK wearing beautiful saris. I wish I could send one to you but I have no idea how to go about buying one as it’s not part of my culture. It would be awesome if you could connect with a UK follower who could help hook you up. I wonder how much one would cost to send. If you can think of a way for your international followers to help you just have to ask! X", "thibowhoa": "New mantra: \"My body, my rules!\" Thank you yet again for sharing your life and your words 💕", "soniacsoprano": "Bless🙌🏽💕", "hello_imkarima": "💚💚💚💚💚💚💚💚", "mzmonroe": "Preach! You are perfect as you are!", "joaved": "Thank you for writing this ❤️", "curvesbecomeher": "#woc #celebratemysize", "jjohns225": "DAMN RIGHT", "le.vagabond_": "My body, my rules. No exception. ❤️", "risaroo88": "Your inlaws called u names?... 😔😔😔😔", "artistshelleymouber": "All of this, YES!!!", "merliahmermaid": "💯💯💯❤️❤️❤️", "meliqat": "I found a beautiful sari on utsav if you haven’t looked there!"}