{"curvesbecomeher": "@smartglamour thank you so much luv, that means a lot 💗💗", "silomaddie62": "Just a little invite to follow my page it is to inspire children to be happy with their look and be naturally beautiful x ownit", "lummyxm": "This is so lovely on you! Lookin' good! 😎", "soul_quest_fairywings": "You're a beautiful woman. 😊😙", "harryozwald": "you look lovely. you have such a beautiful personality. don't listen to trolls @curvesbecomeher", "koki_elzamalkway": "Great", "paomoreme": "💪💪💪💪", "quite_enby": "Beauty", "merkabahuf": "@curvesbecomeher you look wonderfully at ease in your body, looking beautiful 💕x", "pfanndawn": "Love the skin you're in! You look amazing & are very brave! Good for you!", "plusequals": "You. Are. Amazing. We love you!! ❤️❤️❤️❤️❤️", "pictureperfect_yella": "Screaming loud from Buffalo NY-- I freakin LOVE you sooooo much! Inside voice--Oh my gosh it would give me so much joy to hang w you in real life the way we do on here... ❤️❤️❤️💕💕💕💕❤️💕❤️💕😘😘😘😜 Don't EVER allow yourself to be taken down by the arrows of others who don't stand with you. I DO. 👭💕", "peter_scanavino_fanfic": "You are amazing and thank you so much for sharing these gorgeous pics!!!!👌👏💕", "scarrednotscared\nVerified": "Verified", "mrsbeverlygibbs": "oh wow i really love it!😍 i wanted a white suit but was worried it would be see thru when it was wet... it must have a lining or something? i will have to look into it for next year💕💕💕", "annesophiereinhardt": "Love this. :)", "abirarajalingam": "You look beautiful!", "yesyesitsmissy": "@curvesbecomeher love ur swim suit pls tell me where to find.....thanks", "katallica": "Slay, girl.", "selinycan": "perfect😍", "nursegina_": "I can't like this enough. #SlayQueen ❤️", "state_of_ruin": "You're amazing!!!! Thank you so much for turning the negativity that some people have into inspiration and positivity! You're absolutely beautiful!", "zoinks_zoe": "I just recently started following, but am already in love with everything you're doing❤️", "bidajuice": "Beautiful", "theamberwade": "Seeing you pop up on my feed brightened my day! You radiate from the inside out! 💖", "missdeedee1978": "Keep it up sweetie because I know that I am one of many who are too scared to post pictures of themselves showing off in a bathing suit, crop top etc....keep encouraging us to enjoy life and our bodies. 🙂", "curlyredhairednewfie": "Oooh, I'm not usually a fan of white bathing suits but you are slaying!", "smartglamour": "You. Look. Incredible. Keep on fighting the fight while looking fab babe. 💗", "sogwladys": "Hello gorgeous 😍😍😍", "sritha2": "I've never worn a swimsuit, but all the WoC bloggers like you make me wanna try one! Also, love the body chain, gotta get me one of that too, lol!", "thebiggerblog": "So happy that you did post it anyway! #stopbodyshaming to all those which don't agree with you. It's your body and your life, enjoy it to the fullest. You look amazing 🌟", "abby143uk": "Keep on being fab and enjoying it! :-)", "catalyst14": "You look fanfriggintastic!!", "thanksforthewings": "💫💫💫", "alyssaroars": "🙌🏼🙌🏼🙌🏼 you look so awesome! Love that swim suit!", "originalroses": "I love everything about your caption !! Thank you for always inspiring"}