{"celene_lavender": "I can totally relate, had a fall 2 yrs ago down my stairs, wasn't Physio'd at the time. Fast forward to June last year my back completely gave up 6 months later and numerous tests exams etc I am laden with stress fracture and arthritis in all of lower back bones. Am now registered disabled have frames and crutches to walk and told I can only get ' holistic' treatment as it isn't going to get better- you're my inspiration curesbecomeher, sending warm wishes to you xxxx", "inzjehetprinsje": "Yes!! So glad you got some answers! Hoping you can work towards recovery of your back now!", "patchouli_and_amethysts": "Try symphytum uplandicum (Russian comfrey) infusions 😊", "momlycoddled": "Feel better soon ❤️", "singaporeactually": "Just the word MRI alone scares me. You’re so brave. Hope you’re back to home sweet home soon.", "rocketnails": "Oh no I know what a suffering it is when you have a back injury.... I have a tumor in my spine and I suffer from severe pain every single day..... I love u and hope And pray that you find relief my love", "volup2": "I hope you feel better soon 😙😙😙", "signora_castaldo": "Sending you the message that you posted that soothed my soul...I hope your pain eases soon @curvesbecomeher ❤️❤️❤️", "ladymissbeca": "Just thinking about an MRI makes me want to vomit. #claustrophobia", "chiarasalvagnin": "The best thing is finding answers, I imagine it's been so relieving for you to find the cause of your excruciating pain and I'm so happy for you ❤ I think it'd be the best sensation for everyone living with chronic pain 🌹", "loveleahblog": "Sending lots of love and healing vibes ❤️❤️❤️", "emikos_unexplained_blogs": "Please take it easy and feel better hun <3", "frannamstyle": "So glad you’re finally getting answers! Xxx", "finewinz": "😢", "iridescentkaleidoscope": "Take care, Aarti! Sending you lots of love and good vibes ❤️", "danibebean": "Get well soon ♡", "fruitbat5150": "It’s very positive to me that you sought out answers till you got some, even braving the MRI (I am so afraid of them), and being ready and willing to do rehab. You are a tremendous inspiration for me (and I hope that’s okay with you) to do better with my pre-hab for hip replacement, and exercise in general. 💜💜💜", "unlikelykoala": "Sending you love and light and healing power! ✨✨✨✨✨", "zunestress": "Lady, this is positive! You have an answer!", "santacoppelia": "All the best to you, and hope for a great recovery! Lots of love 💜💜💜", "camilagancho": "My backs and my knees make me suffer too. I'm searching for answers and treatments to minimize pain but everytime it pains I think to give up. But I won't! Thanks for your reports!", "tlsnewsome": "Sending positive vibes....", "emmererr": "So glad you've found an answer to your pain and can get treatment and healing underway!", "femfab": "♥️♥️♥️", "findingtruthinme": "May the fourth be with you as well. Finally getting answers can be such a relief. Hoping you can start to feel some relief soon. 💜", "purplegal94": "💜🙏🏻💜💐", "choti_si_steph": "Yay for answers, and positivity!", "lilygmilly": "Im so happy for you that you have some answers! I have almost the same issues you do; still looking for my miracle doc", "rnbhermansson\nVerified": "Verified", "drawnbyjovanna": "❤️❤️❤️", "nataliemeansnice\nVerified": "Verified", "native.body": "So sorry to hear all of this. Praying for you ✨💛✨", "thulisamkhencele": "Sending you love and healing vibes babe. You can do this😙❤", "hellobhav": "Take care of yourself, Aarti, you've come this far and gotten through so much and you can get through this too 💜 and remember that you're not alone, you've got so many people who care about you and you don't have to go through this on your own. We love you, Aarti 💜", "amyxls": "Sending you all the love you need! Hope the pain eases quickly 💕💕💕", "thecurvysoprano": "Love you honey.", "summerinnanen": "I’m sorry you’re suffering, but so glad you got answers. ❤️", "bhappy247": "I hope you feel better soon🌹", "sapphiresplendour": "I’m just glad you got the answers you were looking for to get you started on rehabilitation. I’m so sorry you were in so much pain. ILU❤️", "duskonig": "Speedy and full recovery!", "clausencat": "Hell yeah!", "elabrababs": "Take care of yourself girl! Happy healing! Glad you finally have some answers and a plan of action.", "thiru_2912": "Get well soon💜💜", "ansu1705": "Power hug, lady. Sending you light and love x", "anniecris88": "Sometimes knowing is half the battle! You can do this! Go for it lady!😘😘😘", "rackletang": "Hey, a diagnosis is positive as far as I'm concerned! I hope you heal quickly and completely ❤", "meliqat": "So glad you have answers! Wishing you a speedy rehab! 😘", "kissmyash0600": "Sending warm thoughts and hope you’re feeling back to yourself soon", "hautecurves_": "You got this! Sending you all the good vibes and love ♥️♥️", "mlrice1119": "I hope you heal quickly! You got this", "allsizebeautiful": "Hugs and well wishes for you! ❤", "sundarciriya": "Keep taking good care of yourself! Much love ❤", "grimeandglamour": "Sending you love, healing and comfort", "maggiemunkee": "I'm glad you have been able to get some answers. I hope there are effective treatments for you. 💜", "facesofcocoa": "Sending loads of light, love, and healing energy across the seaa to you!", "coraglitzer": "It's so good to finally know what are the reasons... Happy for you!! 😘❤", "rainbowchatman": "I’m glad you now have answers and can start the road to healing! Love you Aarti 😘♥️", "waitrez3072": "Big,soft hugs for healing💜💜💜", "curvywordy": "I'm sorry for all your injuries, but it sounds like you have a good doctor who can help to reduce your pain and enable you to live a more comfortable life. Let's hope you're able to start with that ASAP! Sending lots of love 💗", "shannonleemcneely": "I am happy you know what’s going on now . 💖 all of my love to you ."}