{"breeneriece": "This is a LOOK! 😭😍 You look/are amazing! 💗", "waitrez3072": "Reclamation of space. Brilliant! All the YEASSSSS! Thank you. Thank you. Thank you.", "rosa_timmer": "I think I lost my jaw on the floor. You look STUNNING. Keep doing you girl. ❤️", "kangaroo_eva": "you look so cool", "julieguiza": "I 🙌🙌🙌 if even ONE person is positively inspired for acceptance, it's a win!!!", "docspicer": "You do you my darling! You look fantastic ❤", "pk.tallli": "@curvesbecomeher So exactly where do you get this level of badass confidence from? Please DM me the address coz I need it in bulk. 😋", "lotus.blossom.rising": "Your amazing is accentuated by the outfit. Your transparency, as always, is humbling.", "sinfulsonia": "Standard la babe. Damn us if we r skinny,damn us if we gain weight. This ppl should reali mirror themselves n watch their own asses instead of KPO'in into others. Do what ur doin - your posts alwaz reminds me that I shouldnt be ashamed lf myslf wen im brlittled", "purdygirl7282": "You look wonderful ❤️", "shana._.banana": "I love this outfit, you look fabulous!", "sarahlouiseainscough": "👏👏👏💕", "pnansi": "Gurrrrrrllll", "purplelemons": "I love your outfit and you look stunning!!! 🌟😍🌟😍", "momlycoddled": "Such beautiful, wise and strong words Aarti!", "slowmotionsz": "You look fucking fabulous in this jumpsuit!!!", "roonyroonz": "Beautiful❣️", "alex___27_27": "You are looking so cute", "xo.n.e_": "😍🔥", "veronicaviolett": "You’re so gorgeous! Keep on doing you 😊", "moodysuburbangirl": "You look nothing but beautiful and gorgeous. Love the outfit ♥️♥️♥️", "hazardouswaist": "There is so much power in wearing what we want and loving ourselves. You’re beautiful, incredible and inspiring. Get it babe! 🧡", "jdejackome": "I love this outfit! And you are ABSOLUTELY KILLING IT!", "trevlyn_livin_life": "Thank you for doing what you do! It is much appreciated by those of us who are inspired! ❤️🌷⭐️❤️🌷⭐️❤️🌷⭐️", "robingillis": "Love those pants!!! I'm sorry you have to go through this too. Meanwhile, you are killing it! 🔥", "zhsomani": "I think you look absolutely lovely!", "shannonleemcneely": "You looked so beautiful confident and sexy happy dancing in this outfit ! Haters gonna Hate ... Artie’s gonna shine ! 🖤🖕🖤", "crea8ting_mybestlife": "You are beautiful and just made my damn day!", "_bex23": "YOU ALWAYS SLAY!! go you 💞", "ricecracker79": "My mom is Thai. I SO feel you, girl. Keep rocking it!!", "coraglitzer": "I'm really lucky (or been very picky in making friends) that I don't get policed by my loved ones. But you are so right! It's our choice and we have the right to express ourself with our clothes and style. And YES, we do inspire others. I experienced it last night 😊❤", "jamie_loree": "I LOVE LOVE LOVE that outfit 😍😍😍 you are rocking it and inspiring lots of women and men to be comfortable in their own bodies and I love you for that!!!", "nikathemadpastrychef": "I LOVE this, thank you! ❤ yesterday I took my son swimming at a public pool and i wore a swimsuit but also put workout shorts ontop. When I went to change to my street clothes, I realized I looked damn good and shouldn't have covered up just to make sure other people comfortable with MY body, which as I type looks and sounds crazy. Like I actually censored my body for others comfort, not mine, not my son's but for strangers. Since following you and other body positive pages I've learned to slowly love the skin I'm in and also to learn how to reclaim my space and to own it. So long story short, thank you x infinity you dont know how inspiring you are to me and I'm sure loads of others.", "purplegal94": "💜", "red_head_hooker": "You look fab and if you’re happy with your look that’s the most important thing of all!! I’ve had it with my family policing me and commenting negatively on my shape, I’m happy in my skin for the first time in a very very long time!!", "gvinegarette": "Jimminy you're beautiful!! 💖 I feel the same way when people want me to take off my surgical mask for photos! \"I got this!\" Let me be me!!! You dying of embarrassment isn't likely...me dying of pneumonia is! People!!", "amberbritt25": "Rock it, you look fantastic! I get the same double edged comments from old southern ladies. If I hear I should wear a sweater in 100 degree weather to cover my arms again, I'm gonna smack someone. Bless their hearts 🤗💙", "jennilynnfromtheroc": "First you look amazing and the most important thing is that you’re happy. Second where did you get that outfit is it a jumpsuit? @curvesbecomeher", "nataszashaft": "Fabulous!!"}