{"fruitbat5150": "💜💜🐕💜💜 I am so very sorry for the loss to your entire little family, as I’m sure that Suresh and your other babies will also miss darling Hershey deeply. He had a happy, happy life and knows he is loved immensely. 💜💜💜", "vaanideven": "I m very sorry for your loss dear😭", "lara.k.robinson": "sending all the comfort i can. I'm so sorry to hear it.", "jennboie": "I’m so sorry for your loss 💚💚", "jay_tee_cee": "So sorry for your loss! I can’t imagine the pain. I have 2 fur babies myself and even though I know it’s inevitable, I don’t know how anyone can prepare for their goodbyes 💔😞", "nilsajsonia": "Hugs hun.", "roxanesweetgrass": "I am so sorry for your loss. I have four cats - but love dogs - and know how devastating it is to lose one of the family. Much love 💕", "tate_harkness": "Big hugs Aarti. Sorry for the loss of your precious Hershey. ❤", "handtalker40": "Hugs to you! Our fur babies are everything! ❤💔❤🐕🐕🙋🏽‍♀️", "sherry__bloom": "So sorry to hear 😓", "thisismeagankerr": "Love you Aarti. I’m so sorry you’re hurting, Hershey was so lucky to have you as his human mom xx", "nourishandeat\nVerified": "Verified", "dragon.woman2011": "Feeling the loss of furry best friends with you 💔", "purplegal94": "So sorry for your loss. Love and hugs 💜", "roughbeautyworkshops": "❤️❤️hugs!", "k.mri_": "Your posts have really helped me with my self esteem and it feels good seeing you share your spiritual and emotional experiences. I really do hope I'll bump into you one day! Singapore is small???!!?", "hillycooke": "So sorry! 💗", "agelessenigma": "I’ve been there. It’s absolutely heartbreaking but there is so much love...remember that! Hershey was completely adorable!!!! ☺️❤️", "tracyrees7": "Sorry.", "lioness848": "So sorry to hear about Hershey, I knew something wasn't right when you hadn't posted in a few weeks 💔 big hugs", "plusbklyn": "THIS FACE 😍😍", "rosiefyn": "The loss of a pet resonates deep. I'm so sorry 💔💔", "charlottiejb": "We’ve missed you. Sending hugs ❤️❤️", "ealasaidh": "Oh no, I'm so sorry for your loss! 💚 It's so hard when they have to go.", "gvinegarette": "I am so sorry Sweetheart!!!!💖", "thefatsextherapist\nVerified": "Verified", "coffeeaddictx4": "So sorry for your loss. Pets are such a comfort to us that many do not understand. You do not grieve alone 😢", "bri_garcia_4": "I’m so sorry to hear that.", "lovecurvyme": "I am so sorry to hear it...i know how it feels 😑....they are like our family..", "singaporeactually": "So sorry for the loss of your baby boy Hershey...loss of one you love is just so hard.", "sharustication": "So sorry for your loss. I can't imagine how it must feel. I hope the memories of good times with Hershey comfort you and your loved ones in this time", "happyandhairy": "i’m so sorry 😢 i’m sure he was a very good boy who will be missed so much. i lost my beloved 20 year old kitty a couple of years ago and still miss him every day. my heart goes out to you! 💛💛💛", "jobellecee": "I’m so sorry you lost your little friend. It’s hard that their lives are so short but they bring so much in that short time, it’s always worth it. What a precious little guy. ❤️❤️", "miggshughes": "❤️🐾 love to you and yours. What a blessing out pets are!", "kknudson": "Oh I would be devestated😪 take your time to heal", "cedar.willow": "I'm so sorry for your loss.", "coraglitzer": "Aww, I'm sorry for your loss and send you a big hug! ❤", "jaylyn723": "I’m so sorry for your loss. Our little furry friends just burrow their way right into our hearts and it’s devastating to lose them. 💜", "meliqat": "I’m so sorry, losing a pet who gives nothing but love is so very hard. Hugs.", "poetess246": "Oh no... I'm so sorry beloved... it's the same as losing a human family member because they are members. Blessings @curvesbecomeher", "ajcersrich": "Im so sorry for your loss xx hugs", "rackletang": "Oh that's such a hard loss. I am glad he was so well loved ❤", "pk.tallli": "Words are of hardly any comfort in such situations. So all I can say is hope you feel better soon Aarti. Hershey is with the angels now.", "jilbijou": "So sorry for your loss. I know how heartbreaking it is. You can never fully prepare for it.", "sapphiresplendour": "❤️ I don’t know if it gets any easier but know that I’m with you.", "fatandkawaii": "Sending you and your husband so much love ❤️", "becoming_audie": "Sending you so much love and light ♡", "tempehgirl": "I'm so sorry for your loss. ❤", "clausencat": "My condolences ❤️", "carrie_926": "Thinking of you. Lost my baby in December and still having hard time most days...", "thebopowitch": "So sorry for your loss. Hershey was blessed to have you as his Mama. Sending love. 💕💕", "summerinnanen": "Losing a pet is so hard... I know how heartbreaking it is. Sending you love ❤️", "jewlaj": "So sorry.", "shoscar": "Love and light, losing my dear martin meant the world to me....I am so sorry for your loss 😔", "mamafierceblog": "I'm so sorry love!", "maggiemunkee": "I am sorry for your loss. 💜💜💜 Gaining a guardian angel is so hard.", "sehustlerosen": "I’m so sorry for the loss of your loving companion. There is no real way to prepare us for the major losses in our lives, grief can be so deceitful. My heart goes out to you, sending you vibes of love, comfort, and healing. 💕💓💕", "chicamissa": "I know how hard it is to lose a pet. He had a long life filled with love and that is all that matters❤️", "dianecastelo": "Oh, so very sorry for your loss 💔😪", "danasuchow\nVerified": "Verified", "svehuti": "My condolences babe. :'(", "duskonig": "Sorry for your loss. Way too hard losing our furry pets/friends. I hope all the happiness you bring each other will soon outshine the grief you feel over being separated.", "pettigrewdear": "So sorry for your loss ❤️", "ribbonreds": "So so sorry for your loss. ❤️❤️❤️❤️❤️ My Millie pug is only 5 and I already can’t stand the thought of life without her. My thoughts are with you. 💕", "instachamalam": "So very sorry. I hope you both can heal with time & just recall the joy Hershey brought to your lives.", "brendajwruiz": "I am so sorry for the loss of your beloved Hershey.", "shannonleemcneely": "My Condolences, ☁️🌾🕊🍃☁️", "curlyredhairednewfie": "I'm so sorry 💔💔", "angrybrownfemme": "my condolences🙏🏾", "aftermyownbelly": "Oh so sorry to hear this! Rest in peace little buddy. Xoxo!", "curvywordy": "I'm so sorry for your loss. Pets are family 💗", "sometimesredhead": "Sending love at this sad time. Xxx", "fullbellyalchemist": "I'm sorry for your loss. Losing a pet hurts. I'm so sorry 💔🐕🌈", "mun_zoom": "💚", "momlycoddled": "Rest in peace little Hershey. Go run across the rainbow bridge and chase butterflies and birds 🌈 #alldogsgotoheaven", "aimee.brrt": "Sorry for your loss Aarti, I’m thinking of you in this difficult time and sending love and comfort 💕", "theamazingbobinsky": "My heart is with you and the little guy ❤️ I'm sure he's having a blast in pet heaven.", "glendaofalltime": "Very sorry about Hershey, Aarti. Very heartbreaking. Strength and healing Prayers for you and your family 🙏💜 ((hugs)))", "jackieinseattle": "So sorry for your loss!", "modachrome": "i’m sorry for your loss 😔 pets are family and it hurts when they leave us. 💕", "lindseyhallwrites": "Sending love to you 💛", "eleanormackett": "I am so sorry for your loss. Allow yourself the time you need to grieve. Be gentle with yourself💗", "kdbennett": "So sorry for your loss.💛", "sinfulsonia": "I am so so sori to hear that! It is so so heartwrenching to lose one of our furbaby but he must be happily crossing the rainbow bridge now. Its never easy, i still miss mine so I noe no words wil appease you. But he is in a better place now. He will be missed (and i will miss alll the posts abt him) 💙 sendin u lotsa lurve right now cuz thats the only thing i can do. 😘", "crissiflo": "@curvesbecomeher I am so sorry for your loss. I lost my sweet baby girl Maddie a week ago, and I have been devastated, crying everyday. It doesn't matter if you knew the end was near, no one is ever fully prepared for the end. It is still heartbreaking, and our animals are part of our family. You have my deepest sympathies. Take care of yourself, and allow yourself to grieve for as long as you need to. #dogloss", "bettyb413": "So sorry for your loss!! 💜", "courtneyannecombs": "I'm so sorry for your loss.", "idratherbebaking": "So sorry to hear this! My heart is with you..sending extra love and light 💜💜💜", "signora_castaldo": "Sending love 💕💕💕", "dee_liciouz": "I’m so sorry :( these things really tug at ones heart.", "nataszashaft": "Awwww my condolences!! So sorry", "malvina_mmmm": "I’m so sad for you! 💔😢", "parttimepinupgirl": "Im so sorry to hear that ❤️", "_bex23": "Awww. My condolences love.", "marire": "🖤♥️", "sarah_the_colourwitch": "I'm so very, very sorry for your loss. Sending love and hope for healing.❤❤❤", "autumnwednesday": "💜💜💜", "samtylers": "❤️"}