{"missmegan_marie": "💞💞💞", "native.body": "Oh my gosh so beautiful", "glendaofalltime": "Thank you Aarti for sharing. crying makes us stronger inside and out. ❤", "shannonleemcneely": "Your post is beautiful. 🎋", "myxxfly": "Beautiful post. It's unfortunate that people shy away from feeling the full range of human emotion out of fear or judgement. I applaud you, and may your mother rest in peace 🙏", "unapologeticallythrive": "@shalynnm_", "alexiamakaylin": "Beautiful post dear, I wholeheartedly agree.", "mixedfatchick": "So powerful. Thanks Aarti, and sending love 💓💓💓", "daniela.marisela": "❤️❤️❤️❤️", "msdorez": "Thanks so much for opening up about your struggle. My heart goes out to you. Sending love and hugs your way.", "xoxo_lynette": "Thank you for sharing this!💕", "xoxomarissajo": "Such an amazing post!!! Thank you! 💕@curvesbecomeher", "carlinka": "top!", "mary846mary": "Just beautiful.", "singaporeactually": "You have a gift with connecting with people & helping them gain inner strength...keep doing what you do. I'm not brave enough to truly share my soul. Wish I was though.", "lenorashewrote": "👑❤️🙌🏾🙌🏾", "_only_bad_vibes": "So true. Thank you for these words!", "heartandartbysanny": "I love you. Thank you for those words 💛", "illisma": "@niikkiii_x @shaina.ac it's good to cry my friends!!💗💗💗", "karkar222": "Thx for sharing that! 💜💜💜👏🏽", "sonianizam": "@hilalyigit8495 caption ❤️❤️❤️", "hilalyigit8495": "The quote tho @sonianizam", "lepalaisduchic": "Amaaazing caption!!😢😢 What didn't kill you, made you stronger😘... @curvesbecomeher", "mediusa": "@marcofrasca10 💕", "zahragaznavi": "Really a much-needed reminder to everyone 👍🏼😊", "xoxoginjaninja": "I agree! When I was in school (for paramedicine) we were taught that as long as a baby is crying, he/she is okay. It's when they are silent that we need to worry. Something I carry with me daily and apply to my adult life. Crying is cathartic and should never be suppressed. And yet it is criticized and frowned upon as we grow up. Keeping those emotions inside and being silent may be the status quo but it isn't healing in any way.", "adjpants": "This was beautiful. We love you so much.", "lioness848": "Your vulnerability is raw and beautiful. I can feel the sting of the tear as it finally released when you took that breath. Much love and respect to you ❤", "26gillettbanktopi": "Crying is a beautiful thing it cleans the soul. Such a wonderful story I can relate ❤️", "armyofolives": "💞💞", "quirkysiren": "Beautifully written!!", "intense_tiare": "Your post should be read from every woman,there's no shame in crying.Thank you ❤", "elis_ali3": "My mom like your dad. She will asked me to stop cry or else she will angry. For me, tears make me feel relief. Is like a healing me from broken heart but in the same time and learns to be more stronger in my life. @curvesbecomeher love always.. 😘😘😘", "bbw_jellybelly": "Beautiful,crying cleanse the eyes too..", "findingevie": "@curvesbecomeher what a beautifully written post. Crying is something i do a lot. I can't even help it. But back in my 20's I went for about five years feeling so numb to anything around me I could not cry. I was a emotional torn chick back then. I literally think crying saved my sanity! ( hugs )", "heyitsdonnadonna": "Thanks for this post.", "paoladelf": "You're awesome, Aarti ❤️", "actressbioncab": "Its very healing to cry. I am happy for you. Crying is a strength. Beautifully said. 💚", "_em_cat": "I feel this caption so much. Thank you for posting this and being such an amazing human. ❤", "curvesbecomeher": "@eryn_frances Exactly. Nothing is wrong with someone who expresses their emotions with tears. And I am so Glad you have come to accept who you are", "amberinred": "Thank you for this. I always felt tears were shameful, and as a sensitive soul I cried easily. Only my mother once when I was in my twenties said something to make me think otherwise: 'you are beautiful when you cry.' At the time I was making some very difficult life decisions and I think anything good she saw in my distress was the will to get through it and out the other side, but I couldn't comprehend beauty in that situation. And my husband in the early days would tell me crying made me less pretty. As if our looks are important when we are in distress! I do not apologise for crying anymore; I would rather be honest about how I feel than keep people happy by pretending I am fine.", "mun_zoom": "💕", "tina.masuda": "There is no shame in tears. We don't need to maintain a sense of pretty when crying (or ever, if we're not feeling it). Crying is also not a sign of weakness. Beautiful post! 💕🤗", "mccallofthewild": "Beautiful!", "mamameya_15": "Thank you so much for this. I needed this today 😊", "purplegal94": "So incredibly beautiful 💜", "xcohlex": "What a beautiful and sacred caption. Much love to you, sweetie. If only more communities/people were more nurturing and encouraging of expression of emotions, particularly of sadness. Repression of emotions is so detrimental to a person's self concept and wellbeing. <3 keep being strong and showing your feelings!", "eryn_frances": "Needed to read this also... I cry alot it's who I am and when I don't it bulds up... And an ex used to say to me.. Why do you cry all the time what is wrong with you.... Turns out.. Nothing.... Absolutely nothing is wrong with me..", "irene_gertrude_malone": "So wise😘😘😘😘"}