{"nats.about.life": "The middle one ... Wow. I swear even I don't have the guts to wear a lingerie and take a pic and post it!", "omstonecreations": "I like the middle one. May I just say you are a very beautiful woman and much love to you for being proud of your body. You're a beautiful soul", "curvesbecomeher": "@because_ilovemycurves ooh that's awesome, I can't wait to see that post! Tag me in it when you upload the images! Always happy to help! 💗❤️", "lajoliefossette": "I thought of doing a boudoir shoot for my hubby. But can't muster the courage to let anyone see me almost naked and vulnerable. But I may have to see me the way he does. It's just really difficult.", "cora.close": "You look great in all of them but you look the best in the black :)", "mizwoochic": "You look GREAT!!!", "gordeeta": "@actuallybryah", "laurathechaos": "beautiful and sexy ;)", "binz911": "You look Beautiful!!!", "sneakapeek101": "Omg the one on the left is my favorite.", "iamasagedumpling": "Girl you are just SO gorgeous!!", "elias50_": "@juliatheis_", "asgagordi": "😍😍😍😍", "hell_no_chainz": "Sweet", "jciarlo68": "LOVELY", "vrenischizo": "the middle one looks really beautiful on you 😍", "mikikoftokyo": "Woot I love the middle. 😍 you are lovely", "hellobhav": "Oh my goodness you look so amazing!!! Looking around in places like La Senza etc, I never dreamed plus-size girls could even find plus-size lingerie but looking at you, I have hope! (Seriously though, Aarti, hot damn!)", "oodha": "The one in teal looks damn yummm!", "shinenim": "Dayumzzzzzzzzzzzzz you're killing it girl 😻", "sirenskincare": "@themilitantbaker we need this girl at an event", "_payalsoni_\nVerified": "Verified", "theshopaholicdiaries": "Lovely! I like the teal one the mostt", "greater_things999": "YOU MY FRIEND LOOK AWESOME!!! Keep up the great work encouraging others to love their body no matter what💖💖💖", "beezee_cat": "I love the middle photo! The teal; it's very becoming.", "magickmogwai": "I love them especially the middle one", "jentheeditor": "Love love love @curvygirllingerie !! You are gorgeous!!", "biggalyoga": "Yas gorgeous!", "shayracha": "Posts like these help me so much. I have wide set breasts so seeing others with similar lack of the standard beauty cleavage makes me feel happy. You look fantastic! 💝", "biggirlsdontcrylingerie": "Looking amazing @curvesbecomeher would love it if you could have a look at my page and let me know what you think of our ranges! 💋❤️", "carolinaplussize": "So beautiful @curvesbecomeher", "iamdaniadriana\nVerified": "Verified", "thatsleevedlife": "@curvesbecomeher that teal on your complexion is probably the vest color ever. Thanks girl! It's getting so much better, I'm seeing a light at the end of the tunnel so bright I'm blinded by it. Muahz boo", "thilinijay": "Work it girl, looking hella fine!!🔥😍😘", "mahruru": "Love the blue colored the, looks great on you.", "kenziebrenna\nVerified": "Verified", "ezotonic": "You're so sexy! - the second one is bomb 😘 xxx", "laurafrances888": "I'm liking the red! But you rock them all 😍", "alisondeg_": "You're killing it in all these! 💯🔥 I especially love the red 😍", "skittyblossom": ":O OMG Do they have support? I hate being bigger and having DDDs and lingerie has no support. These puppies don't stay up on their own. They need help! You look amazing by the way!!", "jrcaruss": "I love them! Where did you get them and do they come in EEE?", "heathersalas21": "Work it girl!!! You look phenomenal in all 3 but the red is amazing 😍", "sonianizam": "You're so beautiful!!!", "ellefinn2308": "So pretty! 😍", "rustle_rattle": "You look amazing. You are such an inspiration ❤️", "oneheckofamama": "I love all three but especially the one in the middle 😍 superrrrrr adorable!! Plus I have a boudoir shoot I'm doing next month and I've been looking for another sexy little number! Thank u for posting & reviewing!! ❤️💕", "soosacy": "I love em all... #2 is definitely my fav... let me go read aND look", "nikzilla_67": "The green/teal one is my fave! 👌🏽", "iamcreated2create": "Mighty FABULOUS..werk it!", "curvygirllingerie": "#Slayingit @curvesbecomeher you look fabulous! 😍🔥", "monique_grace45": "They all look good😊 But I really like the Black...YOU GO GURL😊😊💗💗 @curvesbecomeher", "chocolate_majesty_bbw80": "You look amazing! I need that red one and the black one", "adjpants": "YAAAASSSSS MAMA! OMG I am in love with the red 😍😍😍", "corabachatera": "Omg the red one... you look wonderful xxx", "jennynadine_cdf": "You are gorgeous! No need to be shy...Congrats on discovering lingerie, it's not just for skinnies!! Love you in all of these styles ;-)", "originalroses": "So gorgeous these pieces are perfect colors and styles love love love !!!! 😍😍", "stepharonipizza": "I want that red set!! 😍😍😍 You're stunning in these!", "suavesanddy": "Woaw! This is lovely @curvesbecomeher", "natalie_j_moore": "Smoking🔥🔥🔥🔥", "jjohns225": "GASP SO FREAKIN BEAUTIFUL 😍😍😍", "jennilynnfromtheroc": "@curvesbecomeher they are amazing pieces that middle piece is my fav.", "mademepretty": "I love each piece, esp the blue!!", "catalyst14": "Beautiful", "just_lovely_and_delicious": "they all look amazing, but the teal one in the middle is going to be in my shopping cart soon! <3", "summerinnanen": "Go girl.. You're killing it!", "__watley": "Team Dubey all day. 📷📸📷❣", "bigbagofshellibeans": "These are super cute! 💚👸🏾", "krazykatnc": "🔥🔥🔥🔥🔥 you (as always) ROCKED it!!!!!", "lareinatiburon": "Gorgeous !", "lily_libra_": "the blue one is my fav you look incredible!!!", "theamazingbobinsky": "Oh I love the color of that blue one.. And it looks super comfy 😍", "amayzin": "You look beautiful!!!", "bxzzingaaa": "Waaaaaooooooowwwww🙌🏽🙌🏽😻😻", "meliqat": "Va va voom!!! Get it, girl!"}