{"thebrownsugargoddess": "Yaaaassssssss! 🙌🏼🙌🏼🙌🏼🙌🏼", "short_n_stacked": "Shaming plus size women is the hot topic. This why I refuse to watch that any Schumer movie. She didnt think she was beautiful until she hit her head and thought she was skinny. Fuck u", "dellanypeaceoriginal": "💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯", "divayenta": "Amen amen! Well said!!!!", "najavale": "yes thank you!!", "mowen06": "Very well put!! *standing ovation*", "about_a_french_curvy_journey": "Yes yes yes. Thank you for this 👏👏👏👏", "kalyndab": "All of this. Yes. Every fucking day yes!!", "supermrdaisy": "👏 👏 👏", "curvywordy": "So glad I don't have @netflixuk. Saves me having to unsubscribe from this toxic BS 💁🏼‍♀️", "saimassalon": "Oh I'd not heard of dietland, it's on prime in the UK so it's going on my list. As soon as I finish This Is Us.", "pdxfashionista": "@curvesbecomeher Every fucking word you said, Aarti! 🔥🙌🏽", "laurengord0n": "Yes to everything here! ❤️❤️", "kristenpickrell": "YES!", "purplegal94": "Love your advocacy and you 💜💜💜", "c_likeaboss": "Infidelity, murder, war, violent crime shows all okay, but don't tell the chubby girl to put down the Twinkie.", "claireliedtka": "Hell yeah! This is so true!!", "happycurvybeautiful": "Yes! Yes! And yes! What she said. 👏🏼", "_rajashreea_": "❤❤❤", "lindsay__catherine": "Yes yes yes!!! This x a million! Thank you for speaking up what and saying so brilliantly what so many of us are thinking and feeling love ❤️", "craftysissy": "Thank you for your powerful & truthful words! ❤️", "bofia_": "Oh...ok I’m going to watch it right after it releases", "allinthefoam": "I’m so glad I’m not the only person to be disgusted with @netflix for this show. I believe one of the lines in the trailer was “it’s amazing the wonders having your jaw wired shut for a whole summer will do for your body!” Like it was a good thing. Like disordered eating is fantastic as long as it leads to a rocking bod! I felt so terrible after seeing the trailer.", "foxtaleskira": "This. Nothing to add. You’ve said it all.", "beyoubysteph": "@thecurvyedit ❤️", "lvernon2000\nVerified": "Verified", "thesunmonkeys": "FUCKING YES", "xmtp": "❤️", "_juice_boxx_": "@tahleenorton so much yes", "angtipper": "🙌", "mouthygirl": "🙌👏🙌 All. Of. This!", "momwiththeoctopustattoo": "YES. All of this. 🙌🏼🙌🏼🙌🏼", "jill_grun": "🙌🙌🙌", "kt_and_the.crew": "You nailed it, Thank you!", "soniacsoprano": "👏🏽👏🏽👏🏽This is exactly what I was thinking when I watched the trailer!!!", "gennidubuque": "Also after skipping insatiable go watch dietland! It’s my new obsession!", "cathy_360": "I didn't even know this was a show", "somewhere_under_the_rainbow": "What the effffff is that nonsense!??!!? #FuckFatPhobia And who the eff can get me access to dietland!?! Haha", "sartorialsecretsofficial": "I lost it at jaw wired shut because WTF. How was this approved?", "mackenziemessing": "Started #dietland tonight and it is so gloriously true and painful and my new favorite show.", "angie1981love": "I saw the trailer on my Explore page and 5 seconds in I was disgusted", "_simsimma26": "@netflix you fucking up", "totallytonirenee": "My brother just asked me earlier had I heard about the show. I said no and when he told me the premise I was turned off. Then he showed me the trailer and then I was pissed off. The premise turned both of us off. How derogatory, insulting. There is no way I will be watching this show. The message you are sending is so wrong and ugly . @milano_alyssa @netflix.", "parispaula": "Thank you for saying what people need to understand ❤️", "bodypositivearab": "@netflix should know better, especially after @13reasonswhy which addressed bullying, rape, and suicide. How could something as distasteful as @insatiable get greenlit?", "shannonleemcneely": "🖕Fuck Netflix’s I unsubscribe after their unapologetic support of Transgender and Down Syndrome Hate speech. Seems Netflix’s feels its ok to subjugate marginalized community’s for a twisted laugh . @netflix #fucknetflix"}