{"deesview": "Everything about this photo screams beauty, you, the positive look in your eyes, the outfit, even the background. Definitely a winner. It made me smile. Thanks", "strawberryvicshake": "You are a VISIONNNNNN!!!!", "sogwladys": "Gorgeous", "momlycoddled": "I love this emsemble! 😍", "mangourza": "Gorgeous!", "iheartyellowsubs": "I am so glad that your in a better place in your pain. I remember last year you talking about it and my heart breaking for you. This picture is so beautiful and it's amazing to think how people can't see all the other things behind it. I think about that sometimes with my own pictures. I'm so glad that you are part of my IG world!", "beancurdled": "Love this look! I would assume you are every bit as feminist, body positive, and sexually liberated when you’re modestly dressed!", "nataszashaft": "Beautiful dress like you!!!! You killed it.", "lana.living": "Literally wish I had this same knack 😂", "toothless1994": "I thought it was a dress too. Nice outfit and you look beautiful! ❤", "beanowlogy": "Gorgeous!!!!!", "ashtastiic90": "Love this look!", "chloe_rl": "Glad you’re feeling like yourself again! I was in Singapore a week ago and it’s a wonderful city:)", "lara.k.robinson": "i love how brave your expression is in this picture. great outfit as well, but the best part is your whole stance. Going to make me cry because you look so brave. 💜💜💜", "fibroandchronicpainhelp": "Yes, pretty!", "bhappy247": "You look pretty ❤️", "stonecoldcassie": "💥💥💥", "staceymillicentcarson": "I so love the look on your face here. So brave and beautiful!", "eclecticem": "So gorgeous!", "zeezeebanksy": "Wowza this is a beautiful combo. U look fab 👌🏻💕", "zuzukoehler": "You are stunning! Love everything about this outfit. 🖤❤️🖤", "unapologeticallythrive": "Gorg. I love your top.", "queen____sanam": "Omg i love the dress ! So stunning girl 😍❤️", "veronica.v.vaughn": "Your arms remind me of a baby and make me so happy LOL I love them", "native.body": "So gorgeous! 💗", "halle_hathaway": "SLAY THIS L👀K 🔥 You are fire everything about this post is amazing ❤️😘", "malvina_mmmm": "Flawless and stunning! 🧜‍♀️💖", "tate_harkness": "In love with this 😍", "whatifisoar": "Radiant 🌞", "_tabularasa": "This outfit is stunning! You are beautiful, always 💕", "saniya_pumkin": "So pretty...you looking so beautiful woah😍🌷", "jenvyfox": "Beautiful as always! ❤️", "weeshasworld": "I thought it was a dress- I love it!", "revady_n": "Love this styling!!!!! You look amazing!❤️❤️", "alight_cc": "F L A W L E S S", "forwomenwhoroar": "❤️❤️❤️"}