{"becci_sabbath": "I too have damage to my sciatic nerve also back in 2002 it left me being rushed to the hospital in an ambulance it had gotten that bad I couldn't walk or move my lower part of my body with crippling back spasms every few seconds this was all Brought on by an attack that happened to me in 2002 and since them I've been left with severe lower back damage and most days a pain off around 8 to live through basically 'it's fucked' and now it effects the nerves all throughout my body arms, legs, neck, fingers it's also meant I've had to learn ways of living around this condition and doing 'normal' everyday tasks are exhausting but I do my absolute best to do them, some days I wake up and it takes me around an hour just to warm my back up some nights I cry because I'm tied of the pain and how it's effected my life, I haven't had a sciatic relapse since 2004 once again hospital, morpheme, muscle relaxers and total bed rest for 3 months. But I live with the aftermath every day 24/7 it never goes away just the pain level can be different each day i have a very high pain level so I'm so thankful for that !!!! It's so difficult trying to find someone who fully understands how living with chronic pain effects your emotional and physical life it's changed mine a lot and it's extremely hard to get doctors to listen. Sending you all these big juicy red hearts ❤️❤️❤️❤️❤️❤️❤️❤️❤️!!", "sharlenedashh": "@juliampb @po_po_star_diet vé moi", "curvesbecomeher": "@thesassytruth_ ouch Gia, that sounds intense but I am so Glad to know you do your best to cope..that's all we can do right? It makes such a difference. Thank you so much, I tend to get impatient with falling ill so the universe has a way of reminding me to stop doing so 😝I'm taking the best care possible 💛", "ismarialaura": "Allí caben muchos besitos.", "kittehinfurs": "I have scoliosis, lower back curvature which puts a lot of pressure on the nerves supplying my legs... so I intimately know what that pain feels like 😖 sending lots of good vibes and positive thoughts your way, Aarti 🌟✨💗", "anurangi2004": "Wish your pain go away soon as possible.. May triple gem bless you!", "jennywonder": "I have terrible sciatica from a crushed disk from a car accident, so I know the pain! Feel better, don't push it 😃", "archanadubey1985": "who was that idiot who called u that @curvesbecomeher", "wendzz__": "Ive had sciatica for the past 3 months now and also go to physio, i feel your pain trust me, its absolute agony", "kamrymatthews": "Orrr they might not be that educated to use electronic devices. I admire you for giving them the benefit of the doubt LOL 😂😂 @curvesbecomeher", "pixelatedportraits13": "I know your pain!! Sciatic issues are just the worst! Thank you for being brave enough to post this! Sharing our experiences can empower so many more women! 😘💜💙💜💙", "olive.lane": "Hi @curvesbecomeher have you tried essential oils? My sister had great results for the first time after using them and had pretty much tried everything!", "the_original_kylie": "I have fibromyalgia too sweets, know how you feel xo", "applesandanarchy": "Hello lovely lady, I found you via @dothehotpants. I know how debilitating chronic back pain can be, it honestly sucks balls☹️ Sending you love from this little corner of the globe!", "pdxfashionista": "@kamrymatthews @curvesbecomeher I had a troll in Twitter today with the same spelling issues. Bless his heart 😂", "namoa7": "@c_iio", "jade.manche": "@derekbalella", "titi_mel_": "How were you diagnosed with fibromyalgia? I've been having pains and such and have been told to see a neurologist. Sending you positivity.", "thrillingheroics": "@curvesbecomeher I bet it is. I know how much fibro on its own totally sucks so I can't imagine how you cope physically and emotionally with extra health issues on top. I hope and pray you feel a little better soon xxx", "chan_syk": "@curvesbecomeher Fibromyalgia alone sucks! People have no idea what we go through", "o_liviaaa": "@cicamica033 fibromyalgia is a chronic pain condition which makes it difficult to exercise and therefore maintain a lower weight", "sassyshan82": "I have FM too. I find regular massages to be very helpful", "schandelle": "Have you tried doing yoga to help? It's done wonders for my sciatic pain", "findingevie": "@curvesbecomeher I never found the tape to work. I had at one point pain patches that put pain medicine into your skin. Those helped a little. Hugs to you and your back. I have a very bad back with a list about a mile wrong , all starting with fibro back when I was 13. One of the youngest at that time to be diagnosed. Bad part I'm married to a medical student who doesn't believe in fibromyalgia as a diagnose ... we argue about it all the time. Mostly ending with a FU... because till you live a day in my life with my pain don't tell me what is and isn't going on with my body !", "asian_amazon84": "Sedentary job... my life is very active...", "paoladelf": "K-tape is such help!", "astutefiery": "Sending you lots of love and hugs and well wishes", "mixedfatchick": "@soledadmother you are so right on!", "purrfect_grl": "Get well soon pls", "lulandina": "I have back and shoulder problems too, so I feel your pain! I have found yoga so amazing, and since doing this a few months I am also now doing resistance training which is really helping to build up my muscles and protect my back. I hope you feel better soon!", "styleprism": "More power to you girl! Hope you get the better of these ailments and make the best out of life!! Love & hugs! 😙😙😙", "sharoneclare": "❤️", "emmyelizabeth": "KT tape is brilliant! Hope it helps xxx", "rachelestapa": "Adding more re: sciatica. I see a lot of ppl saying yoga helps, but I want to chime in that if in a flare up, avoid yoga other than savasana. I've been doing yoga for a decade now with sciatica and it's impossible for me to enjoy anything during it. Yoga is great to keep things open before/after an episode. I just had one myself about a month ago and not doing yoga made it resolve faster. This is my two cents anyway! 💜💜💜", "imansyou": "Get well soon 🌹", "whitneysweet_writes": "I found that acupuncture helped my sciatica. Not sure if you've tried it but thought I'd throw it out there. Hope you feel better soon. 💕", "theiskrakhan": "You inspire me daily @curvesbecomeher. Been dealing with some really awful feels re:my body and i forget to be grateful for how much it does for me despite my illness. Thank you for bringing me back to reality", "preciouslexis": "Of the problem about a year and a half ago, shes had sciatica due to the swelling of the inside of her hips pushing the nerve. She had terrible muscle spasms and what she found to help at the time was an inversion chair. Exactly a year ago actually, we boought it on black Friday. Any ways depending what's causing yours... an inversion chair can possibly help.", "thesassytruth_": "Ugh sciatica is the worst babe.. give your body some time and it will heal, I promise. I get flare ups sometime, I have a subluxation in a disc, and the flare ups are intense, I legit can't do anything without having sharp lower back pain. But I rest my body and think about how better I am going to feel in a couple of days. Sending you some love and warm fuzzies for a speedy recovery ❤❤❤", "trustthejourneystx": "I am sending you prayers for less pain and more mobility. I also have had sciatica with 2 disc herniations for that last 15 years and found out today I will need surgery. Take care of your body and listen to the doctors. I wish I had.", "greengrass9091": "The only thing I would say from experience is to get a bra that fits better - it actually makes all the difference. I stand better, my front is better supported and my lower back doesn't hurt as much because I swear I stand differently. Good luck xx", "tate_harkness": "Oh hun. Big hugs. I have sciatica too. Not fun. Get better Miss Aarti. Thinking of you. Xx"}