{"thatoneyogi": "It’s obvious that this person created this profile just for trolling. What is sad is in their disgust for themselves they choose to hurt others. Bitches ain’t shit. 🔪❤️", "_tabularasa": "Lols! Haters can't handle our confidence. It's too scaryyyyy 😂 Oh my gosh get the heck outta here, what a lame-tron 💅🏼", "unapologeticallythrive": "This grinds my gears. People are so insecure and f'ing mean. Just so hateful. I'm very sorry this happened.", "m_chellea": "That is one of the most horrible descriptions of an account I’ve ever seen. We as women no matter what our size or age need to rise above and do better. #reportedthatcrap", "alkea": "@better_healtier_me Why?? Who asked you?? What gives you any right?? Where is the rock you live under?? Who do you think you are?? How does doing this make you “better and HEALTHIER”?? Sorry for your putrid rotting insides. Soon your outsides will catch up. 🤢🤮", "commie.slug": "Reported.", "masimoe": "Did the site get taken down?", "sabrelily": "You tell them!! 🌈❤️ Stupid little trolls - they wouldn’t know good sense if it slapped them in the face.", "gordacabrona": "3 followers 😂", "_bex23": "Fffuuuuuccckkkk them!!", "lvernon2000\nVerified": "Verified", "sapphiresplendour": "To everyone who blocked and reported and to everyone who sent messages of encouragement and support, i thank you and appreciate you. @curvesbecomeher ILYSM thank you bb 💕", "keda.with.the.lovely.lesions": "Ridiculous smh", "blackilocks": "Report that fucker. I got a hater who sent me hate messages shut down. 😆", "naomiva_87": "It's a shame there's so many who want to spread hate in this world. I hope you and your friend are okay, don't deserve unwarranted abuse just for existing and having love for the body that keeps you alive xx", "katies_universe": "What exactly is 'healtier'? Fuck 'em! The attitude might be prevalent, but we can choose to block this shit out!!!", "jennis_and_the_lushcats": "Generally it's someone that hates themselves a lot that spews out this much hate. Reported as bullying and harassment. They need therapy.", "courtneyannecombs": "Love the strength and level headed response to this absolute nonsense.", "sarahmeilyana": "Reported for being a harassing account! Shameful behavior!", "devastatorsuperslayer": "👏👏👏👏👏", "whitneysweet_writes": "I reported also. I hope they find peace with themselves.", "vchtrasogan8": "Some just feel being rude is cool 😞", "frannamstyle": "Reported. Such a vile person 🤮🤬. Plus shame they cannot spell healthier. Probably because this is about hate not health. @curvesbecomeher & @sapphiresplendour you are both wonderful people & reach so many of us in a positive way. don’t let this horrible person dull your sparkle xx", "miss_hawkins": "Reported the account", "leelee_calderon": "They didnt even spell healthier correctly n yet they are coming for someone else!", "waitrez3072": "He or she has 3 followers! THREE. This person is laughable.", "cat.mazza": "3 followers, 0 posts, that’s all you need to know ❤️", "sahni_sonal": "You go girl !", "charlieandjames": "I love that you just unleashed pure fire. Fuck them. You are everything x", "rotten_gemini": "Reported", "synaesthetic.world": "Reported for bullying and harassment. This kind of crap is completely unnecessary. They probably hate themselves more than they hate anyone else, which is sad. But hating from the “safe” distance of the Internet? Grow up and get some therapy. I’m sorry you are subjected to this, and really appreciate your strong voice here.", "meliqat": "Pathetic hater. Smh", "countkissesnotcalories": "I reporter this acct... just that tag line alone is enough. Everyone follow suit, they'll have no choice but to get rid of the account", "vrkur": "I reported their account. Sorry u had to go through this"}