{"meghanmatthewsadair": "You look phenom in that bikini!! 👏🏼👏🏼👏🏼", "svehuti": "🌺", "hiedandseek": "Beautiful! Love that suit 🌴😊", "andrea_keat": "❤❤❤❤", "malvina_mmmm": "You are awesome! Looking fabulous too, dear girl!! You really make a huge difference in raising conscious!! Love your posts and videos!! Keep fighting the good fight! 🙋🏼‍♀️💖", "mia_charlotte13": "👍👍👍👍", "rosiefyn": "🙌🙌 Also! I love that bikini on you!!", "kashirkor": "Ooooo I love That bikini on you", "hollyross": "Fuck. Yes.", "sixsixsam": "You look bomb!!! 🔥 where did you get your suit from?! I love it.", "simplynatara": "I love it...m", "coraglitzer": "Yay 👏❤️ I forgot to post sth!", "lino_jee": "😍", "loveyuhbody": "Beautiful 😍", "mingqua": "I bet the leopard you’re wearing wants to kill itself", "theglassintact": "✊🏿✊🏾✊🏽✊🏼✊🏻 I stand with you!", "el_reinders": "I love your posts, you are so beautiful. Thank you for all the work you've done and you're still doing here. ✨❤", "fatisnotaviolation": "Wow...your words are some of the most moving and powerful we’ve seen. Thank you for sharing this with all of us. You are incredible and we are honored to have your support. ❤️💪❤️🙌❤️", "lindsaymartin630": "🙌🙌🙌🙌", "artistshelleymouber": "YOU ARE PERFECT do not let an inferior being slight you. EVER😍😀", "epiphanysophia": "Girl that's such a cute swimsuit where did you get it??✨", "sartorialsecretsofficial": "Always standing by you ❤️and the leopard print looks fabulous on you!", "michelequelquepart_enfrance": "Je suis avec vous , vous êtes très courageuse je vous admire bisous 🤗💋 de la France 🇫🇷", "thebiggerblog": "😍 Gorgeous!", "peaceful_platters": "You are so right 🍁🕉", "sparklesandlace": "Love the suit!!!!!! Rocking it my friend!", "sarahlouiseainscough": "Inspiring bigger women all over the world 😆👏👏👏💕💕💕i love this", "____hannahsarah": "You are awesome and that bikini is cute as hell ❤️", "deesview": "Amen", "fudgeruthie": "🙌", "finewinz": "Slay Lady Slay 💜", "emmererr": "👑", "amayzin": "👏👏👏 always telling it like it is 🖤", "waitrez3072": "Slay Queen! ❤️🙌❤️👏🔥❤️", "rotten_gemini": "You look great in that bikini", "jessi.so.messi": "Preach sister", "jessicajellicoe": "I love it girl! You are amazing", "fruitbat5150": "💜💜💜 Thank you for being so real and open and caring about so many aspects of life. You help boost up so many of us.", "youngrandomfree": "Loving the swimsuit!", "someminorbloodloss": "Fuck yeah, you put it perfectly. 👏 Still don’t understand how people can’t comprehend these issues", "c.oelro": "Love your glow 💕", "purplegal94": "💜", "mikikoftokyo": "Love it 👙", "brittanybous313": "Omg that suit is amazing 😍", "drdoodlealittle": "Amen! \"Concern trolling\" is a thing and people really don't realise that they're doing it. More power to you, gorgeous human ♥️🌺", "j_hanali": "Bikini babe ✨", "gossipmerl2211": "Slay 💥", "_1ndonlyme_": "You are amaze-balls by grabbing everything as a negative in chewing it and spitting it all out.. with grace too.. hahaha.. you are Bootyfull.. you are strength.. you are a survivor (every day).. you are loved & appreciated.. & most importantly you are HUMAN!!! Thank you for always sharing your struggles and achievements!! I adore you lady!!", "lvernon2000\nVerified": "Verified", "staceyjaneyoga": "🙌🏻🙌🏻", "rackletang": "🙌🙌🙌", "gulatte": "I love every single thing about this post and you so fucking much 💗", "coffeeaddictx4": "You are rocking that suit! Beautiful 😍", "gravezmomzilla333": "Yasss girl!💖", "missmprice12": "This is such a cute swimsuit! 💜", "gayparee": "Yaaaass 👏👏👏👏", "ladymissbeca": "You’re beautiful and I love you", "sukkisingapora\nVerified": "Verified", "mrs.g.rider": "Beautiful. Also, I really want that swimsuit.", "_takeme_as_iam": "The bravery here. Outstanding. I aspire hard. ✊🏽", "bri_garcia_4": "Rock it!! Looking good 💕", "crea8ting_mybestlife": "I think you look beautiful, but frustrated 💜😘", "rizzle_mashizzle": "After seeing so many of you gorgeous women, I finally bought a swimsuit yesterday after years of wearing baggy singlets and shorts. I felt fantastic! It’s people like you who are inspiring and promoting confidence and it really helped me. Thank you 🙏", "danielle138": "Yes girl! You have become such an inspiration to me in helping me with my own body image. Thank you for always being honest, and raw, and YOU! && I’m obsessing over this suit! 😍😍 @curvesbecomeher", "babygotboone": "✨Stunning", "in_vino_veritas80": "Get it girl!! I love that swimsuit 🙌🏾🙌🏾", "gvinegarette": "Love you!!! You are simply a Treasure!!!😍💖I wanted to post today but I'm working on week 4 of this viral bronchitis crap!!"}