{"womanwithin\nVerified": "Verified", "ashantikpma": "You look fucking fabulous 🔥❤️", "maripraxedes": "Yesterday I saw those porn pics in my explore and reported it, but instagram answered like \"no, it is not actually against our rules\" but a picture like this one is? Thats ridiculous! I'm so mad rn 😤", "jessi.so.messi": "Never stop posting. We will never stop supporting.", "queensizemind": "Seriously!? This pisses me off so much! Damn guess we bout to march @instagram cause they’re not listening.", "queeninthenorthwest": "This one got deleted?!!!!! Oh my god.", "karissamoodley": "But Kim Kardashian bikini picture will not get deleted her close to pornography photos are acceptable. You keep uploading it if it keeps being deleted @curvesbecomeher", "coffeeaddictx4": "You just keep those beautiful pictures coming and those of us who who love and appreciate what you do for all of us will keep supporting your posts 😘", "naturenerdandcoffee": "❤️❤️❤️❤️", "fibroandchronicpainhelp": "But why was it deleted??? People pose in bathing suits all the time 😡", "stylishcurves": "Cute set", "angelabethcan": "You better repost this on @effyourbeautystandards today!!! I want to be able to like it again!!!!! #fatisnotaviolation 💖💖💖", "isabellamartini_24": "Yes! Stunning We are loving this picture! Check us out 🔥", "emmererr": "👑👑", "still.i.rysse": "Yes!", "thriftylittle": "That’s fucking bullshit Instagram needs to wake the fuck up", "sherlock_ksa": "Yasss Queen 🔥🔥🔥🔥😍", "tate_harkness": "The thing is I've seen celebrities or models with their nips out and those don't get deleted. Goes to show. Women are not allowed to look or be a certain way unless it ascribes to what society seems as acceptable. Well Aarti you keep posting hun and we will keep supporting you x", "coraglitzer": "Do you know how they delete it? Do someone has to report the pic or are there algorithms?", "meraj.esmaeeli": "😍😍😍💦💦💦💦💦", "deborahbrosseau": "Love this. You look beautiful and empowered in everything you choose to wear. Can’t imagine why that would bother anyone. #assholes", "glendaofalltime": "OMG, They should leave your pictures alone, Aarti. Your pictures are fabulous and confident 😘 #fatislove #fatisbeautiful", "lvernon2000\nVerified": "Verified", "mackenziemessing": "YES. Our bodies are valid, and they are sexy and worthy. You're rocking it.", "jobellecee": "Hey @eloquii @lanebryant @womanwithin @universalstandard @torrid how do you feel about a platform where you spend advertising dollars doing this kind of thing to your customers? Because I’m not too happy with it. You all probably sell suits similar to the one she’s wearing, do you find it inappropriate?", "iraswain": "@curvesbecomeher THIS IS FIERCE !! I love the bikini ! You look gorgeous as always. ❤️", "missfield999": "Ugh how on earth do they justify that?!?! Ps you look great x", "not_betsyy": "😍💗💕🔥", "hautecurves_": "Beautiful as always ♥️♥️♥️", "crea8ting_mybestlife": "Why are they deleting it? Everyone else can have pics in bikinis and stuff. Is it IG?", "parttimepinupgirl": "Did this get deleted by Insta ?! 😧"}