{"curvesbecomeher": "@bodypositiveeverydamnday @orianathesultana @mslindsaym @lottielamour @chubbybabe_ @glutes_and_greens @chrysecolla_yoga @vegan_eve @aftermyownbelly ❤❤❤❤❤", "sheradee_ann": "I love this! I reposted this! Everyone needs to hear this. Thank you ❤️", "k.l.montgomery": "A fucking men!!!!", "rackletang": "THANK YOU", "debbiedodaday": "🙌🏼", "totallytonirenee": "👍🏾👍🏾👏🏾👏🏾", "abeauty_and_abeast_": "Thanks for this post/reminder. I personally feel myself in a weird in-between. I started my IG account as a fitness/accountability one, and after the death of my mom I gained back whatever weight id lost plus some. It's been an evolution for me to figure out and accept that I don't have to decide to be a fitness chick or a woman who loves her body now...I can just be myself, however I am, and work on overcoming self-loathing and fear. I've struggled through ED and self-mutilation, and struggled to find my voice, but it's honestly been the best and most challenging/authentic thing that's happened since I've gained weight back. It's forced me to embrace my body as it is, and love myself through the apathy and pain that comes with grief. I felt like an imposter trying to promise body positivity, until I realized that I was just speaking from my heart. Anyway, that was long, and I just want to say I really appreciate you. It's good for women like me who have evolved out of a strictly fitness/weight loss mentality and into an acceptance and self-love regardless mentality to see your posts and be reminded what true body positivity is about.", "ana_farrah": "Body positivity is simply someone being happy and more importantly comfortable in their own body regardless of ones size, shape or frame ☺", "charlenegirl": "🙌🏼🙌🏼", "bodyposipanda\nVerified": "Verified", "love_to_style_uk": "Very true I have very slim clients who still hate their bodies!", "prettyplusme": "I agree with u Arti. We have struggled with EDs n depression n missed a lot of joy coz of societal standards.....But working towards a fit life - where u can do much more with your body, trek, swim, dance, run, lift - is that an exclusion to being bopo", "grenadine_natz": "THANK YOUUUUUU! 💯💯💯", "fitnessfest.sg": "Nice one! 😃", "diarrajasmineyoga": "🙌🏾🙌🏾🙌🏾✨✨ omg yes!!", "miss_holly_doll": "Loving your body is hard No matter what shape you are in! It took me 29 years to love my body and fall in love with my myself. Although I have lost weight.. I don't strive to be skinny, nor will I ever. My goal is to love my body even on the days it's hard", "quirkysiren": "@newfigureforward I am in the boat as you. I have PCOS and deal with my relationship with food. She and you are saying the same thing but differently. She is talking about the accounts (I believe) that are geared to selling diets. The ones that are using the hashtag for monetary gain. Not that they are using it for their health. Which can cause a distortion on Body Positivity.", "jennnmott": "I also don't think it's fair to say you can't promote body positivity while experiencing weightloss. I am working on losing weight. But for no one else but me. I love me. And I think everyone is beautiful and should love themselves no matter what shape or size they are. I'll always be plus size and curvy and I love that. I still want to promote self love even if I lost a few sizes.. haha", "fit4_life_luai": "Agree with you @jennmott", "sarah_the_colourwitch": "@curvesbecomeher I understand and I certainly agree with your point. I just don't like the idea that if someone does happen to lose weight then she's no longer welcome in the body positivity movement, I guess.", "lajoliefossette": "@curvesbecomeher Thank you. I am struggling with accepting that I can exercise and be healthy while no longer losing weight (and in fact gaining some weight). I can't deal with the demands of weight-loss eating right now. Maybe someday....maybe never.", "hmegorita": "YES 🙌🙌🙌. Thanks for being the realest. NO WRONG WAY TO HAVE A BOD. 💓💓💓", "scarrednotscared\nVerified": "Verified", "mizwoochic": "EXACTLY!!!!!", "lift.listen.learn": "@quirkysiren And the fitness challenge fad diet peddlers that search the hashtag to comment things like \"if you want to try something different, check out my page!\" Ugh.", "girlwithcurves\nVerified": "Verified", "newfigureforward": "@quirkysiren Agree! ❤", "loveleahblog": "THIS. Thank you for saying this. ❤️❤️❤️", "catpolivoda": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "megankimberling": "I fucking hate this. You're spot on.", "colietaicolcsw": "Amen!! ❤❤❤❤", "eva_ioannidi_galani": "🙌🙌🙌", "aftermyownbelly": "Here! Here!🚧🙌", "hollytrevena93": "I mean, I always thought body positivity was subjective. Like, can I not be body positive while I lose weight? I'm not being negative to my or anyone else's body while I do it, I'm just trying to achieve my own body positivity 😕 I do get what your saying though, I just think it's a pretty broad thing", "nourishandeat\nVerified": "Verified", "notondietanymore": "YES!! Word! 👍🏼❤", "xcohlex": "👏🏽👏🏽👏🏽 THANK YOU", "ang.vaughn": "YES YES", "kt_and_the.crew": "AMEN!!", "recoveryeverydamnday": "💕👏", "orianathesultana": "Oh my god YES THANK YOU SOMEONE HAS SAID IT💜", "mslindsaym": "Seriously!💕", "lottielamour": "👏🏻👏🏻👏🏻👏🏻👏🏻 TELL EM GIRL", "bodyexchangeyyc": "Body positivity is learning to love yourself no matter what and if YOU choose to change something then making that choice for yourself.", "unapologeticallypaola": "YES! 👏🏽🙌🏽", "lindsay__catherine": "🙌❤️🙏"}