{"curvesbecomeher": "@anabelreyes_04 ❤❤❤🙏🏽🙏🏽🙏🏽", "babygirlperdomo": "@zunestress me too", "positivelyanimated": "You and your body are mighty 💪🏾❤", "ranidhaschainey": "This is just so beautiful! I know you have mentioned that you are at your biggest now and it's still a journey when it comes to acceptance and love but I see it happening and I'm so proud of you baby girl! I love love love this post and I love you so much❤️❤️❤️", "fckyobeautystandards": "This is really inspirational. I have deleted beautiful memories becaue i couldn't bare seeing myself in a photo just because of my belly. I literally look at my stomach everyday and hate its softness. Knowing that its wrong. Your post and this beautiful picture made eat my dinner and I will also wear that dress that shows my curves with my belly", "drawnbyjovanna": "You're the best! ❤", "curvyconsciousinspired": "I adore you and connect with you on a deep level. Thank you for being a foundational advocate that inspires me and many others on the daily 💜", "emmastanly": "I think you're brilliant! Thank you for sharing💗", "sareesandstories": "@curvesbecomeher thank you so much for what you stand for. Discovering your feed has got my weekend off to a fabulous start!", "motherhoodandmarathons": "We have the same feminist tattoo!", "jadewindhorse": "That tattoo is rad!!", "courtneygzz": "Love it!😍", "hauntedfurby": "Hooray for loving our bellies!! 😊😊", "reeneta_dutta": "I have a similar belly roll. Just one big squishy one! And I love hugging it and tugging it at times. ❤😄", "majestial": "#embracethesquish haha me encanta!! Seriously you can't tell the real comments from the weird perverted ones. You rock, and that's from the bottom of my heart 😃", "zunestress": "I actually was looking at your tattoo! It's cool", "tate_harkness": "I love bellies. Thanks to my cooking and love hubby has a belly and my babies do too. What I don't like is fetishising if that's word. Rolls and bellies. So many sick people romanticising certain body types. All bodies are good and are to be celebrated. Your smile got me here. Contentment, I have so many friends talking negatively about bellies and I can't hear it. Mine housed 3 babies. It was their home. It's where my food is...how is that ever bad 😚", "nourishandeat\nVerified": "Verified", "meliqat": "If I had the guts to take this photo I'd be a happier person. You inspire me every.single.day.", "thedevinakaur": "@nourishandeat", "shannonleemcneely": "Happy Belly Power Love ❤️ 😘", "saahiuppalapati": "You're a force of nature. Thank you for being you because who you are is fucking awesome. You're a goddamn phoenix", "bryn_eva": "Nope, not even a little bit \"shameful.\" You're fierce as fuuuuuh lol keep rockin' it, girl! You're only making the world a better place. 😘", "fatqueenchristine": "So proud of you, lovely 💖💖", "lindsay__catherine": "Love you for always being so genuine! ❤️ Your posts always inspire me because they are so real and you and your truth is absolutely beautiful love 🙌💖😘", "mimir25": "Grogeous! 💗 Keep up the good work, you deserve it!", "lillyrubyleo": "You are amazing, you are a fantastic role model, I adore you and really look up to you! Well done for being so brave and doing this! You're truly wonderful Aarti!❤❤❤Xxxxx", "merkabahuf": "💜💙💛", "anabelreyesbenzan": "@curvesbecomeher ohhh now i get it and love it 😍", "hmegorita": "Love this, love you, love your solo belly roll. Thx for always keeping it real bb 🙌💕🔥. Hope today is a good day -- if it's not, no shame! I'm here for ya always love ❤️❤️❤️🦄"}