{"maygirl5": "😡", "k8emc": "I dealt with this with a friend’s daughter. It sucked. But we talked and I told mom becasue I know she’s not being raised that way at home.", "mzmonroe": "That’s so awful. 😢 I’m sorry that happened to you.", "sonalmahendru": "Been there! Kids repeat what they hear. Families have a huge impact on this, but sadly, most parents miss this out from the basic mannerism being taught to them. And, @curvesbecomeher You are beautiful 🌸", "mary2ana": "thats such an important topic! i guess some parents are not teaching that concioussly but in an indirect way how they talk about their own and others bodies", "elizajogram": "Yeah, and it makes you wonder all the ways they’re being raised to hate not just other people, but themselves.", "dlg222": "I'm so sorry.", "aria.with.the.good.hair": "Children see children learn", "carlovomu": "Poor parents..", "loveleahblog": "I'm so sorry lovely.", "irenehatesyou": "This makes me think of a talk I had with my husband recently. I told him that I already felt ashamed of my body when I was very small. If it weren't for what I was hearing elsewhere I wouldn't have felt this and that's sad. So seeing this makes me sad because it makes me think of my own experience and the ones of other children, which then become adults who have all these insecurities because of so much of what we experienced over time.", "the_vibrant_hak": "this is such a terrible experience, i’m sorry💔 it’s awful that adults can be such poor examples for how people should treat eachother, and even worse that kids soak that up so early", "humanofpreguica": "As a teacher, I had to have this conversation with my 10y olds. I told them about my own experiences with prejudice. They were shocked that people had judged me by my color, hair, shape. We talked a lot about how I used to feel ashamed of myself and how this kind of talking, even as a joke, can be really harsh on the other person. They talked a little about their own image problems and made a vow of never being dickish towards one another. At the end, one of them came over to me and asked \"but you're ok now, right? I mean, you're beautiful\". I guess we have all been a bit of a dick as a child, but there are still hope. Children overgrow their parents and become better versions of them.", "bigxeniaenergy": "I work with kids and they’re not built with a filter. Some are cruel (and u can tell they learned to be that way) and some don’t know any better. But all comments hurt. I’m grateful that I can decipher which are not ill-intended. There have been good teaching moments.", "singaporeactually": "There was so much shaming in the 70’s I don’t even know where to begin. Basically children mimicking adults but the adults were the worse including my primary school principal. Very abusive I wish I could go back in a time machine & give them a lecture. It’s my fantasy to give them a telling off with my 47 year old brain while in my sweet 9 year old body. It was horrendous. Utter ignorance & conditioning. I’m glad to see progress. I’m getting an education myself too. Thanks for educating me @curvesbecomeher 🌸", "crabscrambly": "Is there a “dis-like” button for such things? Not cool 🙁", "movedbythestars": "Awe girl sending you so much love. You know that it’s all BS 💖", "teanhoneybread": "I’m sorry this happened to you. Ugh. So many people parent from a place of compliance and not compassion so children learn not to do/say things because they’re “bad” things to do/say with no regard to their connectedness to rest of humanity and how every act of kindness (and not) has a ripple effect. Once whilst holding a ballroom workshop for children, a child called me “an ugly back girl” in Spanish, she told an adult that she didn’t want me to teach her. My stomach hurt... for the child. And so it goes...❤️", "glambyruna": "I’ve had that happen to me a couple of times. I just look at the parents with pity. Like wow this is what you teach your kids.", "pugpianist": "In my mind, kids still have learning and guiding potential. When adults say things, there really is little hope left for change.", "jilbijou": "So sorry that happened to you.", "born_a_swan": "It is sad, very sad", "booklybritt": "This isn’t remotely the same situation or experience, but it made me think of something that happened to my boyfriend. Unfortunately, he is addicted to nicotine and at the time wasn’t trying to work on alternatives to cigarettes. He is a professional musician and was smoking by himself on a set break in an alley one day and a girl with her mom, probably about 8 years old, said to him, “You disgust me!” And her mother just smirked at his flabbergasted face. I know this really hurt him because he already feels shame and upset about smoking and feels he doesn’t have the power to change that habit and part of his life... But when he told me the story I was so angry! That mother is teaching her daughter cruelty over compassion and kindness. This isn’t a feminist moment of communication or speaking your mind but just teaching cruelty. He wasn’t smoking on a public road and it wasn’t a reminder to be aware of asthmatics or anything... Anyway, he took this experience and composed a rather great song titled after her words. :) And now we can all discuss it, laugh about it, and start conversations about compassion with addiction and that yes, he made mistakes when he was a teenager to even start smoking but a decade later, that doesn’t mean he doesn’t deserve kindness and support in trying to quit smoking. It sucks that this is just one of numerous stories. People aren’t empathetic about addiction in general but especially things like alcohol, food, or nicotine... End of rambling story :)", "cupcakethighs": "Yes, it always makes me more upset when it’s children because that means it’s learned behavior. Makes me sad. 💕", "xms_triggx": "Looks at them dead serious and close in and say “your parents don’t love you", "nwhysae": "It shows that the shaming is a generational thing in them, something passed down, and something they will also pass down. Which is super sad. Hope you’re okay.", "bhappy247": "So sorry this happened to you my friend I know this hurt you and it’s sad that a young child is already being programmed with that kind of mind set. Please know you are beautiful just the way you are and when people or situations try and steal your sunshine don’t you let them.... shine bright for we all need more of the love and light you share with the world 😊❤️", "curvesbecomeher": "Thank you all 🧡 and thank you for sharing your own experiences. I love children. But I do have a temper and perhaps ten years ago I would have raised my voice at the parent and given them a talking to. Who knows, I might have done just that today had not been unwell and just in need of some serenity at the park. I make it a point to tell a child that everybody is different and no one person is better than another. I ask them, how would you feel if someone poked fun at you or your sibling or parent? That often stops them in their tracks.", "d_new_traditions": "I had this happen in an elevator so I said to the child (in a nice voice but loudly so his dad w him could hear me) \"oh honey that's very rude, your PARENTS should teach you better manners! Everyone is different\" ..and I hope the dad felt more embarrassed than I did.", "shanny136": "I've experienced this with 4 yr olds in classrooms.😭", "kristin.is.cool": "See, it bothers me more from adults. Kids can't help the social conditioning we're all steeped in from day 1. But adults have the CHOICE to unlearn.", "findingtruthinme": "Absolutely. I was doing a reading comprehension with a student and one of the questions was what gets bigger and bigger over time (the answer was supposed to be trees) and he said Ms. Emily and just the way he laughed about it like he knew it was mean but it was funny anyway. The kids in first grade.", "botsaucey": "I would probably tell them to STFU.", "fivefootfunandahalf": "Hold my earrings - which kid I gotta fuck up?? 😡😡😡👊🏼👊🏼", "_darlingdee": "I am more than my weight. I am an aunt, a sister, a wife, a friend. I am a opinionated southern woman who deserves just as much right as the next person. So don’t judge me just because I have some extra cushion 😂😂", "stylishlybonnie": "Sorry you went through this. I love kids so much so that I teach. Most of the kids I work with are very young 2, 3, 4 and 5 and yes they are very honest with no filters. If I have a spot or a food baby, they are the first to say something. The kid you encountered seemed older though. At 9 or even 8, 7, or 6 he should have already been taught many times (at school at least) that we don't say rude or hurtful things. What an unfortunate thing. Hopefully some one will catch his predjudices and fix this before it continues.", "curvygirl_chronicles": "So sad. People aren't born with bias, it's taught", "finewinz": "So sad! We need to continue to teach positive thoughts and that people come in all shapes and sizes. Parents need to be aware of what forms of bullying and discrimination that they are instilling in their children. 💝", "thecookiearchitect": "That's what I call a teaching opportunity. 😏 If nothing else, a few new words. 😏", "lanaeroxas": "😔", "coley.lynn": "It upsets me a lot more when kids do it 🤷🏻‍♀️ even though I know they usually “don’t know better” it cuts me a little deeper", "drelirium": "Its mortifying.", "fluffyspacedrop": "UGH I'm so sorry. Yes kids shaming me in is much more upsetting. They've learned that behaviour from an environment that they are exposed to day in and day out. I find myself wanting to simultaneously reprimand and nurture but it's not my place lest I incur the wrath of the parents that created the environment. Again I am so sorry this happened to you.", "fullsizebarbie": "I usually turn it into a teachable moment. Since clearly they’re not being taught correctly at home!", "realconnorluke": "Hi! Check my new post, let me know if it is something you'd be intrested in. 😙", "momlycoddled": "😔 I feel ya. Once a boy made a disparaging remark about my eyes even after I told him it was because I was sick.", "sojohello": "Not gonna lie, the most foul and scary things come out of my mouth when kids say stuff that’s way out of line. And I’ve never had a kid NOT stop dead in their tracks afterwards. If nothing else, it teaches them that not all adults are going to pamper their behinds.", "alifrancesmiller": "That's so sad. I hope you're ok. It can still hurt when it's a child that says stuff like this. Sending you loads of love 💛💖 thanks for sharing because we experience these things too and we all need to know...we are not alone. And it's ok to be sad and it's ok to be angry and it's ok to not know how to feel", "filmyfijian": "I hope you’re okay ♥️ I feel awful tbh as I’ve experienced this on numerous occasions 😭", "srivastavanishi": "😐", "daphneshgr": "I got shamed by a different race kid in a restaurant. She called me ugly cause i was dark and hairy. She was 4 years old. But i dont blame the kid. I blame her parents for bringing her up this way. Very sad to see children like these.", "swetha_sharmaa": "To add , Many Adults these days are only keen on getting their kids to be literates and forget to teach them values as they themselves are uneducated Literates. :)", "sarah_the_colourwitch": "That's pretty heartbreaking.", "wendi_co11": "It's disheartening. Just when I think the worlds changing, this crap still happening. Still a ways to go. Sending you my heart.", "beepsa_biswas": "I have been in situations like these where kids have shamed me. What I understand is how parents talk about other people that influences them. Just today my friend was telling me how his little niece thinks a dark coloured person should be hated upon. And they were having a hard time trying to make her understand that no matter what colour of the skin, every human deserves to be treated respectfully. She picked this from school. And it's really sad that we are not teaching our children to be more accepting and kind.", "artistshelleymouber": "Yes. A few weeks ago a group of kids at the grocery store laughed and snickered. It always seems to happen after I finally get ok with going outside. I@ sorry that happened- it’s very hurtful 🔚🔜", "nehaparulkar": "Been there!", "suavesanddy": "Too sad sis", "thechubbytwirler": "A kid once told it's mother that I am a bad didi after seeing me in the pool wearing a swimsuit 🤷", "fruitbat5150": "💜💜💜", "bodykindfestival": "So sorry to hear this. So hope that kid (and every other) can unlearn the shit they’ve been born into, otherwise their lives will be sad and (in any genuine sense) lonely. Keep existing in your own beautiful way 🧡🧡", "nanthiniedas": "I’m so sorry this happened to u sayang...", "ninilarouge": "This is a shame. You’re allowed to be yourself, you’re allowed to take up space. I hate how children are already being influenced by this fatphobic and skinny promoting culture and society. Keep doing you honey! 😘", "xoshalo": "Kids are bigger assholes than adults sometimes", "marianamcevoy1": "It depends on how they say it.. a kid came up to me once and said you have big boobs and belly and looked super happy life it was something good, or if they have already been told it's something bad.. but of course it hurts", "pictureperfect_yella": "It absolutely does bother me on a deeper level when it is a child. Children repeat what they absorb from the environment, so it’s just another statement of another toxic home in this world. Sad.", "talesbytia": "It's so hurtful because already at such a young age they are already judging another person based on external appearance. Most parents do not teach their children any manners or courtesy nowadays. But this goes beyond that because you are teaching another generation to perpetrate irrational prejudices.", "lovetheone": "😔", "alohaamy": "I’m sorry this happened to you. I have had people shouting rude comments when I have been out jogging and it’s really horrible. But please know they are the ones at fault, and society for having them believe that smaller is better. You are glorious and beautiful and deserving of taking up space in this world. Keep shining your light ✨✨✨✨"}