{"amandalee684": "I think u look amazing!", "strawberryvicshake": "Thank you for sharing this journey with us 👏♥️", "ladymackb": "😍MG I loooove and I want it!!! Thank you always for sharing 💜", "mary2ana": "💗💗", "caz.gaz": "We need more people like you in the world 😍💗 thank you for this :)))))", "marsfergy": "Not an angel but an earth goddess... that is so beautifully succinct and profound, just like YOU! 😍", "sfbaseballlover18": "Damn girl! Loving that bikini on you. It looks amazing. And your curves are banging. Please keep up the pics. 💖💖💖", "ashantikpma": "Love you in this!! And i feel you on the mid-rise Im not keen on the feeling of my belling hanging over 😅", "svehuti": "You.look.amazing.i.kennot. 😭😭😭", "michelequelquepart_enfrance": "😍je vous met un gros cœur car vous êtes une femme très courageuse ❤💖💕🇫🇷", "tentaclesmcgee": "Bikini is cute and you look wonderful in it!", "duchesscake": "Thank you. ❤️", "danamg107": "You are beautiful!", "aimee.brrt": "Love this!! That bikini is perfect on you!!", "gray_sand": "🔥🔥🔥", "risaroo88": "Me everyday #mood shes an #earthangel 🌹🌹🌹🌹🌊🌊🌊🌊", "drekkia": "Flaunt it!! Watch my poetry video “Plus Size Thighs” -> @drekkia! Full video link in bio! S/o to all my big girls 💕", "mama_izzie": "Yes body positive!!!!", "fruitbat5150": "This was the very top post on my feed after being away for about a month, and it — YOU! — makes me smile so much, inside and out. You make me feel like I’m ready to come back and push my comfort zone some more, too.", "santhi_19": "This makes you look like a Goddess! Bravo for this choice", "plussizevintagemadame": "Love it! Keep being you 💘", "_wildroot": "YOU ARE A QUEEEN ❤️🔥🙏🏼", "michellehopewell": "An earth goddess indeed 🙌🏾😍", "strongcoffeeplease": "@curvesbecomeher loves those colors with your skin tone. What does the back look like? I tried searching on their site but there’s a LOT of suits to sort thru lol", "imthecutestandthebest": "You are an earth goddess 🙌🏼", "curvily": "You look amazing! Glad you did this shoot babe", "shionmoti": "Its gorgeous, you're gorgeous 👸🏾", "fern.galindo": "HAWT!! 😘🔥", "medchickore": "You look fantastic!", "mikikoftokyo": "Alright now 😍", "saimangala": "😍", "messybunsandmindfulness": "You look gorgeous and I LOVE that bikini!", "bopomatic": "You look great.", "thickmadamiza": "Still cantik.. 💓", "misskas94": "You look so great!!!! 😍 Thank you so much for posting this! I hope one day I can begin to truly love my body! Seeing posts like this help me realize that all bodies are beautiful and worthy of love! 💜💜 Keep shining!!!", "lana.living": "The colours are stunning! I appreciate your bravery", "bodyposipanda\nVerified": "Verified", "darias_twinsis": "Love the color scheme and you look beautiful! Thank you for encouraging people like me to love ALL MY BODY 🙌🏽❤️", "curvesbecomeher": "If I respond slowly pls forgive me my carpal tunnel is annoying af", "yesak_ylno_eht": "The bottoms are so cute on you!! I think you can totally pull off low rise bikini bottoms. I also love the cut of the top. It's time to rock any suit you want, because you deserve it 💖", "a._rachel_.a": "Good job! You look lovely♡", "annagram_87": "You rock!!! 😍😍😍", "shawnalaine1": "Yassssss", "sun.flower1012": "Wish I had the confidence. You look 🔥", "elleesem": "So proud of you for stepping outside of your norm & always fighting to make sure there's representation where it matters! You look great, girl! ❤️😘", "sapphiresplendour": "Omg but you look so good in it!!!!! I feel like posting my@bikini pic too but I can’t deal with the male attention", "lvernon2000\nVerified": "Verified", "goddess_life_with_kimber": "Thank you for posting...I love your round belly :) I, too, have a round belly, well, more like floppy round and I am practicing appreciation every day until I just fall in love!!!", "laurafrancesallen": "I for 1 am VERY HAPPY that you are not a Victoria secret angel 🤣🤣🤣 thank you for shining your light ❤️❤️❤️ your posts speak to me x", "bally_hayer": "👌😊❤️ You look lovely 🤗", "rosemaryandquartz": "I think you’re beautiful and I love this bikini! You are totally an earth goddess!! And I love your belly, it looks like mine and does me good to see it on others. 💛💛", "thisismeagankerr": "This suit is perfect on you Aarti!"}