{"fruitbat5150": "\"Don't look\" shall be my new mantra.", "kafrinia96": "Watched this so many times 😍😍😍❤", "bhairoojan": "Unfortunately misogyny is a huge part of the south asian community. You are a beautiful woman !!! Fuck the ugly trolls!!😡😡😔❤❤💪🏾💪🏾💐💐🙏🏾🙏🏾", "lauren_res": "😂😂😂😘😘😘", "slsmf1971": "U rock girlie! I totally enjoy ur posts hon! Keep kickin it beautiful lady!!", "love_to_style_uk": "👏🏻 you're right you don't exist for them. Ignore and be true to yourself inspiring. #girlspower 💕", "merkabahuf": "Haha 🙌🏽🙌🏽", "wildorangeblossom": "You're the best. Haha. :)", "danceelydance": "👏🏽👏🏽👏🏽", "nidhichawlatalwar": "You are👍👍👍...Muuuaahhhh!!!!", "fckyobeautystandards": "i understand that. You are beautiful. And strong. These men have to stop", "lizamahamooth": "I love this! Indian men have so much to say about others..Look in the mirror first la", "onyxxflower": "You are BLOODY AMAZING!! 💕", "sanam_kazmi": "U are beautiful and hilarious 👍🏽 they secretly love u but have no south Asian male ⚽️⚽️ to say it ..", "hmegorita": "Omg GIRL Aarti you are the best combination of beauty and humor ❤️. Also SASS FACTOR ON POINT.", "themoonsglow": "@curvesbecomeher you are sooo flame 💖", "samruddhi_kadam": "❤❤❤❤❤❤❤", "jerseygirlp": "Speak your truth", "livin_life_lexi": "Love!!!!", "sophiabellerina": "@xelath @alexdemos @kellyleddy omg I love her", "margedtrumper": "I cannot bare to care for trolls' opinion", "canariesinacoalmine": "You babe!!!!!!!", "br.eannav": "I love", "brimfuls": "Great!👏👏👍", "annagram_87": "Well said!!! 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻❤❤❤❤❤❤❤", "glitzy.fowl": "❤❤❤", "divayenta": "Good for you!!! Screw those people! Your light shines from your beautiful heart- they are intimidated by that!", "michellehess_m.a": "😘😘😘", "chrisanth.isaacs": "\"We don't exist for you, y'know\" - LOOOOOOVE! 🙌🏽🙌🏽🙌🏽🙌🏽", "purplegal94": "💜😍💜😘", "louiethafly": "You are inspirational and your awesome attitude always makes me smile! Stay you always!", "dtg_75": "💞💞💞", "reena1181": "Love it!! You tell them girl!!!xx", "herkliz": "I love this!!! Your response is spot on 💁🏻", "life_of_nush": "Fucking love this so much!!! So, so friggin much! And I love all 3 of the 'ah's!' 👊🏽", "avantiadi": "Love your theatricality!", "the5thcellar": "Love this!!!! Fuck the trolls, honestly. No one should ever be able to tell you how you should look like or feel like - you're amazing!!!", "thepbfamily": "Well said. You are beautiful xx", "ladeutschediva": "Well said 🙌🏾", "bigmamaboo": "❤❤❤", "crazyfoodiesontoes": "Seriously \" dont look\" 😊😂😂 loved it. You are such a charm.", "nailz.n.nugz": "😂😂😂😂😂 Yes, omg, yes!! Tell them all about it @curvesbecomeher Love your response!", "thestylishreid": "@tashabean66 follow her she's so inspiring", "feelflowfree23": "You're awesome!!!!👍🏾", "karissamoodley": "Love your boss lady responses you are great and the best role model @curvesbecomeher love from South Africa", "shylamygirl": "Omg I love you girl!!!!!!!", "daughter_no5": "Freaking preach girl 🙌🏽🙌🏽❤️💋💋", "fullbellyalchemist": "Opinions are like assholes; everyone has one but most are just got air.", "halle_hathaway": "Holy shit YES THANK YOU 🙏🏻💋💕💕💕💕💯", "tanuka12": "Bunch of aholes", "alixmelton": "You're fantastic!", "mimir25": "LOVE it! 💜💗", "miss_scott_504": "Man they can go to hell with the dumb ish... Kick rocks with open toe shoes on that's what... That's right @curvesbecomeher they can get the middle finger", "thewitchnextdoor": "👏🏼👏🏼💖❤️️", "singaporeactually": "Yucky trolls ...you tell em", "iamcreated2create": "Tell 'em...\"kiss my ENTIRE a $$\"", "wecanmakethat": "Your response is a gift. I'm so glad you exist!", "chemicalkilljoy": "Men like that don't deserve a good woman! If all they see is the physical appearance and not the beauty that this person has on the inside then they honestly don't know how to love ❤️ this counts for all the women in the world!", "dionnepj": "I like the \" my male heart cannot accept that\".. this reminded me of how a guy Friend of mine told me to lose weight or I won't be invited for his wedding as I wouldn't be able to fit the picture frame. I was so hurt that I cried for close to 2-3 days on and off. In the end I just declined his marriage offer and went for a gooood meal with his ang pao money!! Hate the discrimination.", "babygirlperdomo": "You ARE the ideal.💯", "theprepgal": "You are such a positive role model to all women. ❤️", "wildtenderness_": "You're honestly the best 💜💫✨👏👏👏", "sparklesandlace": "You are sexy 💞", "mkannan83": "Been watching your posts for a while and this is my favorite. As a curvy south Asian woman ( who was born in Singapore btw) I just love you for saying what I'm thinking most of the time!", "lindsay__catherine": "Yes love!!! 🙌❤️🙏 You are amazing and I just love you 😘", "sakunthala_25": "Hahaha. .. break that rules...🙅... you said it beautifully. . Thank you soooooo much ..", "tiktoqkrok": "Amazing response to your trolls!! You are so awesome ♡♡♡ Give 'em hell ;)", "sony0715": "You are fantastic #iexistformyself", "tate_harkness": "Preach! ! Being a healthy dark brown who isn't slim. I have had this myself. Visiting my country of origin after moving to Oz as a child. Ohhh the fragile Southeast Asian male (on my end ) Funny how they get offended because I don't fit their idea of what's beautiful or sexy. ❤", "macabre_mac": "You're amazing!", "19_paupau_88": "You are a true inspiration!!!! 😍😍👏👏👏👑👑", "tina.masuda": "Exactly. 🖕🖕 If a man can't break ties with the norms fed to him by the media, then that's his problem. We have a right to be happy as we are, regardless of our dress size, skin tone, and height.", "xoririxo": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "jessiolivia": "Yes!!!!! 😍 you are amazing! Don't let anyone dull your shine beauty!", "ang.vaughn": "Yes babe!!! You are the best", "nicole.lavallee": "Haha Yassss. Love this. Xo", "ashidentshappen": "This might seem kinda weird but to me you look like the physical embodiment of a therapeutic hug mixed with a pep talk", "gelwithjels": "Well said Beautiful!!! I just love your posts!!", "keryntinks": "You are the best!!! Your posts are insanely perfect at all the right times ❤️", "hai.morris": "I am very thankful you exist, you are such an inspiration and the perfect role model for self love! ❤", "la_china_criselly": "Love u girl!!!", "lillyrubyleo": "Exactly like you said: 🖕🏻🖕🏻🖕🏻🖕🏻!!!! If you don't like what you see, don't look!!! You are absolutely amazing, totally fabulous, and a queen! Fuck those sending hate, their opinions mean 0! ❤❤❤😘😘😘xxxx", "moniqueslays": "❤️❤️❤️", "wanda.ivelisse486": "The funny thing is that when you look at those men, they're hideous", "cammydoll": "You tell em gorgeous!!! ❤❤❤❤❤", "nourishandeat\nVerified": "Verified", "pdxfashionista": "I love you! ❤️😘", "bryn_eva": "South Asian Troll: \"Hmmm... This woman is plus sized and doesn't hate herself. I'll help her with that!\" 😑 Fuck those losers. Such people are clearly not comfortable in their own skin, so they feel other people don't deserve to be comfortable either. Keep feeling good and being lovely, Arti! ❤"}