{"lauren_res": "Get well soon ❤", "singaporeactually": "Poor thing ....hope you heal soon", "gameofbalance": "Honestly, the dancing was only a small part of the reason I follow you. Your sense of humor and positive message were the bigger message for me. Your knee will heal, but don't feel like you aren't valuable or inspiring without being able to dance. Feel better soon.", "missrachelrawr": "Recover well and soon! ❤️", "zattirecloset": "Sending positive vibes!!", "richa_pruthi": "Get well soon", "dionnepj": "Get well soon. Be strong !😘😍", "gvinegarette": "Sending Love Prayers Healing and peace!! 😘💕", "sammy_sweetie": "Feel better babe!", "frombones2bold": "FEEL BETTER SOON LOVE💙", "the_selflovejourney": "You can get through this. ❤️", "travlgal13": "Feel better soon", "curvywordy": "Sending lots of love and healing vibes ❤", "rebuildingwithlov3": "Sending you so much love and positive energy vibes 💚💜💚💜", "iamcreated2create": "Feel better and take care", "jlynnebc1976": "Having torn my ACL and my MCL I can relate to your pain and discomfort. It will take time and learning to trust your knee again and building its strength back up. But chin up, it will improve and you'll be dancing again in time! This is just a speed bump in the road of life", "tina.masuda": "Thank you for everything and I wish you the best during your healing process. Hope to see you again. 💕", "elabrababs": "Keep your head up, and take your time! I'm sending happy healing thoughts your way! 💖", "mun_zoom": "OK, rant over from the person who woke up with a stupid back spasm", "jenna_h_7": "Feel better soon! Xo!", "hmegorita": "Aarti I'm so sorry! Wishing you a speedy recovery. If you need anything (...that I can offer being half a world away) PLEASE let me know! Love you ❤️❤️", "shini2112": "Get well soon.", "hallee.wils": "@dragonkayleesi", "pdxfashionista": "Sweetie! Take all the time in the world to get better. I tore my patellar ligament to the bone in 2015 and needed surgery. The best advice I can give you is to do PT religiously, I did pre-op and post-op and that saved me. Sending you all the love and good vibes from one broken lady to another. @curvesbecomeher ❤", "jelicasingh": "Will miss you. Your health is important and I wish you a safe and fas recovery.", "yep157": "Take your time I know you're in a lot of pain.", "irenehatesyou": "Hoping the best for you through this. Sending good thoughts your way.", "cosmicspider31": "Heal up slowly and gently lady! Hope your pain lessens soon.", "coraglitzer": "Sending you love and strength! ❤🦄💐", "u4richeart": "Sending lots of healing light your way...", "orianathesultana": "Take it easy, rest up, hope you feel better soon x", "malenefl": "❤ take \"one step\" at a time - and first of all take care of yourself. I now recovery from injuries like this can take a long time, but one small step at a time will get you there as well. I broke my ankle a year ago and six months ago I just started to learn how to walk without crutches. I hope your recovery is faster than that ❤", "bhairoojan": "I am happy you have your family to take care of you!- sending love and strength!!- ❤❤💐💐🌞🌞🙏🏾🙏🏾", "claudiaodra": "Im so sorry honey, you will be sooooo missed, get well soon", "life_of_nush": "Oh mate. That beyond sucks. Rest up and hope you can stay positive. Sending lots of love and healing your way!💛💛💛", "meghquinn": "Sending you huge amounts of love and healing thoughts. Injuries suck...As do the fibro flare after it. Take care and know you have support.", "vamooshe": "😣feel better soon!", "beepsa_biswas": "Take care and much love to you💕💕", "missdeedee1978": "Aw honey! Wishing you a speedy recovery. We'll be here. Xoxo 💜", "maggiemunkee": "Oh sweets. I wish you a low pain, relatively speedy recovery.", "emilyharting": "Take care and rest up and heal.", "healingfemme": "Sending you so much love, tenderness, and healing energy. I hope you're able to get lots of support and love during your recovery. 💞🌸🌻", "ericajanael": "You will get better! Keep your head up :) ❤️❤️", "ferocious.b": "❤️will miss your posts. Prayers!", "shayracha": "Positive healing vibes your way. Take your time ♥", "glitzy.fowl": "I hope you're able to heal swiftly! 💗", "sagceries": "we'll miss you but i'm glad that you'll be letting your body take its time with healing. hope you are getting a lot of care and pampering and homemade food 💗💗 sending healing and care to you 💗💗💗", "sal2315": "You will be fine / you are a strong women !!", "therealtiffycee": "Sending you so much love and strength.", "beezee_cat": "Icing (cryotherapy) is so very helpful when it comes to an orthopedic injury. Ice numbs the area, decreasing the sensation of pain. For the fibromyalgia you might try listening to a yoga Nidra guided meditation. Wishing you a speedy recovery and all the very best.", "plussizeover50": "So sorry! Hope you have a speedy recovery.", "beautifullyflawedbean": "Oh no😖😖 I'm sending you a big hug and wishing you a speedy recoveryyy❤❤❤❤", "ems_brown": "Take good care, I wish you well for a safe recovery 💕💕💕", "imperfectwarriorprincess": "Well wishes your way. You'll rise above this. Love.", "alyssanewms": "Sending much love and wishing you a speedy recovery! We'll all miss your smile 💜💜💜", "ana_farrah": "Don't worry about curvesbecomeher just focus on you and make that you your priorty x", "mrs_uwagboe": "Prayers. Feel better soon!", "steph_in_nola": "Sending loving thoughts your way 🙏💞", "jessiolivia": "Sending you love and healing energy! It will get better. Know that your supporters are here rooting for you!", "mustangsallytwo": "I am so sorry girl! I was sidelined with my knee for pretty much the last year till they finally figured it out. Take the time you need and I wish you a safe and speedy recovery ❤️", "yunisishak": "Yess I did. And thankfully it waa better news", "shaycompton": "I'm so sorry! Healing vibes your way. Best wishes.", "forevverme": "Sending positive vibes and prayers for a speedy recovery💕💕💕", "glitteryfemme": "Sending love and hoping you are able to recover quickly and comfortably 🙏💗💗", "bhappy247": "Sorry for your injury sending love and light your way! 💖😊", "msanavifurnasty": "💔", "shannonleemcneely": "I will pray for your speedy recovery. Good call staying with your folks . 😘", "whiterabbit2910": "Best wishes for a speedy, safe recovery. Take care of yourself. 💜", "michellehess_m.a": "So sorry!", "8charli8": "Send you love and positive vibes. 👐 Take all the time you need to heal. ❤", "mariadubbs": "I'm so sorry. Good thoughts and vibes to you. I can't wait to see you back. I'll miss you ❤", "empathme": "Heal and be well. Love you 💞💞", "bluebellygirl": "We love you . Take Care . Praying for your speedy recovery 😘", "aftermyownbelly": "Oh hon, I'm so sorry! I just went through this and I know how it feels. I wish you a full recovery! Physical therapy will help whenever you get the proper diagnosis. Best wishes💜", "jessiejessiebobessie": "Sending you soooo much love and light 🙏🏽🙏🏽", "bbwgeneration": "Sending strength 💖", "treesinwelly": "I'm so sorry to hear this has happened, take care of yourself 💗", "jaishirelle": "Hoping you heal quickly and without any complications.", "curvesbecomeher": "@yunisishak my appt is for the 23rd, that is way too far off! I'll try to get an earlier appt", "sarahtaylorsjourney": "Praying for a speedy recovery", "iamdaniadriana\nVerified": "Verified"}