{"finally_bopo": "That last sentence! 💖💖💖💖", "hillycooke": "Your beauty shines through. People can be so ignorant and horrible, and, unfortunately, it takes a toll. I hope you have a good day today - you are lovely and you are loved. 💗", "toothless1994": "You're beautiful and yourself all the time. Shame that not everybody can appreciate that. Luckily you have your Instagram family who has your back and does appreciate you. And one of the reasons I follow you is because I got a little upset by all the more thin than me girls on Instagram. I just wanted people with all kinds of body types on my Instagram. To remind me that every body is beautiful and not only the ones the media wants us to believe are beautiful. I think you're an amazing woman. 💙", "electrasinspace": "Power to you girl!❤️🎉🎉", "thriftylittle": "You are a sack of beautiful worthy love 💕💕💕", "curvy_ariel": "So so right! Ignore the hate ❤️ sending you love ❤️", "stephanie_roberts90": "You are AMAZING!", "n1k.n1c": "Thank you for being you. Thank you for standing up and speaking your truth, and our truth. #effyourbeautystandards #losehatenotweight", "_tabularasa": "I dont know how you do it. I aspire to have your strength and resiliency. You’re a hero❤️", "steel_kitty": "Keep on being the fantastic and beautiful you! 💕", "ashannflores": "You are everything that's good in this world ❤️ thank you for doing what you do.", "malvina_mmmm": "Beautifully stated! You are gorgeous through and through! Let the haters hate, although I wish we could raise their consciousness, but LOVE will prevail! 🙋🏼‍♀️💖💋☮️", "missprettyreckless": "Sending positive vibes and love. You're beautiful inside and out.", "jerkernilsson": "The persons with such comments should just shut up. Take care!", "minikhosla": "You are the most beautiful woman 😘💞", "anninhastrefezza": "You’Re 2 sacks of pure gold baby ❤️", "curvily": "❤️❤️❤️❤️", "the_feeding_of_the_fox\nVerified": "Verified", "coraglitzer": "And this is the reason why we love you so much!! The world needs you but doesn't deserve you! 👏💪❤️", "lifebydegrees": "I'm so sorry you have to deal with people like that. I think most of them are often projecting their own self-hatred...so not only should they be taking a look at who they want to be and how they can heal, but also aren't worth our anger. Pity, maybe, if anything.", "artistshelleymouber": "I’m so sorry. People can be so awful. I have experienced it as well from people who should know better. YOU are one of the reasons why the next generation will be far better off!!! Peace and love to you ♥️", "majahugomamma": "You are beautiful no matter what they say! We are all humans❤️❤️❤️. @curvesbecomeher", "beniciadramaqueen": "This follower in California things you are beautiful inside AND out! Stay fierce! You are fighting for the rest of us!!", "mun_zoom": "Big hugs Aarti 💚 you are a dynamo, an Amazon! Love what you said about how these experiences only reinforce your belief in your work, in your path. Taking a stand against the norms liberates you from the effing norms. It's so sad that insulting attitudes are so prevalent in our societies. The only hope lies in teaching children better values so they grow up kind and sensitive 💚", "preetsukhman": "It is their own insecurities that spill in the form of hatred for someone who is comfortable with and accepting of their own self with such grace. I feel pity for them because they would never know this feeling because they never try. You keep shining girl❤️", "monstrance.ghastly": "💜💜", "just_mmkay": "💗💗💗💗🙏🏼", "meganowens4109": "I am so sorry you have been treated so badly! We are all people..not good not bad not right not wrong..just people. Please know you have every right to inhabit your place on this earth. Igore them, rise above them. Do you lovely...do you..💜💜", "_bex23": "Damn. I'm sorry it constantly happens to you. People suck. Keep sharing your story. I'd send you a huge hug from little me if i could. 💞", "saimangala": "Tell em girl 👏👏👏", "juli_patasahani": "We all are beautiful in our own way. The world doesn't need to subscribe to our image of beauty but also not be mean if people are different. I have been called worse names when I was in school. I can relate to you because till date there are one or two people around me who would say something that would hit me hard and that's not okay.", "biggredd510": "Your beautiful, keep doing what you do and f#@k the haters, just means they want what you have....goals and ambition!✊✊", "botsaucey": "How sad it is that there are people in this world that are petty and will always be that way. I feel sorry for them, the limited capacity they have in this life to disparage another human being on BS society drills into their head. I’m so sorry these people were garbage to you.", "dannijones26": "I don’t know if I just surround myself with better people but I do not experience this kind of shaming!!! X x", "abramowp": "👏👏👏❤️", "thisismeagankerr": "I’m sorry you woke up to that shit. People make me so fucking tired. I love you Aarti", "bustedinae": "They suck, were with you!! ❤️❤️", "medchickore": "Indeed❤", "bally_hayer": "Your are Bealitful as you are ..I stop listening to people", "tarynjrose": "You’re incredible", "dayanduday": "Sending love and hugs to you girl! 💛✊🌻", "swetha_sharmaa": "YOU ARE BEAUTIFUL ! I will say this to you every morning you wake up! 💗 you deserve all the love and hugs for you are such a dynamic personality, talking real, being real and inspiring a lot of us to be in love with self cuz that is Beautiful!:)", "vamooshe": "❤️❤️❤️ thank you for that reminder and for the work you do", "waawaamichif": "🙏🏽", "octeorrific": "Don't let unkind comments get you down. Rooting for ya 💪💪💪", "pictureperfect_yella": "Screaming from Buffalo, NY I LOVE YOUUUU 💗", "movement.labs": "I hate that this shit happens. It’s unacceptable, and I’m sorry you have to deal with it. Thank you for reminding me how absolutely crucial it is to help create safe spaces for every-single-body.", "sapphiresplendour": "When you know better you do better and that’s where these people are at. Knowing s***. You’re doing so much for our community and we stand by you! 🙌🏽", "vika_turner": "Thank you for saying this, you’re so strong and such an inspiration 💜🙌🏻", "cedar.willow": "The hatred is so real. You are beautiful and deserve to live in peace. 💛💛💛", "crissiflo": "\"People you have known all your lives\" including family, who dress it up as concern for your health, at least in my case. People and their opinions about our bodies! Making me sick every damn day! I, for one, and grateful for your page. You post your pictures, opinions be damned, and you are brave enough to keep going even when the world tries to shut you down with its ugliness. Know that you are an inspiration and what you are doing is meaningful. 💕", "malamayaselvon": "@curvesbecomeher Aarti, you are a goddess ... I think you’re amazing. I know it hurts but your determination leaves me in awe ... thank the universe for you 💚", "bodypositive_dietitian": "People are trash. Thank you for all that u do", "danamg107": "What the fuck. 😡 I’m so sorry. Our world is filled with so much hatred and it’s sad.", "gvinegarette": "Love you to pieces!!!! 😘💕", "bolddestinations_": "Thats ao terrible . But you are beautiful and strong and worth of love . No one can take that away from you ❤️❤️", "fern.galindo": "You are good and you matter and youre beautiful. You dont deserve that treatment.", "curvesbecomeher": "Thank you everyone for your kind sweet comments. I am really accustomed to this nonsense that I wrote about, but thank you for the solidarity. It means the world to me, and I hope my experiences help you out with your daily living."}