{"mzmonroe": "You do you! Your body, your business! (Not to mention traveling is awful and exhausting. Ugh.)", "africagem": "So if you were thin then you would deserve to use the wheelchair?🤦🏾‍♀️ Humans are just...I mean damned if you do and damned if to don’t. They will talk about you anyway.", "karenwalcottwrites": "I can’t walk longer than ten minutes either. I’m big and I always castigate myself for that issue. It sucks.", "dannijones26": "People need to get their nose out of other people’s business and concentrate on their own affairs!!! Sending lots of love ♥️", "drawnbyjovanna": "❤️❤️❤️", "mollyroxanne": "But your top is so cute!! Tell the haters to ffff off", "mitsueki": "Oh dear I hope you're okay dear!", "emintheeast": "That shirt though! 😍", "vhope_m": "I'm so sorry 😔 I've been out at the store and had to sit down because I become so fatigued and people look at me like I'm nuts just plopped in the middle of a furniture or toy display. My family half the time doesn't understand why being around people for 5 hours at a time is too draining for me emotionally and physically. It's just awful. People are so close minded, when you have chronic illnesses or invisible injuries you don't get the luxury of sympathy. Be kind to yourself. 💕", "singaporeactually": "Invisible illness is so hard 💜 sadly nobody will know the struggle unless they or their family members are in the same position. But it’s great that you are raising awareness about it.", "josephinedervish": "Sending love. Great that you're speaking out, people need to learn how this feels so that they can do better. Do email any airlines who fell short of your needs too. 💛", "fiercefatfirefly": "You are a badass and force of nature my dear Aarti. Everyone deserves to rest when they need to 💜", "deesview": "I'm sorry you had to go through that. I despise when people come to there own conclusions, I'd prefer they do what most people consider rude, just ask me!", "busty_bibliophile": "Surprised that wasnt a middle finger. Lol.", "jilbijou": "Hope you get better soon.", "crabscrambly": "Screw the haters!", "fatbecomescurve": "@curvesbecomeher God will heal you bless u ad give u long life your infact in my life is unmensurable u make me feel happy ad bless ad i decree to yr health u will get God perfect healing ijn . if u don't kw u are a life changer", "eliandari": "I have felt the same way when elevators or anything helpful, felt I had to exaggerate my injuries to feel valid.", "kwbbwruletheworld": "I'd be parade waiving Lol", "shandi.divine": "The same thing happened to me when I was pregnant, I couldn’t walk to the bathroom without having trouble breathing and got the dirtiest looks. People can be so hateful and ignorant. I hope you get better soon!", "stephiejeanw": "People are the worst. 😘😍♥️", "sarahlouiseainscough": "Ughhhhh people i despise their negative emotions, kill em now!! 😑😑", "kimberlyweiss": "Let me live - yes. 🙌🏻 why is this so hard for people to grasp 😤", "electrasinspace": "Take care. Get well soon.🌹 Dont bother with what other people think. We anyway can’t control that. Focus only on yourself.", "mismyst": "🖕🏻 them!!! Own your space", "sartorialsecretsofficial": "Hope you feel better love. I'm sorry you're still struggling from that injury. ❤️", "movement.labs": "I am sorry that people are inconsiderate jerks. Glad you had the strength and support to advocate, and not let this be a barrier to your holiday last month!", "apodaca2281": "❤️", "thebodyispolitical": "Live it, woman 🔥💪", "fatisnotaviolation": "Sending you all the love, strength, and comfort 🥰💓💪💓🤗 You are a miraculous and magical being, and you deserve to be treated & seen as such! ❤️❤️❤️ We’re here for you love!", "han.ec": "💓💓", "lara.jane.ny": "This is my experience every time I travel. Thanks for sharing 🖤", "loved_by_grace23": "Hope you get better. I know the feeling because all this month my knee has been bad sprained. So I ride the cart riders at Walmart and people stare like crazy. But I’ve come to terms they don’t know me or my life so I just move on. People can be mean and cruel. Know you are beautiful and just smile girl make them know you shine. Much love to you. ❤️❤️❤️😊", "momlycoddled": "Your wheelchair speaks for you: karma 😆 Seriously though I wish the human race didn’t assume and judge as much as it does?? Big hugs 🤗", "_nati_mami_": "Flip them the bird 🤬🤬🤬", "coraglitzer": "Why can't they just let people be and live their own lifes?", "meraphetamine": "Your tat is amazing!! They were staring at it and wishing they was you!!", "wendi_co11": "Ppl are assholes.", "josovas06": "💞❤️", "danasuchow\nVerified": "Verified", "glitterwhore333": "I love ur shirt 0.0 ur page is awesome!", "ahope_intheworld": "🧡 vibe on!", "girlfart": "Sending all the love. This was me in three different airports yesterday flying from London to Seattle to Portland and unable to walk very long too due to knee pain. I understand and sending all the compassion because some people are awful. ❤️", "rupertajorcelyn77": "We are at the same pace...inspiration.", "thisismeagankerr": "That makes me so mad 😠 I’m sorry people are such jerks Aarti", "fivefootfunandahalf": "Roll on them haters 😎😎😎 love you honey", "phatgirlsparkle": "Love your rainbow shirt and shorts combo! I have the same one and the colors are lovely on you ☺️🌈", "rosemaryandquartz": "I’m sorry about the assholes and I love your happy rainbow shirt.", "dani_da_olive": "you are amazing girl! 💓 keep up, they know nothing."}