{"curvesbecomeher": "@snepal123 yes that's my concern as well. My doctor unfortunately is not available at all today so I will wait until tomorrow. Will be careful until then 💛", "finally_bopo": "Absolutely beautiful. Your warrior spirit is so admirable. I know it's so hard and easy to get discouraged. Please know how much you mean to so many of us.", "lioness848": "Hopefully it's not a clot 😯. Well be looking forward to an update. Love and light to you 💖", "secureinstyle": "I look forward to your glorious and fashionable return! 😊😊😊😊😊", "the5thcellar": "You will get there!!!", "purplegal94": "💜🦋💜", "myxxfly": "You are a vision of loveliness and I pray for your speedy recovery my queen 🙌👑💋", "youngrandomfree": "Hope you get better soon luv and don't worry you'll be back to slaying lives in no time (but you already do that no matter what )", "staceymillicentcarson": "Much love to you xx", "fyus": "I love your fashion stuff! Get well soon! 😆", "michellehess_m.a": "That is super fun and adorable!!! 💋", "familia_almazanciferno": "🔥", "sujatha_santharaharam": "Hope u get well soon sis", "yogaboobs": "Great outfit, injuries put you on an emotional roller coaster, you know what you can do, like to do, but need not to do right now. I need to heal, recover and that may mean taking a break from things I like to do.🙏🏽✨💚 You'll be Poppin' your old self in no time.😘.", "fridasskold": "All things takes its time ♡", "dtg_75": "best of lucks!!", "greenribbonplus": "Yes look at it with hope, while we look at your medical pictures being proud how you handle your situation. Get well soon!", "amandalee684": "You look super awesome!!!", "margedtrumper": "I know what you mean. I have a lighter situation than yours but I also cannot stand for long and I've been using a crutch in the last 2 months. Everyone is posting pictures and videos of their lovely Spring walks and I am praying this won't last too long. I know we will be back on track soon and sometimes we need some away time to enjoy more after 😉😘", "feedthepoet_apparel": "🔹🔥🔹", "rubberluggers": "Omg you're so brave", "deesview": "Gorgeous", "tallissexy": "Super Gorgeous Picture!", "snepal123": "Good luck, I hope it is nothing major. But as a doctor I'm concerned about blood clot and would advise that you go in sooner rather than later. @curvesbecomeher", "adjpants": "Gorgeous look! And you'll be back on your feet before you know it love. If anyone can do it, it's you.", "halleyree": "Good luck! Sending you healing love energies 💕", "ladeutschediva": "🙌🏾", "thelulasparrow": "😍😍😍", "curvily": "Love and hugs babe 😘😘😘", "mimir25": "🙏🏻🙏🏻 Hope it's just some muscle cramping! Adorable outfit too! 💙", "lindsay__catherine": "You look so gorgeous love 💙✨ Good luck my dear! I'll have you in my thoughts for sure 🙏🏻 Sending you lots of love and positive vibes 💕😘", "sathya_buttercups": "Sending you love & light. Get well soon 😘😘😘", "the_feeding_of_the_fox\nVerified": "Verified", "lilwinnie79": "Hope all goes well at the doc! Fingers crossed for no DVT!! 😘", "lintherealtor": "Good Luck!", "cedar.willow": "amazing photo of you!!!😄😄", "lara.k.robinson": "luck!! and i love the pic too.", "claudiaodra": "Love the pic!!! Please never stop!!!", "jenny_bottrell": "Good luck!! Hope everything is ok 🌸🌸🌸"}