{"lena_lamont": "Oh! My mum used to make idlis! I haven’t had them in years ❤️", "rawxvn_": "Reflexology!", "margotmeanie": "This looks YUMMY! I also require that shirt 😸💕! Sorry to hear about the migraines 💗", "lala_zoe_": "I'm a tension headache/cluster headache/migraine sufferer too so I really feel your pain. I've been put on an epilepsy medication and combined with injections when needed they really help! Might be worth mentioning to your GP? I stay away from caffiene at all costs and keep well hydrated well rested and try to not get too stressed (easier said than done) 🤣) hope you get better💓💓", "radiatingsunbeams": "My migraines/intense pressure headaches stopped when I cut out dairy 🥛 🧀 Hope you feel better", "thisismeagankerr": "This looks yum! I found out the cause of my migraines (they’re hormonal) and my nutritionist advised me to try going soy and dairy free. It’s definitely helped HEAPS and now I only occasionally get them due to stress (in which case I take my meds, and take it easy)", "signora_castaldo": "A migraine cap that I keep in the freezer for emergencies is a life saver...combined with voltarol suppositories & migraine balm. Sending love 💕 going through the same thing just now...I’ve had a few days of pretty bad anxiety and I feel like I’m holding tension in my neck & shoulders & it’s coming off that...does anyone else get that? Xx", "kizzed_": "So fab!", "coralcrusher_jl": "Migraines are the worse! I get maybe 2 a year now thank goodness! It was at the point where I was getting 1-2 a month. The only thing I can take is ibuprofen, I usually get a warm wash cloth and lay it on my forehead and lay in the dark for a few hours.", "uglyasstroll": "CBD bath bomb with extra epsom salt and a cucumber face mask. I think you’d benefit from CBD oil, CBD bath bombs, CBD pain rollers, etcetc. It really relieves pain and inflammation better than some pain meds. Pls try it 💗@dabsoflove has amazing products too but idk if she does international shipping", "vasuthegreat": "Peppermint oil helps me and to take a hot bath with epsom salt, baking soda and you can add essential oils if you want..instead i grate a small bit of fresh ginger...this will make you sweat in the bath and sweat the migraine toxics out..im on day 984 of the same migraine...i feel your pain. .i hope you feel better your breakfast looks yummy", "charlottiejb": "I get tension headaches too! ( I’ve got one currently brewing 😩)You’re the first person I’ve found that suffers. I’m definitely going to have a look at everyone’s suggestions!!", "thewitchnextdoor": "Cannabis 💚", "kat.n.brown": "Sleep", "anjari_jha": "Orgasms", "girloutandabout": "I’ve been trying dry needling and it seems to release some of the tension", "rosebuddud77": "I used to suffer terribly from migraines. My doc tried me on a couple of meds but nothing was working. Then he started an older drug that is sometimes used for seizures and you know...I dont get migraines anymore. Its like a miracle.", "roxanesweetgrass": "I cut out gluten and the migraines stopped. Might be worth trying.", "francesca_pez": "I get tension headaches fairly often, for me it's hot showers, ice packs, naps, and head massages from my fiancee. And honestly the massages are the thing that helps the most. Since tension headaches are all about being tense ya know.", "ealasaidh": "If they won't go away, I hit urgent care for a shot. I can never remember the name, but it's basically liquid ibuprofen. It's amazing. I still have all the other symptoms but the pain goes away.", "anurangi2004": "I heat a face towel (wet towel heated in microwave) and put it on my eyes. Recently that helpful me a lot than pain killers. Get well soon!", "dinesh_subramaniam_94": "1st You are gorgeous @curvesbecomeher 😍😍😍 2nd Idlis 😍😍😍", "whitneysweet_writes": "I find stretching my hips helps. When I get tension headaches they tend to start in my lower back and go up my spine. I do stretches for sciatica and lower back. Not sure if they’d help you.", "cook_e114": "Meds and caffeine.", "xms_triggx": "I don’t get them often but when I do I have to be in a completely dark room with only one small candle for light. No sound if I can help it, a gallon of water between nausea heaves and 4 old school no cover melt as soon as they touch your tongue aspirin. Then I lay with a hot towel over my eyes till the pain stops.", "pocheposh": "Idlis A+", "sheguidestheway": "I legit have had a migraines for months at a time. I went to the docs and they had no solutions. I learned about MindBody Syndrome by Dr. John Sarno. From there I realized my migraines were actually anxiety at like 💯. I journal daily about shit that bothers me. I take anxiety medicine when I need to. And when I the pain is too much, which is rare these days, I take excedrin migraine.", "amrutha.t": "@curvesbecomeher I get these headaches a lot. Eating a good meal that has good carbs and resting or taking a nap worked for me. Also not thinking about anything while resting goes a long way", "lajoliefossette": "I wish I knew. My son gets migraines Sucks cuz he is still a kid and it breaks my heart to see him suffer.", "mausam.avlanishah": "I ❤️ idlis! Unfortunately lot of time eating fermented foods triggered my migraines 😪. Especially if i had them for any meal with a large gap between previous meals🤷🏾‍♀️. What helped me was applying vicks (liberally) and taking a steam inhalation and then sleep in a dark room with a heated eye compress...and once i feel better eating anything that has potatoes in it...hope this helps...hope you feel better ❤️", "purplegal94": "💜 Two excedrin migraine capsules with dabs of peppermint oil on my temples, a dark quiet room and close my eyes sometimes with cold washcloth. I can see that breakfast might do the trick though! So very blessed for your wonderful husband 💜", "pictureperfect_yella": "I forgot abt the oils lavender/tea tree", "111cormier111": "Honestly, a daith piercing changed my life", "jennywonder": "Ice on the back of my neck, all dark. I also got this vibrating facial roller on Amazon that someone had recommended for headaches, and it does feel really good and helps relax my face but doesn't actually get rid of the headache. I'm lucky enough to live where medical marijuana has been legal for a while, and it is amazing for me with tension headaches, it really just releases all the tension for me. But I'm sure that's a case by case thing and doesn't work the same for everyone.", "thepodog": "I've read some positive things about daith piercings. I see a Japanese style accupuncturist, chiropractor and massage therapist. They help but I still struggle with migraines and chronic pain. @practicewithdana has a migraines practice, as well as back and jaw pain practices. I've also found recently that work on my jaw and temple muscles helps my tension headaches. Hope you find something that helps you ❤️", "bailzasaurus": "Chronic migraine babe here! My best defenses are really good sleep hygiene, keeping anxiety in check, peppermint oil, gentleness and rest, and, of course, the right meds! (I get Botox and just started Aimovig, and have rescue meds for when I need them. I’ve also found nerve blocks help when I’m really in a bad spot!)", "jessi.so.messi": "Acupuncture, massage therapy, and chiropractic adjustments help some! I actually found out that mine were tied to my hormone levels. I had no idea that birth control could do that. I get them sometimes now and most of the time it’s darkness, ice packs, and prescription medication. Hang in there love ❤️", "steffiewhiteford": "I second that.. My mom suffers with migraines for years. Garunteed one at least once every 2 weeks that would last a few days. Got the piercing about 3 years ago. She now only gets migraines maybe 4/5 a year. Its been a massive change."}