{"erikag252606": "Love it! I’m an IFNJ too, but this makes me feel extra special 👑", "witchynerd": "I didn't realize we were so rare! INFJ's unite!", "lrnwalter_": "Late to the party, but this is where y'all are. I've only met one other INFJ in my life until this post. We're special and fab 🖤", "lauraacupcakes_": "I feel this in my core ❤️", "hannahmae1946": "It’s me!", "thelatejc": "Saaame!!", "rawxvn_": "This is me to a T.", "beakea": "Oh yes! I took this test a while back & it just clicked! INFJ love!", "sugarfreeeketo": "Ha I’m a Psychology major too🙌😂", "lauralitabeth": "Hi fellow INFJ! ❤️", "melissa_nakaishi": "I think I am INFP, but all those descriptors were spot on for me, so now I'm rethinking it. Maybe I am INFJ?", "monicarose121": "Yup INFJ here! 😊", "erinvontrapp": "Infj-t here💚💚", "artsy_remi": "Super relatable!! I always love reading INFJ content because it reminds me that I'm not the only one!", "alliestrawberry987": "Me me me!!", "rd_plus": "Infj 🙋🏽", "cook_e114": "INFJ here too", "fyus": "ISTP here 😅", "mslindsaym": "Me too! 🖤", "somewhere_under_the_rainbow": "Omg I'm INFJ too of course!", "missmegan_marie": "Omg. So beautiful...and accurate. 😬", "princesscakep0p": "Love it! I’m an INFJ too", "ttemplemeyer": "Me too!!", "hathaholly": "Seems like all 1% of I INFJs have posted here. I am INFJ as well 🙋‍♀️", "kimberlyweiss": "I run between INFJ and ENFJ! Really am E but then the high sensitivity makes me appear as an I. Summary= love this about you! 😘", "on.mckenzie.avenue": "INFJ here too😊", "taliastormx": "We definitely have to stick together and be friends 🙋🏽‍♀️ hehe", "fatcatscafe": "INFJ here too 🙌", "sailthejordan": "INFJ here, too! ☺️", "betsaronie": "I'm an I/ENFJ. I was solidly Introverted until I had a neat death experience in my 20s from Crohns complications. I got more extroverted at that time. Everytime I take the test I'm either 51% Extroverted or 51% Introverted. I identify very much with both, it just depends on my mood.", "malnotvalid": "True true and true! INFJ here!", "purplegal94": "I am an INFJ too 💜", "kountryblk": "Ahhhh, INFJ me too", "agrlnamedtruth": "INFJ over here 👈", "meaghandancer": "Yes! Finally another INFJ! It’s cool that we’re such a rare personality type, but it gets lonely sometimes 😂 It’s nice to know that one of my role models understands the way my brain works!", "fan_farming_tastic": "My best friend and I are both INFJ. It makes for a great friendship 😂", "lauren_res": "Me too 👋", "jessi.so.messi": "Twinning 💕", "angelabethcan": "Yup!! Me too!! I wonder what you Human Design is. That’s the only thing that’s been more accurate for me!", "kat_mccardle_art": "Yay! So happy it resonates with you! Thank you for sharing my artwork ☺️", "myxxfly": "I should've known you were an INFJ too! 😂", "yesak_ylno_eht": "I am also INFJ!", "heatheramidwife": "I get something different every time I do it!", "maggiemunkee": "INFJ 4 LYFE", "mixedfatchick": "I'm an INFJ too! 💕💕💕", "cbelldahl": "Yes, yes, yes and yes. I find that it overlaps with being an HSP as well.", "3packofpitties": "INFJ here! 🙋‍♀️", "hollyhardin16": "Fellow INFJ! Wanting to save the world, but not wanting to leave the house is me in a nutshell. Also, the deep thinking and daydreaming. It’s so validating to hear that there are other people like you, when you always feel like an outsider"}