{"nicolek008": "He’s a miserable person that wants her to feel like sh*t. Guys like that are a failure to society.", "ticha_original": "My parents still want me to marry a South Asian man, and want me to lie about who I'm.", "fabulousfattyk": "Oh and by the way - I’ve encountered similar dickery in Western Europe on the regular too. It’s a man thing...", "gius_peppe_punk": "My god how can they be so cruel? Hope you're doing great! Don't let anyone put you down!", "lovetheone": "Oh my god what an asshole.", "kajalzjourney": "It has to be a fucking Indian.. damn privileged douchebags.", "d_new_traditions": "Jeeezuuuus this guy has maaad issues of insecurity to take out! As for what no \"self respecting Indian woman\" might do, I guarantee no self respecting MAN would talk that way to anyone. POS garbage human", "darshni_mua": "Wow xx sounds so sad but I actually can believe this is happening. I have experienced the same many many times xx such a shame these men think it's ok to talk to women who aren't the typical size in this way. Something needs to.be one and they need to understand a larger size doesn't mean your ugly or un attractive. 😢😢", "kasutoproductions": "Ugh the desperation reeks so bad it stinks *covers nose*", "plussizeapproved": "🤯", "oh.nella.nella": "I don’t know u but air hug... that’s crazy", "unicorn_goddess89": "Ohhh I smell the insecurity through the messages. Smh.", "diva_fashions19": "Sending you lots of love and positive energy 💖", "botsaucey": "What a piece of shit he is.", "jaxie1970": "Did you send this to @byefelipe? What a pathetic, entitled child he is.", "sammy_sweetie": "What the entire fuck?! Sadly, he prob doesn’t realize how much this highlights that he clearly has a problem...", "closed_as_not_working": "How horrible. 😪", "danicornia": "Incels 🤢🤮🤮", "becsbarratt": "This is appalling. I hope @chubby.to.chic twirls on those haters and keeps being her amazing self. I hope that guy grows up one day.... but unlikely", "fyus": "Lol, \"you'll never have children\". If they all turn out like him, I'd say it's a blessing.", "misspris30": "@stolzy31 @cb25788", "just_eat_the_doughnut": "What a incel c*nt boi bye", "oldfamiliarway": "Wow he just went off huh", "kisskadeee": "I love you", "finnest_imperfections": "Her not responding really messed with his head and ego! Deep down inside he wants her and wants to show interest but you can tell he wasn’t raised right, and obviously is a psycho path! He put so much time and energy into beating her up he made himself look dumb and once again psychotic. How do you start at message at 2am when most people are sleep if it’s not the weekend, then blow up at 3am when they haven’t responded....then get even more pissed at 5am and 6am to continue writing mean and hateful messages! WTF is wrong with you, you damn creep...grow up.", "moon.litt_999": "Humans fail me", "thebopowitch": "Sending so much love to you @chubby.to.chic. Thank you for sharing.", "deborahbrosseau": "This is infuriating and heartbreaking. Toxic masculinity is as old as any written words, and the bravery of today’s women in the face of it humbles me.", "nurse_court80": "💔", "katherinewildman": "@chubby.to.chic Dearie me. What a pleasure he is. Keep smiling, beautiful. Thanks for sharing @curvesbecomeher - what a dick. Love you guys xx", "badassbusinessbeauty": "Wow 😳 what anger. I wonder why this man is so wounded. And I hope that every one of his words rolled off you. Much love 💕", "ealasaidh": "They are such entitled jackasses. Nobody should have to see such cruel bullshit in their inbox/text/etc. But the patriarchy is alive and well.", "leashasonam": "What the....Be your authentic self. That is beautiful. Definitely such men ought to show these comments to their mothers or sisters and ask them how they would feel. Agreed this is how it fuels rape culture amd this should never happen regardless of men or women. This has to stop. +1 on Naming the perpetrators instead of the victims. @chubby.to.chic stay positive and DO NOT let such treats bring you down sister!! #empowerment", "fizzarahman": "What the shit are south asian men really.", "millsibills": "Young men are so stupid with their arrogance sometimes 🖤CALL THIS SHIT OUT 🖤every time 🖤", "stcurio": "What a piece of 💩 i bet he has a teeny weenie", "ratty.n.curlygingersnaps": "Well it's simple. Humans like this won't find a mate, they won't be able to spread their genes. Perhaps it's for the best.", "pdxfashionista": "Throwback to men in Argentina... 🙄", "tasalghul": "YEP. this x a billion.", "thatoneyogi": "The part that was funny yet typical starts off in wanting to know her and because she didn’t repspond... he decided to be a dick. A rejected dick. 😂", "naturenerdandcoffee": "Da f*ck. I shouldn't be surprised and how much male behaviour shocks me. But here were are again. Sickening.", "plussizevintagemadame": "Why do people think this is o.k? Thank you for sharing. And well done for the mature response to this idiotic person. 💜", "duskonig": "cishet semi-old white dude here and WTF? I totally understand different strokes for different folks, but don’t give people shit for their choices, especially when you don’t know them. Well, in fact, don’t give people shit ever. Help where you can, but don’t interfere where your help isn’t wanted. The latter in any form is called oppression. I just don’t get it.", "shefty_pie": "@curvesbecomeher too modern to be a wife? What does that even mean? Sending positive vibes your way ❤️❤️❤️", "trainingfor_21k": "It's not just men of colour it's men. Assholes are assholes :(", "claireemoor": "Oh my god this is shocking!", "freddiemercurylordandsavior": "very painful to read.", "simplyjustthela": "I find it amusing how these types of fucktards always approach women thinking they are easy and once the women reject them, they do a complete 180 and proceed to degrade them... Like dudes, do you not realize you fall into that very same category the moment you say \"oh dudes only talk to you for sex\"... 🤷‍♀️", "mrsangiebabe": "I just block people like this ounce the comments start. I don't allow it to flood my mind. Block them wild people", "baaprebaap": "If people ask me why I hate men, THIS IS LITERALLY WHY! Like being nice and kind is some kind of gift to give and not something that should be obligatory", "biancakarina__": "POLLUTED!? What in the actual fuck.", "monapily": "I’ve experienced the same from white men in the US as well. It’s a ridiculous, sad, outdated mindset. Like someone else in this thread said: assholes are assholes. It’s shitty to read, but thank you both @chubby.to.chic and @curvesbecomeher for sharing this with the community and continuing to do what you do. 💖", "eatasnickersshelby": "Jesus christ what a fucking manchild", "junocounseling": "Horrible. Why are these guys so entitled? “You’ll never have me or my children”. Like, who would want this trash bag’s sperm?", "stephiejeanw": "Her response is golden. ✨", "lauren_on_an_island": "Argh. Sorry @chubby.to.chic that you have to deal with this fuckery", "bustedinae": "Pathetic", "ralislel": "After not replying for one day 🙄", "helloaseya": "What is wrong with people?? Like ‘hey, we just want to exist and be safe’ and somehow that is taken as a personal attack!", "hithaherzog": "Um, WTF? I am so angry at this guy. You are a beautiful human and there is nothing fake about me following your story. You are authentic and rad and I hope I get to give you high fives/have lunch with you in person. It would be such an honor. Rock on sister. 👊🏽❤️💯", "quirkysiren": "Sadly I have heard similar things. I live here in the US", "tinalandtravels": "Internet trolls. I just always assume they’re kids acting stupid on the internet. Doesn’t even get to me anymore.", "tennesseehoney504": "What the ever living f**k. Sending nothing but love 💕💕💕 to @chubby.to.chic and all the rest of the people out there who deal with male dickery on the reg.", "messybunsandmindfulness": "This IDIOT is someone with extremely low self esteem. That's it.", "spontaneous.kat": "This is just sad that he thinks he knows more about her body than she does. 😭", "breannas.blog": "Bloody well preach it!!! What a dickwad. You girls are beautiful xx💗", "otakumami102271": "Ewe. What kind of person says shit like that to someone? Such an ugly person!", "recoveryeverydamnday": "Wow 😮", "the.awakening.guide1111": "Thanks for repost🙌", "coraglitzer": "Yes, lets hold them accountable! 💪👏❤️", "coffeeaddictx4": "Thank you for sharing this. I’m always looking for inspiration to continue my own journey. You speak to me. And now I have a new inspiration to add to my treasure chest. 🧡", "nadinelagat": "@chubby.to.chic thanks for speaking up. This gave us more courage to stand up to any shamers and perpetrators. Things like this happen on all walks of life and people like us should be aware that they can stand up and fight for who they are. All of these have to end, and it should start from us. #empowerment #notobullying", "z.dahya": "WTH?? 😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡", "kittehinfurs": "This 1000% is the reason why I've never dated Indian men, also why I left India the first time. It's the worst sort of dehumanizing, nothing I've faced since then has come even close.", "risaroo88": "Lord wtf", "typingberguruh": "ugh. i want to punch this guy in the nutsack."}