{"jannazinzi": "@tanyadf", "andnowmiguel": "Sorry to hear that. Defiantly keeping this in mind the next time i watch anything from this org.", "ajayslive": "can you put the link in your bio so it's easier to access? or via a comment. also I'm both not surprised and yet wholly disappointed", "tanyadf": "@thesoniag @goddessjaz so what about those TanyaTalks??? I'm sorry babe. You know I know...", "eduverandi": "🙌🏾", "corporate.goon": "💖💖💖", "aliciasmithart": "WOAH! WTF!?", "meryemsfirst": "Sjeesh too bad babe so sorry to hear ♡", "bien_volada": "Ur the best", "moodyfruits": "@tanyadf @thesoniag yall are bad-ass, fuck TED!", "a_wilder_utopia": "Keep doing what you do Sonia, and for those who don't get it, fuck 'em", "sanchlett": "Much respect. ✊🏽", "johnhenryaillon": "I am so mad that TedxCuny treated you like that, i was very interested in your talk. I am currently one of the speaker associate at TEDxColumbiaCollegeChicago for spring 2016, If one of our current speakers decline our invitation, I will definitely fight to give you a space as a speaker for our event. I want to provide you that space that cuny couldnt. I will of course reach out to you more formally and not over Instagram. Your words are to amazing to even benefit an institution like that. Cuídate.", "maroonedalienprincess": "I know we don't know each other outside of likes and the occasion comment on the ig, but I just wanted to offer a deep thank you, I appreciate your vulnerability femme, thank you for holding space for queer poc bodies, for using your voice to not only speak your truth but amplify the community that surrounds you. #allthelove ✊🏽🔥💜✨", "t3ddiii_oz": "@thesoniag I'm sorry to hear about this honestly I'm one of the liaison of TEDxCUNY at Lehman College. I attended a reception last night at the speakers reception I was hoping to see you there but I guessed the time didn't worked. I honestly was so disappointed about the Unprofessionalism they showed before the conference and at the conference the host was so horrible and its not fair the you weren't allowed to speak. My next project is to plan a saloon at Lehman College is something as a liaison I need to do. I would like to invite you at Lehman college to come and speak at the saloon, I'll speak more about it with my colleague, my other team member. Please contact me when you have a chance and see if we can meet up and have a conversation. As a Latino this was really unfair. Contact me at Oscar.martinezVillamil@lc.cuny.edu", "nina_parks": "@naticonrazon", "y00nalee": "Thank you for resisting toxic hero narratives. There is no scarcity of people and places who want to hear not just about you and your work but about, as you say, its lineage.", "elizabethjabar": "Yes-resist!!! You are a powerful artist!", "calderon.kenia": "@mabe420 damn!", "doonothing": "Stay strong. You are important", "maejaney": "Ugh @karembloop 😩"}