{"imeta1": "Ppl can be such classist trash, especially in the #dmv", "litcandle_xperience": "🔑🌙 Thank you", "angie_kilcullen_art": "Personally I do it because I’m genuinely interested but I totally know what you’re talking about and you can always tell when it’s otherwise.🙄", "msanavifurnasty": "BOOP! 👏🏽 Can I repost?", "blkhippiegoddess": "Absolutely... I hate this question and rarely ask it", "julzilangbulan": "resonates so much. more so than ever lately. 🙏🏾", "lvmclaughlin": "This. 🔥", "mariconamor": "My new answer: I don't exist, I'm just passing by :)", "tay.lavonne": "Thank you for this 🙌🏽", "deejoy6": "It’s SO frustrating", "ellathoompson": "THIS HELL YES 🙌", "mindbodyninja": "I remember kids asking me this when I was in school. But asking what my parents did. For the same damn reason", "yellowgirlspoetry": "Wow, yes, thank you, I love this, thank you for saying this. I don't have much experiences with 'networking' but the ones I've been involved with have left a nasty taste in my mouth. And lately it's me trying to figure out what's going on, what exactly is 'networking' and you, you said it, that's the network I want to be a part of...choosing to work, choosing to build with each other, choosing to see each other.", "poppyrepublic": "🙏🙏🙏❤️", "mahogany.bo_": "Oh yea", "river_siren": "🕯 All of this, all the time.", "zolitha": "🙌hallelujah @_kwantu I dedicate this you💟", "lehua_m._taitano": "yes, yes! well said. i’m not interested in transactional relationships, but real, intimate ones.", "monicaelisa.g": "THIS. 👏🏼", "itsmedaria": "I tell people this all the time!! I don’t play the age or occupation game...", "lizzcat": "Thank you for writing this. I have a job that is literally sucking the life from my body. I just can’t anymore. I have values. I am a person. TY for posting this, it’s everything I needed to read today", "the_supralogic": "For real. 💯💯💯", "cocosdelight_1111": "🙌🙌❤️", "oliviarodriguezv": "🙌🏾⚡️!!!", "nialacree": "Yes!!!!!!! I’m here for it! ❤️", "laura_luna": "Also, clout chasers and social capital chasers, we def see you and can spot you a mile away. Not cute. 🙅🏻‍♀️ thanks for this post, Sonia ✨", "theeggisyou": "🙌🏾🙌🏾🙌🏾", "jadethemighty": "See you, friend and here to build with you in the most imaginative and liberating ways 🧡💜", "hnub.qub": "Yes, yes, and yes!🙌🙌🙌", "i.am.ven": "🙌🏾✨", "noturbabyfather": "Ain't that the truth", "bucketjones": "😭😭😭😭😭", "tu_me_manques_vachement": "*don't", "omezzz": "THISSSSSSS! So freaking relatable!", "marilovazquez": "It’s such a boring ? I’d rather ask - what do you do for fun?! 😜", "azuaintuition": "Say word 🙌🏽", "leftoverchopsuey": "😍", "johndiazcortes": "👏🏼", "xicana_mama": "Yeeees 👏🏽👏🏽👏🏽", "jesssolomazing": "Woooosah.", "msroeyah_roeinator": "💯💪🏽", "cholotears": "Donnie been a g", "kristin.is.cool": "👏👏👏", "kingtexas": "🙏🏿"}