{"little_kotos_closet": "Appreciating you always and how you show up with your full self. Thank you 💛💛😘🙏", "wildhomegirl": "Oooh. Yes. This one. 🌱💚", "reetaloi\nVerified": "Verified", "niccibriann": "♥️ You!! I reached into my backpack randomly today and pulled out a business card of yours thinking of how you were doing.", "thepunkrockmph": "She ain't lying 🙌🏾", "nativeprincesspeach": "my moms say this all the time thank you for this 😍", "melisacardona": "🕯", "eightbirdz": "This is beautiful and needed thank you for sharing this🌸", "jae.gae": "Thank you for sharing this❤️", "kristi.kawanna": "👌🏾💜", "kuruchitx": "Dear Sonia, hold strong, your fire will drift and change but it will always be there. You are medicine incarnate. Love you.", "marinamagalicious": "Beautiful queridx... gracias!! 💛💛", "gracefranck": "thx for sharing ❤️", "strivingbabes": "perfectly said. 💕💕💕💕💕💕", "scondito": "No one is posting failures 💯", "taylorklong": "I feel this so hard. Have been trying to write on IG about the struggle and not just the success. Thanks for writing this.", "joanne.ny.choi": "Thank you for being real 👏🏼", "thebluntbohemian": "love.", "neonhoney": "Thank you, Sonia 💜💜💜💜💜", "mariposamigrante": "Sending love and light. #hermosx", "jesssolomazing": "We be failing and struggling too. Yes. More patience, less comparison. Yes. We are on our own timeline. Yes! (Re: meditation... I love the @insighttimer app!)", "samirashifteh": "Witnessing this! Feeling this! Appreciating this! So much! Thanks for your vulnerability and realness Sonia!", "iizahieu": "❤️❤️❤️❤️", "lucylunam": "❤️❤️❤️", "insighttimer": "🙏", "rebeccakelly_g": "🙏🏾💛✨", "rzlovescake": "Love this. Sharing our wins is just a symptom of capitalism. I'm here for sharing our failures.", "elisabetvelasquezpoetry": "❤️❤️❤️❤️❤️❤️❤️ Thank you!", "la_marisoul": "Yes!❤️⚡️", "ixxcheeel": "Thank you so much for sharing opening up and being so vulnerable on the inter webs. Really takes a lot of courage and I just wanna say...you’re doing great 🥺💗", "knitquiltsewstitch": "Feeling this! It’s especially difficult when it all piles on at once, isn’t it?", "mustangjane": "You’re REAL! much respect 💛", "tokenpoc": "💚💚💚💚", "channyboo_xo": "❤️❤️❤️", "letygonzzz": "Thank you for being vulnerable with us. It takes great courage. Sending you love and light. ❤", "babyswope": "🦋🦋🦋", "lexx_valdez": "💚 I felt all of this. Thank you for sharing where you’re at. Let’s have lunch soon? 🥭🥑 ✨", "lauraleajones": "💛", "migrantscribble": "Thank you for sharing with us and widening our frameworks of how to hold ourselves and also identify the many flaws in the art world. Sending love 🦄💐", "coralzoa": "💗💗💗💗💗💗💗", "marilynn.montano": "Love you! Thank you for sharing 💛🌻🌻", "lelymh46": "💛💛💛", "maroonedalienprincess": "💜💜💜", "theneed2know_": "🤯"}