{"aunt.gwen": "@alfalamb", "transgressivewoman": "All of this. 💜", "saylondyn": "Yesss", "brownroundboi": "👏🏽👏🏽✨💕💕", "cafecitoconpoesia": "PREACH!!!!🙌🏽🙌🏽", "djtikkamasala": "I NEVER ask this question because it’s created so many varied reactions depending on how I’ve been making my living. But NOW I ask... what inspired your life the most?", "taylorcade_": "Yes!!!", "iamivyfelicia": "🗣️🗣️🗣️🗣️", "priscadorcas": "👏🏾👏🏾👏🏾👏🏾", "hotpinkheat": "I am a hairdresser and people have flat out stopped talking to me or treat me like I’m unintelligent and ask me when I am going to get a real job. It’s fucked up to see classism and capitalism at work and what value people place on you.", "deedottiedot": "You give me so much gawd damn life. Missing you. Thank you for this!", "andnowmiguel": "This is an everyday thing in LA 🙄", "katienumi": "thanks. so true", "wrecka_doodles": "Ableism too", "lady._k": "Much respect", "schnootopia": "Amen", "brooklynmoz": "✊✨💚", "elizabethjabar": "Amen to all that! Thank you!", "melissa_y_cartier": "greaт wordѕ oғ тrυтн✔️", "cyborg_dreaming": "And there’s the “What’s your brand??? YOU GOTTA HAVE A BRAND!!!” Err, what am I? A 🐄 cow? GTFO.", "pso_earthtone_king": "When people ask me that, I say \"I'm out here\"", "disabledspice": "Oh my goodness this was so healing 🙏", "car_la1475": "I've started to lie and say I work at McDonalds. Two things happen, they leave me alone or we talk about about how service workers should be paid a livable wage or/and don't value people based on their work they do to survive. And you are right about \"transactional friendships\"<--they are the worst!", "baby_pollan": "\"I sell my labor to my bosses, and am severely underpaid so that they can have two homes.\"", "parasympatheticpapi": "👏🏽👏🏽👏🏽", "jendaneutral": "Caption !!👌👏👏👏👏👏👏👏🙌💌", "secretoceans": "Is it bad that I feel more comfortable around janitors, waiters, and laborers in general? like when I hear someone’s a janitor I’m like damn, you work hard in an environment that doesn’t appreciate you and ppl will never understand that. My dad’s a janitor and my grandparents were laborers working with their hands and idk people in white collar industries scare me."}