{"murmurshewrote": "💜💜💜", "itskatlazo\nVerified": "Verified", "quirkyrican\nVerified": "Verified", "adelinaxcruzart": "\"....because love is not a noun but a verb and none of us have ever been taught how to love.\" 😭😭😭😭😭😭😭😭😭😭😭😭😭😭", "migrantscribble": "You two are so tender. Thank you for letting us witness your love 💕", "kemikemoh": "Shout out to you @brownroundboi!💖", "sharpwhitebackground": "beautiful deep love 💞", "arte_delacruz": "So passionate and lovely 💕", "cosmicteardrops": "so beautiful ❤️", "caroliasummers": "You warm my heart with your words. What a beautiful real love you both have ❤️", "lisepie": "Wow. That was so beautiful. Thank you for sharing. I feel honored to bear witness to your love. Thank you for loving someone this much, and normalizing the gentle practice of honing language so deftly that I even though I know neither of you personally, I feel healed. Wishing you both love 💕", "deria.em": "i love y’all love ❤️", "luzdemilcolores": "😭💖 what a gorgeous tribute.", "rafaroo": "💕🌺this love is so beautiful and tender thank you for sharinggggg", "brownroundboi": "@thesoniag, thank you for naming these things & for your words, handsome + beautiful one. It's a very kind gesture -- All the work that happens with life + us. Part of the deal is you get delicious breakfast all the time, my love. ALWAYS dessert + snacks for you on saturn's return! Also, the conspiracy theory + horror watching scares me so much but I like the cuddling & laughter that happens. Please hydrate & get quiet away from work if you can. 💞 I love you. 🌸🌿💖", "_rough_puff": "💖💖💖", "fatfemme": "🖤🖤🖤🖤🖤", "robertahhood": "I love this, thank you for sharing 🌸💕", "deedottiedot": "YOU TWO!!! My heart is so so full reading this. Miss you and always enjoy your declarations of love to each other. ♥️", "likearisingphoenix": "This is so cute", "katienumi": "this is love!!! bless your love!! 💜", "k8maxs": "Ummmm hang on i thought love was a rumor", "michelle_921": "❤️", "tajalindley": "😭😍❤", "melissahereandthere": "Fucking beautiful."}