{"jasminebanks_djazzo": "@momo_tester", "atlasthepoet": "thank you for sharing!", "marilynn.montano": "Thanx you for sharing 🌻Definitely ordering this because it’s so real working on all this unpacking. 💛 Sending you lots of love in this process", "crista_inwanderland": "Reading right now and it’s HEAVY", "smendoza_tx": "@corazonyfire", "quemmegalaxy": "As an adopted person I often get angry and confused by that claims. So which past traumas I should look at? * sigh*", "doublemoonastrology": "This is a good book!! Powerful.", "lopezanette12": "@ramengirl__ we should read it together", "aunt.gwen": "@alfalamb", "tiana_webb_evans": "Love that book.", "kelsieiskool": "I’m reading this book too! 🙏", "rmndo": "Keep sharing insights with us!", "belz_yo": "I want this", "rorocs": "this is a good one 👏🏾", "patternicus": "A similar book is When the body says no by Gavor Mate. He uncovers alot of the childhood trauma that stays with you as you grow up and you don’t even realize it. Its possible that your parents’ upbringing was’t always perfect because so wasn’t theres. A great great read ❤️🌿", "juliet2libre": "@cruz2greatness", "lina_mucha": "The ebook is available on libgen for those who can’t buy the book!", "mazatl_": "YES YES YES 👑 get it girl 🌸 thank you for sharing 🌹", "vozdedani": "Hey hermanx please let me know what you're thoughts are after reading this and if you find it helpful. Been wanting to read it for a while. Love and light to you ✨💓", "frijolhumano": "I just got this book the other day! I have been trying to mentally and emotionally prepare myself to read it though because I know it’s not going to be easy", "suzy_flz": "@naseemkhakoo saw this and thought of you and your work xxx 💗", "rebeccakelly_g": "Just ordered my copy! Thanks for recommending and good to connect the other day 💛✨🙏🏾", "rgfootprint": "😢 all of these necessary words", "___oo_o_oo___": "💜", "laura_luna": "I need to get this book ASAP", "nas_sence": "Great book!", "eugeniarosa_": "👏🏼👏🏼👏🏼", "kellycambrel": "Woah this is huge!!", "holocene.scenes": "💜💯💜", "jeweltreks": "Just read this one. I learned so much.", "usernamedontmatter": "This has been on my mind for some time. Need to pick up this book. Thanks for sharing!! 💕", "katherinedullea555": "@djmkhennelz", "tinsaeteferi": "Um wow... I need this book in my life like asap", "crygender": "I have a mighty need", "aw_dre": "We had to read this in my masters program for counseling. Such a good read. Such a hard read. Such an important read. Doing the work for us and all those before us who maybe couldn’t, didn’t know they needed it, etc. Be as gentle with yourself as possible as you explore this very heavy heavy work. ❤️", "instaconcon": "I’m also reading this book right now!!!", "rosy.sunshine": "Whoa. So in alignment with what I just wrote! Must get this book.", "jodi_marie__": "@angbmix", "realesttheorist": "sorry for the weird comment, but I’m a huge fan of your hands@", "poppyrepublic": "💕💕💕 the body keeps the score, another good one. So proud of you Sonia and all the self healing work you're doing!", "sagrado.space": "Needed to read this today. Thank you.", "e_lopez_e": "Great read! 🙌🏽💖"}