{"ann.lew.is": "💛", "artofselflove": "✨", "curvily": "❤️❤️❤️", "votelikeamother": "♥️", "ms_rmz": "Oh The truth in these words!!! Gracias hermana!!", "theykeepbees": "Living single swoon", "tay.lavonne": "I appreciate you! And I needed this today. Thank you. 💖", "linapuertaart": "❤️", "ames_bk": "❤️❤️❤️", "inner_shift": "🙏🏽💜🌹🌹🌹🌹🌹", "kidnapsnap": "💕💕💕", "mulz.13": "Thank you", "petashlove": "❤️❤️", "basicbrassica": "Needed this today 🖤", "cruz3skate": "@brujita_de_la_luna 💘", "tobyfromtheblock": "❤️❤️❤️❤️ keep going", "writenowladybug": "Thank you for sharing, your wise words help me feel less embarrassed and more willing to communicate self compassion instead of pushing myself beyond my limits. Sending so much love!", "ratchetaffirmations": "Amen 🙏🏾", "mmemilkweed": "this resonates with me so deep. thank you for helping folks feel less alone. ♥️", "motivatedmandy": "I love this so much", "themommyteacher123": "I have all three I get it", "ldf725": "Self compassion is the ultimate healer. A sudden loss of a loved one can change your perception of reality. It test your faith, your choices, your will, your self awareness. It pushes you into this web of darkness you cannot breathe. You cry a cry that you have never heard. It comes out of you as pain. Pain in sound waves. In those moments you have to be willing to let it take you. Your pain has to take you where you want it. When it is over you can rise again.", "sucmyvick": "Just ride it is the best advice ✨", "mujeresdelsol": "🌀🌿", "loverays1": "🙏🏼", "toochvnky": "Needed 🍃💚", "msife1": "🙌🏽🙌🏽🙌🏽🙌🏽 the last 2 weeks...", "rochellefatleopard": "🙌🏿🙌🏿🙌🏿 thank you for these true words xx💕", "salud_mentalhealth": "💙💙", "traumaandco": "Thank you for this. Am i ok to share this? 💜", "katienumi": "👏🏾 this is so important💚 healing to you. to all us who struggle", "fatherphilavane": "that’s real", "celinecelines\nVerified": "Verified", "la_incensurable": "Gracias por esto", "brushfirepress": "💖 raw truth", "hellabreezy": "Thank you sis, I really needed this today! Sending you a huge hug! 🤗", "cch1qu1taa": "Thank you 💛", "jalebijaanu": "Thank you for your words . 💕 and a scale with chosen fam is such a good idea! I am going to try this", "gearedsnail": "🗣I’ve been trying to find ways to word this. TY💛", "niccibriann": "🤲🏽💜", "karenlouriana": "Appreciate you for voicing this. I struggle to describe my own situation, but knowing I’m not alone is reassuring."}