{"asa.martian": "Loveee this", "kingtexas": "”my name is my name” 💪🏿🖤", "xitlalic": "Yaaassssss!!!! Omg yessss!!!!", "godmother213": "I love her. Dearly. Did you know she had cops called on her when she won one of her prestigious awards? They thought her check (prize money ) was fake.!", "inner_shift": "🙌🏽💜🔥making everyone say my full name the way it was meant to be said..", "vassilisakapila": "i love her seriousness and her folly. we can do with a bit more of her fine tempered steel these days.", "jesssolomazing": "SincErEly.", "ande24": "✨👏🏽✨👏🏽✨👏🏽✨", "masc_sof.t": "RUN ME MY THREE E’S", "mujer_arbol": "🙌🏽", "ebonynoellegolden": "Actual facts! Know how it’s written and spoken... #respect", "nikkilaes": "WORD! it’s pisses me off so much when someone introduces their non-Anglicized name and then the other person responses with , “I’ll just call you Z “ . How ignorant and rude.", "xikibeiibi": "Are u the library?! I read Radio Imagination which is like a collection of Octavias notes at the Huntington library, I've been wanting to go check them out", "loveyrockets": "I’ve been thinking for a long time about pronouncing my name correctly (in Spanish) when I introduce myself to people, but i always get what? Catalina? Nooo, CaRoleeena. It’s tiring. I end up Americanizing the pronounciation to make it easier for gringos. Kinda sucks, but it’s easier. But I still dream. One day I won’t be so tired and I’ll do it. Appreciate you.", "iamivyfelicia": "@shuggarcubes", "mytheory": "PALABRA.", "sunnydaejones_": "Not with the E in sincerely capitalized! JESUS.", "sistermereychaos": "Feeling this so deeply. Our names are not negotiable!!", "teleportprince": "✨🖤🌹yes!!", "jslyyyn": "LOVE THID", "ashleydelara": "🙌🏾👏🏾", "elpequenothefirst": "💯💯💯✨✨🔥", "jayeesha": "I am so sick of correcting the same people OVER and OVER again on how to pronounce my name... and people have the fucking audacity (ALL THE TIME) to be like “but it’s spelled Jayeesha”.... uhmmmm yeaaahh i know you dumbass it’s not phonetic and it’s pronounced JOY-i-sha — it’s been a battle for last 4 years since I decided to demand people pronounce my name correctly — including myself tbh, because I allowed it to be Americanized for 35 years. The constant mispronunciation is most rampant with movement people too, my “regular” “normal” friends have all picked it up. HELLA disrespectful and I am so sick of it. <<rant over, thank you for listening, if you’re someone who knows me and pronounced my name phonetically please stop >>", "br00ksie": "Love ittt", "yadiluvslife": "I LOVE THIS!!!! Thank you", "nyricaninla": "I've been thinking a lot about this lately as I have noted in my classes right now how often white people misspell the names of Black authors and other people of color authors.", "johndiazcortes": "🙏🏼"}