{"jessxsnow": "I hope this move yields beautiful possibilities for your gorgeous heart and art", "sizzle007": "😭❤️🌹🌹🌹 we’ll help fill your new home with new plantitas and find new adventures and food places to make more memories in the west coast ❤️🌱 I’ll bring my cat over and a boom box with a bodega playlist when you’re feeling homesick, @juliosalgado83 and @allboutnormz can help with the noise 😬😅😂❤️ You have people who love and care for you coast to coast ❤️ YOU GOT THIS 🌱", "morrissonando": "Ill bring a chopped cheese and platanitos for you on my next west coast trip ❤️", "joshuaobawole": "❤️❤️❤️❤️❤️❤️ Congratulations on your transition and taking the steps you need for the next phase in your life. I know move such a long distance can be a CHALLENGE, but I believe in you & im proud of you ❤️", "scam": "💚💚💚", "dhaggag": "I love you! I love you! I love you! And, @sharpwhitebackground 😍 looking like a whole dream!", "lamarichola": "Since moving to LA, I love and miss NYC more. At least it's sunny here sometimes", "coco.dyke": "Sending blessings y ofrendas your way. You will be in my thoughts and wishing your the sweetest and gentlest journey oeste 💙💙💙", "haylee_pacheco": "I love how you strong are and this world needs more people like you. Thank you for being so amazing💕", "mustbelizdnttrip": "So excited for your new journey Sonia! I hope we can make Grand Canyon happen this Summer ❤️", "brujamagiq": "Buena suerte...❤️", "solanachehtman": "Todo lo mejor! Que sea con felicidad! ✨", "dalia_pajarita": "Felicidades and wishing you all the best in the next chapter! Beautiful writing about home and moves💜", "pamelacouncil": "Here’s to an easeful move for you!!", "rorocs": "💥💥💥", "rosewillberosey": "Lovely writing! Sending blessings of love and inspiration on your new journey! How exciting!💕😇", "ty_ushka": "Love you friend!! Glad you are taking care of yourself. I’ll see you on the west coast xoxo @thesoniag"}