{"zinagoes": "Thank you", "escobarcomics": "🖤 Yes", "reaapuri": "Ouf. So real. Thank you for speaking truth. ❤️", "la_chucha": "💯", "artmummu": "Heard. 💔💛 Hope others listen well to this very important take of yours—and respect migrant and marginalized communities. Respect these families—uplifting and supporting and advocating sensitively and with the utmost consideration and compassion. Though a mom myself, I still can’t imagine the devastating impact of seeing photos from a personal tragedy like this shared in this way. And for all my own horror and rage over such heartbreaking news... of course there is still no way a non immigrant, white, non marginalized (other than for my gender) person such as myself can ever fully comprehend the range of emotions direct relations and community members must feel!! No possible way. My heart goes out to all dealing with the extra rage and heartache and sorrow you and others in your community must be experiencing. As much as I can understand though—I feel this. Working towards better. Best.", "analaurabuendia": "Thank you for speaking out. I’m undocumented and when I saw that I froze..just emotionally blunting cuz it’s overwhelming and traumatic. So thank you for saying what I couldn’t get across. They’re human beings who led full lives and shouldn’t be reduced down to this.", "fibrefem": "Thank you for writing this! I haven’t been able to come up with the right way to express my feelings about the horror and disrespect of this.", "culoebra": "I haven’t even seen the pictures but this makes me so fucking angry.", "farrahfang": "Wow", "heartovercrown": "This has been HEAVY on me. I had to step away from soc media. 💯", "vamosqueda": "Im with you with this rage. I cannot believe we have to explain maintaining people’s humanity.", "isolatedpapi3000": "I do not know why anyone would think to share that photo. I couldn’t even look at it. I’m glad you posted this. Abrazos, Sonia.", "oliviarodriguezv": "Yes!! Thank you! 💔 can I share this?", "mlimongarza": "Amen!", "daize_310": "👏🏽👏🏽👏🏽👏🏽 my thoughts exactly", "preciousthyme": "this is unacceptable . Those are people. Loved people seeking better. It is truly disgraceful to see these images....", "st3phmarie": "Beautiful words. I shared.", "bri.positive": "Exactly like imagine if it was your family’s bodies exposed and publicized like that. But that’s the thing even in itself isn’t it...you shouldn’t have to think of it as your family to see the problem with these pictures. People should just know. It’s a perfect example of the depersonalization of POC and foreign POC in our society. All I know is I’m tired of seeing dead children on my timeline. Their stories matter but these pictures are just crude.", "adonag": "It is an interesting conversation to have. Personally, I think this images are what brings people's attention to the issue. When I first got to the US I was very concerned about how little people knew about many issues and situations around the world. Maybe because I grew up in a country that was at internal war, and I was constantly praying to never get desensitized to the value of human lives because we were constantly bombarded with news about bombs, attacks, killings kidnappings... and the list goes on an on. This photo reflects the reality many people live in a daily basis, but people in North America don't seen to understand that others realities can be even worse than dying while crossing the border. So, I am conflicted. As i feel this can educate people and show the reality many are still not seen, I too see and feel your point", "thicccgemini": "I fucking hear you", "shilo_carr": "THANK YOU", "dardarpinks": "👏🏾👏🏾👏🏾", "madelines_mantras": "Thank you for saying this. It is beyond disrespectful to share such a horrific photo, as if any person on earth would want to be remembered that way. Human beings being beaten and killed should never be a social media “trend”. I almost feel like people do it to say “look, I care”, not thinking twice about their own lack of empathy...", "latinaperoamerican": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 The disrespect, I couldn’t even open the article them picture was painful enough😞", "frisly": "Deadass that shit makes me throw up", "jessica_di.gregorio": "Thank you. This is so important. ♥️"}