{"mayreet": "electric heating pad!", "emofemme": "Mine are the fucking worst too... I usually have to force myself to sleep in pain in hopes that when I wake up the pain will have subsided. I've used cramp bark in the past and it worked. It was just so gross. I also get bad nauseous with cramps because of the pain so I can't stomach shit that tastes bad. Dogs are always great heating pads too :) if anything ever works better for me I'll gladly share with you. 💖", "topimorita": "Red raspberry leaf and lavender tea helps to ease the pain 💖", "tesfayetra": "Herbs have really helped me. Red clover with red rasberry leaf tea- and ✨CRAMPBARK. ✨", "l_arely": "Not scare anyone, but sometimes really painful periods aren’t normal. Like, if you’re passing out from pain painful. I have endometriosis and it took forever to finally figure out why I had other issues wrong with my health, which then circled back to why my periods were so painful.", "itskinny": "If you drink ginger tea or ginger water before your period come and the pain goes away. Pomada de arnica works too. Rice heating pad.", "dehnny8": "@whoopiandmaya products!", "krystinamiranda": "Diva cup (takes away discomfort from tampons and pads) and cinnamon tea made from boiling water poured over whole cinnamon. Cinnamon tea all day everyday!!! Helps blood flow and reduces swelling.", "breenache": "I get lower back pains during my moon, so I get the hot-cold pads for that.", "wildbirdmagik": "Yes to plantita support and medicine! Also when ur in the bay on ur moon, book a moxa treatment ♡🎇 or just in the bay lol. Depending on other things, u may want to do steams in the days b4 ur cycled release-we can talk if u want ♡", "honeyblonde87": "Sage tea helps me sometimes.", "a.l.major": "1) You look fabulous in that outfit. 2) I cut out a lot of sugar. I find the days before my period if I eat a lot of sugar, cramps are usually bad. 3) I don’t fuck around with pills lol", "lakshmiintheworld": "Oh yeah also our friend the orgasm", "lgbtqsonoma": "So cute! Hella fuerte!"}