{"aviation_spin": "So you promoting feminism by showing your half boobs and underarm hairs wooowwwww,. I cann't see anything about geneder equality & equal rights. You just irritate me and some other people who is in a stable mental state and have the ability to discriminate b/w right and wrong. Showing clevage, booty, underarm hair doesn't make you a feminist.....and you're not a feminist.", "arjun.chauhan_13": "staking nhi hota uncle ji", "thateyeiswatchinu": "😷😷😷😷😷😷😷😷😷😷😷😷😷😷😷😷😷😷😷", "dishant_nayak": "What's feminism in this picture? Does keeping half boobs out do any good for the society? Feminism is when women are responsible for any welfare in the society or let it be family.", "mayeda.chikan": "i luv it totally❤️", "silpamandalmimimandal": "😠", "sanity_is_overrated": "@nikktiwarii", "rajputketankelgandre": "🔥🔥🔥", "deepu_xx_05": "@crave_on_my_vibes ready the caption 🔥🔥 just I like to share so and I m waiting for ur reply I have msg u many time 🔥🔥💞💞🙈🙈", "devindersinghdutta": "Sensual 🔥🔥🔥👌", "megha_chathurvedi": "What the fuck are you trying to inject to the people.and what the fuck was that \"your body,your rules\" concept.may be the body is your and the rules are yours but the society you are living is not just only yours.it was built by us all.you cannot post all this naked pictures just because you are on a digital platform.Have some sense you moron @redheadwayfarer", "sahriarshanjid": "😍😍😍😍😍😍", "gokbely": "Waw!🔥armpits👏", "prashantlade4": "😙🔥😙", "masoommanjrot": "@chadhaonkar", "sanketkasbe7": "❤️", "mimi_guchait": "❤️❤️❤️", "alive.so.far": "Well said buddy!💙 As usual, your words just inspire!", "arilegent": "Awesome 🔥🔥", "glamourpersonified": "🥰", "tamara_reddy_911": "Very hot underboobs baby. What would it take to suck on those juicy tits of yours ? I will cum all over them n make sure you drink my hot load too deep in your mouth. @redheadwayfarer", "akshataa_a": "You are the cutest lil thing ever.", "_jaahnviinegii_": "Lol look at all the triggered men proving her point🤡", "triad_modelling": "Hope to see you on Pornhub some day", "arleen_yp": "I don't know what to say ! As I'm a fan of yours, I would like to express something ...you are simply awesome. Don't let any people's words into your heart 💓 , your heart is more precious girl ! ..that you are expressing your whole thoughts and powers in front of the world. God bless you 😇", "sukhwinder4113": "Omg my sweetheart😘😘", "wewealqadi": "Lovely 💋❤️💋😘😋", "arjun_reddy777777": "Hey randi @redheadwayfarer", "bloodstreampoetry": "Wow", "nexahex2": "Sab kich bhi dikhaogi for bhi i love modiji. Best PM to the world 🙌", "georgiraz": "Goddam girl! Keep dropping truth bombs!! Know that you voice travels all the way to Greece! I hear you 🙏 @redheadwayfarer", "karan23thkr": "Why you count all men's in same category ? What's the matter with you ? Do you think your boyfriend is very loyal and the only man on Earth who don't think negative about women's ? Every time I see your post you are bullying mens. Not all are same, how many men's you meet so far in your life ? If men's are bad then problem also lies within you.", "_priyankasennnn_": "I was always told by my family members or anybody that be a woman or else you won't be happy with your married life. Your husband will hate you and your mother-in-law will cuss you. Learn the art of pleasing man. ... No one ever told me there will be a man who will think about how to please you. Who won't tell you what your body looks like or how you should be on bed. I hope this stops asap because it is terrific because I'm just a 20 year old trying to figure out to do with my life goals and I don't have enough time to sit and think about what can make a an ideal woman...... Your words just sting to my heart and I cried today after reading this. I was depressed since two days trying to figure out what really happened ate they right and I am wrong? Should I just be an ideal woman? How does it looks like what do they do? Thanks to you I got my answer today. ❤❤ I hope you never stop writting so I never stop getting inspired.", "illustration_420": "You make me believe in myself & gimme the strength", "rahul_yadav6320": "Sexy🔥🔥", "jix_love": "Underarms ke liye Gillette Ka razor bheju kya...lawdi", "redefined_vision": "🙌 respect #speakoutloud", "parth_sk_tank": "Black and white looks lit🔥", "richa__the__wanderer": "She is like corona virus...contagious..spreading darkness everywhere", "boymorgan2k": "Loving dat underboob view of ur yummmmmmmm assets...mouthwatering really 🤤🤤", "blurred.ramblings": "No uterus, no opinion;)", "yushi_xoxo": "Pseudo feminism🤣", "tanisha.mahanta": "The World needs more women like you❤️ so apt,", "ckt.themoderncaveman": "Oh that caption I read. I couldn't control my laughter😜", "diru_twipura": "🖕 selling", "a_random_meaning_": "Damn that's awesome! 🔥 The caption, and you. 🙌", "_trend_feed_": "Roses are 🌹 red Violets are blue Covid cancelling everything Except my feelings for you", "saimahesh89": "😘😘", "himvnshi": "I’ve seen too many uneducated “feminists” on Instagram, with their fake mantras that promotes only “modern women” with no traits of femininity. And I cannot stress enough how much they make me bite my tongue in angst. But seeing you, it’s exhilarating. I’m always uplifted by your words. You don’t promote the “thought” of feminism but teach the meaning of it everyday. You are an outstanding writer and an even better advocate for the oppressed. always inspired by you. ❤️", "loves_like_medusa": "👏🏽👏🏽👏🏽👏🏽👏🏽 Well done.", "sancha_sancha": "Bwossss!!! Love you girl 💛", "yogesh_onmove": "Solid Beauty", "ntik_ankit": "Sex Towards Trance ...Phoolo ki Sundarta niharne k liye h todne k liye nhi...😍👏🙌", "iamagastya": "What is.....😯", "9654manish": "Can you please remove your underarms hair", "yvishal8626": "gorgeous🔥🔥🔥🔥🔥", "vipulchandel": "@redheadwayfarer : Which book? You look bomb 😍", "shaiktaufiq66": "☝👌👏🙏", "matt_murdock11": "Nic Pic", "im_anviksha": "Weirdly enough of all the other things sexuality has become the flag bearer of feminism suddenly. 🤦‍♀️ there are so many imp issues we need to address in this country as part of feminism.. this really lags in the list if i were to start. But anyway🙄", "i_vicky__________m": "Oooooho fuck🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😘😘😍😍", "moumita_pakira": "The caption is so damn true", "denial898": "Mast bable hai yaar😋😋😋, iska dood peene Maza aayega", "scrapbharat": "Abnormal corona", "843rajat": "💗💗💗😍", "vaishhh.__": "@redheadwayfarer exactly how about boys showing dicks😂 I barely see any boys showing their ass and dick. we have soo many body parts to flaunt then why only boobs, nipples, ass coz somewhere you know it its attractive according to biology too! And you can show your cleavages half boobs too but now Hiding a nipple is also a big deal for you? Well why don't you walk nude?", "pdrxaintav": "h🔥t🍷", "ananyabhattt": "💕💕", "thomey_raja": "Allah maag karay.. Corona virus ll nt leave india", "lalit.prajapatii": "Bobbs Dikhana jaruri kya?? 🙌", "myaccformemes": "How does me fapping to your pics make u feel? Just wonderin.", "ankita.mishra04": "More power to you 🔥 I love how beautifully you have phrased thoughts every women in India struggles with! Thank you and what a caption ♥️😘", "superna_saxena143": "Ladke to sab chakke ho gye hai inse kuch nahi hoga ab 😂", "nishitha.queeny": "Superwoman❤", "bharpur_matra_mai": "Beautiful hairs...i really love your...hairstyle...its so cool..🤘", "m.ramsheed83": "Beautiful.......", "tanvirawal": "😍😍", "khaled_alkilanee": "❤️", "bhaveshgorad7774": "Always hot🔥and sexy😍 and cute😘 @redheadwayfarer", "_smarty_anuj": "Nyc", "dharchula123": "Super", "aaliyajha862": "Sexy boobs", "abhijeet__mahapatra": "Kindly wax your armpit if possible if u feel comfortable just a suggestion", "hyacinthzia": "👏🏻👏🏻👏🏻", "aditijaiswal96": "@redheadwayfarer where can I find your book ?? Love the fiercely opinionated writing!!!!!😍", "thehumblepahadi": "💜", "thakur_saahab_7": "Abe yar ye pagal wagal hai kya ?? Har photo post isiliye krti hai aaj feminism ko promote krungi. .. arey behen /didi /. Amma /aunty tujhe jo karna hai kar ... Koi ladka tere ko kuch nahi bolega.... Lekin meri bhi baat dhyan se sunn jo ladka bolta hai ki \"dhang ke kapde pehno\" wo ladka nazar faad faad ke ghurne walo se to behtar hi hai ..... Aur ye seekh meri maa ne hi di hai ... Haa kiya cheating apun ab jaa jo ukhaadna hai ukhaad le .... Sbse gandi soch hai tmari ... Kapde hi mat pehno bc .. ghuno nanghi ... Hmko kya 😊", "kristel_8368": "Ooh mam❤️❤️❤️y❤you always rock..........and yess you are very powerful lady ever😊😊😊😊😊😊", "ssubashi_": "Love you for being \"you\"❤️ Your words always inspires me:')", "dabeye": "wow, i love you, and your work. thank you.💗", "rashika_sachan": "To all of you telling her that she is someone who believes in pseudo feminism. Trust me people you must go and learn what pseudo feminism is?? But leme simplify for you “Pseudo-feminism is saying women deserve more respect, or that people of other genders deserve no respect. But unfortunately I don’t see that neither in her caption nor in her photos. Okay okay it’s as simple as it sounds “if you sexiest her, she will feminist you. And we got a gender and we choose to be feminist . @redheadwayfarer we need HUMAN(playing safe) like you because until the day, they will try to tag you,she,her or anyone till the day we need feminism or feminist. Long way to go girl. #celebrateyourself #nipplefreeworld @bindiia you did a fabulous job. And i am proud of her and obviously you ❤️", "clutch__god97": "Chill bro", "wpnil6384": "Why you show your boobs every time next time please show your Ass /pussy", "supriyata_._": "You are incredible ❤️❤️❤️❤️", "anshuarya29": "🔥🔥 it's JAWDROPPING🔥🔥", "saltybuttercup": "Juss wow♥️", "pranavchandranofficial\nVerified": "Verified", "shah13amit": "👌", "vibha_nayal": "💗", "_neo_official_neo_": "💯💯💯", "navin_pandey13": "Ohh my god . You are hot", "the.vibgyor": "More power to you Lady!!! 🔥🔥", "shweta1746": "💓💓💓💓🔥", "_.power_of_words._": "Day 16...being an entitled woman \"lod*aa lassaan krungi me..nudity dikhake woman empowerment ka dhong krungi..* day 27 ho ya day80 hmko ghnta Fark ni pdta..Some mother's actually raise their children to be a gentleman..sab rapist nhi Hote.. behen itna empower krne ka shok h to PM relief fund me donate krdo😡😡 @redheadwayfarer", "walimbearvind": "Cheap publicity", "m_a_.n._y_a": "More power to you😍❤️", "akimomomomoz": "Where can i see your nudes? 🤭", "salonikababerwal": "Amazing words⚡", "namyaa_": "🙌🏻🙌🏻🙌🏻", "yuktaasharma": "Power. Immense power is what you give us through your work. Can't thank you enough for that.🔥@redheadwayfarer", "humandamu7777": "😘😘😘😘😘", "yash.dhona": "Very well articulated thoughts, always. Killing it, Saloni Chopra. Really. :D", "mr.gourav.rtr": "We're going on t to.mkjjjjvghhzc", "ravithakur6496": "Stay well and blessed ever innocent", "_.iamsarath._": "Wow", "lalitksw": "❣️", "im_yug_005": "Its hot🔥🔥🔥🔥🔥🔥", "charmingly10": "I NEED TO READ THIS BOOK ASAP ITS GOING MAKE MY TIME!!🙌", "muskan_bhat": "i really really like you ❤️ u r amazing", "siddharth221080": "Its more sensual when its hairy 😘 In love with that 😘", "januhairy": "❤️", "1geetvikram1": "Sab ek jaisey nhi hote whoever u r this is depend on ur thinking that force u to think like that nd what do want to prove to anyone about gender equality to post these typ of pics nd 1000 words of lines against men.... I am a soldier a men i respect women i respect every human being... And if u have any fan following so that plz tell him about the problem which world suffer nd jitna time is pic ko edit krne mai lgaya hai plzz kisi gareeb ko khana khil do 🙏", "live_life_nh84": "💦", "parvathysreenath": "I can be sexy and sexual. I dont need another persons word on it. Neither do i need validation. Slut shaming a woman who talks about her sexuality should not be a trend. Come on, we are educated right? This is a free world.", "thecrazywomansays": "Are also always confused between which one to choose? B&w or colorful.. because I'm always!", "makeupbysupriaarora": "All that in the content is super organic , the difference is just the perspective and equality is still strayed and I hope for a better living experience ! It's always good to read your write-up's @redheadwayfarer", "basic__studxd": "هذا تافه تتباهى جسدها الكثير. يجب أن خبطت من قبل بي بي سي", "iamnatashachandra": "You are beautiful and I am so happy to see far more positive comments on it than negative and creepy ones. We girls gotta stick together. Love and admiration.❤️💖❤️", "thetatatop\nVerified": "Verified", "i_m_abhijeetavi": "hot", "its_shalinicious": "@aichgayatri", "_cryptic.mellow_": "@redheadwayfarer never fought for myself so much Ma’am the amount I fought for you. Their pathetic mentalities are the reason why girls are reluctant to come out of their shells. You’re inspiring, love you🖤", "srshan24": "What you have to say about Neha dhupiya is that a feminism.?", "md_imtiaz_hussain786": "Beautiful❤️❤️❤️❤️", "shrushti_2001": "❤️❤️✨", "mayochauhan": "What a powerful message❤️❤️ and the way describe it. Loveee❤️", "saivandana_b": "Can u release an ebook please we need it during quarantine", "beingsalmankhan.offcl": "👌", "akritijaiswal27": "👏👏🙌🙌", "eshwarya_": "🥳🥳🥳", "caldeh": "B&W is 🔥🔥👏📸", "dr__thuganomics__": "@deepakkuppilli arey entraa idhiii", "meha_diaries": "👏👏", "swetakum_": "❤️❤️🔥", "kevinroldent": "Dear sisters out. there... please please try to understand this woman. is trying to provoke the feminism in you... this country ensures equality among all .. and the case of rape is due to some anti social people out there.... there is no sence in what she is doing or posting... she keeps on posting semi naked pictures so men will blame her and woman will fight for her against men... she should be reported and blocked...", "bhondwepradeep23": "Wow so delicious", "bshsabajna": "Pura dikhao", "karan61995": "Ye bhi utarde", "joeytribbiani.jr": "How do I convince my mom to let me wear whatever I want? How do I change her opinions?", "__.rosaayy.xx._": "You are beautiful gurl❤️", "nikita_chaudhary98": "❤️", "guri_singh_04": "😍", "arjun_pratap": "❤️", "panda.avp.8": "Pseudo feminist 😂. Highlighting points that were suppose to be stated as taboo in the early 70's or something. Stop dealing with fuck boi's and date people who respect you.", "hastag_bunny007": "How feminist 😍😍😍❤️", "akshu_zen": "When is the book gona be published..? I'm waiting.. 💗💗", "me_the_nefelibata_": "@krupa_srinivas @varshachavaan @sushie_mushie ♥️♥️♥️♥️♥️", "ani_meena": "You put words to all those feelings going on in millions of women's mind.you are such a love,inspiration,brave", "upontheabyss": "I can't wait for your book to come out.", "moinak.roy": "Can we be friends", "kartiksamaga": "❤️", "s.u.m.a.n_m.a.h.a.t.o": "🔥🔥🔥🔥Osom", "intellectsofinternet": "Arey bc kbhi toh ye nudity is empowerment se bahar aaja", "ambaninagmani": "Mam dikh Raha hai.aur uthao", "boorsesamuelofficial": "Cover your body so I m gonna respect at this moment", "jassi4840": "I miss you", "_norwester": "I really really badly wanna read this book. When is it coming out?", "sunilku21": "Little bit more up your hand", "bluvish7": "@raghavmeattle thought it was you for a sec.!", "sonaleegedam": "More power to you my girl😘😘😘", "chauhan_09876": "@milind_kain", "usernamechangedthrice": "YOU ARE A MALE IN FEMALE CADAVER", "amisha_mani": "@shwetanidhi_23", "a_bookish_wanderer": "The b/w one is so aesthetic 😍", "bazeelabhat_": "👏🏻", "__eclipse005___": "You are the most amazing social media activist I have ever seen! Y", "reeni_yadav": "👏👏", "_silverspoon_badass_": "curls", "_divya_jami_": "So damn true🔥🔥", "aaryansha.sinha": "Eagerly waiting for your book. I can feel these caption. I'm an artist. My friends and relatives avoid me if I draw half naked women.", "hetvi_alina": "One male professor in my coaching classes shames all girls if they wear short clothes by saying that it's unprofessional and that we lose our dignity by doing so... I was thrown out of my class for wearing shorts... But the male students are allowed to attend lectures irrespective of what they wear... What should I do? Do u think Filing a complaint would work?", "jagritijhaaa": "My sister spent a year in Brazil on a student's exchange program. On coming back she told me about the things that make Brazil different than India. She told me there are basically no rapes in Brazil. Her host family and brazilian friends were very intrigued and couldn't understand how Rape exists in India and to the level it is. They just couldn't understand it. My sister also made another observation about how there is complete gender equality in Brazil and no gender is looked down upon. People have a lot of sex and also respect consent and it's just THAT SIMPLE. It's so sad how the men here would just never get it, no man wants to be at a place where his privilege is in question.", "ias1813": "🖤", "twerking.bird": "Please do the blind folded couple challenge 😍", "savvviiiiiii": "U are amazing...I admire uh alot❤️", "rude9024": "Xvideos mein job ke liye kyu nahi apply kar deti 😂", "arpita_rathod": "The problem with gender is that it prescribes how we should be rather than recognizing how we are. Quoting Chimamanda Ngozi Adichie", "ifahimm": "Yaak!!! Ugly", "svnaidu": "😍", "jagjeet_soni_": "Looking Hot 🔥😘", "faheemba2648": "Looking very#hot🔥", "choudhary_arpit_sharawat": "u are absolutely right.....u are doing notjing wrong ...keep it up... but next time do some fully nude pose...we will appreciate it more", "singh_ravi00": "You are so amazing 😘 😍😍😍😉😍👌😍😍", "ririlion152798": "I absolutely love how strong n inspiring u are! Honestly it's all about upbringing!! N in dat home n school plays MAJOR role!! Sex education, consent, gender equality etc etc these r some things which are necessary to b taught in school as well as at home!! Teaching equality in schools bt son r asked to sit wid father where as daughters r asked to help mum in d kitchen, learn cooking, cleaning etc bt are not allowed to sit wid father juz like dat at home, this destroys d whole purpose of teaching gender equality! I have seen highly educated ppl lacking basic idea of equality n being misogynist n according to them dey r perfect coz dats wt dey've been taught n seen at home 🤦🏻‍♀️", "iamnehabisht": "Well said!!", "iam_akshat_": "Superb", "madhushreee": "❤️❤️❤️❤️", "nap_god_dess": "💖💖💖", "rabini_abraham": "Woah❤️❤️", "nikkami_sarkar": "I love your brain sm", "soham_awate": "caption is lit af 🔥 can u say which book?", "pradumnya98": "Nikal hi do...Fashion chal raha he vaise bhi", "lookadonut": "❤️❤️", "sishmita": "@girdhar.sristi read madam☺️", "sagar789minati": "@sumitkurhade 😍", "anikate_monish": "Looking gorgeous 😍", "_peanut03d_": "You know what saloni, i am not at all comfortable showing so much skin of mine, but your photos make me happy coz you own your body completely and you are well above society's judgment. But see, that's the point, it's sad to see few women condemning other ladies who are frontal with their thoughts. It's high time we accept that if I don't want to show my thighs, that's my choice, I like it that way...if you were black lipstick, that's your definition of bea", "fahmida.dipa": "This s not women power. Sorry to say...👎", "ankitsharma8923": "❤️❤️", "skylightlion": "Does the tree behind produce oranges by any chance?", "itsme_nirajmishra": "👙💋😍❤️🔥", "pandit_anvita": "💯💯", "dilipacharya111": "🔥🔥🔥🔥🔥🔥😘😘😘😘😘😘😘😘😘", "surdoll": "Beautifull 😊", "vrinda___aggarwal": "so true and felt so peaceful after reading it..", "soniya_kajale": "So so damn true💯", "prakash_12_96": "😑", "bunny_ron": "@redheadwayfarer i strongly recommend u to just c the comment of this particular guy @patel_aamir619 on ur post and this guy is a fashin model by d way and has 12.5 k followers and this is his thinki g and this is what he will inspire other 12 k people on insta to do . @patel_aamir619 she is talking about how some morons visually fuck girls and u just showed us the example how it is done . What a shameless human being u r u r the people who actually give a push to rape culture also. Just thinking before commenting of any Women's post that u are also born from a woman and she will b ashamed of u what u have just typed over here yhe thing that u r saying sexy over here is the same from where ur mom used to feed u in ur childhood Grow up boy #Fashion Model being one from the same industry not respecting one of ur industry artist shame on u", "jain.divya85": "This is so amazing❤❤", "aromance_3695": "You're a bold inspiring goddess and I cannot wait for your book.Please tell me when will it come out ? 😍", "aayushkumaryadav": "😍🔥🔥", "en_em04": "🤍🤍🤍", "hariom_rajpoot_336": "are didi.. kya krna chahte ho🤢🤢", "pranaysd3": "#attraction #goodtohavefeeling #selfbelieve #bearealmen", "nisha_370": "love love love😘😘😘", "duttasibayan": "1) We live in a country where if u made a film with slangs for the sake of it the film get a straight A also censor board implements a lot of rules on that, meanwhile you made a film with some sexist comments or PJs or an item song out of nowhere just for cheap entertainment tickling that shitty sexist side of ours u slip past", "_aroojachakraborty": "Dang! You beautiful woman this was so deep. @redheadwayfarer", "mylifebasically": "👏🏼🥺", "nutkracker_": "@whos_your_daddy_97 😂 she's legit beta 😂😂Ladies and gentlemen here's your winner by TKO @redheadwayfarer 💜🤗🔥", "sadikbee": "the way i love you !!", "cherubgloss": "i think ill b reading ur book", "__.okbabe": "I'm in love with this picture 😍💕", "sitharamv": "Love ❤️", "fuukra": "😍😍😍", "hatitaaa.matataaa": "🔥🔥🔥🔥", "iam.bilalashraf": "Hawttttt🔥🔥🔥", "s_a_w_r_a_v": "Shoutout to @redheadwayfarer saloni chopra.. she is❤", "mansi_ghangas": "Caption ♥️", "amitaggarwal8": "U should give sex education.....", "profilo_maker": "You're trueeeee inspiration✨", "etishakohli": "y babes such a pic ?", "sadiaology": "Damn your caption 🔥❤️", "beast____2000": "💦💦💦💦💦💦💦💦💦💦💦", "nit2254": "Very good", "merin_mariya": "More power, more love ❤️", "isolatedsoul1983": "Saloni tere jaisi ladkiya chahiye hmari society mein. +ve thinking waali. Aise hi rhnA", "maverick_luck": "🔥🔥🔥🔥", "thesameeroberoi": "🔥", "khushiansari17": "💯💯💯💯", "buttercupismad": "Brave!!! 💚🙌🔥", "vineetha_paradkar": "gold♥️", "puns_and_pizza": "The world needs more women like you. ❤️❤️", "vishalrathore13": "So beautiful looking sexy💋", "payalnimwal": "🔥🔥🔥😍❤️", "sarwagyaaa": "💋💋😍😍😍😘😘😘😘😘ur amazing person", "lawyer_dreamer_": "You put words to all those feelings going on in millions of women’s mind . Hats off to you🙏 love you 😘😘❤️", "manasgaba2794": "Gorgeous you 👌👌", "travelshareninspire": "So damn true. I wish me could understand this thing that no you are not privileged. You can't stare a women like this, you just can't go out and grope some women and rape her. You don't owe anyone", "ab_aamir619": "Sexy boobs", "true_e__": "The relief yu deliver and respect yu earn.👩‍❤️‍ yu hav my heart lady👩‍❤️‍", "queen_of_monsters_nidhi": "Omg soooo elegant n pretty 🔥❣️", "piinkykotwal": "Just wow❤️❤️ ur pictures always seems very connected yrrrr", "kat.says.no": "Now that’s some truth on this Sunday 🔥", "keshuchetry": "🔥🔥", "dharaa_13": "Ohhh God!! You have put my thoughts into words so beautifully. Also, can't wait to read your book. ❤️❤️", "tanisha_bhattacharjee": "For changes to come the legal framework should change to, there are countries where rape is still not a crime and sexual violence laws are not gender neutral. Even in India all the cases of rape where the criminals are blammes are third degree sexual violence. If it's a simple denial of consent it's not believed to be raped and marital rape is still legal. How can we expect quality if our Constitution doesn't support it?", "samuels.rubio": "Amazing 😍😍 claps 👏👏👏😘 stay strong", "tan_.vi": "You're an inspiration ❤️", "pushkaresh_singh05": "Ur thoughts n uh both......r incredible and very clear🔥💖", "__ishitaa._": "You’re an inspiration for me ❤️@redheadwayfarer you write the truth and some people dont have the guts to accept them.", "swetlanaadhikari95": "Nude is normal ! Sex is basic ! Equality should be the only way to go no matter what field ! Freedom of choice is a birth right ! More power to you girl for being the voice 👊", "pardeep.singh.311": "Nice lines mam 👌👌", "lucky__________143": "💙💙💙💙💙💙💙💙💙", "raghavendra072": "❤️❤️ you so much", "phenomenalrohit.singh244": "😍😍🔥🔥❤️", "prantik57": "I like it😍", "zahid_mohammed_92": "🔥🔥🔥____🔥🔥🔥", "gouri_sankara_roy": "👍👍", "muskaan__d": "U go girllll❤️🥺", "gabbar_singh______": "After a long time❤️❤️❤️", "sharon_7231": "This is beautiful 🔥😘", "the.backup.brain": "This picture is black and white is AMAZING!", "simran.bhosale.1": "Ufffff 😍😍😍"}