{"_muskan_chauhan__": "@aparnaguptaa_", "parasrana61": "Wow", "kannangovind194": "Love to c u wid only panty 💘 beautiful lower half 😘", "abhipanwar": "So miss feminist how are you supporting poor ladies in lockdown?", "its.anshulbhatia": "You are an inspiration. Not just females, I think every human being, needs to look at themselves as a beautiful being. Men today are uncomfortable of sharing their shirtless pictures just because they do not have abs like a model. It’s okay. Celebrities and models are not as perfect either as they look 👀 in their perfect photoshoots. Yes, inner thighs are darker, yes I have stretch marks, I have cellulite, I have body hair. Big deal, god made me like that, I can filter and post a perfect picture of my body too. But I love myself for the way I am!", "itszaidkhanofficial": "Ass pr white lines ho rhi he 🤣😂😂😂", "nudefreedomlife": "Exactly. Nudity is defined in a very narrow perspective. Comfort is what we feel when we are free. Be it naked or in undies. Being naked is not sex, but the soul gets a place to rejoice. We mostly judge a naked body as a topic of sex but are we any humane? Woking from home, naked or in my underwear is just what makes me free. No pants no belts to hold the jeans..no tight under vest. Just air air and air of life 💞", "kurreeya": "🔥👌💋❤️", "tasha81005": "Life is way beyond your CHUDS BABE!! Stop using your lacy and stinking ‘chuds’ to promote feminism genius. Self love is to be confident enough to walk on the road with whatever type of body you are blessed with and not just to wear chuds and click pictures showing your half cleaned ass as self love you 7th fail!!!!", "kanchanachakravarty": "😋", "saakshi__v_": "Woww ❤️❤️ such powerful woman you are. Lots of love", "innocent_heart__09": "😳😳😳😳😳", "zaheddamani": "Why 24 hours you showing your ass?", "subiyadavofficial": "I needed this. Thank you honey! ❤️", "billionaires_club64": "Earn extra income by doing part time and full time work and only serious people's can DM", "gnaik68": "pant nhi h kya😂", "_mandakinisingh_": "Courage courage courage @salonichopraofficial and right on point .. 🔥", "__prashantshukla__": "Such a crass it is ! None asked you to be hairless or anything. In earlier times women didn't used to wax their bodies. It is you people who started this and now opposing it. Be what you want to be, but why being so hypocrite with something.", "__imperfect__misfits": "🤮🤮🤮🤮🤮🤮", "__sway.it.padma__": "I'm hungry and I don't wanna cook (again).", "deyarunabha": "Great thought I must say... But that's what most models and \"perfectly\" shaped celebrities say... Then why do they not practise what they preach... If you are lecturing against women being used as sex objects, why objectify a woman by performing in item songs..? If you say love your body and colour why do you feature in ads of fair and lovely or some random shapewear companies.. Why do celebrities portray themselves in larger than life images that no1 can touch or feel and yet lecture others to live the simple life...!!", "ankitmedhekar": "Wow 😍", "iamtanviir": "@salonichopraofficial You just reminded me my girlfriend❤️", "hushanjhinjer60": "😘😘😘😘", "euphoriyaaa_": "I even added a backshot because I wanted clout that's more appropriate.", "sh.ivam9786": "Can i eat your bun", "mr_meldivala_": "Wow so cute figar you just fucking💋💋👅", "iconinflexion": "woww sexy", "harshsinghbagiyal1234": "You are shit. are you really a real feminist I don't think", "poojasharan": "@saherk91", "raja.banerjee.946954": "💓", "firminised": "\"Don't like me, don't look\" has to be one of the most underrated quote, if it bothers you so much ignore it. Only if people follow it in real life, so much of shit won't even happen", "psyche_wolf": "Well said as always😝🤭 solution to the problem sounds dope. Life is too small to invent and use the hate react,lets stick to the love react or scroll whichever dirn you want to if u dont like it🌸", "insomniacwriter_": "Nice ass", "dolabera6": "💞💞💞 caption everyone should read this 🙏🙏", "preetbalofficial\nVerified": "Verified", "saloni_taurian": "Sisly your every line is truth & well said 😘👍🏻", "belton___sutradhar": "So nice all pick🔥🔥🔥🔥🔥", "gayatriyerla": "It took me a minute to forget how comfortable you're nd how adorable you're looking rather than noticing the number of clothes you're wearing...I've been your fan since I saw girls on top nd fell in love with you thousand times more after discovering your instagram profile...💓💖💖💖", "kunalkumar4782": "Caption🙌 n u always🔥🤘", "anirudhprasad.010": "This country is going to dogs!!", "rajkumarthakur53": "👏👏👏👏👏👏👏👏👏jio", "shivangeeyadav": "😍😍😍😍😍", "psujeet36": "Chadi achi hain", "faheemacil": "👌❤️", "nisha_snow": "💕", "sukhwinder4113": "Omg my sweetheart🔥🔥👌👌😘😘", "sahil___69": "Randi", "hopeangelyn": "😍😍", "ashutoshonly": "🤢🤮", "sarthakdavee": "Cutie😍", "kailas3364": "Nice", "jewelbikomiya": "😝🤤😋", "hanjikiddan_": "More power to you💪", "mahimaptl007": "Penti lovers🔥🔥🔥", "ajthisside": "@lakshaychaudharyofficial", "deepak5357sharma": "Bauty", "kananpai587": "Beautiful🌸🌸", "haneef13_": "💦😋 i want you", "riicha.goel": "U have the guts to do this girl...#hatts off....wish we had half as power as u👍", "walimbearvind": "very hot", "charmingly10": "I really really get your posts just when I need it. The day I feel insecure or un sure of my body or what I wear and how I look you're there telling to be me not anyone else. It's really changed the way I look at myself. Thank you!", "ritu12kadyan": "❤️", "19jayanta82": "Is it comfortable ? 💐💖", "dance_dilip9758": "😍😍😍👌👌💕💕💕💕💕💕💕💕", "imamudeen.ansari60": "❤️", "naugh.ty11": "Awesome booty 👌👌", "broken_by_inside_": "Funny", "apartunited": "Hi there, we’re a page trying to lift people’s spirits during this time of lonely isolation. Our goal is to have more people holding hands virtually than those infected with the virus. Check us out & join the chain! #ApartUnited we can beat this.", "varkak28": "hi saloni , huge fan ,ur inspiration for me, i want to ask something, i too live in with my boyfriend in pune. during these Corona times when everyone is lock down me too is locked wity me boyfriend like you. but i have a mother she live in Bangalore and alone so my mom keep scolding me i left her alone to die, old people are most infected, she blames for all these lockdown and keep on crying for food and groceries lines crowd. now wtf is that to do with me? did i called corona? did i told to do lockdown ?NO then why m i suppose to do all that ,look at ur mom bindia and ur nani, they are also old enough but they are giving you independence in these crises also.", "lustt_for_life0": "Ur write - ups r like moonlight in gloomy nights..❤️❤️", "human_noreligion": "❤️😘🔥❤️", "divyani7956": "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤", "rushabhkapoor1167": "नागडी बाई", "rajugowda.r": "👌👌❤️😍😍💋💋💋", "_that_bongchick_": "Such a beautiful caption ♥️", "rj_ron": "Your wig and your caption doesn't go along.", "arjun_.arya": "@redheadwayfarer Why r u encouraging girls to roam naked in public? Evn biology says that INTIMATE/ PERSONAL/ PRIVATE Body parts are sexually provocative. Now u'll say HER LIFE HE CHOICES. But this mentality is wrong. This universe is made by ISHWAR so we have to follow rules given in VED, thats INDIAN SANSKRITI. RIGVED 8.33.19 clearly says that \" Females are given higher position in society so she should be kind hearted, she should not be rude and she should dress herself in such way that all INTIMATE/ PERSONAL/ PRIVATE body parts are covered.\". And if you think VEDAS only put restrictions on women ,then tell me I will give u many mantras that talk about equality and higher status of women THAT MODERN DAY FEMINISM CAN'T EVEN MATCH.", "iqbalkhan4644": "👌👌👌", "hollychy16": "@ofstardustandhope", "delindharod": "Love the initiative. No matter how much some of us may admire/love a person, we still cannot shake this belief in a woman. I think its really important to come from peers.", "saurav_defence": "if a person has to yell out 100 times in public and look at herself in the mirror she is the most insecure person ever.... U won't see world female leaders yelling out I have got a huge brain I am being myself 😂 glad I don't follow such dumb fuck people who got nothing to do but post fake inspirational quotes on their asses 100 times a day... She is herself objectifying herself showing her ass and yelling out don't objectify me 😂😂😂😂😂😂", "twinkle_2_3": "You are pretty awesome...👌💙", "artichughmua": "@redheadwayfarer I just love you 😘", "madhushnata": "You always motivates girls like me. Thank you. Even I roam around in my home in my chuda but sometime I don't feel that confidence in me. LoveU.", "gursheen_vd": "You are an inspiration! As a teenager I have already learn to be comfortable with who I am. Really don’t care about what the so called “society” will think! ✌🏻💁🏻‍♀️", "lucas_dalman": "Just wanna be this happy 😊", "itsreenaparekh": "👏🏽👏🏽👏🏽", "kabeer122131": "Beautiful❤️", "deepakj5342": "Braless😍", "samking1223": "Yummy ass😚🔥", "kanishka.sharma.186": "❤️❤️❤️", "vishalrathore13": "Nice one🌹", "mahaasaf1": "♥️♥️♥️ love all of this", "shekhar7610": "U r truly honest not only in writing your thoughts but wearing what u like n that suits u very well👌", "prateek201289": "Mem lots of love 😍😍😍🙏🙏🙏 @redheadwayfarer For insprination of many fearless girls 🙏🙏🙏🙏", "__half_boyfriend": "🌸🌸🌸🌸", "balpreet2028": "You are a huge inspiration", "adeeba.arif": "❤️❤️", "iamabhizt": "Spank you with my eyes. 👀👋🏻", "rashh_08": "❤️❤️❤️", "neels_way": "So true... Hope this reality reach to every girl and women out there... And help them to change that mindset as if it won't bother us then who cares what men thinks or not... If we are OK, problem solved", "dancin_bee_simran": "The caption is so on point and perfect. 🙌🙌", "aakaankshaa_": "Sounds cool but I live with my parents.. Not everyone lives with their boyfriend 👻", "vaishalisoni96": "Just reported a few hate comments on this post. My job here is done 💁🏻‍♀️", "skywalkeeerrrrrrrr": "Mind full of coolness, thought full of freedom and word and action full of chilli sarcasm. 👌👍🙌", "marymichelleeeee": "@redheadwayfarer your posts always always make one feel so much more confident and comfortable being themselves. Thankyou for being yourself and writing this article for us and posting this picture of yourself so happily,your posts are really the most informative thing everrrr, thankyouuuu,hope you continue writing and inspiring us all,more power to you and Rahul really.❤️😍🙌", "insiyahusain": "You're just perfect ❤️", "itsme_nirajmishra": "🔥❤️😍💋👅👄", "mohammadshaikh909": "I don't like that ass 😡", "biryanimonster_23": "So well conveyed🔥🔥 wish people understand this some day💯", "itz__khatru_boy_____": "🔥🔥🔥🔥🔥", "_oh.prediction_": "This is so so so important. You’re such a gem 😭♥", "pranaykhera": "Yuuuucckkkk", "profilo_maker": "Everyone should read your caption at least once!🔥", "the_holisticmermaidxo": "I FUCKING LOVEEEE YOU SOOO MUCH!!! SINCE DAY 1 LIKE 3 YEARS AGO!!!! YOU'RE AMAZING!!!! @redheadwayfarer", "vrunda4792": "Don't advertise ur choices n likes...... Its for u not for the world......", "_mad__mask_": "🍒🍑🍎🍌", "navin.shankla": "Hot n cute", "dilipkatkar007": "Love 😍", "rima_bezbaruah": "Girl, you are amazing. 🌼", "chinmayy_nuthikattu": "O.M.G... this is amazing 🔥😍", "swetapattnaik1101": "You just killed it!! Amazing!!", "priyankaa.sh": "Reading your thoughts always gives a new perspective. A perspective much needed 💯", "asmi.soni": "Tee shirt and chuds is a whole new mood", "seerat_sachdeva": "you are amazing🔥 @redheadwayfarer", "anjalisharma_x": "I swear i love this post!", "chetak.sharma": "I love you💞💞💞", "a_known_imous": "🙄", "adityaayuda79": "🤮", "conteoliver": "Wow ...bella....🌷", "joyb37": "Beautiful 👌🌹❤️❤️❤️❤️", "_revo_3": "Love you gurl ♥️♥️♥️", "aishwaryaa_luthra_": "Haha, bra is happy even she is sneaking out from the cupboard 😂 and youu look supa cute😘❤️ #inspiration", "deney1995": "😟😖😖🤣", "eshwar.s.bujurke": "👌👌 U LOOKING PRETTY CUUUUUTE PIC 💕💕💕💕", "rahul__531": "Ki", "rohit.devarushi": "❤️", "tailor_made_chaos": "❤️ Much needed", "shiviiingh": "👏👏", "__pardesi__": "Nice ass", "koyeenaa": "@tanisha_bhattacharjee our inspiration 💖 she's the best, isn't it?!", "777jyotsna": "Love ur words♥️♥️", "prantik57": "Looks like katrina❤️", "daniya_ly": "❤️❤️ 💯✨", "_pallabi_saikia_": "The best as always when it comes to amazing caption❤️", "nishhaaa_.__": "words!!🙌", "prernasharmma": "❤❤❤", "_vee.23_": "You are the best thing that happened to me this quarantine! Finding your page has completely change my outlook on life. You are so real and encouraging and inspiring!! I feel lucky for just being able to read your words. Honestly its like free therapy:)❤️ I love you so much😘🔥 YOU ROCK🔥🔥❤️", "confident_girl_nextdoor": "Very well portrayed, just love you for this post 👌👌😀😀", "cool221989du": "Super hot body🔥", "stylishsohail23": "Cute expression with pretty face.... looking so comfortable with sweet & adorable smile all natural @redheadwayfarer", "the_pup_cuddles": "Hello ma’am! Do you own a pup or have a picture with a pup? We are here trying to promote feminism and pup love altogether! Thanks for supporting us! DM your pictures with your adorable pups to get featured", "nonchalant_dp": "Thanks for being voice to many and breaking the stereotype♥️", "its_mannu_77": "sexy", "shah_nawaz_aly": "Yeah🔥🔥🔥😂", "sparrrow14": "I love you girl @redheadwayfarer you have been such an inspiration for everyday girl like us. You're awesome. Your words give confidence and power to fight against tens or even hundreds of people with narrow mindsets. You know what some time, I just can't say narrow mindset for one person in a general way, cause that person has modern thinking in different ways. I believe it will take years and years long to understand that we all have same emotions irrespective of sex. Much power and love to you❤️", "neha__ghia": "You mean to say that nudity is women empowerment.!?", "singhmanisha032": "You Go girl 💪 #womensrule", "siddiquerazi": "Stretch marks👌", "anmol.mishra401": "This is post so true!!I totally agree with each and every words of it!!More power to you and to all females🙏", "anmolskohli22": "I love your post. You are amazing . You are one of the very few people I adore !❤️", "kanchanpotlia212": "Nicely said appreciate this small writing of urs ... women never forget to love herself", "ikavitakaushik\nVerified": "Verified", "saddam_rawat786": "sexy", "shivanii___13": "Quite an influencer you are. :)", "himanshuc266": "Abb ye Kaunsa challenge chal raha 😂😂😂", "aby_fied": "Just curious... Again... \"Freedom of expression\" here... You think you can ever promote feminism beyond the \"right to be nude\" Or wearing no bras or going topless... Etc... I really want to know what else apart from all this you have to offer?", "thepunknextdoor": "Gosh how tf are you so gorgeous❤️😭", "rahul.dalvi.18": "I really like the way you are... No show off.. always genuine and don't care about stereotype people. Keep going Girl 🤘", "shreyas_mahamuni": "#naileditbro🔥", "bshsabajna": "Nangi sali🥒💦🥒💦😂", "kritikaa_y": "You a Goddess❤️", "missmoonlitbee": "❤️🧡💛💚💙💜", "kaash_a_vile_orchestrate": "Why u feel shy.. Its ur body....", "shagufta.shaw": "You literally write the bitter truth of our society which is hided by social media. O love the way you have put stuff about reality", "undeniedself": "This post is sooo wholesome! Thank you ♥️", "ohhhhh_boi": "Hoe", "rakeshrajbond": "Sexyyyy", "i_vidhisha": "Best❤️", "aakashhaistar": "Haa what a shame", "imshweta03": "I love the way you write mam..", "prashant.pal75": "Nice", "cranky_cake": "@redheadwayfarer tumhare jaisa koi kahan 10 on 10❤️🔥 on fiyaah, gurl!", "twisted_twentythree": "You said what they had in head so far! 🔥", "rajputketankelgandre": "Sexy🔥🔥", "lalit.prajapatii": "🔥😉😍", "xo.sd._": "You're the best thing that could've ever happened to me. I love you. I love you💙", "kasim.shaikh.313": "Equal combination of CUTENESS and hotnessss😘🔥😘🔥😘🔥😘🔥", "ddrrashtiii": "Best post I saw today, it’s sooo freaking true, you go girl❤️❤️❤️", "bellaluna_71": "Love this gurlll!!💛🔥 stay safe and healthy!!", "pragya_dubey_30": "❤️❤️", "taylurking._.13": "@__rashiiiiii__ you need to read the caption! <3", "aaliyayayayaya": "You inspire me everyday ❤️", "_preksha_joshi_": "You are my dream women ! Someday I hope I can be 1% of what you are 💕", "missygobin": "Very positive and motivating words for the females.....we need more inspiring messages...thanks for sharing....🌹👍", "globetrottergirll": "Everytime I curse myself being overweight your post comes up and it just lit me up from inside ❤️ 🌻", "har_i.s.h": "Real beauty❤️❤️", "lalith_909": "Well said🙌🙌", "shilpa_dwivedi_": "You are inspiration 😍❤️❤️❤️", "adhikarismriti0804": "@redheadwayfarer The coolest person on this planet who has stolen my heart ❤️❤️❤️❤️", "_divya_jami_": "That was needed to be said ❤️❤️", "musafir_huyaro1": "Love this look, more power to you saloni👏", "shubhomoyguha": "🔥🔥🔥😘😘❤❤❤", "roshnisasa": "Can’t commend you enough for what you portray and write! It’s never enough. And despite the flaws you have, it’s always flawless to watch you!♥️", "amansingh_12_": "Ur thoughts🔥", "ikzoom": "😍😍", "bharatrajputtheking": "Yukkkkkkkk 😫😫😫😫", "thesunrayyyy": "Bhai itne guts late kha se ho?🙏", "syedashafquatwasti": "❤️❤️❤️❤️❤️ @redheadwayfarer", "chandu.succour": "Wow..😂", "imsandeepgarg": "That ass though 😍🔥🔥 @redheadwayfarer", "almikaithub": "Ever since I bumped into your account on IG... It has been more enlightening and motivational👌@redheadwayfarer I love reading your posts, I simply love the way you put it out there...just boldly and beautifully. You inspire me to accept the reality everyday and crush the whimsical land 😜", "hydropanic.90s": "💯💯💯💯💯", "jaravatavishal": "Sexy🔥🔥🔥🔥🔥🔥", "_gargikatke_": "@redheadwayfarer so inspiring! ❤", "rude9024": "Can you dance on \"Chaddi pahan ke phool khila hai\" please", "arty_tyagi": "🖤", "an.any.a": "Cute butt😍 and cutest u.. I wish I had one fourth of NGAF attitude like yours 🙌", "_mehzonedout__": "💯❤️", "abishek_joseph": "Beautiful said. #respect 🙏", "headstrongwayfarer": "How to manage to be so sorted 😭 nd overvaliant 😫 l love you tons ❤️❤️", "shahzihil": "Uff", "basudhaparija": "Wow, you are just so amazing. And specifically I personally love the fact how you truly project your emotions and ideas in your posts and express them so beautifully. The world needs people like you.. ❤️", "shrusti_pol": "😍🔥❤️", "_angry_man_4444": "Sanitizer & masks were out of stock in Australia for 2 weeks...India has the least number of deaths due to corona... But some Australians are seem to be jealous... But some people like u are busy to spread hatred....like a cultural communist....", "highpiness_x13": "@redheadwayfarer i love ur eyes nose and that damn heart melted smile 😭❤️🙈 ily", "mayank.shekhar.9275": "Nudity is an arts. So, don't hesitate in showing in front of whole world. Keep doing this. One day, you will surely change the narrow mindset of people.", "paarullsharma": "U need to change this....its monotonou🙌", "disha_.jain_": "The doll behind admires you just like I do! ❤️", "fire_desire08": "How flawless are you !!!! @redheadwayfarer 🌸🌸", "hikabieber": "❤️", "sehgal_ash5": "HOT🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "me_mysterious_0": "You and your thoughts are amazing bro❤️", "kedia.aditi": "❤️❤️❤️", "stylegrabs": "U r a godsend 😘", "sa_lonee_____": "You are amazing✨⭐❤️", "_my_drug_his_smile": "❤️ So sweet", "_jass.batra": "Ma'am you are an inspiration to all the girls! I really love your boldness and thinking just be like this! Instagram need more people like you keep it up! Proud of you! Much love from delhi😇❤🙏", "rockstarr1430": "Gift me the cell phone 😝😝", "say_hello_to_vikrant": "angel has fallen💕", "rushinaaa": "So much power to you ❤️", "sach316insider": "Wooooooooooo it's hot during corontine🔥😘😘💋💋💓💓😍😍🙌🙌", "hariom_rajpoot_336": "kya dikhaana chahte ho didi 🤢🤢🤢"}