{"vedneha": "👌🙏", "sreeram_rupesh": "Is Rahul like that in the way u mentioned?? If u r Rahul is not a kind then why are you telling about other men. Feminism instead of bringing equality, it's bringing hatred towards men", "nit2254": "😂😂😂😂😂😂😂😂😂😂", "tllachenpa": "This is the problem “just” raising kids. Raising kids is a huge task. It is raising the next generation and it is because we don’t have good role models mother or father that more people are depressed today, there are more crimes, more suicides, more narcissism leading to wealth gap, climate change, etc etc.! You think raising the next generation is something small? No miss! It’s one of the most important task a human undertakes because with the kind of self destruction we have today on earth, the survival of mankind solely depends of adults who were raised right but for that to happen the parents (mother has a very important part as she literally shapes the future of the child in his her formative years by the interaction she has with him her which can either be compassionate or selfish) have to first be ideal role models themselves. So the future of a peaceful world literally depends on individuals raised right by well informed (emotionally intelligent, self aware), compassionate, intelligent, selfless, nurturing mothers and not a narcissistic entitled, less informed bunch who like calling themselves empowered without actually being one. The creation of a great civilization depends on individuals who were raised right and you think this is a trivial job? I can see what percentage of brain cells you employ.", "ayushkesharwani98": "\"Marriages today don't end because we've forgotten the meaning of love.\" This was the starting line but the whole point was how a modern day woman has the right to end it. Can someone please explain the relation between the line and the paragraph? 🤔", "leyb_bhavna_thakur": "Lol how dramatic, once ppl get little fame from something they keep repeating it , and baki log like bhedchal buttering her always utter bullshit this is stop this please , ppl crying had tear lol what bakwas is this , u earning money with these words and enjoying life with bf and making ppl chu***a , am sorry but for me you are very irritating specially the way u dress up am not saying it's bad to dress like that but atlst u should look good in it , y dont u wear something according to your body type , showing your body all the time doesn't make u a powerful women with words I mean cmmon , I am saying all this because I am so pissed with your drama and look at ppl considering u god here ,fools , stop all this u r non that intelligent that ppl doesn't know all this it just words u playing with to get fame , and y against men , your dad , bf brother what are they then u fool , ?", "soumyamohantyofficial": "👏🏻🙌🏻", "amolaksingh.khalsa": "👌😍", "scooby_.dooby_.doo": "@_shriyaaaaaaaa_", "iam_jomom_1229": "It’s wonderful & motivating. Thank you. It really helped me to make decisions of which I was confused for quite some time. 🙏🏻", "mebrahmin": "Waah Didi", "saffron.31": "Sharing this beautiful msg with your permission..coz i felt it myself..thx❤️", "kalyaniaggarwal": "Yes.", "shreeya129": "❤️❤️❤️", "akashchourasia14": "Sexy pic", "insiya99": "Just a single question why being housewife is considered as easy job? And being feminist doesn't iclude the housewives job?", "biswanathghosh6": "❤️", "abhaymootha": "👏👏", "bombastic.mathura": "You are a bad example to all the girls out there who need the right encouragement and the motivation exactly the way you put it. Reason? Your utterly vulgar language, equal vulgar posts and horrible examples like \"what holds and breaks marriages\"! YOU DONT BREAK STEREOTYPES AS MANY GIRLS THINK OF YOU. YOU ARE A AN UGLY REJECT WHO IS FINDING JOY IN SPREADING GENDER HATE IN THE NAME OF FEMINISM. You're ONLY fit to be a marketing tool for ad contents and for your beachwear clothing brand. YOU'RE A PRODUCT OF PARENTING FAIL", "celestebatra": "Even if a woman is housewife, she is using her god damn brain, taking care of children and cooking is not a bad thing, if a woman enjoys it. Dont generalise things.", "usernamechangedthrice": "IF YOU ARE READY TO LOVE THE SAME WAY I DO , I CAN EVEN TAKE YOUR LABOUR PAIN ON MY SOUL", "thedusky_me": "Kaam vali bai se lekar..vo majdoor jo pregnant v hokr kam krti h....sb independent woman hi h..bss 2 piece pehen k laptop p kam krne ko nhi bolte working woman...my mother left her job when i was born....because i often used to fall sick..iska mtlb ye nahi ki vo working woman nahi rahi...unhone hmare ghar ko ghar banaya...mujhe healthy rakhha...she is a working woman,a homemaker...and we are Proud of such mothers .", "nimra_khan_pvt": "Woww 😍 well said ❤️❤️ people need to understand this 💕 @redheadwayfarer", "miss.globe.trotter": "@ashanagarkatti", "usnehajain": "🔥🔥🔥🙌", "badass_0101": "Fucking suhagan look🔥🔥🔥", "vandanaraturi20": "Immense respect for u girl....ubr such a gangsta..... i love love love u to write this ....its so powerful....🙌🙌🙌", "kat_diaries": "So true", "aarohizeyana": "Huge respect for ur post", "nishthaaaaaaaa": "Loved the caption through and through! 💛", "zaid__n1": "الي المطبخ بس🌚", "sonamsadani": "You go girl!! Love from Melbourne your way... And this comes from a single mother living all by herself in Melbourne and raising her boy solo!! A man is not a plan 🙌🏼🙌🏼🙌🏼", "satishwaran1994": "nice thought if those are yours ❤️", "shinoscorner": "Wow", "pezetusha": "Awsome ,very well said 👌👌", "absolutedolly": "You just said what I always feel 🙌 Love you ❤️", "meghalpatadia2": "@denisha_kakkadiya @itsmili_98 ❤️", "saylivelhal": "🙌🔥❤️", "sonalmodha19": "I love you ❤️", "sana_mhxd": "Does that means no more peaceful marriage?", "alok_ranjan_vv": "बकवास", "roymaitreye": "🔥❤️", "aaashayyyyyy": "Best thing I’ve read today!!!! ❤️❤️❤️❤️", "riyanavlani9": "👏", "absharabshu": "💯👌", "beckyninan": "Considering each one as human and not distinguished by religion, caste, gender, sexual orientation, etc👍", "rachna_mohapatraa": "best ❤️", "tasneem09_": "It happened with me .. I left because there was no respect for me...so fuck such relationships....", "bhargavi__ramaraj": "💕", "tharmini_nathan": "@saranjha @jenny_vimal", "advranazunzunwala": "So, for every failed marriage you think only mens are responsible....that's just sexist.", "aarti_077": "👌👌👌", "nehawasnik": "Bravo", "shiivangijain": "And the sad part is that the people who call themselves modern are all bloody imposters. Deep down no man can still see his woman going even a single step ahead of him. It requires courage, it requires selflessness.", "shymayur": "🖕 Equality ki baat krne walo..u r the only destroyer of Equality!! Marriages are based & successful only when you bow down first even if it's not related to u!! You must have courage to apologize before your partner do!! At the same time, you are not supposed to show yourself superior under the reflection of word called \"Equality\"..!! Equality means Equality only!! If you have self respect then wear it in your heart not on your mouth, because others do have their own also!! So stop posting such kindda publicity stunt in the name of *Marriage\"....!!!! Be mature....!!!! Cmmnt krna to nhi chaahta ta bt kisi ko dikhaane k liye ye sb likha, but still ur post doesn't have worth....!!!! (p.s. No fucking replys plz)🙏", "sarcastic_hardik": "I just hope rather than this post, individual personality become the cure to this epidemic.", "vrushti_01": "You r correct that women should be respected... But the thing of marraige failure is just bcoz ppl just be in there ego (sometimes!!) Some of them are still happily married bcoz they dont want their marraige fail n also they love each other n are equal in every possible ways! But both had to have a mutual understanding between them so that marraige dont fail!", "krupachoksi": "♥️", "vaishnavimurthys": "Damn🔥🔥", "food_celebration": "Phenomenal🙌", "sapna_rajput": "👏👏👏🔥🔥🔥", "whiskywali": "I’d like to point something - not “think like men” but think to begin with. Men still have a problem when so many times they realise that women now have a mind of their own. It’s just not okay for them.", "_shxwrxma_": "Okay clown 🤡", "words_of_poet": "Don't ever let what you love own you. 🤘👌", "gram_spammer": "I agree with most of the things you said above, but, undermining the women who handle kitchen chaos and kids is not right. I mean, that is also a hell of a job. I've seen my mum and bhabhi working so hard so that we can become a better human one day. I think there is no better job than that. And I respect every woman who keeps someone else's need above their own. I respect every woman who go for their own dreams. Every path has its own sacrifices. Respect them all🙏", "blog_writer_123_": "I don't know where to start not sure whether u will read this or no Yet I am saying everything that I went through. Being a blog writer I was going through depression by reading ur blogs I managed to get over it @redheadwayfarer ty for inspiring me so much I truly love myself even more than yesterday. Actually, the problem started after agreeing for this marriage wherein my family failed to understand their own daughter willing to get married or no they emotional trapped me for this shit and lately I got to know a guy family not promising so I cancel the wedding 💍 since then, guy family stared to threat us saying we will spoil her career and he wrote death note 📝 stating we are harassing mentally shit like this but then my family asked me take control on this finally I stood myself and fought with them all I want to say is I got this courage frm u ty for inspiring all the girls out there", "giddu16": "❤️❤️", "___priyaljain___": "@prateekshamalpani07", "ektabathla21": "🙌🏻👏🏻", "navjoyt.dhillon": "Wow! @sonamgupta29 it's just what i needed to read in along time!! So meaningful.!", "irishinno_": "This is the best thing I have read. It's so inspiring and motivating💓💓💞 so much truth", "swarnalathaparamsetty": "👍", "tara.gurnani": "Powerful ❤️", "uniquejalu": "At the same time many women who wants space and respect, not willing to give to their partners. This works both the way. Don't play victim here.", "ambrose_rooze": "💎", "shelly_simply": "Soooo.. dam true ....🔥", "theblackcoatsarcasm": "Truth being said and needs to be understood 🔥🔥🔥🔥", "rakhisimmi": "Amazing .. 😘 you took my heart this time..", "diivya_jindal": "Woww!!😍", "welcome_to.my_profile": "❤❤", "parshvip": "💪🔥", "mamta___16": "@pragyaparimita_ @disha_19_ @mananta_13 @avipriyaak read it", "27ankita": "No words.. it is just a open minded women we are now. But being in 21st century still there are many people who have shit thinking and we can't change there minds. 🙏🙏", "jaanu_idancify": "♥️👏🏻🤗", "the_madpackergirl": "Very true...👍👍", "prinksstyle_travel": "Very well written..😊", "hopelessly.flawed": "Wow", "the_goanfoodie": "Can't agree more 💯", "hasrab_hasish": "You're right. Everyone should be treated with respect in any relationship. We need to stop fooling ourselves in the name of a relationship..", "_khushboo_dhamecha": "👏👏👌", "thakuranchi_aishwarya": "🔥", "madhvim26": "This is amazing!", "uddesh_chhajed": "@redheadwayfarer STUPIDEST FEMINIST(so called) EVER.", "shreyaroy_29": "I’m surprised an unmarried woman has so much wisdom to share about why marriages last and don’t last. In the end, you pull everything down to feminism. Not everything is about feminism, woman. There are lots of reasons why two people may chose to stay together or part ways.", "vrishi95": "@redheadwayfarer I still don't understand why Woman are not aware of what they Deserve... ?", "fcamvj07": "Go to any country there are Good boys, Good girls and Bad boys, Bad girls Go to any state any caste any culture any school anywhere there are Good boys, Good girls and Bad boys, Bad girls so can't take anyone's side👍", "ritu12kadyan": "Yes fuck the society", "jaya_mulani": "This is amazing❤️❤️ Thank you for this one❤️❤️", "khatri_bhavesh": "Promising... Way to go 😬", "thetravellerrrrrr": "beautifully said 🙌", "hafsanoorthehotelier": "🙌🔥", "fati_mohmet": "Vah vah its our time keep going queens 😍😍❤❤really like it this post", "memes_for_earth": "💯", "thatismysideofstory": "I have no idea why you have a hashtag as runawaybride 😂but I am the one who called off my wedding for one to many reasons which you have mentioned.", "achillitect": "Can I repost?", "the.hipster.soul": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "bindhyaaravind": "I agree with the fact that women these days are more empowered, but this post sadly infers that women are primarily the reason for divorce. In my opinion, marriages these days dont work mainly because people these days are always seeking for the better, even better life partners. Also, earlier people valued commitment which they don't these days.", "susansata_thebestmotherever": "Very true 😇", "ar.jun742": "Mam if you given a chance I would like to decorate your nose by piercing your nose both the side and fix nose stud for both side of your nose mam 👃👃👃👃👃.", "sahilchandel": "💫🙌🏻", "kavyadagli_": "After times, some one to keep it real❤️", "ritikabharadia": "@gaggarvrinda @keshavbharadia @nehadamani @anisha28486 @aniketbharadia", "gaurikatodi": "Word🙌🙌", "sanghavi.bhavya": "🙌🙌🙌🙌🙌⚡️💯", "deepikakalita": "I have started loving you more and more everyday @redheadwayfarer .you exactly say the same words I feel every day but fail to express..so nice just to know a person like you exist..more ❤️❤️ to you..nvr stop writing coz I save them all the time to give me inspiration at times when I need them the most..😍😍😍😍😍❤️❤️..", "obhimani_singhi": "@bong_under.construction", "ankita.ramesh.bohra": "I’ve just come out of a separation; you have put it across so well, and so to the point. Beautiful you and your writing! 💯❤️", "musafirguy": "Before anything self respect comes first. We have to treat each and everyone equally. And if you don't find self respect or happiness, where you are right now, it's better to leave thn staying over the place like our older generation did. 🙌🙌 #selflove #selfrespect #happiness", "hitakshi.mehta": "🙌🙌🙌🙌", "_kajalchauhan": "@payal.malviya @kanchan_satija @pooja__menon", "that_bloominggirl": "Wooowwww.....😍😍😍😍😍😍😍", "d_dhall_7": "Beautifully written.", "_saniya_dalvi_": "🙌🙌🙌", "shrutij.v": "How could I share this on Facebook?", "birr_d": "🗣🗣🗣", "shivangi72_": "Wow! Your words are just amazing. I feel like this is inner me speaking 💯👏🏻 #worthywords", "geetika_fit": "Needed to hear this. Going through nasty separation/divorce with a toxic abuser and in laws.", "garish_25": "🔥🔥🔥💕", "saanya27": "🙌👏", "jainnaditi": "Caption!! 🔥", "zehra_noori": "This is such a strong message and really the indian culture needs to get this right into their head", "the_demure_soul": "Every word is true..", "theswatikakkar": "Hats off❣️🙏🏻", "prajwala.mudhiraj": "🔥🔥🔥🔥kudoss", "soms1808": "Your words are motivation.", "thesublimemind": "Yes yes yes🌌", "thebrowndiary_": "🙌🙌", "anusha_oxy": "@zuni_mehta @iti_sisodia @prachisavaliya1368 read caption 😍", "lucia.aishu": "❤️", "curvyyconfident": "💕💕💕", "harshiimehta": "Woah👏🏻", "sachinjain89": "Solid 👌", "srijankumar93": "I wish we could explain all the reasons for a marriage split up, rather than just focussing on one perception and explaining it just from one point of view. Sad, what feminism has led to these days.", "richastha": "Love each and every word. 🔥❤️", "sidzee_96": "One triggered individual you are🥂", "chnithish": "This is like expectations Vs reality😂😂😂", "kaur.rashmita": "Love u @redheadwayfarer", "vani_j_": "💯🙌", "zoominabdulrahmansyed": "Ur exactly looking like ghost n DeVil😈👿👹 what d hell is this nonsense shit don't have any other fucking job fire it🔥🔥", "sahelikukreja": "Suprb one..❤️🙏🏻", "oh__my_gosh_someone": "🤣🤣 seriously ! Women like u pretend to be unhappy when they are bored in life and demand for maintenance in the name of divorce. Sorry u mean to say that is called to move on 🤣🤣🤣🤣🤣🤣🤣🤣", "amrita_varmaa": "🙌", "manikachikkala": "TO THE POINT @disha.aswani @hamsikagopalan", "newleaf.store": "So well said and so accurate", "aahanakumar05": "Wow 🙌", "shailadas30": "Agree", "charu_arora6": "Brilliantly summed!", "shahruchika": "❤️", "sondhinamrata": "👏👏👏", "riyaagarwal920": "I m in love with you more and more ..", "_jigs211_": "👍👍👍", "sandhya.rani2610": "👏👏👏", "gpaikane": "Well penned. I just found 1 assumption of yours wrong. Men are equally tolerant and equally good at multitasking. Those who arent, may be have never explored that skill of theirs.", "aditishishoo": "Word!!!!🙌🙌🙌", "sankeerthana_kuruganti": "Very very very well said 💯", "tanisha.sharma20": "Yes exactly", "abhishek_bitolia": "@redheadwayfarer Y SO SERIOUS 🔥", "niki_shots08": "Beautiful words..❤️", "shenil1311": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "dhur_babaa": "🔥🔥🔥🔥🔥", "vishaalmankoo": "We all are just becoming selfish and thats it", "vridhidhamija": "Just when I actually needed to read something like this and feel better, this popped up! :’)", "the_wolvarun": "\"With only more tolerance and multitasking skills... ? \" And this post has an underline of equality? 😌 SHAME 🔔", "rudra.amin": "@jalpapatel_2355 read this", "bhavana_1015": "Well said 🙌🙌", "mariyamalekar": "Well said. It's perfect!!", "carpediem.zie": "💝", "mkh_mirza_": "@hazari123 read this", "deepakbhojak": "@redheadwayfarer your words are right but their are mens, boys who are experienced successful they also make mistakes so as equal you wanna be treated then mistakes can be performed by you also but then you girls have ego that we should be treated like this that etc... And these explanations about dignity self respect are in the shadow of ego.. These are for both men and women.", "soniaamrw": "🌟🌟🌟", "sunshineshruthi": "Powerful words ❤️", "samygggb": "Trying to promote divorce s or wat", "debapriya_ss": "Last paragraph is lit. ❤️", "itssonuvinod": "Yes. Attagril ❤️❤️❤️", "gauravbaronray": "If a man or a woman is getting a surgery done . It’s obvious that he or she finds himself or herself ugly . It’s very obvious . Until and unless if surgery is done after an accident to get back original face . We can’t save such ppl by putting blame on trolls . That it’s because of trolls the poor girl went for surgery . If I am confident about being a handsome guy . No amount of criticism can push me into surgery. Because I ll be proud of the way I look .", "dpka.iyer": "@_akshathaaaa", "soumyajaydas1": "I find comments consisting of 95% females who agree or support this post. The rest r males. Wtf? 5%? Heh?", "zainabv92": "Independent girls these days be like 'oh I can't cook for my husband and in laws because I am independent, but I would serve chai and coffee by becoming stewardess because that's my job'😂", "ektaa0430_aisha": "@_1anchu", "shakti_mr.b": "@redheadwayfarer probably you must have broke with this damn reason whenst there are plenty more lying on the red carpet..", "haripriya.29": "How anti men are you? It's all a matter of mutual respect. If one can't do that, any bond is bound to break", "me_imhsar": "❤️🙌", "anjali_nauriyal": "@aanchalnegi @abhilasha0508 @jyoti.chauhan1996 @shraddhac14 @jyotisaili @supriyagupta412 @pia045 💯", "aditi.yadav": "Wow how amazingly you have written this.❤❤❤", "preeti_tomar96": "This earth is blessed with women like you. You make women proud of being women. Lots of love your way ❤️", "jamesadamses": "You are a troll!", "drkverma": "Yessss👏🏻", "en_closer": "💖💫", "poonamkokardekar": "Agree 100%!", "lokeshbhatt52": "Just out of curiosity if you really are concerned about equality then why don't you talk about women having special coaches in public transport or why should a man give alumni to a women after divorce and there are many other factors, why don't you mention such stuff? Is it because that will make a negative impact on your female supporters? By your feeds I can sense that you have a contempt for the male gender sometimes I wonder your father, brother or may be your boyfriend must be proud of u moreover I don't believe that is the only reason for a broken marriage, however u mentioned it just to gain fame as u r using the power of freedom to go against the male fraternity. I really pity those who follow u blindly", "mahima_agarwal19": "Girl you slay🔥♥️", "poo_2795": "💗💗💗", "sugandha_singh_": "Thank you for this.. @redheadwayfarer 🙌", "sukhwinder4113": "Beutiful 👌", "dhana__sri": "🔥❤️", "swathi_elangovan": "Bomb.com❤️🔥", "sudanvish27": "And yes women has grown in all aspects...but tend to forget these days their in-laws, their basic responsibilities as a daughter in law, and just wishes all her demands to be fulfilled...where in guys even after getting married are nicer these days...they know how to manage relations with his in laws, manage bread and butter and investments for future use, and yes compromising on thr own desires and fulfilling their wives...but still women will cry forever and ever, lost Champagne", "dansation_by_hemali": "👏👏bravo#proudwomen#independent#Strong#beyou#supportalwaysthetruth#Godblessu#❤️", "sanxo1994": "Can you please write a book for us ?? I would read it everyday ❤️❤️", "ruqaiyah_fatimah": "Well said 👏🏻👏🏻👍🏻👍🏻 @redheadwayfarer", "abhnya_reddy": "awwww😭 that one who texted soo much 🙌 deep the heartttt!", "iamit_ghildiyal": "Yes you are great", "reeaaaa___": "Respect!", "_its_deshpande_": "Oh my god...you are amazing...truth ... nothing but the truth...❤️😍 #respect", "jholewali._": "@himanshu._1993 read the caption", "_manisha__mon": "Omg...ur writings🔥🔥❤❤❤", "saivandana_b": "The caption 🙌", "devyani_agrawal": "Couldnt agree more. Nicely written @redheadwayfarer", "despistado_": "MCP I am", "_thelostwitcher": "On a sidenote, going by this post a lot of people are going to get fucked.", "surendranjegatheesvaran": "50% of people are polygamist?is that legal or illegal i.e. infidelity and is it only men?", "pahadi_buoy_25": "@suhani_sandhu", "beingmeraki": "You had asked yours fans to remind you to stop writing here for instant gratification and focus on your book", "djnair92": "You mean to say Marriage don't last right ?! Got confused at the 1st sentence.. 😅😅", "ghost_of_the_navigator": "I am just waiting for the day when she talks about those men who treated their women equally back then and still do. I will tell you something. I grew up watching my dad taking all the major decisions of life only after consulting with my mom, saw him respecting her and supporting her at every step. I am sure he got all this as a good indoctrination from his father and it sure did pass on to me. My point is, i am very proud to say that i am not the only one belonging to a family like that. There are so many more. Respecting a women and her independence is something which is present sunconsiously and not forced into our lives. Reading those men men men in your post is like getting blamed for something horrible many men did not even think of ever doing. Its my advice that you target some specific cheap fucks who do all these shit instead of generalizing all the men the same bucket. What non sense!!", "abhinandandas1026": "Khoon bharii mang", "suchismiita": ":'') but not everyone that reads good stuff understands it", "bhumikabansalofficial": "Words🔥", "shamielaschippers": "@tracyleescott30 it couldn't of been said any better or clearer👏👏", "im_nidhi_srivastav": "Waoo 😍😘", "samikshadugar": "Wow👏🏻👏🏻👏🏻", "imshivmangal": "simply great......👍👍👍👍", "surbhikazal27": "Here you get this right girl.. Every woman out there should reads and understands this.. And probably some of them stop being guilty of what they are and what they want..💕", "prateekj1302": "👏", "_trend_shopholic_": "♥️", "zarya5670": "Men or women are not conditioned to see whats right for them....", "the_honey_bunch": "@mariha_shaikh @pragati1136 @shk.hafsa @dishamaldikar_99 read this guys ❤️❤️💯 so inspiring", "trishali_chaurasia": "WORDS !! 💯❤️ You go girl ❤️", "i.am.prachiii": "You are amazing..i love u❤️😍", "iamremonaidu": "👏🏻 #excellente", "__swagataaa_": "Wow🔥💕", "vrindatekchandani": "@neha3891 lol", "nitikarai3": "Perfectly articulated !!", "_pallabi_saikia_": "Always writing the best💕", "rajanipriyanair": "👏👏👏👏", "deephanda5": "@neya2705 explain me in short. Pls", "parsatee._.99": "Save this for the book. You were not supposed to write these.", "ayuzhma": "Perfectly articulated 👌🏻", "komal_goell": "@redheadwayfarer im a constant reader of ur post and feel privileged tht i followed you! The way you write these feelings inside evrywomen so perfectly it’s remarkable.", "lopa_milli": "👍", "akshitasharma162": "❤️❤️agreed", "_dikshita_das": "Just wow 🔥", "manya_aroraaa": "This is so awesome.. You inspire me to write more❤️🔥 cant wait for your book💕 keep writing you are one of the best💋", "breezeofoldroses": "❤️❤️❤️❤️", "saumya435": "Everybody should go through this post atleast once to know that humanism is the key...people with evolved minds ,needs should value other people with the same needs.", "abc_musings": "Perfectly said। 💖", "artab03": "Sooo beautiful ❤️", "quickexocite_7": "It's better to be unbiased. Not just to lean on one aspect. Not ever men is same nor every women is same. It's just a perspective to look on. Still there is rap is going on. Women are being murdered for the dowry. But at the same time men are behind the bar. Women are misusing the power of feminism. And Society puts blindfold on it. So I'm not against you but it's breathtaking betrayal of the mankind. #wakeup", "priyanka_pisces": "There is difference between similarity and equality. Give us equity. Don't make us feel exhausted or fill us with hatred towards men.", "kaushikvachheta": "Congratulations..🌹🌹", "ruuchidubey": "If only every girl could find the courage to do wtevr she wnts without being judged by others @redheadwayfarer really love you!!", "dr_sonalika": "Girls like can relate so well to this post cause you wrote about everything that we feel but never had the courage or the proper set of words to write something like this ❤️", "friincel": "Beautiful", "____bibliophile_boy___": "🌺🌺💞", "riankeviv": "Wow💫", "anaa_iskam": "Feminism? Women empowerment? This all are shit this all are fake word see around the world by the name of freedom, women empowerment and faminism women are being naked see the Dan Bilzerian insta post see what women are doing see playboy post this is not should be Faminism or women empowerment......", "pranjali.11": "👏🏻👏🏻👏🏻❤️ people need to understand this.", "muthumarisaravanan": "👌👌👌", "m_phanindra_reddy": "Brought tears with smile. Go ladies 💪🏼. Be you, lead a happy life, you do great being you. 🙂", "maanvi_samuwa": "🙌🙌🙌💖", "nandita1992": "Oh my god ! Your words are magic. ❤️❤️", "dpkshrmaa": "Fuck Feminism... Feminism is cancer anyway... all the women here saying that its such a great post.. i say that its bullshit.. All these feminist want is to be a man without any kind of problems of a man..", "lakhan_kashyap": "Whatever u said about women becoming more independent is right but I don't think that this is the reason due to which meaning of love is forgotten or failed marriages... Women were always stronger than men and always will be, yes they are good at multitasking... But the reason that you mentioned... I just don't think is right...", "dr.pratimachaurasia": "@garg.abhii", "eshaagrawal_22": "Truly said l,for Instance I had the same discussion with my mother yesterday nd I gave her the same explanation tht it is the women who is not accepting being degraded by men in marriage and hence the results ❤️", "sitharamv": "❤️", "k_ram___": "Beautiful ❤️👌", "the_unapologetic_virgo": "Absolutely correct.... you're amazing girl❤️", "ambitchiousxx": "❤️❤️❤️", "shameena10": "❤️❤️", "tanuu1995": "Put in words everything i have ever felt!! ❤️❤️❤️ @meenu13121995 @diksh_mittal @nanc_doshi @fierceflowerchild_28", "jhanvsingh": "You are my real inspiration😘", "pallavi_poojary": "Did I happen to mention that I adore you? If not then I do, so fucking much..thank you for just being you💕💕💯💯😘😘", "shivu__joshi": "All my Love and grati3for you mam", "freaky_foodie_yatri": "True ❤️❤️❤️", "scene_tillating": "\"compromise\" is an essential part of any relationship. At the end of the day we want a peaceful life, not everything is justified in the name of \"independence\". Yes you can wear any type of clothes, but you can't deny the fact that people will stare with wrong intentions here in India. So everything requires boundary. Better to stay happy with what we have.", "ashrika1992": "❤️this very true👏", "rashieag": "Every woman and man needs to read this. Thank you for writing this. 🙌💖", "_nishthaarora_": "RESPECT.", "beingyasha16": "@akanksha.saxena.1809 🙌", "ratnadeep14_8": "🔥🔥🔥", "vish_19_96": "How shallow can your mind be when on one hand you're talking about marriage which fyi involves the equal contribution of both the partners & on the other hand blaming it completely on the men out there. It takes two to break or maybe just one petty hypocrite like yourself.", "theholagirl": "This is so much deep 💕", "shivanimittal91": "Slowly and steadily, it's happening. I'm glad to be part of this revolution where women are finally claiming what they have denied to for years.", "neeshi19": "In the past ,women kept mum and tolerated everything only because they were completely dependent on their better half which is not the case now.Nowadays women are financially independent and knows that they no longer need a man for their living nor need to suffer in a suffocated relationship.", "nainashrivastava73": "True af.... 🙌", "bips_here": "So touched 😘 i was literally reading out that loud in the bus when i was coming from university 😘😘😘♥️♥️", "reshma.11_": "👌👌👌👌", "jahnvidhaka": "Will love you always ❤️❤️❤️❤️", "sree_vkn": "Damn true, ur thoughts are on point ❤️", "the__astarte": "I love the caption💕 this is the exact arguement statements I have when my mom says I am reckless in case of marriage.", "aditigoel91": "Wow❤️", "pallabi100": "Is it only about women being independent asking for respect equality ???? Aren't girls n women taking undue advantages of law made in favour of them??? It's not forgotten meaning of love that breaks marriages it's lack of understanding and capability to adjust by both parties that breaks marriage... Not only men r to be blame that's a predefine notation we have women r equally to be blamed for broken marriages", "happy_highh": "😇 beautiful", "suhail.rk.9": "❤️", "feeha_syed": "Shocked by the fact that you wrote this in 2015 because those are the same things we still deal with. The issues are still same and the growth is either monotonous or stagnant. In these years we could not make it possible to resolve. I hope in some years, upcoming, this won't be of any relevance. You are one in a million, your words dart@redheadwayfarer", "dhruva_087": "❤️", "monickaraju": "It's true we don't need a man to define us and one shouldn't settle for less but how do we know if what we have is less than what we deserve? @redheadwayfarer Also, I at times feel, we(as in all human not just female), in order to get better, we tend to ignore whatever good we have. At times I also feel we humans need love but are so insecure that we won't want to open up and give love to a person. This is just an observation.", "sach316insider": "Wooooooo...can't bit Indian beauty🔥🔥😘😘💓💓💋💋😍😍🙌🙌😊😊💕", "laveenarajwanii": "You r superb @redheadwayfarer ....", "anganagos": "That was worth reading di... ❤️😊", "santiibaba_thebiker": "I don't agree with u at all @redheadwayfarer .. u r probably wrong this time for presenting what u feel..which is actually wrong. The indipendence and equality that you are talking about is not a taboo, or a matter of insecurity..it is the wrong assumption of taking the terms Independence and equality which ruins any relationship..be it marriage or a relationship..😑", "sharmasshristi": "Beautifully written🔥", "medhavista": "This is amazing.", "the_mi_girl": "Drop dead gorgeous", "rishelr": "❤", "_astrea_0804_": "❤️", "gopika_mandal": "Needed this.. thanku.. m a single mother...💖🤗", "aanayaborah": "❤️❤️", "impriyankasharma01": "❤️", "smrutijaveri": "@simmi_koli read this...more power to u girl🤘🏻🤘🏻 u r more beautiful now thn u wer.. ❤️ fuck all the judgemental people.. 🖕🏻", "dr.va.si": "❤️", "oindriz": "Mind blown by that write up! 🔥", "soureddevil": "Today's feminists mentality 1) all women a are good but all men's are bad 2) all women speak truth but all men's are lairs 3) they say all women are strong yet, try to show that all women are victims and all men are abusers, rapist, molesters.4) feminist innocent until proven guilty but Men Gulity until proven innocent. 5) womens who are beaten in the home is highlighted but women beating men considered normal. There are thousand of cases where husband are beaten by there wife. Boyfriends are beaten by the girlfriend s But as per feminist how can a woman beat a man. And they laugh at it. 6) feminist also hate women who choose to stay home to be a home worker and to raise a family.", "justpreetwithsmiley": "True", "shimeowna": "@sabachandni ❤️", "apurva_singh_29": "You go girl.🙌", "maryjane_kng": "Woww❤️💙", "kun_ika": "🖤", "danila_t29": "@khrimeyninja", "mycurvesgotglitter": "Don’t settle for less ❤️", "shirazzz_": "Meri man ki baat😌❤️ thank you for this..@redheadwayfarer", "style_and_strike_rc": "Reposting 😍❤️i share the same thoughts😍🔥🔥", "agarwal7532": "Very well said saloni , it has to be in every individual’s mind.....i hope people should respect and feed them with equality..... @redheadwayfarer", "unconscious__buddha": "👌", "pooja.mouli": "Respect ❤", "5hambhavi": "@kavyasharma17", "nicolai_conti_": "A perfect couple is where both the partners are independent and successful, yet stay together n love each other. (Ps: by stay together, I mean stay happily together n not against the will.)", "soumen_saggi": "Yes, you are correct, this is how we all grown up which is totally bogus ...but now it's time to accept the challenges...all women should come forward...@redheadwayfarer you're an inspiration to all the women..🤘🏽keep on rocking🤩", "vaishhh.__": "@redheadwayfarer what about muslim women who are still suffering? Are you going to do something's for them talk about horrifying rituals for them. I feel Islam is the most orthodox for women compare to all other religion. And when you talk about women it includes all. But that I don't see in Muslims!", "ididanoopsie": "Inspiration", "shivani.x3": "♥️♥️", "dhruva_tara_": "Such a beautiful one ❤️❤️❤️ you are just a role model ma’am hats off ma’am ❤️", "iam_sid___": "True..", "wrappinglifeinbooks": "@_iti298 @jignasiddhapura 💜", "neha.sarkar_": "❤️", "solankimukehs": "😍", "ojaswinigaba": "U make me be strong with my thoughts and decisions love your spirit", "_hurricanee._": "🔥🔥🔥", "anmolkanwar": "So true 🔥 definitely reposting this one 💯", "anjali_schmuck_official": "Amen! Love this! ♥️", "sarfarjkhan007": "😂😂😂😂😂😂😂😂", "disha.nandy": "The harsh reality ..... but spoken in a good way", "wakemeupwhenpandemicends": "Deserves a million shares!", "sumaiya_kharbe": "@heena_k786", "sneha23___": "The fact that this still exist gives me chills but I still have hopes because people like Saloni are there", "forevercello": "Well said .. just apt❤️", "_wandermojo": "Said like a Boss... Truth all the way👍", "fixthegyroscope": "Was there ever a definition of love.? @redheadwayfarer", "manya___962508": "@redheadwayfarer keep motivate me😎😎", "_divaa__": "CAPTION❤️ @kritikachug @bhavyakumawat17 @prachiwadhwani01 @soni__sakshi", "07mehuljain": "This caption is everything 💯💯💯💯🔥🔥", "shilpe.e": "❤️", "suryavanshikamakhya": "Totally agree and I feel it👏🏻👏🏻", "n00rsharma": "Well said.... Totally agree with u🙌", "journo_vinaypande": "😂", "reetukapandey": "Absolutely right. Just love everything what u said👏👏", "mayur.jain.bbm_53342330": "🔥🔥🔥😍yes you are always right", "sankshipta0519": "Well raising kids nd making amazing food for family is not what tells dominance of men over women or making women only obliged to it... Some women find happiness in this..... Cooking food... Staying at home luking after everybody nd handling the whole house all together.... Is a big task... Nd which is appreciated by many men In the society....", "reena_panwani": "DAMN TRUE THOUGHTS❤️💯", "ansh_khattri": "y to shout about feminism in every post..cant u all lead a normal life..instead of creating an issue over everything", "happieness_within": "Well said🖤", "sendy_avril": "👏🏻👏🏻 u said it", "sharma_priyanka_": "💯👏", "weirdly9": "Ufffh! You saved me. As I am 26, the burden of getting married was getting heavier so I decided well ok lets get married with 'SOME' guy. No, I don't want to marry some guy I want to marry a human who knows how to be a sensitive being. 😍", "lamalakpadolma": "@passangdolmalama83❤", "bhatiankita": "Well you know what makes you more beautiful...? Your way of thinking... And the way you portray it...😎😎 Your words does make sense...😊 #stayup #stayclassy", "themanavguptaji": "Super Like", "the_happy_roll": "You speak my mind ......i just wish someday we could meet and talk on such issues in person.....i wish you more power, love and health. You are one of your kind ❤️", "sanu23tiwari": "I love your thoughts @redheadwayfarer and I definitely agree with this.", "mrudu.la": "❤️", "artbyvidhya": "👏 true af", "dr_nilanjana_simlai": "You just made the \" Abu bakr Al - Baghdadi\"s of our society more vulnerable and insecure ....one hell of a bombarding piece on women empowerment and feminism...more power to you and more wisdom to your pen ♥️", "_.shrutznair._": "Girl......💕 ur too good at this. Thanks for making my day. I can proudly say now 'I don't need a man to prove myself, I need a man to be my life partner not an owner'.", "sunshine_aru": "Have never read anything more appropriate and amazing than this .....♥️", "rohitmundra96": "Apt. Needs to be talked of More @redheadwayfarer Been such a inspiration through your thots. MORE POWER TO YOU ❤️", "siddhi7484": "❤️❤️", "lookbeyondlooks_": "Beautifully written❤️", "pritysarkar1298": "Respect💝🙏👏👏", "nithin.chakravarthy16": "❤️🙏🔥", "__sprajakta__": "👏👏🔥", "sin_shivani": "❤️", "__miss_shreya_": "3000 likes for the caption🔥🔥", "rumi_das1495": "@savannahdaphene just last night we were discussing same thing😅", "mani__shiii": "@rxginiiii don't settle for less than you deserve.", "sahil_chopra3": "Best thing i saw today", "ambujanaik": "YES. YES. YES. 🙌", "surbhi_kaul": "You write so beautiful and true. Love and respect 🙌🏻♥️", "amrit_thesufisoul": "@redheadwayfarer power to u girl.", "peehu.jaiin": "Love it❤️", "giri17898": "So true, everyone needs to hear this. They say marriage is all about compromise one should adjust but why? Only because we love someone and we want to be with them, we cannot run back to the past because it's familiar, how can we not love ourselves first? Or we are afraid of being judged? There is one life why make a compromise with it and regret it later when you can do nothing about it, fuck the judgement, stand for yourself because if you can’t love yourself, you can love no one.", "sojournmagnets": "Hahaha You've poked the 'MARDS' out there.... Can't stop laughing while I read the comments of Women appreciating and that of other Hoomans degrading what you' ve written.😁 BTW I LOVE YOU GAL.... 😍 You are the salt to the wounded society😆", "gambhirgarima": "Thanks for writing this. Have fought a battle inside myself for good 1 year now getting prepared to fight this with everyone else.", "hudaaashaikh": "God damnn..That's so on point ❤️", "prashantkdubey19": "All are true, and thanks for sharing and salute your courage for what you are doing.. just want to know your thoughts about different type of relationship just you mentioned polygamy what's your thought on it.", "weekendwandergirl.kom": "You wrote everything about what I have been thinking lately. So apt❤️More power to you", "kruti_a_joshi": "@iamlilteddy ❤️", "malhotrar186": "🤗💝😚🌹😘💖😍", "theiggrowth": "The best best best sayings... 🙌👌👌👌👌👌👌👌👌👌👌👌👌 My words can't help to define this beautiful statement.. Fabulous🙌🙌🙌❤️❤️❤️@redheadwayfarer", "chains_charms_official": "Follow @chains_charms_official", "stellar_ellipsis": "🌸", "shruti.92": "@ankitmalhotra7290 Caption. 🔥", "thedastardbastard": "I couldn't agree more with on all points except that everyone needs to feminist. If we are talking about equality, lets talk about that. Feminism is creating an anti-men wave, which if catches upon will reverse the trend and make a women superior society. Let there be equality between all humans. I have a problem with the word feminism, although it preaches equality but then why use a word that leans towards a particular gender? @redheadwayfarer", "poojarajbhar_14": "🔥💯", "_monika._.singh_": "Love the content you've written! Sad reality we as girls are facing even in 21st century! 🤗 @redheadwayfarer", "aquashimmergirl": "So well said gal. Keep rocking you gal🔥🔥🔥 love tons 💓😍", "shvetz_me": "Couldn't hv asked fr a better way to describe this feeling. @redheadwayfarer you are so fucking On Point. You really made my day. Wish the society understood this and makes the path easier for women to choose their lives for themselves. 🙏", "nidhibagri3001": "I love how you narrate the simplest and the most complex feeling so honestly!", "aapurv_": "Hate the fact that all you have written about how majority of married women are treated is true. I've always wondered why it has been so hard for a women to walk away from a relationship/marriage where she is treated like dirt or an animal? Maybe they were too dependent, maybe they didn't wanted their kids to suffer or maybe in fear to lose them, additionally back in days a divorced women meant nothing and was treated like some kind of whore or a witch and this is not just because of ''MEN'', its also because of stupid morals and ethics Indian Society has, do you agree? @redheadwayfarer", "nabanita18.dg": "@redheadwayfarer each n every word is fact what u hv written.....I feel world will be a different place if all of us think the same...", "suman0910": "❤️👌", "aj_sabu": "👏 couldn't be more articulate! ❤", "anushkamalik25": "Very accurate ❤️", "manishi_tiwari": "Beautifully put. You simply penned down every woman’s thoughts!♥️♥️👏🏽👏🏽", "makeupbysupriaarora": "Can I Repost in IG story ?", "patranishu": "Huge respect 🙌🏻🙏🏻", "tanniyadas": "Beautifully written . Thank you for always making sense to things that we women don’t know how to define or put it across❤️❤️", "whitecheezindia": "👏👏👏👏👏", "babyginger_17": "WOW🥺❤️", "aakansha_singh85": "This is so beautiful ❤️", "apurva_vairal": "@redheadwayfarer I just can’t thank you enough for this post ❤️ u give me strength💕", "anjana_singhi": "Love this💕so relatable!", "muskan_agrawal_45": "@redheadwayfarer u r the face of change and strength.. ❤more power to u and keep throwing up this fabulous works.. U inspire brilliantly ❤", "_vaishhhuu_": "On point !", "ripsythourani": "You wrote everything I had in my mind, but fell short of words 😇 more power to you @redheadwayfarer", "__spell_bounded": "Truly inspiring 👌🔥🙌", "darpankanu": "Preach girl! I'm amazed eveb in these 4 years, nothing really has changed", "harshatandle": "😍", "rockysingh6969696969": "Where did you copy this from?", "surabhidawande": "Wat about your book😰", "radhika_7599": "True ma'am❤️❤️❤️❤️❤️❤️", "nandini.aggarwal2": "Damn tru, society need to understand this , we live in a egalitarian society now!! Everyone has to accept it even women, I love your post#independence is so good , b free girls n know urself", "the_night_painted_blue": "🔥🔥❤️", "ayushi_toppo_": "Bang on girlll🔥🔥🔥", "abhinav_chawla03": "WOW!", "kashbabydoll": "Brilliant 👏🏻👌🏻👍🏻 was much needed to hear out today 🤗 Thanks for sharing & loads of ❤", "anikate_monish": "In marriages and relationships thier will be lots of fights , their shoudl be little adjustments their should be little compromises ... If two egoistic persons stay in the same house i dont think so that they will be together", "mandydisha": "Accurate😘💕", "cheshta.menaria": "On point 🙌🙌🙌", "tejaswani_singh": "More n more power to you ❤️", "abhishek_m08": "Even in 2019... Typo @redheadwayfarer", "thenerdynomad_": "How do you make sooooo much sense 🧡", "kajal_nagrale": "✊💪❤️🙌", "phoenix_outta_ash": "Huge respect", "thelifeofsesh": "So powerful! Keep growing babe💓", "mahisingh236": "Fuck all the Orthodox ones and the mentality that only support men...And always look down on women", "spandannshukla": "Woaaah", "kara367": "Love the words written so beautifully!!! It resonates so well for Today's women. Thank you !!!!", "akritivyas090": "I have learnt a lot ❣️❣️ thanks", "manisha.saxena": "I love you so much .. your posts are amazing ❤️I wish this happens real soon", "__shah_palak__": "Daamnnnn!!!!!!!!!❤️", "abbz_82": "Beautiful picture ❤️", "lavishakalraa": "💯💯", "s022001": "👏👏👏", "justagirlfromkolkata": "❤️", "mishtix_x": "Always on point. You literally said the words I had in mind. 🔥❤️ There are so many women still out there rotting in their so called \"sasural\" while their husbands and their family members are scooping the life out of them (in so many ways that one can't explain). But they remain silent because they were taught \"that's the right thing to do\" and most of the time have no choice. As more and more women understand what they want in life, as they get more educated they now know when to exit or show the door and that is so very important. 🖤 More power to you.", "gharsha.dr": "👏", "karishmar143": "So inspiring!!!!♥️♥️@redheadwayfarer", "babylover__07": "Caption🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "nisha_370": "😘😘😘😍😍😍", "prakharrrrrrrrr": "You're outdated and don't speak the truth. You only stand for what you think and whatever gets you in highlight.", "angel_kinju27": "👌👌👏👏", "sukhjeet_21": "Words👏👏", "tripatleenk": "Powerful 🙌", "tgzoku": "😍", "coffee_chua": "@nagendra.chauhan.7 @jayu_singh", "yagya_singh6": "Damn @redheadwayfarer 🙌🙌🙌", "nakhhrewali": "The words sumed up everything I guess the society reflects 😍🙏", "_thesugarcandy_": "💯💯", "_parul_chugh_": "Keep thinking the way you do and keep writing ❤️", "ds_anjlee": "❤️", "nehha_kandhari1986": "Word 💥💞", "ritopa0303": "Beautiful❤️", "deepashree_vedpathak": "😭😭😭❤️❤️❤️❤️", "riyasharma7790": "May I repost this?? You're amazing", "supreet8638": "You are so beautiful ❤️", "sunshineveer": "Needed this so much♥️..repost at the exact right time..thanks a lot @redheadwayfarer 💕", "abhijeet007ji": "After being independent still alimony", "kumavatshekhar": "Ye photos aise post kartihai jaise Aishwarya Rai jaisi beauty Ho 😂😂", "richa_mourya": "Well written, as usual 👏❤️", "getting_inspired_": "Your writings are so beautiful ❤️", "khyathigarapati": "Love this", "archanageethasharma": "You speak my heart", "sanssskruti": "THIS IS SO GOOD", "shivanipr_": "❤️❤️❤️", "kaay_zaale": "There's no limit of extent upto which some men can go to stop women from going out and breaking boundaries.", "garima_chittoria": "Wow🙌", "mehta_paulomii": "🤗♥️ 😘", "tyagizclicks_2": "Ok"}