{"_saxam_": "🙌🏿🙌🏿🙌🏿", "__andre.n": "Word!", "_rohit_sin_": "ooooohhh so this must be the legit solution of rape naa didi, government need to be consider this coz implementation of law is not bit important. core social knowledge for men specially for youngsters is not important. choosing this option and promoting fake feminism with a tincture of fake influence might work 🤔😏 and talking about your so called problem didi that every mother and bla bla bla so let me tell you one thing this is 21st century and i think uh have an idea of that.here a responsible spouse think over her daughter and give equal right coz i have an elder sister and i know how things work in the ground level and i feel weird that i am talking about this right thing in the first place. didi kabhi to fake feminism se hatt k socho kabhi to legit solution ki baat kro.. peace 🙏", "paliavi": "They set the curfew for their daughters bcoz they know that those rapists are standing right outside their house.", "udaipurshutterlove": "Mere ghar m to meri sister se jyada mere per curfew tha 😅", "17illne_uwu": "I have a problem that as a son I have a curfew. What now ?", "dg_selfmade_rare_precious_dna": "🙌🙌💎irony words..those every... men who r sick from their mindsets,parents must give proper basic education of humanity and yet caged them from teenage till they know to be a human,respect women in every way..Mam as a real men and other good humanity men's out there r deeply ashamed of our own gender for some .......and dont believe in our country laws....Worst karma law must be followed....Burning or killing their life or their that ...organ must not be there....Or else its never gone to stop..Our majority society and backdated parents cant update their mindset towards women...So till they r not updated,this law must be applied to those...So rest all the women's and men's who want change towards women s respect must do it together...To destroy this ..viruses from the world", "sneha.gautam": "True ❤️", "m4rocaine": "Please shut the fuck up", "pandey_001": "@redheadwayfarer i agree with u, every mother on this planet do this because they know how cruel \"society\" is....", "robedoe": "Yeah cuz her son definitely gone walk through the door pregnant 😂😂🤣🤣🤣", "babiebunne": "I AGREE.", "mahika_trivedi13": "Being gender biased is wrong... We understand but then these things take time to change... And this will be a big change so it's gonna take a lot of time... There are people in India more than 60% of Small mentality and those are the ones to commit these rapes... Can u explain this to them... .. educating children would help reduce rape rates in future but what can you do about the current male adult generation (men above 20yrs)... Those drunkards in the name of alcohol took out an innocent girls intestine... Can you do something right now... No na... Then stop commenting about education... Because it's already happing in INDIA... People are educating there male child to respect women but currently just changing the education system won't help... We need to talk about a bigger action to be taken for these rapes happing currently by the current generation male adults... 🙏🏻🙏🏻", "sonali.singh30": "Very well said !", "ashima_colorsnglitters\nVerified": "Verified", "raza_k_": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "garima_pathak_7": "On point!", "doublecheesehamburger": "I'm pretty sure those mothers are not on Instagram!", "srishti_pandey18": "Very well said😟", "manjushreesamanta19": "👏🏿", "miss_arpana": "This deserves a standing ovation.", "sid.privvv": "How do you guys have so much time to write paragraph after paragraph about this😂", "mxxzen": "I have a problem with every mom that does otherwise for the daughter", "julayrh": "👏", "parinika_sharma": "Don't teach your girls to not wear short clothes....... Tell your boys to not look at them with demonic eyes. Don't teach your girls to reach home early...... Teach your boys to not be threat to girls who are out late. Restricting your girls will never stop rape and harassment..... Teach your boys to respect girls and women and this will come to a permanent end. #teachyourboys#priyankareddy", "rishabh.goel.1800": "Well said👏👏, not a single thing is gonna change until the mentality of the parents and their upbringing is changed", "roadiewithcody": "Somebody tell TI", "aaravtalks": "So well written! This had to be written, loud and clear!! KUDOS TO YOU!!", "inaya_aabir": "I just cant understand why the government cant change the rules If money can be changed over night then wth cant the rules be changed I just dont understand this happens every day every night every hour as there are no strict rules and punishments Make the rules so strict that they even fear thinking of doing such things We fail as human beings we just want the politicians who come to beg during elections.. wth are you doing now Iam ashamed right now being an indian Not a proud Indian anymore So sad cant say anything just torture them so much that others shiver even thinking of it 🤬 *take a screenshot of this and share with everyone so that the government sees this not doing this for likes or something its just that Iam ashamed being a Indian😞*", "_burnthoney_": "I agree. And it’s sad that so many people want to troll and argue over it. Keep it up. You’re sharing things people need to see.", "msub57": "Why not maa??🤔", "karina_.1": "🙌🏻", "devyani_sharma_06": "@redheadwayfarer Ma'am what you are trying to propose is equivalent to impossible in a country like India! I am astonished at the fact that there are so many female leaders and politicians yet there are no stringent safety laws for women in the country! And more than anything women are the worst enemy of women!! The unwarranted freedom given to every man is supported by a mother/ mother in law/grandmother/sister. If all the females in a man's life show their strengths... I don't think that a man can ever look down on any other women. But in our society a boy since childhood sees his mother putting restrictions on the daughter, adhering to the \"societal rules\" of being an \"aadarsh\" bahu or wife and sacrificing everything for others. What you believe is absolutely right....but unfortunately our country isn't worthy of such people with good and normal thought process.😓", "logan1311": "My sister has a later curfew than me :(", "prashant.kumar21": "@ushaparmar784", "waly.9": "ok when your daughter gets raped dont talk", "writer_rv": "Incredible #India ki Incredible #Story Everyday more than 89 \"#RAPE\" cases are register in India. India the place where women's are #worship_as_goddess. A Server says that in 2017 - 32,559 \"RAPE\" Cases has been registered. When ever there is a rape in India people just start posting #status or they conduct the #candle march. But they never ever think whats next? Does this really #help someone ? Does this much really change something or the things are the #same? This thing only create #pressure on the #government,and the government start #blaming each other.This is because of #Congress or this is because of #BJP. What's the end of the #story. Nothing is #happening &the #same_cycle repeat itself. Ask your self who is #responsible for this #Government or #people_of_India. What is the Solution for this...? There is only one #Solution of this issue.This human animals handed over to #indian_army and when army is giving them a #punishment. Just give it live to #media.Beat them that much they came on #verge of death, give them #treatment,and again #beat them. Then just #Repeat the cycle", "itznanaxo": "This is so true. My parents keeps me in the house because they afraid I'll get pregnant or sum shi", "mananpotterhead": "who is she to addressthe issues of the nation and lecture everybody on every fucking issue , is she a neurosurgeon or a PhD in theoretical physics from MIT. she is someone who herself depends on lust of teenage boys stop earn her bread and all the plastic she applies to look decent. She is someone who has never learnt to achieve something but has only learnt to blame others for everything wrong in the world. She who only keeps posting about this unfortunate incident just to get more likes on her posts. She who will call me a troll and people will support her just to look cool. She who is no intellectual but an obnoxious, judgemental personality whose only achievement in life is to post semi nude pics on social media to woo horny followers.", "s48z_": "👏🏻👏🏻👏🏻👏🏻👏🏻", "c.nikitha26": "Exactly. Everything about a woman is taboo to boys since a young age. Gender gap leads to inequality and moral looseness. Unless that gap is closed we cannot have a safe society.", "_sania.n": "Been there and it hurts! So biased. I'm with ya on this!!! 🙏 Charity begins from home!", "meesha_hasan": "👏👏", "la.ville.du.cum": "It’s because females are more at risk of getting harmed at night than guys, it’s basic logic I don’t know why this is such a big issue.", "shellyxantana": "You guys are mad they protect you more???", "manjeetrohillaofficial": "HINDI RAP Justice for Priyanka Reddy. Must watch #justiceforpriyankareddy 🙏🙏. 👇👇👇👇👇 https://youtu.be/BSn2opRV21M", "mayankbalor": "There was one TV series handmaid's tale in that a women was raped so they gather all the women and men who raped was bring and the all women beat him to death this is perfect for that monster", "_zoemeier_": "I absolutely hate this. I was fortunate enough to have a mom that trusted me, and was never given a curfew. Really I was one of the few that never stayed out past 10 so there was never a need...", "dont_be_a_richards": "Girls have a curfew because there parents don't want there daughters to be raped and boys don't have one cause they are doing the raping.👧🗿", "l_w_nz": "Why blame mothers? Fathers are equally responsible raising their children", "ishii_fishii": "@hinal2", "rahmxt_shk": "🔥🙌", "iamshafiya_alex": "We should definitely stop blame game. Blaming mother isn't good. What are we doing just posting stuff sitting In AC rooms. If you wanna change it start it from yourself. I'm feeling really very helpless. I remember when I tried to stop some stupid boys commenting on a girl the other girls was supporting them and when I reported in my college about the incident these girls were standing by these morons. Such a shame that we women don't support other woman.", "amrithavanisuresh": "😢", "vln.mayankpurohit": "My mother set a curfew for her both sons, cz she didn't have any daughter, i guess she nailed it.😊😁", "_chetna061195_": "❤️🙌", "productivityqueen": "We definitely need shout louder about this more! Cultural toxicity is very dangerous to the upbringing of our young men and women. This shouldnt be the norm.  We get it, there are some bad people out there with bad intentions, both male and female.  Men and women are equally accountable for their actions. Women shouldnt be oppressed, they should supported, empowered and protected in a way where they arent made to feel the blame and fault is put on them! There are responsible and ambitious women out there who cannot fulfil there dreams, due to these limitations, the curfews and this toxic way of thinking", "isukapalli_": "💯🔥", "shakshii.__": "👏👏", "super_gigglessss": "❤️", "dcool_amitdhyani": "https://youtu.be/dKrVi4vp1iw #hangtherapist #justiceforpriyanka #justceforrapevictims फैलाते रहो जब तक लोग ना जाग जाएं और सख्त कानून ना बने ।।", "_dr_diksha": "Lets not make this about any gender, let's not again talk about feminism here, its about humanity that is missing in those who do these kind of shit, so its not about being man, its actually about BEING INHUMAN !", "mishalalikhan_": "@rabiyaalikhan", "saltycerealx": "Hi, I’m a new meme/TikTok page💗 please help me get to my goal of 100 followers 💗", "debashish_biki": "What happened to the other woman, who was found near the same place where Priyanka Reddy was found? Nobody talks about her.", "rafey_04": "Sub say bara jhoot mere ghr ma 10 baje kay baat ju curfew lagta hn. Kya level ki basti hoti hn late ane pay ap ki sooh hn", "anon.ymous2466": "The thing is the one's for whom this is written will never ever read or can comprehend this.", "fattylipidss": "Girls are only made to pleasure us men", "ms_mittal03": "Areeey bhyii kiske liye justice maang rhe ho uske liye jiske saath ye sb hua ... Ye India h yha kch hone se rha bs jyda se jyda Kya hoga sjaa milegi kch saal ki uske baad vo rhia or issey jyda kch nhi vo fr dubara krenge ye sb justice hang krne se bhi nhi milega sbse phele khud ko smjhao Kya pta aaj hum sb posts daal kl ko hum se hi koi kch krde ..... Apni ldkion ko Mt sikhao glti unki nhi h glti hmare yha court ki h Jo kch krte nhi h unhe tbhi sjjaa di hoti toh or itne cases nhi bdhti jitne ab bdhe .... U just think and then blame anyone.....", "scorpiondivine": "Are you a RAPIST or ENDORSING Rapist Culture? Well YOU ARE IF- 1- U think that it is her mistake that she get raped. 2- if u think that a girl should not be allowed to go out in the night. 3-if u think that it is her clothes who provoked the rapist. 4-If u deny the independence of a girl as a father, brother or as a husband. 5- if u think that a girl is a prize to show off or a property of a man. 6- if u think that a girl is a second class human being. 7-if u support the honour killing of girls. 8- if u think that a girl can not choose a life partner for herself. 9-if u judge the character of a girl on the basis of she having many male friends or having a boyfriend. 10- if u believe in the typical definition of a man. 11-if u dont let a man be weak or mock him for crying. u can't build a generous society for girls if you dont allow a man to be weak. 12- if u vote for a rapist in elections. 13- if u prefer a male child over a girl child. 14- if u ask for a dowry in marriage or harass a girl for dowry after marriage. 15- if u think a girl drinking is asking for sex or asking to be raped. U sterotype the women who smokes. 16- if u think less of a girl who is in physical relationship before marriage. 17- if you judge a girl over her clothes. 18- if you try to click a girl picture with revealing clothes without her consent to share with your friends or on social media. 19- if you can't control yourself after seeing a naked girl. Accepting No as No. 20- if you share vulgar info about a girl just to have a laugh or otherwise. if you comment vulgarily about a women body. #This is just a small list including most general traits out of many for someone with Rapist(endorsing) capacity. #This list applies to both male and females. Be educated not trained. Look inside then blame the others, Help better the society by changing yourself. Share this list with your friends and family to get to realize the Rapist inside them.", "adityaatomar": "Part of it is true but calling your parents gender biased or claiming everything as patriarchy is sick. The thing is, the whole change you're talking about is a long term process which definitely should be carried out. But what's the immediate solution??? You can not change the whole system all at once and you know that . You gotta see this once from your mother's point of view. If you had a daughter and would see these horrible things happening around what'd be your call? Equality or safety? Even you would do the same thing as your mother and that is really unfortunate and I'm literally sorry about that. But you're being a little too harsh. this can be toxic for some people who i care about and some who care about you more than even you do. What needs our attention is these predators pay for their deeds and that too publicly to create fear among such men. These things happening prove that there's no fear. Law needs to be stronger against this just like UAE. Punishments should be scarier than even death penalty. Period.", "vinay.pj": "Very well said .also mothers should teach their sons the value of any women inside the house and outside the house! Same way a girl is brought up by a mother ,should also teach her son too. These rapists mostly are uneducated n some are educated .in India when a boy is born he will not be taught of shame in first place .if the boy doesn’t value himself then what will he value others !", "_.xsaviox._": "These long essays and captions wont change things... Take every freedom to the fullest and get access to everything Boys acquire... There is absolutely no problem... But if something happens, who are the ones to suffer..?? Feminist arguments will not change the mind of a rapist when he is in front of u biting his lips for ur Blood... Understand the basic human Nature... Men are not superior but they have an upperhand than women... That is true... Whatever arguments u bring forward, its gonna go wasted... We dont suffer pain every 28 days(huge respect for every female who goes through excruciating pain every month), we dont get pregnent, we are not the ones the society will blame aftr something bad happens... Ultimately u r the ones who would suffer... Our Mothers know where to put curfews and Be sensible than criticising...", "raunak_kadyan": "Here we go again 💁🏽‍♂️", "amitaahluwalia": "👏🏻👏🏻👏🏻", "navaf__": "Seems like noone hava a problem with the government who don't care about all this.", "_sukhwinder_13": "🙏", "dhruvshermeh_": "What kinda bs is this? If you're old enough to rape a woman then you shouldn't be loving with your mother", "_yenuuuu": "Damn straight.", "_a.b.o.o.d.i_": "0ur country is not safe for women rightnow... Agree?... It was safer... Agreed?.. now... Our wo men need to be secured from those wild animals... Wild pigs... Roaming around... They need to be punished as bad as possible...agreed?... Now... Till the country is safe for women we need to takecare of them.. and they need to take care of themselves... And take the neces sary precautions... cuz bura waqt bol k nai aata... Our parents are wrong to do this.. you say... ?... Ok i agree... But they do it for ur good... We need to be safe... And help our women to be safe... Only untill the area is clear... And safe to roam outside for good at day time and night time... take care of yourselves women!.. stay home and be with you families... Only untill the place is cleared from those pigs..and i hope and i am very sure... india will be a better place for women soon.. i hope u understand what i am trying to say.. #rapetherapist #hangrapists #makeindiagreatagain💓🇮🇳 jaihind", "wander_mystic": "Just a question that i didn't got an answer to. is Open for everyone who sees this comment to reply : Parents include a female and a male, family includes male and female.. society includes male and female.. they why or how did this evolution happened? Like why did in the past of the human history did the parents started to treat male and female in different way..? Why did it happened that way... ? And why boys are not treated as the females are treated? Who is responsible? Male or female?", "laiba.___.murtaza": "@amman_lashari", "version0max": "DO NOT BLAME THE GENDER, BLAME THE CHARACTER !", "nidhihosamane": "@diya.aneja @ your mom", "marzia.begum": "🔊", "ramchand178": "The video you need to watch is in my story.. 😓 It will disappear in 2hrs", "wtm.luke": "i dont get it, we are different thus should be treated differently. there are things men get and women dont and there are things women get and men dont. also im not saying one is inferior to the other.", "rikvin": "True", "79_annejo": "Fucken oath 💯💯💯🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "xxkefalas": "Men and women are different , get over it", "ady7_": "You should not have a problem with mothers who have a curfew for their daughters. They are just doing their best to keep their child safe. You should have a problem with the people on the streets because of whom a curfew is set.", "ishanbisht97": "My mom does set curfew for me", "nirvika_15": "😯😯", "fishouttawhisky96": "Well i think I'm grateful that my sister has a curfew. 🙄 Am i wrong?", "yourbrowncurlfriend": "YESSSS", "sarahnushkaya": "🙏This is so important", "anika__maniam": "Veryyy truuuu👏", "farrahidris": "@sassy_scholar 👏", "aeshita.sharma": "Maybe if we spend enough time educating our sons that caging our daughters, something better could come out of it! #teachyourboysbeforeyouteachyourgirls", "shubhamkumar.18": "It's more about the psyche and the upbringing. You can't blame every guy.", "riyajain2101": "I couldn't stop crying for two hours thinking about what #priyankareddy and all those victims must have gone through. Hearing these increasing number of cases day by day, I think I have now lost hope if we'll ever be able to see a better future where my parents would not fear sending me out of home. I now doubt if we'll ever be proud enough to say that - 'Yes, there were once a fear of rapists, now we are free from that fear'. I doubt if we'll ever be able to say that!", "tylerroh": "This is moronic", "life_in_a_jacuzzi": "Parents r not panicking tht their son will rape someone if he is out late at night: becoz they know tht they have given him good moral values, due to which even if he is out late at night, he won't do anything wrong. & those men who rape, their family r themselves very moral less, low minded, men from such family can rape even in day light.. No need to wait for night. Parents who stop their daughters from being out late at night: becoz they love their daughters & want them to be safe & alive. They cannot take the risk tht some cleaner or slum dweller or driver will not rape her. In no era, in no place of the world was a women safe..women, diamonds, money has always been a thing of intense desire. Women is also powerful in tht way..she can get what she want using her beauty. In every era there will be some \"villain\", who will want to kill someone to take away money, or get the woman. Being safe is just an act of \" wisdom\". The society has deteriorated due to several factors, & all factors r connected..", "kaamaraaj_": "But i guess why should a girl or boy stopped from being out at night.Better they need to be teached about sex,opposite sex ,their rights,after effects and treating a human being that essentially include girls with respect even if she is sunny leone.", "azeemq101": "honestly i would struggle more letting my daughter out late at night vs my son but i do agree its the right thing to do", "ayan.m5": "I honestly dont have a problem oh wait dats cuz I'm a boy 🤣🤣🤣", "nidzz.privv": "It's high time they get punished! Punished as bad as their Thoughts and Actions ...cuz if not it's just another rape as others in our country", "_hr_14": "But not every boys are like that ok. I agree with your statement. Our India is a fucking bloody rape country but putting it on Instagram post doesn't make any difference as if u revenge on government to let them give an big punishment(hang to death) then may it get less don't ever underestimate all the mothers", "shreeyazala": "@nishita2802", "sakuniii": "@shehaanw_ mhmm.🤨", "sakshijain.2504": "@redheadwayfarer the only post which matched my thoughts..... It's all about upbringing..... No law can do anything for a longer period of time...... But upbringing can🙏🙏🙏🙏", "_yash_deshpande": "Yeah because you’re living in India, where girls need to be protected❤️❤️", "guntaaj": "👏👏👏👏👏👏", "ankita_sahoo__": "The deep rooted problem of India. So true. This is the only solution. 💯", "pokerfacegupta": "Bang on @redheadwayfarer", "tamannahanda_": "BLOWN.", "divi_dii_my_angelll": "Those words 🙌", "seedivija": "Daughters have a curfew BECAUSE the sons don’t :/", "chauhan.sabhya": "YES🙌", "priyasmitaray": "But you know @redheadwayfarer education is a more longer term solution for this. As for now, we need capital punishment for the rapists and molesters. If upbringing doesn't work, then fear sure will. It has to start somewhere.", "shaurya_awasthi162": "Yeah this is just some brutal feminazist shit Our contry's scenario is like that whatever you do, girls are more likely to be harmed in the night our people are like that changing curfews won't do shit tho she's right in saying that guys should get curfews too Cause or country is unsafe for both boys and girls take child trafficking for example stop making one-sided arguments and try to be just for god's sake every guy isn't a rapist 'Ive heard parents say, \"But girls get pregnant/raped and boys don't\"-men are the ones that are committing the rape or equally part of the pregnancy, so why treat them different?' Wth curfews are needed if the kids (yes I said 'kids' not 'girls') live at an open area which are mostly not safe If you're living in a safe environment like an apartment enclosure or whatnot then who's stopping you? do whatever you wanna do YOU should stop being gender biased first if you want people to", "ruchixgaur": "There are so many problems I have with mother's who set rules and standards for their daughters but not the same for their sons. Unfortunately, Indian women are often complacent in the patriarchy.", "abibarman6": "You have written it so honestly ❤️", "sumit_x_x": "Preach girl 🙌🏻🙌🏻🙌🏻🙌🏻", "festival0156n": "Which parent will think that his son will rape anyone? Don't normal people normally teach their children not to rape? But it is comparatively much more difficult to ensure you're daughter does not get raped. Parents are just worried, when their daughter gets killed, all these so called 'anti-sexism' posts on social media won't bring her back to life. They have a right to be worried.", "_shweta_uttekar_99": "You nailed it buddy🔥🔥", "pre_1213": "Why mother's are being targated here, one way or another are women the only one that are blamed", "anksshita": "Yessss louder for the people at the back 🙌", "tina.jindal": "🔥🔥🔥🙌🙌🙌🙌", "adityyuh": "Things aren't always so black and white. Some people just want their kids to be safe, man. They set deadlines because she's unsafe out there, not because they want to oppress their own child. We cannot assume that people will set a deadline for their \"rapist sons\" just because we expect them to. At the end of the day, it's the woman who's in danger. Teach her to defend herself. Arm her with pepper spray. Inform her about which areas are unsafe. Drop her home safely.", "shreeja.tiwari": "I've seen mother's giving their daughter nice lecture on how to be on time before sunset, but their own son returning home by 10pm.", "beinganushasharma17": "👍👍", "vanshikatyagi._": "Well said mate", "its.me.jaffer_ali": "Any mother wouldn't teach her son to be a fuckin rapist. And please it would be better if you say teach ur child to respect everyone nor blame everyone.", "rehnuma_halal777": "I remember when I was in a mosque they said \"we love our sons but we raise our daughters. Our sons can go do whatever they want but our daughters need to stay inside and learn morals. Thanks to our superior boys and girls can now study together but before girls were properly disciplined at their houses.\" And I was like \"this type of sexism in 2019 i- 💀\"", "prarthona_xo": "Preach!! And also who’s to say that the boys are not going to get raped or mugged or killed? This is also a real thing, parents. Boys CAN be in danger just as much as girls.", "babababbabalost": "Trueeeeee", "umul_vara": "Yas and Yas!", "husain.karachi": "Yeah. Differentiating between boys and girls in not justified. But I clearly don't think it's the parents who are at fault here. Parents care about their daughter and want to prevent her from mishap that someone else's son might rape her. Talking about boys, no boy tells her parents that I am gonna rape someone today.", "riyamaloo16": "👏🙌", "equinoxe_7": "All of you are gay", "aintyourbitchh": "And the worst part is, most of our parents dont use social media and they are not able to change their thoughts.", "pavithraphotography": "Speak it!! 🙌🏼🙌🏼", "nivinivethanivivivinai": "👏👏👏👏👏", "princely___": "Ur words are really true. Upbringing is root to this problem. But do u really think posting this on Instagram is doing any help? Any mother who will be reading this post on ig has taught his child all things. Nothing Will happen by ur posts mam. Only stricter laws will make fear amongst every one and thus Rapes will stop", "perhaps__cow": "I have a curfew too and I'm a guy. Moms are overprotective about daughters because of monsters lurking in the night. These monsters don't see the gender, recently a minor boy was gangrap*d but no outrage. A few days ago a guy was stripped, tied and made to walk around the school naked by his female teachers he later committed suicide and there was no outrage. Another 17yo boy was raped at night and they inserted a sickle like object in his ass and he died too. These incidents are rare when compared to women but no one outrages just because they were men. Our society is twisted where men are shamed for the crimes committed by people belonging to their gender. This male guilt should be stopped both the genders suffer equal social injustice. I know I'll get a lot of hate comments for expressing my opinion but I give 0 fcks.", "jagdeepvirdi": "Everything starts at Home. Everything kids learn is from Home. We as a society have to change. We ourselves don't realise how our outdated habits affect our kids. Father shouting at Mom, demeaning her front of children, the son learns it is okay to do that, daughter learns to tolerate. Simple thing as Women belong in Kitchen. When Dad is allowed to rest or watch TV is wrong. I have seen one of my member at Home who never picks up his plate and expects his wife to do so. This is so wrong. And that's what kid is learning!", "lasyaindrakanti": "PREACH 👏🏽", "radhikamody": "Should we say parent instead of mothers? Why blame the female parent. It's a shared responsibility", "mk_sherine": "@stellar_mammoth", "wanderlust1906": "@jainamsanghavi @moxitsanghavi caption", "__.aish._____": "Well said... 🔥🔥🔥", "taniishaa.07": "So true ! ❤😭", "_._amritha._._": "Well said..👏👏👏", "jazzc00": "@rim4_21", "mentallyjudgingbitch": "Parents don't want their daughters to roam late at night because of \"men out there\", if that's the logic then parents should stop sending their sons so they don't become those men! Or else just let us all be free ffs", "armaalians": "Whatever you said is absolutely right. But just wish you'd started with mother and father. Instead of holding only a mother responsible for her son/daughter's upbringing. These little things also show gender bias.", "just_thinks": "This is important", "ridhisood": "😂😋", "babe.pluto": "periodt", "_moody_writer": "Do you have a solution in mind?", "anonymous_poettt": "boy's, is there only my mother having curfues for me 🙄", "__little_snowflakes": "\"Arey nahi nahi humara ladka kuch galat kar hi nahi sakta\" is the staple answer for indian parents if you ask them why they don't control their sons😑", "variaeternal": "All those mothers with this mentality about caging their gurls shame on them they are true kalank to all the women kind", "tripathi_aditi_0504": "😢", "sonalllzzz": "Why are we blame the mother is only? What about those fathers who don’t teach their sons to respect women and men equally?", "nickiegiggles": "@daisywalchx", "charming_chats": "It should be #betekosikhao not beti padhao. Please teach your boys to respect other gender nd not behave like a monster. 😠😠😠😠😠😠😠😠😠😡😡😡😡😡😡😡😠😠😠😠 My heart goes out to hear these stories. So shameful 😩😩😔😔😔", "atinshabhargava": "Can we tell the government to wakeup and punish these demons, i’m so helpless and tired of these heinous crimes, its breaking my spirit. I don’t even want to have kids now because i don’t want my kids to live in this world.", "m.o.h.a.k_": "Jb tk thokenge nhi tb tk kuch badlega nhi... in rapists ko sirf thokna chaiye, no fir no talks direct encounter.", "audaciousandfar": "\"The rapists should not be killed , the families of the women or girl who gets raped suffer their whole life , the punishment that should be given to such rapists is the punishment Shivaji Maharaj gave to a rapist , he told his servants to cut of the rapists limbs (hands and legs ) and dick and to take him to the chowk or a street where every passerby can spit or kick the rapists how much they want , he told his servants to starve the rapists for days and blind them . He told his servants to hit the rapist with a whip daily for hours . What should be done with the rapists is not to hang them what should be done is to torcher them for their life and then kill them so every rapist and all boys who think of raping a girl get scared and who has ever done rape and the government released him unharmed should be torchered so they understand what they have done \"", "_motivationdose_": "Well said👍👍👍", "elleclique": "@reannapearlpereira @smitavenkatesh @floris_ann", "kavin_dsouza": "👌", "fishy1597": "After reading your caption i still got one question, how do we change the mindset that are already building in our houses and also in the places we have no control over? Places where criminal ridden mindsets are born how do we reach them, the ones blinded in power, the ones who are born in an environment where hitting women is ok. I am referring to two specific cases here the nirbhaya one and the recent one they all were heniously committed by men who projected their own learning where objectifying women was ok. How do we reach places like these and do something to change the mindset?", "x_mysterious_x2006": "The problem is that the outrage only lasts for a month or so and after that everyone goes back to normal as of nothing happened. It's time for a full fledged campaign. It should be 'Beta padhao, desh ki izzat bachao ' and not beti padhao beti bachao. Men are equally responsible for rape and half of the parents of our country think it's the women's fault for 'attracting attention '", "_keerthana_s_kumar_": "Cannot explain and express it more than this💯 #sayitloud", "niniane__": "👏👏👏", "dummy.dreamer": "😢😢😢", "quotereadz": "https://www.instagram.com/p/B5FFX4ojSKt/?igshid=1fxt3yb2nrpl1", "17kajaljha": "Lit🔥🔥 and well that is the true picture of our society and families.", "jiggyasabansal": "To the point. Up to the mark.", "___sathyan___": "💯", "akshaynotaksay": "Irrelevant.", "niranjana_m_t": "Brilliantly written❤❤❤", "toxic_fille": "Well I hope all the moms out there restricting your girl for all the things she always dreamt of and all the fun stuff she always wanted to experience and to live a beautiful life being independent Now it’s time to change let’s your girls have their time and change the world and make it a better place to be happy", "nnidhi_singh": "Me what", "arun.chaudhary23": "Yes someone had to say this. Listen to your children. Understand their emotions, problems, ideas, desires, grievances etc etc. Let them lead a free life, control their behaviour not their choices. Children are really vulnerable since they are new to this world and your idea of good, bad, ugly can bring havoc to their self esteem. The truth is sooner or later they have to face this world on their own and whatever they do is somewhat a test of your parenting too. Make them understand about things rather than imposing your idea of things on them.", "panda.sarah_": "The protests to hang the rapists have started all over social media, which definitely is genuine and necessary. The criminals deserve punishment because\"actions have consequences\". But does it strike you that these strong campaigns start only after a disgraceful crime is done? Everyone empathises, supports, join in actively; only after a devious crime that brings the entire society down and puts a question on the workings of the entire society happens. The mishaps and crimes taking place in a society are the results of the actions of out society . Again, \"actions have consequences\". Rapes are the consequences of the actions of our society. And *we* are the society. Somewhere we all contribute to these crimes. Like how easy is it for you to judge any girl and declare her a*slut*. How easy is it to just defame any girl. How easily are guys who actually respect respect women and don't objectify women are bullied. How easy is it to abuse and troll females. And so much more . Yes, these things don't directly lead somebody to rape or a girl to get rapes. But as \"drops make an ocean\" such little things bring down the image of females making them \"an object\" which is expendable. There's a need of a campaign for \"our\" morals; for the people of society to not forget our morals and also to remind those who do.", "chillpill_killdil": "This speaks Volume.", "fearless.san": "This needed to be said.", "aaysayayesha": "@gulnisa071", "saijyothi_a": "I have a problem with how this post makes mother’s(women) accountable for their son’s behavior and upbringing. Why can’t it be parent or a parents? It’s not really right that we talk feminism and equality and hold solely women accountable for their sons, daughters or their upbringing.", "khan_am.shady": "🔥🔥 💯 Truth👌", "perlene.t": "Women all over the world don't deserve this.", "ramyasri.m": "Completely agree with you @redheadwayfarer. Like you said there are many men who think that the women should be controlled which is where the actual problem lies.The only solution is to change their attitude which start at our homes.Still couldn't digest the veterinary doctor's murder case.Thinking of her position makes me feel sick in my stomach 😭.", "kimberfresh": "@tracipanah", "paradkar_yash": "Are we sure that the boys to which are guilty of these crimes are the ones who use Instagram or are the ones who have life like us or at least get their two meals everyday ? I don't think that these criminals come from family like ours or an upbringing like we have. They might know nothing about the law or the basic humanity because their upbringing isn't like ours, maybe for them their meal is priority not ethics. For them hormonal changes might not be ever discussed or talked about. It is also related to illiteracy and to birth control. I think, they are just like weed (unwanted fungus which lives on the plant destroying it) in your garden which spoiling your plants but in order to eradicate them, you need to cut them off from the roots of the plant. I am not in favour of anyone. I am also sad fot the current situation of our country. And of course feel sorry for the victims and my sisters. But i think we can reason this as lack of literacy and ethics and morals. I don't think a self-righteous man would ever have balls to do anything like this, provided living in the society. Or else I know, that we are no less than animals. @redheadwayfarer i hope you understand my point of view. I am not against anyone but the criminals. This just my point of view, which you might just agree to it.", "amanyadav11099": "This happens because from childhood it is said that girls and boys are not equal ,gender discrimation starts from School which is a early phase .Teachers often gives as a punishment to Sit with a girl and treating them different .This Society sees bad in Urself when ur friends are a girl and if they found any Boys hangout with girls or any girl hangout with a boy.Society need to be change. ,their mindset need to change @redheadwayfarer", "bonvoyagesadie": "100x YES!", "rarejunk": "@sunandininair", "kameeeelia": "Great post. On point. Also, societal norms don’t just change like that. This is a structural issue in a lot of ways that government needs to address. There needs to be laws protecting women. There needs to be enforcement of these laws. Violent social norms can shift when people are at some level forced to face consequences and really think about why things are the way they are. WE DEMAND BIG STRUCTURAL CHANGE IN INDIA!!!!", "rajsanya622": "Very true", "nidhidings": "💯💯", "_the_katiyal_": "👌👌🔥🔥 💯 💯", "sultana_san.francisco": "👏👏👏👏 yes...yes...", "aneeshakochar": "Great post. Firstly, rape is a PSYCHOLOGY BASED crime and is NOT RELATED TO sexual urges. So 'men will be men' is utter crap. The crime comes from the imbibed social and psychological conditioning that women are supposed to be indoors at night or aren't supposed to be very free. The moment men see anything different from this 'conditioning', they want to teach HER a lesson for being DISOBEDIENT. Rape has got NOTHING to do with CLOTHES. Only when people understand these things, they'll start conditioning sons and daughters equally. It's a long time before we see this change but if we never start, we never will.", "tyonq": "Say it out loud to the sexists in the back,they be too busy discriminating genders to read something powerful like this. Fuck em,honestly.", "elisha_saigal": "I have a problem with every parent and grand parent. It’s not the mother alone to be blamed for this!", "kannamma98": "💯💯💯 Thanks for speaking out about this. The cause of rape are truly the parents, they plant the seeds and fail to take responsibility.", "yashikadutta_": "🙌", "naman__suthar": "Like boys, girls can also go outside whenever they want but mom knows our Indian law and government can't protect girls that's why she is doing the right thing the day rapists and person with rapist mentality will start feeling the fear of law then from that day mother will also starts feeling safe about her daughter .. so u have so much followers u can stand against the crime and protest in front of parliament people will join u ... hopefully a law will be made to terrorise the person even before thinking of doing something wrong ...if u call yourself feminist do something that country remembers you for a long time...we want someone to stand against the government and u have lot of followers use them to stand against the government", "vipu.la": "Me too.. uff.", "_.aaryaaaa._": "Finally someone said it.", "tiffany3721.32": "Are you fucking retarded bcus girls are more vulnerable than the boys are so why constrict the boys when it is not necessary to", "krina780": "Fucking facts", "kalika1909": "💯🙌", "gemini_12_22": "@mayankchadha", "mellarrkk": "👏", "inforstyle": "Any real change will only come over time and with persistent collective effort. It’s one about one set of parents. If a whole generation of parents educates their children right, we’ll have a different generation of men.", "arohi8107": "You have problem with everyone , all you want is “Attention” !! Don’t say bad about others mother !! We love our mother no matter what she do !! You talk about women empowerment and see now you yourself degrading a women !! Thats your double standard attention seeking person !! All you think is divide and get attention just like east India company divide and rule !!", "eeshaparekh": "You go girl!! Heart-touching words ❤️❤️❤️", "keetviews": "Makes sense yes but girls are so precious and our princesses. We know how guys are in this cruel world, we must protect them to a certain extent. Men are naturally stronger and larger making them less vulnerable in dangerous situations. But yes I get what you mean", "qiranjaan": "👏🏽👏🏽", "arushi.srivastava19": "👏👏💯", "vermaharpreet": "Bang on", "aambson": "Totally agreed! Right since I was born, I was taught that I was more stupid then my sister, just because I was a boy", "ninjaboy_01": "In this case my mom needs to get an award, I grew up in a curfew...", "ii.p.o.o.j.a.ii": "So true. About time too. 💥", "dreamer_0.6": "i would like to differ from your last segment about killing rapist i think that every fucking one of them deserves a capital punishment for their repugnant act so that the others would think twice before shamelessly suffocating an individuals life irrespective of their gender a capital punishment is must or else i even had a thought that if not capital punishment then every women should be given a licensed armour for self defence ( which i know is impossible in india but what else is left now?) and of upbringing , for that to actually happen it will at least take a century , because yes its patriarchy and we cannot deny it as its deeply rooted into the minds of people which is sick and poignant", "beckyninan": "That mindset must be changed; that women are weaker than men so they can force themselves on one when they see her stranded. The whole system should change: more awareness should be given through education (at school and home), harsher punishments (I am not against humanity or anything and I am not evil, but people who even thinks of doing such a crime should have fear of the consequence, be it shooting them on spot or burning them or anything that instills fear). We shouldn't feel ashamed to say that we are Indian but what @redheadwayfarer has said is true and I think we should come together and fight for the bigger cause and not start nitpicking like why blame it on India and why blame all men. All men are not the same, there are men who have heart of gold but here we are talking of the number of rape cases in India. India should change how people view women.", "prithvika_shet": "Well said!! I hope this helps to change the sick mentality of our bloody society!!!", "denishacoelhoo": "YES GURLLL👏🏻AMEN TO THIS🙌🏻", "i_am_0n_diet": "😭🍁", "bob_goulet1": "@jennifer_rodriguez_trade is the best trader that understand the trading signals in the market am proud to be part of her investors", "t__tipi": "😔", "sekar_v": "I purely see every emotion of a human without gender base is being taped ,marketed & sold for cash...in the name of good...be it clothes..cars..home..education..parties..to an extent friends in illusive world such as social media ..i wouldn't say the corporates alone..even the governments ...they would kindle ur ego into a identity u enjoy...some tyms even such posts wr u tend to take sides...don't get into conclusions so soon....do good in ur near surroundings...it will have a large impact very soon..don't believe this dividers ...who every tym come up with a heroic act...god bless..🙌🙌", "mariamm_.s": "Exactly!", "______starstruck": ":\")", "khaleesibutdesi": "💯💯💯", "_ayeshx.xx_": "👍👍", "amitsinh_dubela": "Good initiative @redheadwayfarer", "aadivaryani": "The actualproblem what I think is... seeing all these changes on a bigger level. For example: I am willing to let my daughter, neice and sister go out have fun and enjoy just like my son or nephew would...I am willing to let them enjoy late night as long as I know they are capable enough of taking care of themselves....but what stops me from doing this is that even though I am thinking all this but deep inside me I know that there are still some people out there who don't have there minds right who still couldn't control there hormones looking at a girl. This thought...this very thought scares me. Or everyone else for that matter.", "i_am_cenation": "Not saying that curfew should be for girls only and not boys but this stupid discussion won't change the anything about the bastards in our society. It is us who need to take care of our safety and not bring it as a topic of girls vs boys. Boys take own measures while going to unsafe places where they can be looted or kidnapped. We cant just say we have the right to be free neglecting that there are bad people on the society too.", "dichoo_2897": "Well said 👏👏👌👌", "gopaldesh": "Women are targeted in small violent crimes more than men so it makes sense for them to have a more strict curfew", "lavbangad": "Yes, this is the way forward.", "paris98150": "Ye India me har lrki nangaaaaa q hona chaihye parhiiii likhiiii jahil no values no dignity only behayaeeee ap logo ko nangaaaaa hokrrrrr Sukonnnjn miltaaaaa h tm log gando ko izzat raaaz nae ateeeee ye h gandadeee k nishani", "sudhir_shad_mastfakeer": "In that case... I must say... You are lucky enough to have a mom like bindiia ji....", "penneyyproud": "Alllllll fax. No printer.", "nadiyashah57": "@thislilfishy", "s_imrum": "I agree with you. Men with no limits tend to get spoilt by freedom and get exposure to such lustful thoughts.", "drishtystha": "💯", "sagarsingh4860": "🙏❤️", "mike88335": "I'm so grateful to God for bringing Mrs Jennifer into my life because she has really helped me in recovering everything that i lost, after being scammed several times with some men that called them self manager, but I continued searching until i was connected to Easy every week and I want to use this avenue to tell others out there that there are still trustworthy account manager in Bitcoin Mining/Forex trade. If you are interested ....Contact her and you want to be among the beneficiary you can contact her @jennifer_rodriguez_trade", "nirali.p": "THIS", "dr.priyanka_swami20": "This whole country is fcking impotent no security no safety fucking brainless ppl . Date Rape , Gang Rape , marital rape, rape of female child these r d second names of death frm Wch evry fcking female is scared of Since birth till old age frm relatives till stranger NO WHERE SHE IS SAFE . Guys ..Girls are also human they also feelings n they also have ryts to share thr body with whom they want too.Second culprit is the government of this country they can just fight for thr ruling chair . They say dharti humari mata h ...But whr r they wen evry daughter of this mother gets Raped....", "brothersarwar": "📢📢📢", "jacintadiaz": "@i._.madhav", "mainee_we": "After being scammed several time i there was a difference betweediscoveredn those scammers and @fx_tony_illic9 he alone i can trust and as well recommend to anyone who is interested in earning online from forex trade and binary", "myself_yamini": "Even in my home also gender biased my bro can go with friends but not me y ? He will come to home ni8 late if I come 1min late they will scold if ask anything thing they used to say he is boy why for u 😢😢", "daisychains._": "*parents... How come only the mother is responsible for this? Shouldn't the fathers also be shouldering this responsibility? It's often so lopsided - the mother frantically puts together rules in the house, while the father is either the good angel who always says yes, or is completely unbothered, or worst case criticizes the mother's efforts without any actual positive contribution in bringing up the children.", "navya_sree_sree": "Dear priyanka reddy don't expect justice you ain't getting it...", "man_with_desire": "Rape is one of the effects. The root cause is how we, collectively, have failed to manage power. Rape is about power. The man-woman tussle is another subset. Worse we kill our own; members of our own species. That says about our as is sensitivity towards each other. There is a need for better upbringing (a slow process and to me which might not be sufficient), deterrence, a revolution of spiritual transformation and sanity, or, perhaps, a catastrophy.", "aanisaa.49": "@itsmebruv THIS 🙌🏽", "_lady_gorgeous": "👏👏👏👏👏👏", "diwaaakar": "First time U have written a well balanced thing without discriminating men ..yes Gender biased law is one of the reason and one of best example of gender discrimination , that is forcing us and our children to think women r fool/week, men are born intelligent , women always need reservation or privilage to survive.", "sendy_avril": "Big mood", "hrithik_thombare": "Exactly 💯 @redheadwayfarer #beti_nahi_beta_padhao", "prakharrrrrrrrr": "Again. Try growing up someday. At first, i admired your writing, but you've stopped going the logical way. You care about situations, good, but check what you say about it. There are many more logical issues women have been facing currently.", "darshil_shah": "Sadly the shitty humans who are involved in all this rapes and this kind of things are NOT LITERATE or on INSTA that they would understand all this. And mostly they are poor and just dumb so there is no point in writing all this, as if they did listened to there parents in childhood then they wouldn't have become this devils.", "tanzaahh": "THIS IS EVERYTHING", "khwaish07": "Proud of women like you! I wish there were more women like you", "sanyaakamra": "and then my mum told me thats y i don't let you go at night. don't know if my mum is right as she's protecting me or she's acting like stereotypical people who don't question men instead they ask their daughters to stay at home only", "keshitawithadollarsign": "OH MY GOD THIS", "jmcart9": "It’s particular odd because men are more likely to commit violent crimes and to be victims of violent crimes. If either gender needs a curfew, it should be men.", "khatpal2000": "👌👍Things should change..... law shld b strict! More awareness towards education n free education. Youngsters shld also participate in NGO activities which helps a lot in better grooming. We trust our girls n believe both genders are equal but how many in 130 crore population in India understand it. The world outside our home is not safe n thus there is a curfew at home especially on our girls. See the law in Dubai, Women are priority n highly respected. Dare any1", "shetty_shravya": "Totally right", "khushi1696": "@creativebharat jst go through this", "_dblmxo_": "💯", "zarya5670": "A boy is raised to be a predator....", "rahulchaudhury1397": "Ok, so at one point you say men are sex starved and now you're telling men should be put to curfew, wouldn't that make men more sex starved? Like yo, what the fuck?", "_nikittaaa": "mam , i want to say that these restrictions are the main reason of all this happening nowadays, like see if there a sign board that NOT TO SEE HERE , thn also majority of us will be looking at that place only , if it was written like NOT TO SEE HERE OTHERWISE YOU WILL LOOSE YOUR EYES , thn we will not see , same like here we have a bloody system that tell us not to do that or this , but is not not imposing some strict actions on the violators. These restrictions had not allowed us to create an environment where girls can talk abt their personal things loud , these restrictions have stopped them letting themselves out loud tht everyone can hear what they are and what they deserve, but in case of boys they are loud talking abt nonsense here n there n don't feel shame abt that bcz they were not restricted to do so . I think that can be a bit reason for this scenario and I FEEL SORRY FOR THAT . @redheadwayfarer", "_priyanshi_shrivastava_": "I idolize you so much @redheadwayfarer ♥️ I have always wanted to be like you, to bring a change in the society. I hope someday I can. ♥️", "misslulumuggle": "Agree with you. But maybe the caption should read \" I have a problem with every parent...\".", "jjjaiveer": "Just the world we live in 🤷‍♂️", "piaamalhotra": "People we need help. We are planning a protest not some candle light shit this is a protest for us women! For all those women who are not here and who have survived this . We need JUSTICE. We need this. Women need this", "thecutemaltese": "“Because the world is dangerous for girls”. HA. If you reigned in your precious boys, the world would be a lot safer for your daughters.", "nandittaaaa": "@lakshh17", "ranibeti": "Like curfew for the both of us? @akashnotaakash", "sancha_sancha": "Me too!", "paandorazbox": "Correction: I have a problem with every *parent that has a set of different curfews. Mothers are not solely responsible for this, Fathers are responsible and accountable for their kids too.", "theritrat": "💯💯💯💯💯💯", "_rebelmom": "100%", "abhi._.ram": "Only way to stop this is to kill the rapists publicly using most painful execution methods. Or the rapists be given to the family members of the victim. They would know what to do with them.", "anatk87": "🔥", "abhi123paariii": "All U do Is Write long Ass Captions For Fucking Likes and Shares .Do u even Care Abt the Victim .Deep Inside The soul I feel Fucking sorry for the victim and Praying For her soul while u write Long captions", "herbeauty_tales": "The world is only male dominated sadly....so many women are suppressed in their own homes how will they put a curfew on their sons when their own husbands are out there staring at girls like a pedophile!", "the_flying_pushpa": "Exactly", "__e__molina__": "👏🏽", "simcaur": "This is so beautiful. This needs to be read and understood by every parent and future parents.", "_chandansachdeva": "Do you really think these assholes listens to their mom", "gauridale": "SAY IT 🗣🗣🗣", "mansiev2.8": "I don’t like it when they make a political issue or when they plead just for the sake of personal publicity. Ranting on MEN is not an option. NOT ALL MEN ARE THE SAME. This lady, what the hell does she know? Just targeting each and every MAN for a few men is typically bias. Men don't have curfew. Well I have brothers, friends, colleagues and acquaintances who do have curfew, what the heck does she know? MEN Also Get RAPED. Stop shoving your obscure feminism-based, biased opinion in here. Why not teach Women SELF DEFENCE? Why are you so focused on degrading the entire male population for few culprits, when you can talk about educating females with self protection/ self defense. If you want rights every where else why not begin from here instead? Have you forgotten women also falsely accuse men of rape? Why not consider that before you make a stupid downgrading opinion. EDUCATE YOURSELF, WOMAN. The audacity with which she wrote that all MEN are sex deprived. They've had ZERO education towards woman’s body.- in the previous post. The fraternity she comes from, has educated men raping women and still roaming free. Salman Khan hit Aishwarya Rai and is still free. Shinny Ahuja raped his maid and he is still free. Aditya Pancholi has many sexual harassment cases against him he is still free. When these people will raise voices against such powerful people, then and there I will stand in their support. But for now it’s all for publicity. Fvcking social media losers.", "vaish9i_18": "💯💯🙌🙌", "snehajain8868": "The problem.is what ever wetalk..write is not reaching them at all", "meghaprajapati0321": "🔥", "shraddha_vijaya": "I couldn’t agree with you more @redheadwayfarer, problem is in the very root!", "__gayatriiii__": "@rajasrajopadhye @saiathale", "nectared_": "Thank you for saying this but one small really important detail *Every MOTHER AND FATHER... mom's aren't the only one raising kids. Hold both parents accountable. Don't just blame the moms", "__nishant": "I hate to break it to you, but the mothers of these rapists don’t get to read this post or understand the grasp of this!! Bottom line is unless there’s change (in the judiciary system), nothing will change...", "sweta.episode": "@tanvir__tian__", "enujea": "This is so on point", "bhawnasingh26": "❤️❤️❤️❤️", "abhimanyu_9892": "But father set curfew for his son, coz he knows that world break that son from them", "madhuri.sam": "You can only debate and argue with Instagram people but you are incapable of taking any action to stop nonsense which is happening on woman. Do you have guts to suggest some possible solutions to all woman ?", "_its_dvd": "100🙌", "himanshi_aroraa": "Couldn’t agree more", "rumi_das1495": "All these things i try to explain at my home. Glad i could make 30% of changes atleast", "chopraji87": "Tu to culture ke baare me mat hi gyan de, kuch incident ho Jaata Hai Tumhari andar ki mahila jaag jaati hai isse Pehle koi posts nai aaye, sab famous hona chahte hai idhar aisa karne se kuch sahi nai hoga hum logo ka judicial system hi kharab in logo ko 10 din k andar Maar dena chaiye fir dekhte hai kaise rape karte hai.", "vaishhh.__": "@redheadwayfarer for a reason because this caption won't be there with them that time soo its good to take care of yourself. Because of concern they know you can't change the whole world and uk indians population apparently. You can't go and tell everyone soo apparently safety is in our hand. And no mother teaches her son to raped soo stop blaming mother's for that you have made that statement in your first caption.", "agirlinglasses": "Very aptly described😍", "imayurika15": "Absolutely all these differences starts from each and every house in India. This mentality of everyone sucks me everytime.", "swatiichugh": "Wonderful post. #thoughtworthy", "maheen_kahlon": "Louder for the people in the back love 💔", "anjali1912": "So true", "akira.chinuva": "I'm sorry I can't relate.", "srishti2441": "My opinion is also same . But very disappointed that even today moms and y moms let's talk about parents.they will say the same thing they use to say since Indus valley civilization😶....I hope you get it ... anyways it is very very shameful to hear about the girls who are paying a hard cost Even without doing anything.....not Priyanka not nirbhaya , any girl could be there ...it can be me too ...Nd of course I m not having the bodyguards to safeguard me ....all the need is to first learn what to teach ... don't come up with your shitty ideas to be at home ...it is safe ....of course it's also not ....let us be alone at home and leave the door open ...will we be safe?", "a.bhardwaj7": "*Every goddamn parent saloni.", "viggss22": "The reason is because most men out there (given India's population) are from underprivileged parts of society. They dont really care between what's right or wrong, and are sexually deprived and frustrated. It is how our society is and nothing can be done about how they think/act. Secondly, you get naked on Instagram in the name of FEMINISM and WOMEN EMPOWERMENT. There are so many girls out there who represent their country; be it in sports,Olympics, science etc. They are the ones who really show how women are powerful and can do what men can. They are the real examples. Not someone who can show their ass crack and cleavage of just because you aren't overweight by 40lbs.", "imnumber31": "🙌🙌🙌🙌🙌🙌🙌🙌🙌👏👏👏", "sriganesh81": "@redheadwayfarer I totally agree! It's about time women teach their boys about consent about not objectifying girls! A mother should tell her son treat girls the way you would want your mother and sister to be treated! It is surprising to see sometimes that these maniacs who are rapists are born in a family with female siblings but still end up doing the unthinkable to other women! Much worse in some parts of India women who have sons approve of their uncouth behaviour saying Woh Mard Hai Aisa He Hoga Tum Ladkiyon ko ghar ke andar rehna chaahiyae! About time at least our laws are changed to become swift and strict in taking action against these morons! Nirbhaya Priyanka Reddy and many many more precious lives lost 🤬🤬🤬🤬🤬", "chandan_bannerjee": "This is a law and order problem! A country of 1. 3 billion where law and justice for all is still a distance dream... Results in these type of henious crimes... As the society evolves and people are empowered economically and socially....justice and law will improve... Which includes polity as well as law enforcement agencies.... For starting let's make woman safety as a election issue..", "sumira.t": "@dnzxhg", "vedanshsingh70": "The fear in parents and in our hearts need to go first.. Only then we can live peacefully.. Its high time that govt. Stricts the rules regarding rape cases.", "16alamshadab": "These are the golden words of the 21st century.", "geethaharikadharimireddy": "You should not have problem with every mother well some curfew their sons too. It's just a matter of fact that some children were not being their true self with Their parents. The whole thing of morals and decency will not only come from their parents even the surroundings they are grown up.", "mum_arts": "I agree, but if strict laws are there, they will think twice to commit such crimes. Bcoz good upbringing can do its part..but there comes a point where a teen-ager gets into some bad company and ruins everything.", "ashmeet_2001": "Well said! 💯", "_urban.bloggerwala": "All these thoughts should come up and reach where it should actually be.our generation of instagrammers and such a goid thinkers no doubt would lead to a good and healthy generation but...we shiuld come up wd something which could teach d non-social media using generation which is not happening. These non-social. Media community feels like they r getting backed and such media using generations r too forward. We should come up to fil this gap. That is why its generation gap. How can reach to our parents, uncles aunties, living near u..think abt this first. There r too many who even dont have smartphone nd if they have they dont have internet connection nd if they manage to get it...sadly they end up wd tik tok kinda apps.😞😞", "aahana_sharma_s": "Totally agree🔥", "negiaditi24": "❤️❤️❤️❤️❤️", "stefanibun_aw": "Thats why my mom always set a curfew for my brother. She’s afraid “if he rapes girls” | “better to prevent than cure” <<— this my mom said.", "sanaa.syedd": "@nusratjahan29 @aishaa.syedd", "nazneen_sharani": "@baigsana this", "nikita.gauba": "Is there no way that these masterpieces that you write reach the ears of the people driving our country? It is daunting and sad at the same time that a doctor who saves lives, has faced this. I can’t even start imagining her condition. When will we say we feel safe in India?", "jrish70": "👏Appreciated 🙌 girls should had equal right n freedom tooo💯🙂", "aakashhaistar": "It's not about mother raising her child she is doing that but when a mother needs raise 9 to 10 children at a time there you loose this thing. People should stop breeding in the name of religion", "gaur_689": "If sons were also in curfew then there won't be any cops to keep the streets safe at night, if you women don't support each other then it's not society's problem !", "wanderingkamya": "Damn straight. There is no reason men should be allowed to run free and do as they please, and women be put down for being themselves. This attitude only feeds more fear and more weakness. It’s about time the accused received harsher punishments and women be allowed to act in an empowered fashion - society is changing on a macro level.", "_deepaligarg_": "I agree with this. This mindset is not limited to Indian households. My college had curfew hours for female hostel dwellers. The damage was being done on both sides of the spectrum. We were explicitly told that it's perfectly fine to keep women in cages as men are feral beasts. This perpetuated the patriarchal mindset in our rustic little Haryana town. Sometimes women were equally complicit in victim blaming. Any time a girl was molested, the talk of the campus centered around her drinking habits or choice of clothing.", "hirumojidra": "Totally Agree with you.. @redheadwayfarer .. Keep Supporting.. Keep Raising voice against Wrong ones", "sukhmeetssidhu": "💯% accurate. A son takes his mother as his role model and tend to treat other women as same. So basically a mother is to be blamed(partially ) if her son becomes an animal. A mother is the best judge of her kids. ##  And I must say that there are others who should I believe should be held responsible. 1 . Government:- for not providing education to all. 2. Police personnel who should be on their duties staying vigil towards these acts. 3.general public who could save 75% of these crimes by standing up against in-human acts. I rest my case because I believe that talking in comments makes no progress as people who are committing these crimes are far from reading these and people who are able to understand the depth of these long messages are so busy and carefree believing that this can’t to happen to them or one of their knows. #RIP all those beautiful souls lost to these heinous crimes. May god bring all help in bring justice to them and their families. And I hope this doesn’t happen to anyone and as a brother I can’t even tell you how sacred I am and hope men out there will keep their animals to themselves", "aquarian.neyha": "You spoke my mind💙 @redheadwayfarer ... 🔥🔥", "soham_awate": "i agree, there shouldn't be no difference from the beginning. Boys & Girls should be treated the same way.. Girls can wear short clothes, have late night parties & do everything that boys do... BUT THIS WORLD IS CRUEL & BCZ NO ONE IS THERE TO PROTECT, WE NEED TO CARE OF OURSELVES! so all i ask is *STRICT LAWS*", "ms_vbhavna": "Y don uh juss come out n do something...this writings will never satisfied our grls... We have to do something for... No need to ask for help... No need to ask for. Punishment....", "sapnabodh": "Well said @redheadwayfarer love the you put your thoughts... Always inspiring...", "ericzebra434": "Boys and Girls both need a curfew. We should be taught rules and it should be enforced. You live in your own house. Don't say, “But, mom. My friend's parents allow her/him out”. That's another house. Listen to your parents, don't rebel unnecessarily...for the sake of being defiant without reason. When a guy and girl make love, they both should get into it willingly and make the commitment. And, Don't give girls the benefit of the doubt when it comes to divorce, in terms of custody over the child. We need better laws for the men as well. It's inequality. Equality is a concept where the laws don't favour a single gender over the other. I know that these cases are miniscule but, girls sometimes destroy a guy's life just for monetary gains. There are a lot of holes in this concept of equality. We are humans first. The crime is done by the human first. The gender comes second. Also, don't treat boys like they are born rapists, they start to believe it and that leads to mental health deformation. And then, it's the girls who laugh at him and paint him as a sissy or god knows what all. I mean, what's this insane hypocrisy. If you want to man hate and generalize. Leave the feminist movement. Go join...the noisy hateful side.", "garimaagarwal16": "Kudos! I must say you are very inspiring to the young generation mostly. But the issue in our society is that our parents are not ready to accept the fact that we (girls) have equal right as any other human being. I recently had a discussion with one of an older generation lady, and I was shocked by her views on the current issues. According to her and ladies of her age, we (as in the young generation girls) are inviting men to rape us or follow us or to pass dirty comments or to lure them by wearing short cloths, by going out late at night alone, by going for a midnight party...and so on! It's so frustrating that it is mostly the women of our society who does not want equal rights or even justice! And I have no clue as to how to make them understand that everyone has the right to decide as how one wants to live.", "_shekhawat_4144": "and you also just blame on boys or mens....even you know still boys are respecting woman...and might be they are good than rapist...but according to you we all are same...we need to learn how to respect woman or girl....then why we all are not in prison...because we know very well that what is right or wrong...Mrs ! still we have humanity....so why you all treat like we are rapist...and if you differentiate man and woman then you have to create another country of female only...there is no man...so may be possible that we both will be happy... 🙏", "vivekprasad015": "Now don't bring this son daughter shit, India needs strict law and speedy punishment. #hangtherapist", "swetha2088": "While I agree with the point of the post I should point out that the onus to raise socially responsible boys is not just on the mother. Both parents are equally responsible", "mrunalcy": "I agree 100%", "harshitarathod_": "This is so controversial, and yet, it makes so much sense to me", "swe_etu__13__": "I totally appreciate it...Soch badlo...ladki ko apne kapde ki size badlne ki jarurat hi nahi padegi #fucking_narrow_minded_people", "be.you01": "These are the words everyone should hear and understand and practice periodt.... Only if parents start treating their children equally and teach their son how to be a better human than being a man.🙌🙌", "sawant_vaishno": "Meee tooooo🤘🤘🤘🤘", "shalviiii": "The best write-up I've come across so far.", "n_bpoems": "Would it help if parents don't differentiate between girl and boy at home and also do talk to them openly after say 13-14 that rape is a crime in this country and never ever commit it. Also if someone is eve teasing a woman, then do stop your friend/s. As rightly said education needs a drastic setup and schools, especially in rural areas should teach these up bringings to children. More parent teacher meetings as well.", "_the_wildflower_0": "I seriously have had enough of this bullshit of providing us girls a manual of how should we behave, eat, breathe, live! And none for the boys out there of how not to consider the women in your life your property. While growing up,I myself have been forced to follow the rules for being a \"good & obedient\" Girl. I'm not passing on the same to my children!", "manali.redkar": "🙌🙌🙌🙌", "aartiks": "Your writing is fire!!! Thank you", "_ashwaryaa_": "Your words❤️❤️", "problem_child_josh": "🚨Girl you're wrong❌ No offence but won't you be mother of your children and if he'll be a boy you'll understand and will feel the love why mother can't come and see his son's dead body. I know how you feel,and be with surrounded with people with whom you feel Positive not Negative . We can talk about it.🙂 @redheadwayfarer", "shwethah_paul": "Generation's changed but women are still unsafe. We fear to walk on empty roads. We fear to take cabs or auto's at night. Even after wearing a burkha we fear whether we'll be safe from those luscious eyes. It's not the dressing or the time when your daughter goes out. It's the mentality of people...now where are those people who comment \"kaha gaye woh feminists\" when something happens to a girl... do we ask this question kaha Gaye woh mard when a girl gets raped ??? Even this case will be forgotten after some weeks... India is still dangerous and unsafe for women...not only for women even a 2month year old baby is not safe in this country.", "avishasogani": "Girl! You speak for so many of us!! 🙌🏻❤️", "amrithaa._": "i have a problem with every mother who say keep it to yourself after hearing that her daughter/son is sexually abused", "weekendwandergirl.kom": "You just spoke my mind @redheadwayfarer Every work is a fucking truth here. I have made a small change happen at my place. I have taught my mom to make sure of my brother’s whereabouts all the time, where he is partying, with whom, is he coming home on time. All that applies to me, applies to him as well. But this is not enough! So much more needs to change", "deep.rao92": "this is ur first sensible post", "nofiltersnina": "Actually men should have a curfew. That way women can stay out and do whatever their hearts desire.", "_shakshichoudhary_": "u r totally correct but somewhere our moms might have undergone these curfews and she is so naive that she thinks that by doing this we will be safe but i think she is unaware by the thunder inside us who makes us feel weak and way more unsafe bec. of the rules of the society", "theankitarai\nVerified": "Verified", "shwe_osha": "Exactly!!", "tanyauppal243": "Sooooo true💯❤️", "atul_pathania": "💯💯💯", "varshikaaaaa": "💥", "mudassirkahnn": "What about the mothers of lorry drivers, auto drivers and the millions of illiterates in our country ? Are they reading your captions ? Thats the strata of society that needs awareness too .", "vrushali_l": "Have had a lot of discussions pertaining to this issue but the point you making here is so practical and valid....i guess most of them would have problem with this as welll but i hope this reaches in every parents head loud and clear 🙌", "man_in_frenchbeard": "It's not always same everywhere, but the family culturing is the beneficial element to structure one's life.", "_.nautanki._": "THANK YOU FOR THIS!", "whatisinaname_shals": "I'm wondering if only moms are responsible for keeping the daughters inside or their dads as well? Shouldn't the right word be \"parents\"?", "xoxo.sego": "Yho that’s true👏🏾👏🏾👏🏾👏🏾", "anishb07": "I m ashamed to be a man and also i m scared for every girl out there....just remember one thing no one is going to protect you...i m sorry to say this...but it is the truth...no govt, no man, no rules, no law.. none...it is the harsh reality...you have to save yourself.... because these men can't change...it breaks my heart to say this...but we FAILED.. couldn't do anything to save her...and these monsters are still alive", "wastedtimes11": "I COMPLETELY AGREE TO YOU BUT, we leave it such society..i might explain this to my parents that if my brother can work till late night, i can to being a girl. I can say all of what u mentioned but tbh now I AM SO SCARED TO EVEN STEP OUT MY HOSTEL. I BELIEVE IN EQUALITY BUT WHAT WILL I DO, WHEN SUCH MEN ARE FREE OUT THERE WHO COULD RAPE OR MURDER ME? I AM NOT SAFE . What shall I do now. I have taught my bro to respect women, treat everyone equal irrespective of gender but I can't trust my society. My own country. There is no fear to such bastards. There is no limit or restrictions. What is use of being brought up such modern family when my country is not safe for me.", "_i_am_groot_007": "Yes, that's what I was stating.", "vikranth_rana": "Too much of stupidity in this post than a gud message .. not agreed completely", "vivekdwivedi5678": "Mohammed Afroz raped Jyoti Singh and Mohammed Pasha raped Priyanka , speak properly or u don't have guts to speak 🤔🤔🤔🤔🤔", "nainitalin03": "Parents. Not just mother. Why is it only the mother's role to raise kids!", "ifraww": "@xtreacherousx she spoke your heart out", "shrutimehta21": "💯", "charmingly10": "This is the reality. If you teach to give respect regardless of GENDER. If you teach EQUALITY regardless boy or girl. If you teach them both how to treat human being as HUMAN BEINGS then it is only way there is a possibility of a change", "im_nidhi_srivastav": "👏👏👏👏exactly..", "aarthivaratharaji": "We should kill everyone who involved in rape in front of the public immediately we should kill rapists whether he has a big background or Normal person we don't send rapist to jail they have to be killed.from this kind of punishment no one have guts to rape another girl,baby or women at the same time we have to educate all the people to treat both genders equally.parents teach your son to behave properly.girls don't do any mistakes except fact that they born in a horrible country who treat girls just as an object they didn't consider even as a person even a humanity is dead.i don't understand that everytime rape is happening in some where all the time we spoke about this problem in social media and we get back to our normal life.justice is not given to the victims on the other hand this issues is increasing gradually kill rapists in front of the public and live telecast this all over the world.severe punishment is only one solution for this problem.rapists are burden to the family society and earth.i feel guilty that i can't do anything that perverts people.everthing is politics there's no justice in India", "tophbeii": "💞🙏", "moonneha": "🙌", "bhavi.shekhawat": "Facing this discrimination at a bigger level in my own family daily,I can relate to it..sometimes it feels like life must be much bttr if I were born as a boy.😑", "_vishsky_": "We'll unfortunately I don't think it's right to blame mothers. You yourself said, I a guy was found alone by a few creeps then they would just beat him up and take his money but the same with a woman is much worse. And that's exactly why daughters usually have a curfew. I don't like the fact that sons and daughters have different curfew times but I understand the point behind it.", "pankhuri_malhotra": "I love you babe", "bhoomika_netam": "I couldn't agree more. The roots always starts from the ground - the home", "shreyabarman": "so true..", "crestede": "You addressing a totally different segment .....so its no use", "shettyanu05": "That's what we need to find a solution, whatever punishment we take for that rapist what's the use when the girl is no more and suffered trauma , we have to find a solution to stop this happening.#iwantsolutionnknotreaction", "ninibear1012": "Upbringing is the root of this problem.", "i_am_ruchika": "Thank so much for this @redheadwayfarer we can't undo what a conservative parent bring you up with but what we as girl will make sure when we become parent to always make sure that we are giving them reasons to be a better human first, and to look for a persons heart than gender, sexuality, colour or any prejudice 🌸 @redheadwayfarer thankyou so much for everything you are doing you are empowering alot of women trust me YOU ARE AN EPITOME OF HOW A GIRL SHOULD BE 💫💛🤗 I LOVE YOU SO MUCHHH❤🌹", "ami_sna__": "Totally agree vd u mam!! Nowdays people's ill mentality and ill thinking give rise to such rape culture....They think they are not bound to anything....The only medicine of this illness is fear of DEATH PENALTY and strict actions....These type of people should be hanged to death.. As u know India got freedom on 15 august 1947 but frankly speaking India never got freedom fully...India can get full freedom if rape , harassment, bullying and other bullshits end!! Parents shld educate their male child to respect women instead of caging their daughter!!", "sonali.612": "So damn true! I could literally relate to each and every word you said about how gender biased the society is. It's all about how they are brought up and how shitty their mentality is! After all, teachings begin at home.", "thisdakshguy": "🔥🔥🔥", "kalyanivatsala": "The saddest part is that even these curfews don’t give us assurance because females are not safe even inside the four walls of their houses, there are so many molestation/rape cases where the culprit is a member of the family and the whole incident is just ignored, if its a family member, people are indifferent about it and i honestly see no reason these people can make up to blame the female when she is inside her house “in time”, wearing “proper” clothes, not “revolting”, not “asking for it” and i think that is why they’re so indifferent of it happening and not even acknowledging it as a problem. So fucking sad. Even if we follow all these “rules”, we end up getting molested/raped and I cannot sleep at night because I’m so worried it might happen, again. @redheadwayfarer", "shivaneesujatap": "👏🏽👏🏽", "lailababar": "Not just parents, even colleges set curfews for female students while male students can roam around never having to worry about hostel times", "_kini___": "💯", "bhanvisharma14": "I m a feminist.....I have always talked about equality between man and women... i always questioned my parents whenever they allowed my brother to go out late at night....and for me the deadline was 8pm....I questioned her everytime whenever she disallowed me to wear short cloths.........but for the very first time....I am scared .....I no longer care about equality....I just want to be \"safe and alive\".... that's it...I have given up y hopes on humanity.....and done with this society......🙏🙏", "ar.yyaa": "Exactly!", "its_nehxl": "You're amazing...Salute bro...💫", "alan_ferrrari": "Mom is not wrong... Provide her daughter safe place to wander...she will stop setting curfew.... Coz at the end if something mishappens these big captions posts don't work she knows that", "c12h22o11_berry_3.141592": "Schools teach gender equality and yet girls aren't allowed to stay out of hostel after 6 but boys are allowed to come post 9.Girls are adviced to dress modestly whereas noone cares what guys do.Im sick and tired of this society.", "shivanshi.x_x": "I can totally relate to this it's like patriarchy is the major issue 😔", "esha_kumari_": "See there are multiple sources of this problem.Rapists are one, The inefficient law is another. You can't solve the problem by eliminating just one source. If the law works fine, there will still be few pyschopaths, If the people are fine, there will be the law playing the blunder card. I don't mind creating fear in the minds of potential rapists by capital punishment.", "singpriya1996": "Yes this need to be changed.", "_fashion_crz": "So well said🙌🙌💕", "aritra_das": "This is exactly what I am feeling 😠😠😠😠", "sharanya.nair": "Well said... Really", "3ack23asics": "@redheadwayfarer why are you so good?? The world doesn't deserve people like you. I'm in awe of you!👏👏👏", "shradz_10": "Thats it.!!!! Thats the basic and major issue. Strong mothers give example of girls being strong. If ladies are suppressed in their families, that will raise a chauvinist and may be a rapist for future.", "rishabjha9": "I have a problem with you that other than posting such issues on social media what else you do which could lead a change. Everybody is talking and so as you!", "vaishm13": "I just wish this reaches out to everyone! Very well written.", "kajal_israni_": "Omgg your truly an inspiration ❤️😭", "merrylinboro\nVerified": "Verified", "saaz_._": "Do you think there is hope that anything will change anytime soon? Is it really about education, or what the Indian society believes is education? Rapists & harassers today come from all sections of the society, rich-poor, literate-illiterate, rural-urban and any other classification you can think of. I think the reason is Indians in general are selfish, much more selfish than any other society. They don't care until it comes to them. That's why parents stop their own daughter coz they don't care about anyone else's daughter. Sure they will read the news and curse the rapist but will never think it could've been their own son. Worse, even if they know it was, they'll try their level best to protect him from the law. This fucking mentality is what I call selfish. It's just so messed up that I won't give anyone false hopes about any kind of change, at least not for better.", "suhaanaasuffer": "I have a problem with every parent who thinks I am self-centered for prioritising my dignity and needs over their son's. I have a problem with men and women who call me selfish for daring to put myself before the men I'm supposed to cater to. It's not natural to expect me to step into my mother's shoes and be a second mother to anyone who is violent, disrespectful and cannot take no for an answer. It's not my responsibility to feed anyone who can get up and fix themselves a meal, like I can. I can go on and on. Point is, the man that makes the outside unsafe is bred at home, this variety gender bias is insidious and I wish women noticed that this too, wouldn't thrive without their cooperation.", "sankary_richare": "Exactly 💯.... your words are true 💥.... things should change!!...", "raksha.rathore": "True.. N well said👏🙏 @redheadwayfarer", "janhvi1311singh": "@redheadwayfarer Yeah, that's actually the exact problem, the upbringing, parents still tell their Sons to \"Have Fun\", and their Daughters to \"Be Safe\". This society assumes that every girl going out alone at night is asking for rape, then they should also assume that every guy going out at night is going to rape someone.", "dolllsh": "TRUE", "iamyashjaiswar": "These words should be spread everywhere in every way.. 💯", "khushhhh205": "Sooo true .....💯🥺💔", "ravneetsangha74": "https://timesofindia.indiatimes.com/blogs/the-treasure-chest/it-never-ends/", "nupur999": "Sharing this👏🏼", "hey_this_is_aad_": "Well said👏👏 but how will these words will reach each parents of india🤔🤔🤔??", "aksamehndi": "This! 🙌🏻", "rocko_lusty": "Am I the only man in the world who is exploited by women or it's just my bad luck that I'm in the world where everyone thinks that only women's are getting exploited by men not the other way around", "misbah29": "Tell me abt it", "swetakavar0722": "Hope this words work in India 🙏", "rit_amethyst": "So true! I especially related to the part where you said that, men think that women need to be 'taught a lesson' . That line of thinking is so incredibly dangerous ,when fellow men, guy who a girl dates , hold such beliefs, that they need to put their woman down and bring her on the line. It's horrific at the least .", "_rigvedd_": "No one should have curfews goddamnit. Neither Girls Nor Boys. Rape isn't just a gender thing. Men get raped too. They get molested too. The actions of a few mentally broken individuals cannot be allowed to be a stereotype for the entire gender.", "aryasharan_": "@swapnil_joglekar get it?", "angel_kinju27": "👌👌👌👌", "chillicrispypotato": "Yes.", "ashishhhhkoihai": "This won't change anything. The ones who are raping they aren't going to be reading viral posts on Instagram. If you hang and/or castrate the rapists in public it will make a much bigger effect than some post on Instagram. Look at phillipines,they had a huge drug and violence problem, once they started killing straightaway anyone who was a drug dealers, now they have zero problems. This is what needs to be done, heartfelt posts on Instagram wont change anything at all ,mark my words.", "radicallyeverafter": "So effing true. This is how we grew up and look at the mess we're in", "sahniaastha": "Omg so much yes!!! Can I please share this?", "krishnapriyavenu": "🔥🔥", "ashmita_m97": "Thank you so much @redheadwayfarer for doing this! This needs to be heard!", "sandhya_singh_": "I totally agree with you. It all starts from home and upbringing. Indian parents trend to treat their son superior than their own daughter. It takes little efforts to teach your son value of opposite gender and how to respect every gender.", "ssoma.__": "Trueeee actually", "noopur.rajput": "Someone had to say this out loud, and fact has been spoken. Thank you @redheadwayfarer !", "manisha._awasthi": "*Every Parent", "giridhar_kattimani": "Well said... Girls r blessings ❤️", "saumitra2987": "Superb statement made in the caption and I support it totally.", "chinmai.khare": "👏👏👏👏👏👏👏👏", "phenomenalrohit.singh244": "👌👌👌", "noahs_words": "👏🏽👏🏽👏🏽👏🏽👏🏽", "itsakshataa": "Your words gives me goosebumps 😭", "akhila_aakk": "Don't deserve this !", "thelove22222": "Well, said.", "priyancaaa___": "🔥🔥", "theycallmeriti_": "I CAN FEEL THE CAPTION 💯", "tauro_lady": "Rightly expressed.. True statement 🙌", "poojithasid": "😭Girl", "chauhan_eha26": "Say this out n loud n loud n louder n loudest!!!!!!!!!!!!", "the_saadhana": "Girl.. You're a blessing!!! ❤️", "theprathamchaurasia": "🙌🏻🙌🏻", "rana.elena": "I have a problem with every mother who makes her daughter pick up after her brother.", "trolls._world_": "After all these incidents, I've lost all my faiths and hopes that we can change... The truth is we can't everything will remain same... People will protest for few days and after that they won't even remember who is Priyanka. I'm not saying for Priyanka only but for all the victims.... And the harsh truth is nothing gonna change... So disappointed", "sheetalstrong": "💯💯💯", "_.vandanaaaaa._": "Yes , the only thing we can really do is hope 💙", "peru1114": "The best post with the best lines😍"}