{"siyaraganesh": "Who cares u show ur nipple free nipples.. dumb ass🤣", "tithij_jain": "@narendramodi @mygovindia", "lovewritebts": "How long is this gonna continue. When r the correct laws and acts be in the system. When r the clear crime be seen as a clear crime. This is not okay. We haven't won anything until all my sister are safe and gets justice. Those clear rape cases shouldn't even take 7 years to get to a conclusion. In these cases where we all know the criminals, courts still need proofs to hang them. Death is a small punishment for what these monsters do to our sisters.", "nancymathew_": "Truly Heartbreaking! !", "zakirs7v": "Hyderabad changed , now india will change?", "hrishidere": "Now Mr. Adityanath announced 25 Lakhs and police protection to the family. Sir they don't need your money and corrupt police officers protection they and we all want justice. Burn the culprit in public.", "sarcastic_ck": "Rip😢", "ruchhaa_": "#notindiasdaughter 😊", "great_zeus007": "Lund le lo salo", "sagrsid": "What about Asifa?", "rkush_07": "😢", "komals9899": "@narendramodi thanks a lot for this . What a prime minister you are", "rincyvijay": "Exactly, just because 4 people were shot doesn't mean justice is served, people are so content thinking their duty is done here, it's just the tip of the iceberg, there is so much more, many victims go unnoticed. Many cases don't even get reported because apparently if a female gets raped she is useless and no one will marry her, what the fuck, it's nothing to be ashamed about just because a female is sexually assaulted doesn't mean she is worthless. It's not her fault she got raped!! People should be more open about this, but sadly it's not that simple in our country.", "emiine__yamazaki": "I feel disgusted to be an indian daughter #protectus #protectwomen", "___wander.woman___": "N someone who is a rapist,killer....desrves to fking die....i am in fr all.kinds of human rights n all...but the thing is such crimes they r not humans.....its frm both sides,u get respect when u give it....human rights fr those whose acts are not so heinous....", "p_pradhan2410": "@shweta.chaskar92 the caption 🔥", "pragneshh_": "RIP🙏", "dank_sinatraaa": "I aches me to see that people don't see how it's effects could be amplified and to what extent, in a country with such a huge population, where already people are aggressive, ready to get offended. Say something against their socially conditioned ideologies, and viola! You have an agitated Indian man (or woman) preaching you, telling you what you're 'supposed' to do according to them. From the rishtedaar at home to the principle in the college to the colleague in office, you see at least one everywhere. And it scares me whenever I get a glimpse of the society we're heading towards.", "bloody_wordy_vr1": "We made a song on Unnao case.Do check it out (Link Is In My Bio)", "roving_soul_": "#notindiasdaughter", "dyna_antony_28": "Why is that no one helped her while she ran for a kilometer after getting burned? Why is it that, no one cared enough at that specific moment to genuinely help her? There is no humanity left in this world. Here we are grieving over this on social media, whereas we should be ashamed when the people who were present at that point decides to go blind towards her. Untill and unless we don't play dumb and act at that moment and not post our condolences on social media. We can't expect change. We need to help eachother out. Be there for one another.", "swarttish": "I couldn't put it in words,what i felt,about not feeling good about the encounter because justice has not been done...u have expressed those emotions,exactly. Thank you.", "onegoodhuman": "I'm a patriot, tears roll out of my eyes whenever I hear my national anthem thinking how many would have laid their lives just to make us live with freedom and this is the only thing that could make me not to love my country.", "nehasiddiqui02": "@shazdah", "_poojasharma17": "Thank You for Speaking Out Though 🙏❤️", "shashwat.raj": "We want encounter of BJP MLA KULDEEP SINGH SENGAR", "anandshrivastava": "And now we have a 17 year old girl in Tripura who was raped burnt and murdered.", "okeuf_tqr": "One thing I would want to say here.. I totally agree with you. That one thing we sort out and start clapping and celebrating. While on the other hand. It's such a shame for the police that the accused tried to escape.. I mean seriously!!! The police could not even held them properly. They even snatched a gun... After that encounter!! Great.. i seriously do not find any reason to be happy about... They can rape us, burn us, kill us and throw us anywhere and anytime they want.. but our authorities can't even held them properly.. awful.. @redheadwayfarer", "_saurav_ganguly_": "Sick of it😔", "gayu_me": "There’s really no hope. People are cheering the extra judicial killings on the one hand and will victim blame on the other. Anything, as long as we don’t have to take a hard look at our rotting values and society. Keep supporting patriarchal culture that harms men and women, that nurtures casual sexism and bigotry and produces rapists.Then end of day blame the government. The government is only a representation of the society. I for one am happy that as a species we are ruining the environment so rapidly. Hopefully humans will die out faster and we can all be done with this pathetic farce.", "deekshaprabha2": "i don kno what kind of judge granted bail for those fukin animals 😑there shouldn't any kinda bail for rapists... that's it", "simrranjeetsingh": "Actually true... The men killed were escaping or falsely fabricated... NOT PROVEN GUILTY... IT CAN BE POLICE OR POLITICIAN HIDING SOMEONE POWERFUL BY KILLING THESE MEN... ACTUALLY CASE IS STILL UNSOLVED.... NO ONE KNOWS THE TRUTH...", "anwesha_xd": "Time to leave Earth..🙌 cos our government is sleeping and we can't expect Justice from our leaders who are sold..!! And who knows we can be the next..!! Shame INDIA @redheadwayfarer Humanity died😌", "sridutt.saripella": "Fuck.", "kalsikamaljeet": "😓", "ahmedrayan.ar": "India is trash 🤷‍♂️ that's all there is to say!", "t.g_16": "RIP Angel. I'm so freaking sorry that this horrendous society made you go through hell but my sorry or others won't bring you back or bring you justice. I can just hope for change while working my worth for bringing it. I can just hope for safety of all girls, women you were representing in your fight with the system and the monsters who this system protects. You've been through hell on this earth but I hope in heaven you're getting not only the appreciation your strength deserves but also a promise by the universe that those monsters will get their due in the lowest, ost fearful pits of hell.", "darshan_ki_aditi": "Im not an indian... but i really feel like there is no humanity left... we get to hear such things like everysingle day... pta nhi q log itne berehm kaise h... pehle rape kro fir jala do murder krdo.. jaise ek ldki insaan nhi h.. unki bnai gye unk liye ek toy h... 💔", "ananmolmol": "@narendramodi", "aditiswarup": "@redheadwayfarer I hope this beautiful message reaches millions and they realize the importance of the fact that you've written ❤", "shuchi778": "Its a freakin sorry state ,its a sad country .#notindiasdaughter daughter", "tanyauppal243": "💔", "ardently_jaded": "This is disheartening, she deserevd a better life. Her family members were killed and nobody gave damn about it. It's just not the rapists but also the government is responsible for her death. I belong from UP and trust me it is at worst these day. Our CM is busy making Hindu Muslim statements, being in news for his vegetarian dog and all the communist shit you can imagine. Aslo the rapists was a former BJP leader. So there were hardly any legal actions taken against them. Things have got to a point that it does not feel safe anywhere. Be it day or night, it feels I can be the next. 🙌 @redheadwayfarer thanks for speaking about it when everyone else choose to stay quiet.", "m_sandy17": "So saddening! It's so much so that putting all our emotions into words together. Very disturbed by the things going around one after another. This Government, People, and Society altogether is one hella hopeless thing on the Earth. Total absence of humanity..😭💔", "heisenberg03": "dude where's d cardboard?", "ankita.chauhan2945": "Our leaders call themselves \"chowkidaars\"..what is the point of such chowkidaars when they can't even protect the people in their country.", "yashanshikala": "What about Jyoti Singh? (Nirbhaya) it’s been 7 long years and she’s still not gotten justice. She wanted them burnt, they’re living.", "abibarman6": "😔😔", "sahanabanerjee99": "@douchewayne11 read this", "ash84m_": "@narendramodi", "aaryanabbass": "@iamjustavintagesoul", "ishita2909": "Thanks for speaking out!🌸 It's just heartbreaking to see all that crap with recognition who themselves didn't registered the FIR at first place and are now getting praised for an attack in Self Defence. Just no one is wondering about the real cause of all these cases!", "__the_anonymous_soul__": "SERIOUSLY! The Government really needs to do something. #NotSoAccheDin", "ms_.sparkle": "💔💔.", "bhoomiikaaa_": "No hopes left..Is there any end of such cruelties ,Something needs to be done our pm is solving major issues of the country but why can't he see this..What can be more important than the safety of women?? #nohumanity 💔", "riaaana16": "The Killing of the culprits happened yday while the victim was set ablaze day before.. every effort to stop the heinous crime should be appreciated as against writing down..", "tanvisukharam": "💯. Whatever is happening is so outrageous and boils my blood to hear this every second day . People in our country are so divided and illiterate that they will see a victim suffering , begging for help but they would just stand and stare but not help or raise their voice against the accused . And talking about police and law and justice. It’s all ridiculous. There are just laws , NO JUSTICE . This is all so sad and disturbing.", "nishadwivedi.25": "You make me speechless..!! Very well describe and actually at this point of time No girl in the country feel safe or wanted to call herself India’s Daughter because Nobody is giving a fuck about women safety. All they have is Talking in front of media nothing else. Its high time now do something, make strict law so that these bustard must learn a lesson and think what worse will happen with them If they even tried to do anything wrong.", "ayesha_dsz": "😢", "sahilpunyani": "Amidst all the celebration for the unserved but called justice.... This is the fresh perspective of the situation that is required but none is ready to have.. 😑 Your words are truly impactful, sadly but so true.. I really hope the situation and our country gets to a better state for women and their safety with every day passing.", "mushy_muffin": "Taking revenge and serving justice are two completely separate things.", "bollywood.trendzz": "💔", "the_arcane_spirit": "India needs a humanitarian revolution. Democracy is implemented in the wrong places like the juvenile justice and human rights dor criminals. I mean which fucking country in the world does that? Only India! The ones who are elected to represent the people are corrupted and monsters themselves. I dont see any signs of democracy in this country and rather the rights of the citizens to freedom of speech are being snatched by the Indian govt. While directors out there are coming out with movies like Narendra Modi and all those shit, and politicians nore concerned about CAB and Ram Mandir issue, the country is breaking apart", "abdurshaikhx": "Wtf 😶", "leera_jayne": "I agree with everything you said. But do not talk about other women thinking it's \"too much of a hassle\". They have their reasons for not fighting. Everyone can't fight. Don't get me wrong - it's incredibly commendable, what she did. But there's a way to say that without talking about fellow rape/ abuse victims that way. Apologies if you didn't mean it that way. I'd just like people to know that while it would be great for everyone to speak out against abuse - it being a hassle is last reason people don't. It's simply a lack of a safe space that people don't come out. Or the trauma of dealing with the abuse is too much to cope with. Or you just want to forget it ever happened. Or your family puts you in a horrible position. Please don't mistake suffering in silence for \"I don't want the hassle\".", "tarinigopinath": "Atleast someone stepped up and gave justice to Priyanka reddy..its not a lot. But its definitely something... Encountering 4 accused rapists.When the country is steaming with rage and anger isn't an easy thing.. I know it doesn't end there. Killing them wasn't the ultimate solution..but look at where the other rape cases have been landed!? Atleast somewhere justice was met..Not a lot. But something.", "sayantani_artist": "😢", "yashpathak_9": "@amitshahofficial", "bornstubborn7891": "@narendramodi @amitshahofficial @smritiiraniofficial @dreamgirlhemamalini @iamsunnydeol @ravishankarprasad @manojtiwari.mp @myogi_adityanath What is going on...Why your govt. Is not able to stop these incidents ? Dont you have daughters in your homes? Are you all waiting this to happen with your daughters then u will wake up to bring stringent laws ! Ram Mandir and 370 can not save your face anymore. We are glad about 370 n ram mandir but women safety also matters. How can you put this matter in dark room and for how long...Push the guilties in to the concentrated acid containers if victim dies out of such brutality and chop their hands off if the victim is alive. I may sound inhumane but are the culprits are human 🙄. Do they even deserve humanity? Or we ppl accept these facts that culprits belongs to your safe shed and will never be punished. You all are equally guilty as other culprits untill you get them punished.", "n_bpoems": "Someone ask Mr. Godi, kab khaulega khoon tera chaiwallle, jab desh ki saari aurtein maar jayenge..", "mukshnaaa": "@narendramodi can you do something instead of just roaming around the world and improving public / country relations? Kis desh ki suraksha ke liye aap videsh jaa rahe hai. Pehle Uss desh ko surakshit toh karlo. Taaki desh ki betiyaan jalaai na jaaye? Kab karoge law strong? Jab aapke khud ke ghar ki koi beti jalegi? #MakeTheLawStrong.", "imsurvi": "@redheadwayfarer Totally agree with you!! There is no justice in getting 4 men being encountered! We need stricter laws! Sadly the chosen one (The people who are elected) are the people who are with stained backgrounds! The so called law makers sitting as representatives in the parliament are thselves accused of various charges! How do we accept criminals making laws that are Citizen friendly? Its not about any political party..its the people we have chosen as our representatives who sadly are good for nothing! Despite such serious crimes against women if a strict law enforcement is taking ages..is only because there is reluctance at Their end. One more reason to vote responsibly! Also, Indian Youth can not always remain at backstage when it comes to politics. This country demands(needs is an apt word) new thoughts..A different perspective! The old set of retards need to leave!", "nidhi6414": "Why is it soo that to prove one self right .. One should be buried live till death.. Just to prove this gov. The actual truth", "x3504105x": "boht phail rhi hai ye", "_ricebell": "@jishnu_bhat read", "missanjalimishra": "😶", "vaishhh.__": "@redheadwayfarer well when marry kom or hima das won the medals for India you didn't post anything? That time you didn't said Indias daughter? Why all the time negative side?", "oddnaarii": "🤯😡🥺😭", "mad.i.e_shejwal": "They can't encounter the accused of Unnao Rape Case.. They can't do a shit when there are powerful men involved..", "utsa_bagchi": "I second each and every word you just mentioned....a politically motivated encounter act to shut up the enraging population against rape....but guess what ni amount of encounter can stop this heinous crime", "arushigupta_17": "😓", "prateek7parihar": "@shifuji_jaihind @narendramodi @presidentofindia 🙏 please .", "dr_sameekshaa": "I totally agree with you...", "divya.tiwari8": "This breaks my heart over and over again. We need more people like you. I wish we could unite and do something more than writing a post. I'm in if you're doing something of that sort.", "miracle_maitri": "Trueeeee and That wasn't a justice That was not something which we asked For Government To Do...Law Should Be pass For this Fucking Rapists Because They just shoot 4 rapists What about Other morons !???We haven't Get JUSTICE and Our Fight and Want still Should Be Go On...............", "avratt16": "@narendramodi @smritiiraniofficial", "drunkandspill": "You know there are some stubborn people who just never accept their mistakes no matter how wrong they are, yeah this country's people are like that. Whenever i try to talk how corrupted this country's people has become they think we hate the country, NO we don't we love it. It's the people we hate and they are referred to this country's people because of the fact (nirbhaya, Priyanka reddy and now this) that we see and hear and can't deny the reality. People commit crime and they find loopholes in our law system. Human rights and justice is not really for victims in the 21st century it is for the criminal's to find loopholes get the benefit of the rights while victims are punished with crimes first and soceity second. I just can't take this anymore seriously it horrifies me from inside out", "hailthedoggo00": "And I m in so luv that I wanna bang that ass😍😍💋", "thesmalltownblogger": "Just so terrifying! Why do we need so much time by law to give the survivor the justice they deserve.", "meghad11": "I want to ask one thing where are the human rights activists now? Yesterday I was watching Nirbhaya's (that's how we will refer to Jyoti, because #protocol) mother say that her daughter's perpetrators are under human rights and hence they can't be given the death sentence (I have paraphrased her statement of 5 minutes here). So, where are the HUMAN RIGHTS of this girl from Unnao? Or just because she is dead, we don't need to focus on that anymore?", "kartikvithlani_9": "Rip", "purishivu": "😭😭😭😭😭😭", "_sasuke.s__girl": "And some people be talking about the rights of the rapists even After the victim is dead *slow claps*", "sidnaaaazlove": "@dikku391", "disha_manocha": "I can't even get myself to 'heart' your post, because what is there to heart, really? It's just deeply saddening. But, here I sit wondering what can I do to bring a change, how can I make it better?", "noahs_words": "I salute you 👏🏽👏🏽👏🏽👏🏽", "sylvia.horta": "@narendramodi", "aurora.whorealis": "I’m so proud to know you, but especially after your coverage of what happened to this poor woman. Thank you for continuing to be an advocate and a voice for women.", "saumitra2987": "Very disturbing but it is the TRUTH. AND THIS is the genuine situation of this country.", "vinit22632": "In a country where we celebrate navratri, durgapuja....shame on us that we are even living in an age where women are being treated like this...we dont hv a right to celebrate really...wats the use?", "aditii.05": "You are sooo on point! I praise you! Thank you for speaking out!!", "amitahluwalia76": "😥", "one.drink.amy": "Cannot believe I like in a world, where humans do this to humans. Let alone men and women. We're all sufferers. None of us is safe. And since it's 'mostly women' (as they casually put out), I'm only anxious. Why do I have to think 10000 times for everything? Why am I not safe ANYWHERE? What world is this? Is killing those men really justice? I spent my yesterday thinking whether what was done was right or not and will it really prevent men from molesting, eve teasing, harassing, brutally raping, burning and killing women. My mind has no thoughts. There's a numb inside me that can't be explained. Don't understand if working, earning, living a normal life here is worth it, where on some part there's another woman getting rape. If the death of \"alleged rapists\" is also not calming us down then clearly it's NOT JUSTICE. And do we need random, unlawful killings like these to improve the country's condition? I don't know. And I don't who will ever bring about a REAL change, because this isn't. 😭", "priya_izzie": "On point!! But they are proven to be guilty because they gave statements. It's the need of the hour apart from that there is a bigger picture . Why men who are raised by women only are behaving and hunting women like a prey may be because somewhere women have in their minds some logic less thoughts about creating a difference in raising a man and a woman. Awareness should start and also those conventional thoughts has to be deleted from minds because how you are grown up has nothing to do with ur daughter or son. Purification of mindsets should start from home thru friends and society. Ofcourse people are busy but atleast make sure the creature you gave birth to is ur responsibility. Please be aware and be strong.", "deep.rao92": "negative soul \"shitheadwayfarer\"", "sahas_715": "Where are those human rights activists now?😏", "jhanvi.shetty09": "On point❤️!!!", "being_praveen1203": "@archit_dubey03", "irahonam": "@redheadwayfarer she walked approximately 1km to seek help with 90% burnt n her body.", "gorgeous.divas.insta": "I'm surprised you haven't talked about the actual change that the govt brought in..... 1000 fast track courts to be opened in India exclusively for women safety related incidents and faster implementation of law.... Is that a good thing or not?? Yes i fully expect you to celebrate that news since that's what you were asking for or are you just playing politics in the name of feminism so you'll just ignore it altogether? @redheadwayfarer", "rajevbjanjuaa": "Sorry to hear about the loss of life. But @redheadwayfarer I feel India needs a new law for Rape. It's not a death sentence but Govt should tie up with KSA and hand over all rape accused to them for trial and sentencing. With the name of KSA these crimes will reduce. Death sentence is given to many and since then the crime of this kind has taken a rise. It is disgusting to even think how cruel a human can become.", "idivyatanwar": "💔", "dey_arpan_26": "Thank you . Because atleast a few people still talking about the main issue we still have . Killing those 4 criminal is not gonna stop future rapes. We really haven't achieved anything yet. People literally thinking about the temporary thing. Not the permanent.thank you", "sahil_nandi": "the 4 men accepted that they had raped and murdered the girl so they were not just four men trying to escape they were four men proven to be guilty for raping and murdering a woman! @redheadwayfarer", "savitasdulani": "@sumitdulani", "twinkle_2109": "Man, I can’t even like this post... It has made me even more angry on our society..!! @redheadwayfarer More power to your voice..!!", "mantu__107": "😭😭😭💯", "hippybooboo": "For all the people asking for trigger warning or wanting to speak about subjects which will make them happier, I would really like to point out that Saloni had given a clear enough picture in the post. If after that you choose to read the whole caption and get affected, then that is not her responsibility. This is a national conversation which is needed. If we need to be shocked to keep it going, so be it. It shouldn't be that everyone moves on and only gets back to talking about justice when there is another horrific instance. Honestly, reading the posts here make me feel more determined to bring out change.", "deepak_singhwal": "shame🙈 up government shame", "from_another_plannet": "I just posted literally the same thing. I feel you. I fucking feel you.", "raj_kamal_bagri": "😢😢", "tyagizclicks_2": "Death is not just enough for her culprits. They deserve something worse. Just killing them isn't the justice now. THEY SHOULD BE MADE TO SUFFER MORE THAN WHAT THEY HAVE GIVEN TO THE GIRL. Ab to jaag jao UP police!!", "ali_butt6007": "Any Where in the World Rapist Should be Hanged in a Public..So nxt time no Fucking Person.. Have Courage to do such Act with any Other girl or Women.", "sameerawaheed101": "So sad to read this the brave girl lost everythng. Every fucking thing. Kudos to the govt. For the ppl?! Ryt", "marsgeek": "Well said. It’s almost like a woman has to always stick to the norms set by the society to not get harmed, to not be raped. And still if someone commits something heinous and horrendous against her, society always throws the girl under the bus. I’m concerned about where we as a society are headed towards? Why does it always take another mishap with some innocent girl, to be vocal against the inherent patriarchy and misogyny? And why does that energy die out after it’s off the news? Why do most men (who support the strictest of the actions against criminals on social media when things like this happen) shout and shriek at the top of their lungs against feminism? Because from what I know, feminism is synonymous with equality. And this is not even about feminism for that matter. It’s just about the way society wants a woman to behave or dress like so that she doesn’t send off a signal to be raped or killed. So kudos to the parents of all the men and boys whose interests lie in violating women because they weren’t abiding by the rules.", "gulshan1447": "Isse pehle meko apka post random lagta tha...ab meko lg ra ki aap sach me sahibho", "itsporus4content": "The sad part is that it's not just girls and women! These monsters attack 3 months old babies too! Which then destroys the oft repeated refrains - She wears revealing clothes ; She should not be out at night; and more. The worst ones being - She should give in, else the rapist will hurt her badly; She was asking/inviting it. 😢😔☹️", "bhavya.bajaj": "💯", "landonhope10": "I’m shook. I m freaking crying right now. Is sexual pleasure so much more valuable than someone’s fucking life. How inhumane people can be. Like how. It’s extremely profound and devastating to hear such incidents . India really needs to teach it’s sons how to respect the gender who gave them their freaking life @redheadwayfarer", "sushantdivgikr\nVerified": "Verified", "abstain_from_abstinance": "There is a crime then there is justice. What happened today in Hyderabad was far from justice. Rather it was an equally gruesome crime. We lost as society when we celebrated cold blooded extra judicial custodian murders of the accused. We are also losing as society when we raise such cold blooded insensitive people who could burn alive another person. We have just lost in both the instances. Be it UP or Hyderabad.", "zarya5670": "😢😢😢😢", "asma.alvii": "@ayakar_vibhag", "deeps9105": "yes u r absolutely ryt, men to choro women ek dusre ka support krna to durr , baithkr uss warrior pr tarass khaa rahi h , this society is full of shitty mindset , aaj hi quora pr ek post pada jispr virginity test pr ek aunty ne itna shitty rply dia ar unhe logg support krr rhe h , change logon se aata h pr itna sabb kuch hone k baad b women still apna muh band rakhna jyada prefer krr rhi h , there is seriously something wrong with us.in short i hate me that i m living among these cowards 😠😑😑😑", "swesala": "Thank you for putting our collective emotions into words that resound. Everyone needs to do better. The police 'heroes' are no exception.", "misssshreya": "Yaa police took some action against tis Priyanka's Case.. but still it's not Justice.. v all didn't got Justice still now fully.. V just need to done our government & law strict rules to take action against tis devils... Priyanka got Justice may now her soul rest in peace...💫 But wt abt the other woman who r still fighting for their life, rights, safety & Justice.. wn they will get Justice & rights & safe life.. make government, law strict.. for better tomorrow & better future.. Make India safe place to live & humanity..🙏🏻🤐", "shamgurav21": "Everything well put in caption. 1000% agree with you.👏👏👏", "munnabach": "🙏🌷🙏", "the_gassy_muffinpunch": "I'm so exhausted. I know we have to keep fighting against all odds. She couldn't have and can't die in vain. But I don't know what to say or do anymore. I'm just so hurt. And clueless. Sometimes even when I've heard all the factors or reasons behind this horrible pandemic, I still don't understand. How? Just how? I do know how. I just can't process it though. I'm too exhausted. I hate how rape has become normalized that people can go on with their lives despite the shit that's going down. And tomorrow? I might just do the same. Be in denial. But tonight, I'm crying. For her and everyone who's been hurt. I didn't like this post because I can't. It's not something I can double tap for a love icon to appear. Because this is vile. Disgusting. Repulsive. And I can't take anymore of this. I can't believe if this is how I feel, how do the survivors feel on a daily basis? Gawwwddd. My head's about to explode. 😖", "harshahahahahahahaha": "She's ALSO gone.. Girls are going out of this world as it's anyway not worth living!! This world was never a place even worth breathing for women and never will be.. Every girl will die with hate in her heart I guess!! Every yug has proven.. Be it Draupadi or Sita or Nirbhaya.. No respect, no life, no happy world. Women are born like magic but are gone with disgrace!!! #broken #shameful #disappointed #hate", "shrey4190": "\"Unnao victim believed in the legal system and what did she get? Like getting gang-raped wasn’t enough, she also had to get burnt alive by her rapists who were granted a bail by the same judiciary, she trusted. FCUK the civilisation where a rapist has human rights under the law.\" - Sonam Mahajan", "mollymheld": "This is disgusting. She’s not suffering anymore but it shouldn’t have happened to begin with.", "iam.unableto.can": "💔", "tamursheikhoo": "Incredible india", "tanvii_thukral": "Thank you for speaking out. We are still far away from the real justice. It's sick to live in this country anymore!", "willfadeaway": "Nirbhaya case culprits? That horrific brazen crime happened in 2012..it's going to be 2020.. Why fucking so much protection to rapists murderers? 9 month child just raped! Molestation eve teasing set the judiciary system on fire ...let us become that janwar and show them we won't tolerate anymore.No enough is not enough.ITs not enough...it's never going to be fucking enough..I am angry and I condemn my own country for having such lagging law system and loopholes in it. Let the common man take the justice in own hands. @redheadwayfarer please🙏", "inforstyle": "Fuck no! I don’t even know what to think or feel anymore.", "not_so_female": "😢😢😢", "tanisha_bhattacharjee": "Saloni it's great that you're speaking up, but please use some trigger warnings, a lot of your audience are or were physically abused and rapped and a post so sensitive such late an hour can be very harmful for their health.", "alexfey1": "RIP", "sarojbrijendra_official": "Yes! You are absolutely right ,I am also Feeling same thing ,Low order should be Strict and should be eqaul for everyone ,So That Victims can get justice Atleast .4 Encountered but what about rest.😔😔😔😔😔,", "estelle.art.conservation": "Thank you.", "_mahi_agarwal_": "I love your writings ❤️It inspires every girl to speak out whatever they feel without any fear of judgement! You are just amazing !", "just_jagrati": "I think there is a brighter side to this world, why don’t you ever appreciate it? People are already sad, everybody already knows what’s going on, everybody who is on Instagram knows everything that’s there on Instagram. I follow you, because I really like you, but sometimes I feel like reading something nice. Something that can help me deal with everything. I look out for your posts. I wait and wait until the last line. I really want you to help instead of pointing out problems every time. Please saloni. None of this is to offend you, but I really really need to feel better. I want to feel better. Everything that’s going on around is sad. There is no pressure, you have the right to be upset and angry. But just as a girl who reads everything you write, I look forward to something that can hold me back together. So Please! :’(", "__tanuyadav": "ZERO FAITH IN HUMANITY, if that is even a thing here .", "arvindmerwah": "🤐 speechless", "dharaa_13": "We support you and we will fight this fucking patriarchy and politics together. We won't sit back, come what may. You are absolutely right @redheadwayfarer . Each of your post is a piece of inspiration that can actually, actually bring a change in this world .", "mayank.6596": "Today what police did ,is appreciatable and good this is what has to be done..but if the rapists had big rich or political backgroung then police coudnot do that .....", "bluntnrustymaverick": "a post i cannot like...😒", "manilisokar": "😢", "_inspiredcapsule": "I m sick now😢", "magnificent_faraz": "the world has lost the fighter but heaven had gained an Angel", "karishmar143": "Utterly heartbreaking news😥this fucking assholes are everywhere!!!@redheadwayfarer", "teju_jamblekar": "True... I did not know how to react. when the news broke this morning.. I wish we can put strict laws.. Prove someone guilty in two weeks or lesser and then hang to death.. May be telecast it to create fear.. But this is not success.. It will only be misused even if this case was true!", "rtrjessica": "So what the Hyderabad police did to those rapists was actually justice! See what happened to her. She trusted the legal system and the judiciary!", "ciaranmcgilloway": "💔", "dr.bhartiii": "Your are sooo on point! I praise you! Thank you for speaking out!!", "spartan_701": "This is heart breaking💔", "evanne_the_terrible": "Sooo true.", "archnadass": "Gut wrenching and heart breaking. I don't know why this happens... I can't fathom what people get from abusing, exploiting and killing other people. I just can't. Women and girls and overprotected till their own will is smothered instead of making the world a better and safe place for them and everyone else. It just breaks my heart. I don't know how to express all the anger and sadness I have inside of me.", "hasan_sharif_adnan": "What u are saying is true in every way .. 😥", "missroy14": "We all celebrated the killing of the 4 accused in the Hyderabad rape case. It was the first news I saw this morning and I was honestly very happy. But there is another side to this story, what if they weren't the ones who did this. What if they were innocent? The police caught them within several hours. Was there any proof other than their so called confessions? What if these confessions were beaten out of them?!.. Now this is why we need to just believe in the judicial system.", "_brar_aman_": "well said🙌🏻❤️", "shubhi_25_": "I just read the whole news and a wave of anxiety hit me. I’m 20, I’ve experienced a lot of cat calling, a lot of weird uncomfortable stares and I just feel so helpless. As a 20 year old girl living in India, I just feel heartbroken. It could be anybody. And it’s so scary. It’s scary how so many people still blame women for this, it’s scary how we have failed as a society.. we’ve failed to contain sanity.", "accessoryfreaks": "Is this the second case like this this week. What is going on? We need to do something", "_potato_02": "Nothing is over. Unless this fucking law and the mindset of the sick people of India is not changed we will all become the names in the fucking justice hashtags one by one. And it will continue.", "seerutkchawla": "This is fucking horrific. Please keep ‘interrupting’. We need to not look away.", "itsreenaparekh": "❤️", "jig_3_xvi": "I don’t even know if dropping a heart is appropriate", "eishitaa": "Saloni PLEASE PLEASE PLEASE put trigger warnings. Please. Some of us get triggered by simple mentions, let alone full posts. Thank you for speaking out though ❤️", "anand.k.sharma93": "🙏🙏🙏🙏", "shiva_daddysgal": "Numb and 💔", "probinmeitei": "UP police killed the accused like Telangana police", "rzualbawih": "💯💯", "gladiator_fox": "Thank you for writing this, it needed to be said 💙", "ankit_nirvana26": "Victim’s identity is not revealed because it’s a LAW! Do you know how much harassment media houses, public, relatives gives to the victim and it’s family? Also it’s hard for victim herself to carry on fighting. It’s a gross violation of Supreme Court’s order when it clearly said not to disclose victim’s identity. It’s not because of what society thinks, law thinks on much deeper ways.", "_pretty_madcap": "That's so exactly what has been disturbing me for the whole day, since the ENCOUNTER's news!! I mean what about the other rape victims, what about their part of justice, why did the fire vent out before any changes in the current legal system, why is there so much appreciation on an act (straight out of the movies, to gain in mass support back)? Are those not a concern anymore? We just want our souls to be at rest. Recently, a man in Goa buried his wife alive just because HE wasn't able to bear expenses? No difference between insanity and sanity to be seen around in this country!", "parvathysreenath": "Can feel every single word you have written saloni, i wish if india did better, and we felt safe. May her soul rest in peace.", "ad.i.ty.a": "😢😭", "travell_toe": "Fuck society & patriarchy", "salmanzaidiluv": "I am numb and speechless. All I know is that development is a myth if these matters aren't taken in hand. The government should start focusing on problems within India first", "anshita__malik": "I am speechless and numb atm. This not what she deserved. This news has completely broken me. 😭🤐 I no longer have any faith in humanity.", "akankshavats99": "💔😔", "_shubhisingh_": "@sahilbaluja", "harshshukla7390": "RIP🙏", "_komuuu_": "Is this another rape happened or priyankas case?", "kirbyamour": "You are everything woman.", "i.akshay_": "So saddening"}