{"__m_k_d_": "I follow you because you always write the truth, and your photos are nostalgic ♥️", "lendiboi": "RunD n ugly", "rangrez.ziya": "Bcoz uhhh are very good person misss cuteeiiii😘😘", "chandhana_singaravel": "Because : You're an inspiration. I look up to you. You broaden my perspective. You enlighten me. Your views are intriguing and beautiful. Thank you.", "rezurit": "You are an inspiration to me.", "muskanlohia7963": "Beacause i like youuuuuuuu", "spieziojohn": "Several reasons, in no particular order: 1) pretty face, 2) good photos of nice places 3) interesting insights at times. All Together your content is compelling.", "_goks__goki": "U r badass🔥 love 💙", "sannechino": "Beautiful 😍", "_bubblesome_": "Thoughtful! And revolutionary!", "ruchijas0030": "Your personality and song choices ❤️😘", "urvashisheen": "Because you are \"the woman should be\"😊", "imwaleed007": "Sexy🖤🖤🖤🖤🖤", "lesnar21": "You have done nothing to motivate me(coz i am man) and you are always against us. I do not follow u and never will. You are the only person i dont respect. Believe me i am not your hater. I never demean you or say bad about you. But i will always search you in my free time and always write my strong thought on your thought about men.", "sameernaheed": "I follow you just to keep hating you, not saying this out of any sarcasm or to grab ur fucking attention. I just hate u, i hate u , i hate you @redheadwayfarer", "garimasingh2399": "♥️", "_rhitama_": "I'll probably say writing too but mainly the pictures yes. Your pictures are so beautiful because they are so unedited and raw. So many of us are so insecure about our bodies and your pictures help us accept our flaws and our body for what it is. Thank you. ❤️", "yogeshgadekar04": "Girls DM me for sex chat or have free fun", "manisingh0109": "Because you are phenomenal and makes me never wanna lose hope❤️ so Thank you 🤗", "ankification": "Extremely pretty😘", "dearasmityuvi": "I dont flw u neither do I double tap on your pics but y do your posts pop up on my feeds", "darshan_rakholiya_": "The main reason to follow you is the self proclamation which i found often while reading your captions.", "i_m_tarun_sangwan": "I m following ur idealogy from last few years .. Nd I really like it way of thinking. I follow ur idealogy 😎", "ilea_na20": "Come follow me ❤️", "sbg_sharmistha_bts": "I follow you because I loved your character in girls on top and now I love you because you say things which can move people and you are inspiring 😍😍", "pia_410": "Because you are a true inspiration and you r very cute🙌😍❤️❤️", "medhavista": "I follow you because I love your thought process and the way you pen them down. I follow you because you are you and not pretending to be someone else. I follow you because you're so expressive with showing love, happiness and even your vulnerable side. I follow you because you inspire me at so many points and motivate me to work on myself. I follow you coz you remind me constantly how important self love is. And yes, I'm waiting to pre-order your book. But I'd just say, don't ever stop writing coz you have no idea how many lives you are transforming in the process of just being yourself. Because in today's world, that is a brave thing to do. Thank you for being you !!", "jayalaxmi_suyambu": "Because u r the Change u want to see... N I love that!", "ar.aishwarya_kohli": "I don’t follow your account. But every now and then I do search for your account and I like the content you write. Every picture has a story and I love your thought process behind it. And in many ways our thoughts match on a lot of topics! So yeah! 🙂", "amit_adwanii": "@redheadwayfarer I wud have definitely gone for your book and let u know what motivates me abt u...but Blue ticks only revert to blue ticks!", "ayekay00": "Because of your ability to be what everyone is afraid of being the most; themselves. A true, raw, scarred, imperfect wholesome self that isn’t afraid to conform, I find that baffling. I am from across the border, but I am someone with whom your captions resonate completely.", "great_zeus007": "Gremlin", "swees.99": "@ahoud.210 تذكرت ناصر القصبي وهو بنت", "ar.jun742": "Mam we all want to see you in person to see your beautiful cute parrot big nose in close up 👃. If given a chance we all want to pierce your nose and fix nose stud for both sides of your nose mam 👃", "shifa_maruf_": "Because your captions are on point and i love to read them and you are a great human @redheadwayfarer", "_lil_maiden": "Let me clarify you then. People especially men follow you for your provocative nude posts. And the rest are dumbass immature girls who thinks feminism is getting nude. Tbh it's literally making me laugh that you're calling yourself attractive", "aaryansha.sinha": "I'm eagerly waiting to pre-order your book. You're an inspiration for us! I admire you ma'am", "_juhimullick_": "Because your words can move mountains in me and they let me be comfortable with the way I am.❤️", "khushbookumawat27": "But I like u", "harsheys1999": "Because I love how you don't let society and it's thoughts change the way you live your life. Stay strong ❤️🔥", "jaggadaqu": "Because you are different, straight forward and you speak what is true and what is right. And most importantly you inspire me. ⚫", "kharbandanavya": "You are my idol!! ♥️", "quirkazoid": "SO many reasons, Saloni. For one, you're always honest with your writing. 💕 And now you're a hooper too! ✨ Its only getting better and better(in terms of inspiration I draw from you)", "saraswatip22": "You're an absolute inspiration❤️ I read what you write every single time", "notharshalshettyisweartogod": "People who found this post via the explore page: 😳", "_s.o.m.y.a._": "Because you're someone, who've changed my perspective of almost everything!❤️ And yeahhh, eagerly waitin' for your book!🤞", "itsayushiiii": "Everything 🌸♥️", "bhavishya.09": "You are some one I look up to 😁😁", "soumen_saggi": "Hi Saloni this is Soumen. A Bengali movie named \"Bramha Janen Gopon Kommoti\" (Bramha knows all the secrets), talks about breaking taboos. If you see the poster, it is showing the protagonist (Actor Ritabhari Chakraborty) holding a sanitary pad, hot water bag etc. that a girl needs during her period days. This film raise questions about gender imbalance, restrictions during period days and other so many old myths which we generally follow. I think this type of awareness in form of movie / other media source should come out to every part of our family, lives & society. I know you have written so many post regarding this issue earlier. But It's my request to you, if you please can post something about this unlawful social practice. Thanks and lots of love to you. And yes you definitely inspire me. That's why I follow you❤️. #redheadwaferer", "throw_me_that_blanket_please": "I follow you because you inspire me!!!💜you have made me so comfortable in my own skin and you continue to do so...i love reading your posts 💜💜💜 you're making so many people out there so confident 💜💜💜 thank you so much💝keep on spreading love🌼✨💛much love to you ♥️", "samairah98": "Well it does help to have a pretty face, putting across subtle, powerful images aesthetically but it is your writing that ensures the double tap eventually. One can get bored of beautiful shots but not of words that remind you the things we should care about", "mansi_d103": "I guess people follow you because the content you post is what actually people wants to read these days.. You Inspire. You motivate. You give hope. You make your everyday special & your post makes someone’s day special & Yes Ofcrse, You are really pretty too ! 💛", "myadi1748": "👌👌👌👌", "nirupama_amapurin": "Because you are fearless. Or maybe sometimes feel the fear but do it any way. Because I'm so happy there are other women who believe in sharing openly and not concerned about unfounded societary norms. Because you make me think. Because I think you are beautiful. Because I love the way he loves you. Because I wish there were more women like you 💪❤️ #pleasekeepsharing", "nehab_0907": "You and your righting are your thoughts purely....you don't allow other to change your thoughts(be it boldness, your career or anything thing)....That's the best part of you...Hence #(I follow you)", "_the_greeneyed_girl": "You have a content which is Real Raw and Relatable❤️", "hunarjot_kaur": "Your words and thoughts❤", "banarasi_food_blogger_": "I am following you becauce of your efforts in your every post💯", "himalidave": "I started following you after watching GOT maybe coz I liked the character that you were playing or just the over all series I felt a connect with!! But once I started following you, I found you are such a different person!! Your thoughts, write ups, posts made me connect with you even more... it's 3:48 am and I'm commenting on your post see how much I'm connected? 😜But trust me, I don't follow many celebs religiously or comment/compliment them. I love the fact you like our comments and maybe even reply if you can. Bottom line, I follow you coz I find you genuinely Genuine!! You speak the truth, you portray the reality and give strength to many to come up and speak!! I can relate with you and I so wish I can speak my heart out so easily someday! 🤗❤️ Much love to you!", "queenserqet": "No. For many thing. No you are not a pretty face . You are not a pretty attractive girl . You don’t inspire (people don’t go on insta for lack of reading inspiration..) don’t take your self too serious plz :) you want people to praise you and so on ??? 🙏... I follow you coz it is fun to know how a (WANNA BE ) in India thinks 🤣😂🙈", "hot_and_beautiful_babes": "When you broke up and remembers that he used to pull my hair which turns me on wow that feeling 😍😍😍😛", "tej.aswi": "Your posts challenge my thought process . They are motivational ,most importantly they tell me to feel beautiful ,empowered in my skin @redheadwayfarer", "manojextreme": "Elegant", "iamall4music": "To be simply written, you pen down your thoughts better than anyone I know!", "rishikaagrawal": "Because you express what's in your heart not caring about the back lash it may receive 😊", "anita_sapkotaa": "I find peace in your words. Love from Nepal.", "maahisinghs52": "Positive writing", "_miss_saxena__": "I follow you because I love your blogs", "a_nush_ka_07": "We're on the same pade Di and our thinking and vibes match alike ! And so it feels awesomeee following ya !! ♥️😊", "alive.so.far": "Because I'm in love with your thoughts!❤️", "travelshareninspire": "Your captions are just amazing. They always motivate, they are all about uplifment. And yes of course your pictures are just brilliant and raw 🙌", "abhijeet_mahat0": "See I'm not going to lie at this thing ... I started following you since your show \"Girls on top\" came out on MTV and I found you as the soul of the show and you and shantanu together were so cute ... And of course because you are beautiful as well ... But later I started liking you so much as you motivated us and in evry post and in every caption of yours you have always given us a reason to smile and taught that I'm not a failure in my life and many such things that I don't have enough words to explain it. But I have one dream of meeting you in person before my last breath. #lotsoflove❤️❤️ #keepsmiling😊💕💜 #keepinspiringus😍💖 @redheadwayfarer", "rvrajan": "@redheadwayfarer And yess..i think you very much think like me..i connect to you..i am still not that open as you are but yes i like the way u express", "manshi_kesharwani20": "Your writings amazes me,and makes me happy to see that such people do exist here🌻", "jitsinatorsukhanis": "Because ur thoughts and mine are same that's why follow you and I love travelling like you :)", "paushalli": "Because you believe. Even with all the atrocities and negativities, you believe and work towards making today better. And that's all that really should matter.", "singhshasmita": "👌", "prachi_mehra01": "For your courage and what you write 🔥", "minischievous": "You get prettier, coz of your thoughts, the way you say it, the way you're not conscious or afraid of it. To me. ❤️💫", "vrindaharnal": "you give words to all the problems that we all face and wave off in our lives . more than a pretty face you're a pretty soul , a great writer(ofc) and so unfiltered for every fucking thing that you want to say. not giving a shit and being the real you 🙌❤️", "simransahu618": "@redheadwayfarer I love you, I have been following you since the series of Girls on top💖 it's love and so are you Ishaaaa😘 really you're so amazing and you got serious topics to talk and you inspired me, many more of us from that! Your thinking has eaten me and my barriers within myself🔥 Thanks for that ❣️ I'll keep supporting to Ms Isha( youngest producer😉).", "sugarfish_21": "I like your content. Sometimes I agree sometimes disagree but it gives me different and unconventional perspective everytime. And make me question so much about everything around.", "ash.is.a.time.lord": "Definitely your thought provoking write ups", "_._leoness_._": "Being motivated by your words since the beginning....", "the_amy_creature": "You are an inspiring beautiful human being and you never cease to open my eyes about issues happening in this world today.", "letters.andall": "Everything maybe?❤️", "shefalimishra611": "For your beautiful mind. The words you weave never fail to amaze me, arise within, a sense of strength & wonder. The audacity to stand by what you think, the brave little acts of every day life that are not little at all, the wistfulness of giving something to the world to remember as long as we're alive. You... You inspire. 💙🌼", "sharfabeing": "You motivate , inspire and I love you ❤️", "muskaanchawla": "Because you are real and the love you have for yourself makes me wanna believe in the power of Self love", "ripsythourani": "Because you give words to my thoughts!! That makes me feel connected to you😊", "ambikarai0150": "You actually motivative us 🌸 in a beautiful way🌸 in a pure way of love🌸", "lonelywand": "Ur many things but pretty or beautiful is not one of them.. being dead honest. You are a partial hypocrite who uses women's rights etc for your benefit (sorry that u r). No u don't motivate me", "kevisano_k_rurhie": "Your caption are powerful and confident in itself even though you have your beautiful posts tagging along...Also I admire your optimistic and confident enough in being yourself..... 💞💞", "khemkaanshul": "So cute", "my_best_buy_": "Hi everyone! We're a new shopping handle on Instagram. Follow us to see & grab premium quality stuff from our place. Posting will start shortly. Do follow us. @my_best_buy_ ✅ 💕", "abvposiyan": "You inspire us", "vaishh_vajipeyajula": "You're a true inspiration, I have your post notifications on and whenever you post a picture I know I'll learn something new today or I'll have something to question and ponder. I follow @rahulb90 and @saerahstamps cause of your very aesthetic pictures, cheesy content and also all the relationship advice that is realistic. Everytime you post something, I wonder how much more real can someone get. That's why I follow you ❤️❤️❤️", "mariahassancafe": "I searched for you on insta after watching and hearing your #Me too interviews and following you since then.I have a huge respect for you as a human being and as a woman.It's just like you grow fond of someone.So I like to read your statuses here,your photos and everything you share with honesty and straight forwardness,Flaunting your skin the way it is.No filters,no drama,no fakeness.You are YOU Saloni.Hats off❤️ .Stay happy,healthy ,blessed and safe with your family forever❤️❤️❤️❤️❤️❤️❤️", "manasviiparmar": "Because I want to be the woman you are ❤️ Love x", "rupin_kale": "Many of my ideals match with yours", "supersparkyy0y0sammysingh": "vibe match", "indurovert": "You inspire and motivate", "aparna_s_j": "I follow you because you inspire me to think, to be a better human being. Each and every post of yours make me feel things I probably haven't even thought of maybe. Thank You ❤️", "thicclittlelady": "I follow you to learn. To know more. To unlearn. To change. To connect. To be more me than ever was before. To feel a certain sense of belongingness. To smile, sometimes and wish often.", "niggy1803": "Because you’re so comfortable in your own skin, and that is truly inspiring. You put in so much thought and effort into empowering other women. Your writing’s brilliant and I’d definitely buy your book 😇", "hairzsarah": "I like reading your thoughts on women in today’s world. I also like your travel photos too. 💖😊💖", "mazar_khan_786": "I received tons of upvote notifications from you on many of my answers followed by a beautiful appreciation message. But you still didn’t follow me then. Hehe.. I checked your profile (that's obvious), read your answers, loved them, replied to your message and followed you. But that's not the only reason to follow you. You are someone who lives life in each moment. You inspire people. You know how to be a better version of oneself. You know how not to give a *French Collection  dom* to what haters think about you. You are a wonderful loving , a soulful beautiful , a good singer, a fitness enthusiast and what not. There's a reason I call you “Engine 24/7”. You never stop. Reading your answers and talking to you is one of the best feelings as you are a complete package which no one wants to miss. I still remember the days when only thinking about you gave me strength in tensed moments. I truly admire the way you handle complications in life. I don't think there's even a single reason not to follow you. You know how to care unconditionally and simply being there for someone without any questions, expectations and accept them the way they are. Thank you!", "reminiscent_impressions": "Because you're unapologetically yourself.", "ghaznisaab": "If someone follows your footsteps they will be a spoilsport.", "dusky_brown_girl": "I follow you because after reading your post...ur kinda a motivation and an inspiration to me ❤", "_peanut03d_": "Coz you say what others Only think of saying...🔥", "keeeeeeerti": "Your anger fuels me to not let things slide by", "_.sameeeeer._": "❤️❤️❤️❤️", "anish_jackson": "You are pretty😍😍😍😍", "jinx06": "TBH at first for your travel pictures but then over a period of time your writing intrigued me. More power to you and all the people you inspire.", "kmani786": "Because you are @jatinderdhir 's sista. 😂", "subhashini_natarajan": "I follow you because of the kind of optimism and confidence that you shower. The way you give hopes to all women out there. I'd definitely pre-order your book. Much love. 💙", "cupie.db": "I love your Writings and I love everything about you. for me you are my inspiration that leads me to do something that I never believe it could be possible ❤️ 🤗 PS - I love you❤️ #myInspiration #mymotivation", "gokulravi08": "I had full faith in the remarkable abilities of Shri Ajit Doval.  I was very happy yesterday seeing his proactive approach and his guarantee of peace.  I heard him say \"I give my word of honour\". And then, violence all through the night.  Delhi Police and CAPF not competent? Or?", "andrew999_444": "@tatianabubbles for a second I thought it was you😂", "_a_girl_has.no_name__": "Cause you made me change the way I used to think.Because of you now I don't judge people in any way.. 💕❤️", "ntrilokriya": "I found u very attractive....that'd", "fapdda": "I guess for the unnecessary drama?", "joshikakhatri7": "I follow coz u r very inspiring 🔥", "amol_rchabukswar": "Because your pretty face 😘👸", "imperfect_monk": "Pretty face and girls. I don't think that's a bad reason.", "the.girl_has_no_name": "You always say exactly what I want to hear", "poojapundeer": "I used to think alike and react whenever even small disturbing things used to happen. There was one moment when i convinced myself that problem is with me. It's me over thinking and overreacting. But When i read your thoughts i realized that it's not me or you, problem is the problem. You are an amazing inspiring fearless soul and i love reading almost everything you write. Wishes for youuuu ladyyy @redheadwayfarer 🥂", "the__overthinker_": "u r the who can make people think..as i never commented on your posts...but this time your words make me think... that's the power of yours words,more over your strong personality", "priyankasingh_31": "Because u r unfiltered....in the world full of drama and people seeking for followers you are the one who don't care about what people say about you ...which inspires me♥️more power to you @redheadwayfarer", "musicosaur": "you are a beautiful person, who is helping me be me ❤", "arati_pradhan": "For writing... 😊", "usman_chohan20": "loLzz i folloW uh because uh looKs like @katrinakaif to me..... ☺☺😍😘😘😘😘", "iamnandini__": "I have been following u since u were thr in Girls on top. That was my fav show at that time. But after tht u became my inspiration.. U taught me how to be comfortable in my own skin my own body. Moreover self love. ❤️ Thankyou😘", "aditinarang95": "You give voice to the everyday issues women face all over the world. It can be hard to put the pain and the way you feel into words at times. But you express it beautifully. Kudos!♥️", "rupalsingh2799": "Because your captions are impressively conclusive. It helps me calm the storms inside my head(the reason I never stopped checking your posts).💕 I saw you on Girls on top(the reason why I started following you) I loved Issh.... But I love Saloni more.", "priyanjalirajta": "Because, you inspire me in many ways. 🌸", "prernapnegi": "You say things that every girl wants to. :)", "shoutolovessoba": "It's all of the above! The writing which is straight to the face without being covered with pretty lacey papers and the travel pics.", "__architaa___": "Because I love you... And when i say I love you,it means i love the way you make me feel comfortable in my own skin, i love the way you maintain your relationship,i love the way you speak to us like you know each of one us personally,i love how real you are..i just love you♥️", "saanjh_gidwani": "I am gonna book my copy for sure...its not your pictures but your writings...you really make me think and trust me!you are the big inspiration and you have always been an eye opener...simply,you are love girl❤️", "monzmania": "Cuz of the body image positivity I get from this account !", "nishant.a.a.y.u": "I love to read your captions❤️. There is so much to tell about you but can't explain in word.", "cloudy_thoughts9": "Because you use your voice in the right way ,and you inspire us 💕💕", "kashmishr": "Wooow❤️❤️❤️ couldn't believe, it is u . @redheadwayfarer . I read you and try to understand you . Lekin nahi samjh saka .. follow karta hu taki alag se vicharo ke sath rah saku", "amit_the_limitless_": "Earlier I used to follow you because there were lot of bad and insensible guys following you. There's not one reason to follow you. (I don't even follow you all the time but I like to visit your profile at occasions) You ARE attractive and beautiful (to me at least), and you travel (Croatia 🇭🇷 I remember and loved), your posts have given rise to conversations, debates and fights, girls and women feel inspired and motivated by your words and posts, and they feel connected (that's so important), you are a woman who speaks as she feels and thinks (that's the best not just for you but everyone who connects with you), ALL the reasons are there, all the good and meaningful reasons are there. And, you are beautiful!🎉 #YouAreWritingBook #ThatIsWonderful 🌟✨🌈🎊", "the_sassy_dreamy_girl": "Your thoughts, words motivates me. Your writings helps me to see things clearly❤️", "peii15_pam": "You're such a true inspiration , awaited for book💙", "_architagarwal": "Good face with meaningful content. Your posts make me think. 🤔🤔 Didn't know about the book. Would like to check. 🔍", "anuja_arvind": "You are the inspiration for self love ❤️", "adibantai": "I follow you because you make me think and question things", "rajathbolar": "It's a sustainable effort, also u intrigue me.🍸", "niki_shots08": "You are my lady love.. you are pretty inside and out. I am so inspired by your content.. lots of love 💕", "shyampappala": "Coz a friend of mine asked to and I don't regret 😁", "ritik.jolly": "Killer Looks...♠️", "coloredemrainbow": "So I followed you because your voice was pretty unique in the show girls on top and like since the intro scene of that show I was like that girl is different you know like amazingly different. Then your hair color and the way the show ended up so good and your daring posts. I have unfollowed you and followed you back lol I mean I don’t really mind bras I’m in love with bras and something so minor as a big deal I was offended but again in a country with that much stuff against women I get it how women wanna be heard. Anyway idk what I was saying. Oh yeah and you are couple goals and I love your writings too I end up reading it all. That’s rare. Also, you’re amazing and love how you got no insecurities or are good at hiding em. Yk thanks idk if you’re gonna read it but here it goes", "breaking.tables": "You seem to be cool. Also, I like how you don't care if you have a little bit of tummy, that bikini ain't going nowhere.", "anupranavi": "Initially I started following for traveling pics BT by time gone u motivate me every time you write something. You changed my perspective of thinking on many things. I respect u❤️@redheadwayfarer", "crusthero4": "You instill in me great values. I look at you with my jaws dropped when I see you treading forward as bold woman. I feel powerful and different in the most beautiful way. Btw, I didn't you have a book coming out, send me the link please 🖤⚡", "arshi__k": "Because u r the voice of today's women", "theblissthing": "Cuz once a person commented \"BEWADI KUCH BHI LIKHTI HAI\" & you proved yourself to the whole globe and womanhood around \"BEWAJAH LIKHTI HAI PAR SACH LIKHTI HAI\" I follow you cuz you empower me to stand to speak up for oneself and I follow you to explore everything along with. @redheadwayfarer you ain't just beautiful face to Get followers you are beauty with brains and the most important part you are flawed and I and others truly can relate to this💜 iloveyou and by the way thanking for viewing my story that motivated me tones and excited for your book 💫❤ @redheadwayfarer", "kananpai587": "Beautiful😍😍", "sassysashaying": "You restore a woman to herself. 🌠We often wander off to places that demoralise us, curb us and chain us to opinions. It is so difficult to retrieve ourselves from all the negativity around us, but you take us back in time , to a place where we can belong , to a place that we can love and nurture. You take us back to none other than our very own selves and teach us how to fly a little more everyday. ❤️", "pallakjagga": "Because you are hope.. and you are love 🌸", "nidhideshpande__": "You are my inspiration!!", "marta_sev": "Because I find you natural in your photos and uplifting in your comments. It feels good to see women who don't pretend to look the same as other models but who show their natural beauty and are not afraid to look different from what media wants to portray. 💙♥️💜💚", "scatterallourstars": "Your captions 😍", "adnanjohnson": "No words... Bless u.. Amen", "tiwary_nupur": "I never see the picture. I always see the caption. I see you are not a \"feminist\" or a \"sexist\". You are advocating for equal rights! It is primary and people have to know this! Kudos to you girl❤️.", "snehal_p_gaikwad": "Because all the things you say n do, I feel I could have done that but cant", "samim4945": "Maidam mujhe 1 work parmit visa dilado Canada ka ya UK. Ya USA.. Ka please bahut sari duayen milengi aapko meri family se. Mai apne family ko support karna chahta hoon.. But i don't have any degree. But i speaking English good.. I heve experience 15 years in garments clothing stitching.. Plz maidam.. Thank you.. But bure haal me hain ham aur hamari family plz.. Thank you", "lost_in_subtitles": "Your storytelling from your picture shouts feminism. Means you are living definition of that for me. And that's what keeps me hooked to your contents. Be it anywhere. You highkey inspire me.❤️", "thesassymitz": "coz you are real ❤️", "fuchsia.nomad": "The way you beautifully express yourself 😍", "_shhalini_": "Because you're the voice of many women. 🔥", "glucille": "I met @rahulb90 one random drunk night in Dublin many many moons ago, we might have actually been children, and at one point of internet creeping I saw photos of you together. You both genuinely look so happy as a couple so I started following you, becuase women should support women. 🌟⚡🔥", "divyam.arora1": "Your boldness in your pics. I mean it can be seen by ur poses. Not giving an f to things that are bullshit, kinda attitude.", "__.ak9999.__": "Your too much cuteness that's what matters❤️", "natashaaajwani": "Because you're different. Because you believe in bringing change & also act on that. Because you make us love all our flaws & embrace them like never before. Because you make us think that it's okay to feel things, to feel low but also important to rise up from it. Because you're YOU & never been anyone else. Love always & forever💕", "rishabhrai2225": "Don’t know the reason but I just love you for freely describing each and every thought and emotion so freely ❤️❤️ @redheadwayfarer love you😍😍❤️❤️", "taraphine": "Because you speak.", "sankalp_mittal": "Pretty face, definitely. Who doesn't like one. Travel photos is the main reason tho. But after this, I will even try to read your posts!! 😁", "notsosanskari": "Because everytime I chose to rebel, I know I have someone out there who taught me I really do have a CHOICE!", "chicalaaaaaa": "You’re beautiful inside out🌸", "diya_misal18": "Oh, you’re way more than just a pretty face. Your writing is so pertinent and everyday you stand up for girls, for women, for everyone and remind us what it’s really about. And you and your boyfriend (I know he has a name, too😂 Sorry.) Rahul,are real cute together.", "tanvijindal": "Because you talk the talk AND walk the walk, and you are challenging the norms and you make me think, and I hope on some days, you change the minds of some people that actually need to start looking at the world differently. ❤️", "vermashivani00": "You always tell the bitter truth of this World. Very few have the courage to say the things you say. You speak every women's unspoken thoughts, which they are afraid to reveal to people", "_m_u_s_s_u": "Because you inspire me & also I love you for who you are❤️", "saltybuttercup": "For your writing of course plus everything else also😘", "deeps9105": "bcoz of your thoughts give me hope and encourage me not to suffer in silence and accept the way i am and the way i think ☺", "abhradip_acharya": "I love that you don't judge anyone and let them be what they are. And I love the way you express your thoughts in the caption, which sometimes gives me the courage that I'm not the only one who thinks like this and can speak up about it. And obviously you are beautiful and your pictures give me the confidence to be comfortable in my own skin, though I'm a boy.☺️ I love your travel pictures also. They are so so refreshing. Most of all you speak your mind out, I just love the way you handle yourself. 💗", "ra__shi__22": "💗", "unoriginalusername0001": "Because you're not superficial. You're genuine. You're human, and not afraid to be one.", "_reeshika_": "Coz you're one cool logical person in the world of stereotypes and judgemental people. You sincerely inspire me for teaching me the art of not giving a fuck and loving yourself❤️", "avantikalkar": "Hey, I think I started when I liked something you posted quite some time back. Later on I did not remember why did I follow you because somewhere I thought you were too loud with everything that you did (back then). But then I read your post of your views on feminism around a year and half back. I was in a place where I myself was figuring out my believes and that post helped me a lot, I related to it and there was an impact. Thank you for helping me get some direction somewhere. Helping me believe in feminism as a theory concept and even beyond. I won't lie if I say you were amongst the firsts who led me somewhere on the 'feminism' journey. Thankyou. :)", "sonalv3": "You are brave. Period. Most people hate you because they can't be.", "tchoujar": "Fab writer cousin!!👌🏼", "maitha_almuhiri23": "You motivate me and make me think", "_same_sane_": "You words always makes me think sooo much deeper...like i dig deep down inside me... Its kinda refreshing how bindaas yet responsible you're", "fantaisie.drug": "You inspired me more than anything in life", "mostlysane_guwahati": "Because you're so inspiring💖", "alex_david009": "पहली बात तो ये है कि आप दिल की बहुत अच्छी है, आपके जितने पोस्ट और विडीओ मुझे देखने के मिलते है तो मे ज़रूर देखता हूँ और आपकी पोस्ट पढ़ता हु। मुझे ज्यादा इंगलिश नहीं आती है पर मे आपकी लिखी बात की फिल्लिंग समझने की कोशिश करता हूँ।आप मुझे बहुत अच्छे लगते हैं। 💐💐💐😍😍", "pupe_1098": "Because, before coming across your page, I categorised my ideals and thoughts as 'too forward' or 'only for rich people' as our parents describe it. And that we have to be okay with things because this is how society is. Uncivilized yet unchangeable.", "kajalnaveensardana": "@redheadwayfarer I follow u coz...girl u have a kind of magic in ur words...ur words can make a change....a change in the society...a change in the mentality of people all around...u r a magic in your own❤️❤️❤️ pls reply🙃🙃", "mohakchaturvedi": "You have a perspective that i lack , its always learning something new every time.", "aviana_rachel": "I follow you because the first time I saw you in an interview with Sunny Leone I think a month or two ago. And the words uttering out from you really got to me. Believe it or not everyday women are being stomped off on though there are so much women power throughout. I love the equality you bring out in everything, I love the loving your own body before letting others say anything about your body. There aren’t many desis who discuss such things so publicly. These are the reasons I’m following you. You inspire me in the most utmost manner which makes me question a lot of things in life and helps me make a better decision at times.", "onismsoul09": "Your words! They force me to think, contemplate. Even if it's just for those few minutes.", "vansshikkaaa": "Youre very motivating", "miniatureamazon": "No hesitation in telling truths. You’re a true advocate for women.", "memoirofcloud": "You intrigue me. I like you being vocal with your words and as Chinese says A picture speaks a thousand words likewise your pictures that's why I follow you. 🎈🌺", "shanky.loves.yuh": "Love you😘", "senga_samoht": "Because u are so truly urself in all the ways that really matter...In your posts and your writings you are unapologetically yourself. You help me embrace myself with all my flaws and quirks.And your Writings are well thought out and really beautiful....Thank You for Existing😍💕", "nargis_qureshi1": "I follow u cause u write abt ur love life in a freely way , u dont think what other people wil think abt ur life abt ur relation. U talk everything that people dont. Peopl always hide their love life. U writ exact right feeling that i feel in my relation. Everything is real fact. Real feelings.", "fashionmate21": "I follow you because of the voice you have. Because of the way you make us and every girl out there feel. I follow for your realness and for your bad assness.. I follow because I feel you can make a difference and in a good positive way!", "tani.russa": "Becoz u give me hope, u give the courage to understand that it's okay for me to have body hairs, extra kilos and I wasn't wrong when I talked about sisterhood and lifting each other up. U make me believe that I am on right track of self love and sisterhood. Lots of love and hugs to you ❤️❤️❤️ @redheadwayfarer", "sarvdeep_": "Let me be honest, I actually usually don't read a lot of your captions. I find your pictures cool. 🐥", "vishalrathore13": "So beautiful🎉", "ashwinijoshi996": "Because you are unapologetically your own self. You have made me comfortable in my skin, with my thoughts and the fact that I can be a feminist but still like to look pretty. You have reinforced time and again how we need to stand in solidarity and not break each other, what this patriarchy has taught me. You help me unlearn gender in this society💜", "hasan_sharif_adnan": "Because you are beauty with brain 😍", "animasindur": "I always read ur content and am fond of whatever u write. Love the way you speak ur heat out abt the topics where generally people hesitate to give their thoughts.", "ny10091999": "I love the way u think.. I love ur perspective abt each nd everything which u mention in ur post... Basically I love the way u r... The kind of person u r ... I have never saw a person like u at such a young age who thinks totally different from others...", "priyanka_kumari_suryan": "for your words❤️", "a_humananimal": "You are raw on style & light on attitude!👍", "iterative_infinity": "A lot of your posts are nice. And I live your pictures - they seem REAL and of course, supremely attractive❤️", "mohor_rc": "I like to read about strong personalities. And also to know how you work things out with your partner. Especially the long distance part. Loads of good wishes. 🍁", "dharaa_13": "You motivate me more than anyone in this world.", "dpritze": "Because i love evrything about u💯🔥😍", "sakshi_joshi_03": "I follow you because you inspire me every single day. From being a teenager to being an adult these 2 years with you have been pretty amazing for me because you gave me power to come out in front of my mom about my childhood abuses ❤️ You are an amazing amazing person Saloni dii and i don't know if you are gonna read this but you are a blessing to me ❤️", "aaa.sa.tha": "Started to follow you to learn from you, eventually turned into just liking the picture and scrolling 🙈🙊", "siddharth_peepra": "Mam😍", "__vmoonchild__": "Bcz you motivate me and make me think💜", "hanyarajendran": "Hey Saloni , you are always inspiring,I just love how u inspire me ,I usually used to scroll down the posts I see but your posts made me read and think .i saw u at India gate ,I was scared to talk but now later I regret of doing it", "bumukula": "I admire your voice and what you say. It helps me to think stronger for myself", "dimpy_blueberry": "Few months ago I saw an interview of yours by Sunny Mam....& I was like 'Omg who is she...Damn cool 🔥' Then I wanted to see that topless pics of yours... But then I realized it's not about your pics.. It's your words 🔥🔥🔥... Now I love the way you guys enjoy ur life 😍after all you are so real and pure... That's what I feel... So much inspiration..", "gemini_illusion": "Everything! 🌻", "surbhi.chawla412": "Because in this world full of people too afraid to be real you speak your mind however bold your words maybe. You are a reminder that the future is female and the past was female too, it just wasn't acknowledged well. Your captions make us think and most of the times they are relatable to an ordinary person too. It puts me at ease that even a person with thousands of followers puts so much of thought in her captions when she can just garner those numbers with her looks alone! ❤️", "architekasma": "@redheadwayfarer how can you even ask what makes us follow you? Every word of yours is so powerful, it keeps me going... You are love... ❤️", "cric_lover99": "You changed my idea about feminism👏👏👏👏", "yours_truly_devil": "Let me come honest .. I had a crush on you... When I watched ur 1st show on TV... So after few years when I saw you on Insta.. I instantly followed you... Then something happened... I just came to know... Tht u r not just a pretty face... Your words are maybe more beautiful... N that didn't help my case of having a crush on u... Now it was bigger than ever.... You are an inspiration to not just girls.. u r an eye opener for many boys out there.. although the crush still exists... M happy that even if it's not me... Another bong has ur love 😉. Stay blessed...n keep inspiring...❤️", "r.o.y.s.y_j.o.s.e.p.h": "I follow you for your captions 🔥", "freaky_foodie_yatri": "Because you raise your voice on those topics which are ignored completely. I like your take on different things, small things that do matter and makes a difference. I like the way you put your words on topics which are termed as \"taboo\".❤️", "sonaleegedam": "You make me think🤗😍", "wild_monk_07": "Ur Captions are Worth Reading And Inspiring 🤗🤗", "karan200790": "Because u have spark in you to motivate other to live their life with there own ways👍🏻👍🏻", "anshhbgp": "I follow you because in your post I see an independent girl you raises questions that should be relevant but nobody dares, you raise your concerns about how women are treated in your post I see a free spirited girl who never bothers/worried of what people or the society thinks about her, and then your travel posts are travel goals and then your beauty is mesmerising", "bhatt.nutan_": "Because of you I found out the answers to many of my rebellious questions, which I never asked out loud. You gave me hope that there's still someone out there who won't go with flow if it's wring and try to break every stereotype. We're in this together.💞", "devgolia": "Love how you speak your mind. Changing the world one caption at a time. And I absolutely love your posts with Rahul. Makes me have faith in true love. God bless.", "stopbeingsoextrasrish": "I love you, your writing, the voice behind those words, the fearless woman you are. You inspire me and I'm the kind of person who would even spend 10 minutes just to read your thoughts beneath that photo of yours. You're💞 lovely ❤️😍", "pessimistbitch": "because I'm amazed by your strength to go on despite all that people throw at you. I scroll down the comment section to see if anybody has posted anything offensive. when I find one, I report the user. your courage, determination and hope is contagious. The fact that you're POSITIVE that you're gonna change the minds of some people, if not a huge lot, and your tireless, relentless effort towards the things that I can proclaim that you truly believe in, is the reason I follow you. ভাল লাগে ভাবি, যে এতিয়াও আশা আৰু প্ৰচেষ্টা শেষ হৈ পৰা নাই।", "mukaann_": "You are a inspo. You radiate positivity. Strong vibes. The way you are is the way everyone should be ♥️", "__.anupama": "Found your words attractive especially the captions💓....btw this one is awesome😂", "vanshsoni6340": "Being your fan since girls on top❤️", "seeming_v7": "Because you're fierce and speak up what needs to be heard. ❤️", "writer_rajeev": "Ufff🔥", "mr.iu15": "I like a girl who does and says what her mind likes and doesn't give a fly about others think . I do find that quality in you so that's why??🔥", "aarushii_sharma": "Well because you are an inspiring woman and you make people feel worth about themselves. You fight to break the stereotypes & the things you say are just apt.", "debabrata190576": "🔥🔥🔥🔥", "snowkars": "I think your my fellow traveler & ur damn hot in bikini❤️😍", "gbsharma302018": "🔥🔥❤️Dem hot looks dear", "sidd_mehta608": "Perfect thought of life shows on your post, specially I m want appreciate you for all this @redheadwayfarer superb 💕🙌", "devrajchhikara": "T way u write👌👌", "alexthehungriest": "I like seeing things expressed from a perspective I cant see on my own", "maher_supecute": "Bocz u make our minds free of the concern this society has set in our minds.......u are freedom...and seeing u makes us feel we can also be free...without makeup...or watever u wear..Its U... thats wat we like abt u ....❤️❤️❤️❤️", "ishani.chatterji": "For the way you write and the conversations you start❤️", "priyankjain19": "You do motivate with your words.", "css_03": "I follow you because you have a big role in saving me... in taking me out from a guilt trap (i have msged you with my story when you asked for #iamnotscared) and i can not Thankyou enough.", "_norwester": "Your writings are always hard hitting & inspirational & I love how you embrace your body & dreams", "thebooworld": "Waiting for your book🤙🏼", "maryannejohn0208": "Because you're trying to make a positive difference ❤️", "kimberly_marie_noronha": "Your post on the rape of the Indian daughter is what caught my attention. But seeing your take on life, your blog about your relationship is something I find attractive. With regards to your book, should it be very soon, your Instagram posts would have to suffice for me. But someday, I'll definitely purchase a book by you.😊", "the_hippie_head": "U r the chief who is making her tribe strong not just herself.", "the_instyle_journal": "Beautiful 😘", "nktgoli": "Fab🔥", "projectzerowasteindia": "To read what you're talking about! Some of your posts have made an impact that'll stay with me forever!", "_.fiftyshades07._": "Because you write too good and inspiration for many maam♥️❤️", "dikshaadhikari007": "Bcz you talk soo openly and somehow make me motivated to comfortable in my own skin when see your travel photography . And your post for your partner always Litt🔥 . You are soo strong . It feels like whatever comes in life you always has own perspective to deal with it . I get really good vibes when I read something on your page . Always empowering and motivating .❤️", "trulyavani": "You have made me ask questions to myself that I never would have dared to", "smithaearl": "When I first came across your posts , it hit me so hard that , all this while I have been wanting to talk certain things out in the open... And when I found you as the first person to have done that, it gave me a sense of power and I felt as though I met you in person with each of your posts... You instigated the reasoning in me that was dead for quite sometime and since then I've always given every single thing in my life a reasoning... And the way you empower every woman out there is just impeccable... Love you @redheadwayfarer for all that you passionately post and write about... You changed a lot of my perspectives towards many things in life... Thank you for that... ♥️", "_korobiii_": "Your book !? Really? Anyways I follow you because of what you are and what you write is inspiring, encouraging and always worth reading.", "rakeshz_rb": "I follow Yu....bcz i dun knw...when I see you..it jus feel gud..I jus feel positive...🙂", "npranali512": "I follow you since girls on top💕 I love the spark in your eyes 🌈", "_suhana_b": "Because you write what I'm thinking at that very moment. I resonate with your thoughts and I share your post because the world needs to know it too. It's a very strong feeling when I'm writing this. We click and it's just amazing.", "aaronth50": "Liked you since u were in a serial long back, forgot the name.", "rashmi.__.sharma": "I follow you cause whenever I read your writings..i just feel a lot of things...it makes me think about stuff that I never think about..they make me feel good sometimes..vulnerable sometimes..but the best part is that they make me feel ..I love your page for that reason..and I love you as a person...as a girl I relate to..as a woman I look up to.. you're great🙌💜", "tiwari.nancy": "It's because you force me to unlearn things that I have been taught as a child and am imposed to believe........ You make me think and when I do I can see clear", "priyanshi_singh___": "Eagerly waiting for your book!!🖤", "garrulous.gal": "I like how you put ideas and thoughts into words. They are very affirming and relatable.", "pratibha2121": "Indeed the picture you post are Awesome however what you write is the reason I follow you. You have a blessing to write the simple things in the most beautiful ways!! ❤️", "bhagwati__khatri": "Love your content ❤️ I read your every caption 😍", "riddhithummar_": "Because you motivate me a hell lot than any other people around me! When I read your posts, I feel like 'shit this is the same way i feel'. Your words encourage me to do better and never take a leap of silence when something wrong is going on. Your words push me to speak up what I feel to the people around me. Thanks for being here!♥️", "shikhar_vishwakarma": "I'll just skip to next one. 😁", "aishwarya_ogrey": "I follow you because your words, your write ups are so powerful. It really reflects power. You talk about a lot of things which needs clarity in our country. Few years back, in a dark phase your words really worked as rays of power. I learned to battle solo for self. @redheadwayfarer I love youu❤️", "kushhealer": "I am male but your capitons. make me think about #womanpower 👍👍👍👍", "_akantaaaaa___": "You’re a full time motivation sweety. 💕", "faheemba2648": "#beautiful❤️", "vanitanekhwani": "Because you are brave girl 💜", "agnisikha27fire": "I see a", "priyanka_joshiya_": "Bcz you’re inspirational ❤️", "romyysinghh": "Posts to think about!", "rewa_thomaz": "Because your words are \"hope\".", "apekshakongovi": "Because you just don’t give a shit about what the world has to “label” and continue to be yourself.", "stephanieee_morris": "You inspire me to be a better person!", "unfineshedsentence": "Because u motivate me", "sumitiiiii_": "Because what U post maximisely it's so relatable in our life or we as face it.... May be somehow it's motivate us...... 🙌", "pocahontas_the_poetess": "Well I follow you since I joined Instagram you're first of few people I followed. I come from a small town and I was conditioned to believe that my feminist thoughts are \" too much\" and I'm \"extreme\" and that I wouldn't ever fall in love with a guy if I'm too \"picky\" I think that was the time around end 2016 or start 2017 . I followed you because I loved you on girls on the top and you're Instagram didn't feel like you where trying to have a small talk rather start a dialogue about something bigger and loved reading what you had to say and I felt hey I feel the same I'm not wrong I'm between wrong people and I try my best to show them the right. Then I moved to Mumbai grew into this young woman of unapologetic thoughts and can proudly say when I first moved here I couldn't call a sexist college friend but now I am not even scared to call my professor on her casual sexism . I don't say you were the reason I'm strong I'm the Reason I'm strong and this person right now but you, malala ,lizzo, my past , the people who wronged me , the people who correct me and the people who support me and most importantly ME and the self acceptance helped me become who I'm today. But waking up and seeing to a picture of yours talking about body positivity and acceptance is way better than waking up to a post talking about how a tea will make me thin. So on my journey of self acceptance and self love you have had made a contribution as well just like so many amazing women in my life and world. And thanks for not giving up on what you believe in because I won't either . I don't completely love myself yet but I don't hate myself either. I am more accepting of me and I'll probably pass this message to my fellow females just what I got from reading your posts little - little, day by day over years. Tschüss!!", "a_random_meaning_": "For the way you write about things that matter or make you angry. 🔥", "pallavi__tour": "Bcoz you show us boobies 😂", "amrutha.murugesan": "Travel photos and writing 💜", "ankita_dazzles": "u look so good in straight hairs", "napidnas89": "initially I started with your travel photos but slowly I started reading your quotes and thought about life... I appreciate your thoughts...", "ektad07": "You are a brave girl, I appreciate it your words do a magic .. Nd your thoughts the way uh express yourself its true nd inspiring.. I have been following uh from your show, where you had played a bold character nd what I found, you are brave in a real life too. You are amazing.💖", "ammu_raghunadh": "The writing. The feminism! Absolutely love it😍", "murtuza1812": "Cause you write well.", "vanita_aarya": "I always read what uh read , I really get motived with your words , uh hit the point and it's smooth and clear , I adore uh as a person , and uh reveal what uh are , uh done fake ! That's what I feel :)", "craezinaari": "Because we’re still unlearning things we’ve been taught about being a girl , some of us know how difficult it is to do things that aren’t expected of us but some don’t even know what’s going wrong and what you write and say is all we wanted to hear. And I’ll take this chance to thank you from all the girls, women and everybody who’s learning a lot about themselves just by your existence in our life by your feeds, captions and post. Lots of love.", "neha_singh_001": "You are such an inspiration to me❤️ i love you 😘😘", "tanya110292": "You make me think and motivate n appreciate everything about myself . N a friend says my body type is like you 🐥", "imdivyar183": "Your perception!! Your long captions that are worth reading!! You motivate, inspire, push our thought beyond limit, also you give Major couple goals with @rahulb90 😛♥️", "mayeda.chikan": "Because I'm in Luv with your vision for the world. You think different and beautiful. Above all, your posts make me fall in love with myself. I'd definitely like to see positivity in my feed. It's great scrolling through and coming across your posts. You are such a great positive energy. I'd always be thankful to you for everything post 💕💕💕 Lots of luv from Kashmir.", "kapoorkaran950": "I was told you were a victim of a monster named Sajid Khan...... I 😔feel for you", "shaishcastic": "I follow you because you believe in breakin the stereotypes❤️", "gratis_soul": "I follow you because I find you standing up against one small thing that has conditioned for so long. I see a beautiful human slaying it who is vocal and expressive, something that I wish to be and I try each day, just like you. ❤️", "sachinmathane7": "Wowwowowow", "_soul.seeker": "Because you are women with power of words for yourself and other women who can't speak for themselves. Because you are the light in the darkness of patriarchy. Because you make womanhood look beautiful ❤️", "__oyevd": "😍❤", "__aditisharma": "Because you are adorable and you always inspire us🙈❤️", "sanghita21": "Because you say what I say, only on a bigger platform, and it feels good to know that I'm not alone in this daily fight", "yogini_riadawar": "For your writings, waiting for your book 🤗", "lazy_crocodile": "Wow gorg", "jisleen": "You inspire me!", "santy.mentalist": "Because you make sense, and everytime you write I learn so many things.", "_.cinderelllla._": "I've been loving uh since girls on top🙈♥ you are literally beautiful person inside out!! You are a whole light of inspiration!! No words to describe, keep inspiring us!,☺🙈love youuuuu ♥🙈 ps:-you look so pretty damn🙈😍😭🌈✨💫", "agyapragya": "💙💙💙", "i.shaona_": "I followed you first when you appeared on Girls on Top. I liked ur acting. Then I have been reading all your posts for all these years. And its really motivating and inspiring. ❤️ i like your viewpoints and i will definitely read ur book when it comes out. Maybe even pre order it. 😁💫💫 I also love to see u travelling cuz its my passion as well and secretly dream of having a boyfriend like your s. He is too much goals! ❤️ lovee uuuuu tons!❤️", "vishra_shah": "Bcoz when at night, you appear in my news feed, you show me that there is someone out who has same lifestyle and life problems!", "_aparna": "Because you make me think on things which i would have otherwise never known they existed. Yours isn't a feed Just for photographs but i genuinely follow you for your write up; for breaking streotypes, it's not just about putting content but like as said words have the power and you sure do create shift in mindsets of people little by little with your words. More power to you 😊😊", "supriya_2477": "Inspiration💕", "goku2672": "A more important question is that why do you give a shit?", "_mahima.verma_": "Because you are my motivation, nd inspiration,❤️", "upontheabyss": "I love your account. Whenever I feel insecure or low, I read your posts. You make me feel strong and Happy in my own skin. Also, I'm waiting for your book badly!", "m_ans_i_ary_a": "Bcz u r soo beautiful...also i watched ur show #GIRLS_ON_TOP . And now the final.answer is tht.....every time whn u write smthg....its olways diff. Its unique ..its motivating...nt me ...bt also everyone.....who needs to be motivated in their zone.......i don't knw wht to call u...mam, miss , di, or jst call by ur name.....bt u dnt need any name....(aap bht acche ho i like u..keep writing ...keep motivating us.......my b m aapse bht choti hu bhi yh sb bolne ke liye....bt u r amazingg😇", "bharatijkrishnan": "i'm an 18 year old student and honestly find it so hard to meet people i can relate to, people who are comfortable in their own skin, people who aren't afraid of standing up for the others esp when it's inconvenient. ik you get a lot of bs from people. BUT PLEASE DON'T STOP. you give me motivation to be happy, love myself. you make me realize that everything is not that hopeless, that there are people out there who will look out for the best of this country even when there's sm shit going around. love your work, please continue ❤️", "pulak.jain": "U actually motivate me AND make me think of things I didn't know we should be thinking about", "solo_shaan": "I just love ur thaughts .. after following u I got the courage to speak out ..", "rahulsingh291": "I follow because I see u r also a normal human being but trapped in a situation where every one wants to go ahead and u r somewhere in d middle ... but still u don’t give a fuck", "rv_rukhsaar": "I follow you cause you're a Badass! And I aspire to be as honest, vulnerable and bomb ass as you one day!! #brownheadwayfarer", "follow_your_vibes": "I follow you to listen to your views and opinions on different social issues. Fan of your travel page as well. I don't know what your book is about but will look forward to reading it if it is available in the USA.", "fanofdemon": "I just want to know how much complex u can think", "_shreya._____": "I follow you to read your captions and understand patriarchy better. ☀️", "lekshmikurup_2904": "Because you talk about things that most often I don't have the courage to tell to myself, let alone to others. Loads of love to you❤️", "thatcatladywithoutacat": "Because your words speak to me in so many ways, and if there is a book you're writing, then I'd love to pre-order.", "crestede": "Articulations on many unimportant pertinent issues, travel photos, humour,body/face in that order..", "kapur_tanya": "Because I like your eyes, your unapologetic personality, the confidence you portray and your lovely curly mane! 😍🤗", "ruchi.hai.building": "To learn from you to how to be unapologetically yourself", "meghna_la": "Your thoughts! Your writing! Travel pics! ❤️", "foodgrambyami": "I follow you because you motivate me to live & love the skin I have and just be yourself 🙌", "lavinadaryani": "You really motivate in many ways.", "kalon_111": "💕💯", "worthiest__pearl": "You’re honest and raw🙌🏽", "hitrocksbaby": "I saw you on #GirlsonTop . I loved the show as well as everyone , who is part of it", "adrijasanyal": "Coz you make me feel \"it's not me only\"", "krupa_patel_357": "Bcoz Ur motivate me sister 💕😘", "anajoy15": "I like what you write and none the less your pictures are good too..... your posts are a blow of fresh air....", "an_d13297": "Girls on top, of course!!! But besides that, you're an extremely brave and rational person. The points you put forth in episode 5 of Girlsfeed and even your stint with Vitamin Stree.. i loved it!!! you're all kinds of awesome, di!!!! 💖💖🥰😍😘", "xanshix": "Because you inspire me", "purvai.soni": "Because you give words to a lot of my thoughts about the society and myself. It makes me feel less alone and more understood. Kudos to you!", "aishis_1804": "You talk about issues that most people are afraid to talk about. You are strong. You are courageous. And we need more women like you.", "psyche_wolf": "Bcz i think you frame and pen down all \"perfect society,this is how society works,this is coming if ages rule wala society\" breaking questions that come to my mind often too. So i feel like ur my mirror reflection,but more vocal and bold. I wish to bcm confident too. And lastly,bcz ur soooo damn raw in this roller coster snakey fakey world....sooooo real i love it. 💜", "thepracticalrebel": "Because of your dimaag🙂 the way you think🙂 you views", "dakshina.hazarika": "U really inspire me to speak up ... Thank you for everything...more power to u....❤️❤️", "asmi98": "Because I love what thoughts you share it reflects your transparency, none of your posts are fake and ofcourse your travel diaries 😊❤️", "skylightlion": "Looking hot for a change", "samruddhiwani_16": "I'm 17 and I've realised in past few years I've lost myself in something that was constantly draining me, there are tons of things that we are taught and now it feels like it's not worth living in a mindset like that... I'm in my learning and unlearning process and trying to love myself more and you inspire me for that...💜", "darkpoetessisme": "Cuz you're open minded, kind, humble,... have lotta other qualities that i wish people had in them too. It's comforting to know world's not hopeless after all", "abhithesinger549": "I follow you coz you have the thinking which this society needs", "tania.b21": "You give me hope that there are still women like you, who are fighting for the ones who can’t", "the_ruthless_queen": "Coz your captions to the piks are inspiring 💕", "azna_._": "Because you inspire me to accept my flaws and be comfortable in my own skin. ♥️", "ashwineedeotale": "I follow you because my bro sent me a post about you... that’s how I was introduced to you... and I learn from you that being bold and honest is not a bad thing (or unladylike)... also I love your confidence and the way you embrace your body which teaches us self love and gives hope to someone who has body image issues... looking at your post makes me feel that u don’t have to look a certain way to wear a certain dress...be comfortable in your skin.", "ilumau": "You say what a lot of us think and wonder if anyone else feels the same. You raise important questions that make us think", "pickett77": "Because you're one of my favourite feminists on Instagram.", "what.moved.our.hearts": "Because your words are magical, they've made me feel comfortable in my own skin. Your sarcasm has made me smile. And also because you're beautiful! Are we waiting to pre order your book? HELL YES!", "riturajritu87": "Because I watched you on MTV talking about issues that was shockingly new for me that time. But that talk was one of those bricks that built me, so I follow you.", "flowing_river_soul": "You gave me courage to believe that yes, I can have my choices.", "cranky_cake": "@redheadwayfarer you're my inner self that has been suppressed for so long in terms of both. You're my mouthpiece. You're my mouthpiece. You're my words and expressions. Someone I would want to be like!❤️🌼", "kritika_nakshatra": "Because you say what many are afraid of saying. You compel people to think and rethink. You don't shy away from expressing your thoughts. Lastly, because you are unabashedly you.", "pszs1": "Would love to read your book", "suman_bundela": "❤️🧡💛💚💙💜u r like these colorful hearts 😘😊", "soumyapd92": "Because you feel like hope..... Because your captions are everything I want to say.... & I am definitely going to pre-order & read your book. @redheadwayfarer", "chethana_sisodia": "Your words, your stories, they tell me that 'there is hope. There is strength. Here, draw your strength from my experience. You are responsible for your life' I get this from following you and of course, all the mushy love you both share. Thank you, for each word you've put up here.", "supriaaa": "Because you ferociously voice your opinions. Because you talk about things that most girls still think twice before saying. Because I can feel honesty and vulnerability when I read your words. Because", "hopeworld270": "Because u inspire me 😍🙌 how to be comfortable and confident in my own body❤️", "justjassii": "I follow you , cause I find your page empowering and it does make me think and I hope one day I can make a difference in people's mindset too", "_____casio__________": "I think I follow you because you are a reminder that words are powerful and they can move people to such extent that it actually makes a difference.", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "silpa94": "love your writings", "deepa_tyagii": "You are amazing and yesss you motivate me.🙌🏻💕", "dhhaarruu": "Because u take us from darkness to light by ur words... we have started accepting our flaws and started loving the way we are... thanks a ton darling... u r a spark....", "iam.kesav": "BB nose 🔥", "itsmedipali_": "Because you're the girl what gives us so much confident 🙌to live our life without thinking of any one ... And not only these matter I actually like your spirit & your smile ❤😍", "mr_nobody783": "🔥", "neemishh": "@redheadwayfarer I follow you because I loved your performance in Girls on Top.", "gorge.nina": "Cause you are so raw and true and everytime i read your post i feel that 'you go sistah' push to be the same too.", "i_am_ruchika": "So here it goes @redheadwayfarer you are a kind of person one should look up to you have guts to say and project things and issues the way they are without filters without being politically correct n stuff . In today’s world where everybody is escaping from reality you are a breath of fresh air 💫 personally you have motivated me to be body positive and speak what should be spoken no matter what people around you think of that !!! You are more than a pretty face you are a beautiful mind and purest soul 💝 KNOW THIS FOR A FACT THAT IF SOMEONE IS CRITICIZING YOU THEY ARE AFRAID OF YOU BEING THE FIRST ONE TO BRING A REVOLUTIONARY CHANGE 💖 WE ALL ARE TOGETHER IN IT AND YOU ARE NOT ALONE WE ARE LISTENING TO YOU AMD TRYING OUR BEST POSSIBLE TO ALTER WHAT NEEDS TO BE ALTERED 🤞🏻🙌🏻 LOVE ALWAYS 💫 KEEP GOING AND WHENEVER YOU FEEL LOW JUST THINK OF YOUR TRIBE WHOM YOU ARE LEADING 💖 YOU GO GIRL IT IS A HIGH TIME NOW WE ARE STRONGER TOGETHER 💞💋", "deewana__09": "🔥🔥🔥🔥🔥", "sandeep_minama": "The way u thought about women empowerment", "andya_141": "No ma'am it's not like the way u think... Ya that's true u have pretty beautiful face... Bt apart from this ur captions videos really motivates...your questions make difference in our lives...your writings gives peace...Becoz of ur thoughts I follow u..and likewise u rly have a adorable face🖤🖤 and this wid double tap... I've tried little so that u get to know what actually I think abt you...", "asmi_rasmi": "I follow you to see your posts with your partner i always dreamt of those pictures for myself n i see those in your picture....i don't even notice what captions are there or any of your book...i just love the both of your candid...n i never see any couple from india pictured like you.😊", "boom_slamtheclam": "Sometimes I like your post and what they have to convey. It would be good if you can shorten your write ups", "arshia_gill": "Your words give me peace. That’s it💕", "hydropanic.90s": "Killer Eyes 😍🔥❤️", "naini.dawar": "Red hair motivation 😎♥️", "ajdent": "@redheadwayfarer I like yes the way you write... Plus the absolutely pretty, beautiful and gorgeous face is also another reason... But mist of you standing up to certain not do civilised people... #metoo movement... Plus you are someone who speaks your mind....no matter what no sugar coating from you... For me these are attributes which is why I follow you.... You so much more than just a pretty face.... So much more.", "bhumikaroraa": "Just gettin all the vibes after reading your writings ..you just write ...all straight and things we need to know and talk about ... simple you're awesome and motivating ppl alot about so much stufff. We love you ...alll good vibes your wayyy 🖤🖤🖤", "swetajadar": "U inspire me", "mritikaat17": "Because u r highly inspiring", "rishxp": "Caus you cute cute with a good heart😤😤❤️", "saxenamonikaa": "Your perspective towards feminism , what you write💜💜....makes me feel strong...so yaa that's why I follow you", "vanz_raw": "Because you are bold, raw and beautiful. Because you wear your brain as crown and words as necklaces. Because reading your thoughts seems familiar. Because your pictures gives courage. And yes, I am waiting to ore order your book! Much love and strength 🤍", "amritawacher19": "You are an inspiration to all us girls teaching how to use our voice and how its okay to feel not okay about the wrongs in society and be suppressed by it!🌼❤️", "varun_sigh15": "U r different n my 1st crush😍😍", "pragatiupreti": "because i can relate very well with all that you say.", "preeti_verma234": "Cos you actually raise the question , we generally refrain from asking. You discuss those issues that needs to be highlighted.", "zain.hebs": "You’re interesting", "desitadkah": "CAUSE YOU'RE WHOLESOME ✨✨✨", "pauljoyita_06": "Because I relate to what you say...And also I love you ❤️ for you being you ❤️", "spicy_vidhuja": "If you see my posts m also bold I mean m very same as you! Mere ass pass ke log bolte hain even my relatives that why you showing so much skin you are fat you should wear kurtas though my mom do support me but bich main I was start questioning myself ki sach m doing something wrong ! Then I saw your interview with sunny I don't remember the name ! And I feel ki Jo mujhe kehna hain woh hi tumne kitne achese kaha ! I always feel ki main Jo sochti hu woh main kabhi kisiko bata nai paungi kya words main us feeling Jo bata paungi ! Ki I love being like this of shoulder tops n low neck ! Abhi m sure ki mujhe likhne nai aaya hain properly ! But u can understand jaise I understand aapka woh interview ! In shorts we are same ! (Soch same hain ) girls can wear anything n they can post anything they want ! ❤️❤️❤️ Love ❤️", "bhardwaj_mannat09": "You are beautiful both inside and out!! Your posts are extremely inspiring and you help people broaden their perspective towards life. Much love❤️❤️❤️", "banerjee.ankush99": "I want to grasp the limits of your vanity!", "__precious._.camedhian__": "Captions💯", "panchhi_perspective": "I follow you for your bang on captions! You smash all stereotypes and give best of replies to all sexist, misogynist, patriarchal assholes. Besides, you promote body positivity with so much love.", "anandjosh.i": "Face good🤩🤩 expressed bad", "theyinfromtheyang": "I love your writing... It makes me think and ponder", "p_a_nda_": "Because to be you is to be brave and that's what you are. I've read each word of what you post💜", "rachana_mattur": "I follow you because, you speak out about things such as women, body positivity, sexuality. Your words push me to reflect on my thoughts and give strength to talk about them( not as unapologetic as you, but it's a work in progress) Thanks saloni for being and speaking your mind.♥️", "aguywithabun": "You have changed my thoughts towards Females. You inspire its okay to be what you are.. keep inspiring us.", "swatilekha_roy": "You inspired me a lot, like its not that im able to do everything you teaches but i try to do .. You , teach me to love myself again which i forgot totally. It is not that you are that girl i want to be in future but me. That what you keep on inspiring me, i think this is what you try to tell us. And ovio your travel photos, which i dream of everyday and hey you are preety lady", "_kajal.gupta_": "Been following you for a really long time now, I started following you when I came across one of your posts in my search tab. Since then, read everything you write. You gave a whole new definition to my idea of feminism. Your writing gave me strength, so many times. Thank you❤️", "dharchula123": "Because u r so beautiful...I love u", "_prernaamalik_": "To make the best of myself ❤️", "ash_winiieee": "Because you are one of the very few people on Instagram who claims and accept that they are not perfect (perfect in terms of the standards that we have set as a society for physical appearance) in times when Instagram is a world where everyone's entire life is perfect. And I look forward for real people with whom I can connect, share my discomforts and be \"not so perfect\".", "manofenfield": "Well am following u coz there is different vibe from ur side always like there are millions of girl are there but the way you write and express things are quite different also your words and paraphrasing is like a novel.", "juwhereya": "Because you're easily one of the most genuine influencers out there. In today's time and age girls especially I'd say are popular for all the unimportant reasons. But you're a nice face with a beautiful beautiful brain. Kudos!", "reeceroyce215": "Haye me marjawa🥺", "obsessed_dreamer_": "I honestly like your content. Everything. You, your pretty face, your travel photos, your way of seeing things of this world and definitely the way you express.", "nazzzzuk": "when can i preorder 🥳", "jhajagriti98": "No you motivate me also I find that people do have different thoughts and it's ok to have that", "sonaalit": "To something that is real. And that empowers me .you being so real ❤", "callmetarannum": "Body positive, badass feminist who is inspiring a learner like me.", "_jigsawww": "Because I relate and strongly agree with what you say. Because you are unapologetically yourself. Because you put my thoughts and beliefs into words. Because you are a badass and you never shy away from saying what needs to be said.", "ayushi.gupta00": "You inspire me! You motivate me! You tell me reasons to open up, speak and stand on my grounds! You are truly an inspiration! Love you ❤️", "kirtikabanerjee": "Lady, you're an inspiration, shouting out loud, we are capable of becoming anything that we wish for ! Breaking norms - holding on unconventionally.", "factsworldd_": "Mujhe apne dam pe jine wali ladki pasand hain isliye mein apko follow krti hun", "jowanjindal": "I ask the same question to myself whenever I saw your post or story!!", "lookbeyondlooks": "Saloni it’s not a surprise to you!!! You know how much I love and admire you. Whether it’s your ability to state the truth or just speak your mind. You truly have influenced my life. I recall your “red head days” back then you just wrote and inspired me. Today you write and I know many women follow you because you represent our experiences on a public platform. It take courage to be a face to a living moment and yes I will pay for your book and stand in a line like an ordinary person to get your autograph :) PS I love you 😘", "shreelekhapriyadarsini_": "No because we love u the way u are.. U keep motivating us with ur word.. I read all ur caption.. Its make me stay positive.. Ur are 🔥🔥 ❤️", "ashwinnnie": "Your have a different perspective at many things and that's what is intriguing.", "rasnadefeis": "Um all of the above. 🙌", "paru_thehuman": "Simply because you're a soul .. pure one ❤️", "over_intellectualizer": "Your words are just me. 🌼❤️", "luscious_grub": "Well, I followed you, I unfollowed you and followed you back.! Because when I unfollowed you I felt like I am missing something, I felt guilty of not supporting a girl who is fighting every day to make this world a happy place for other girls. I myself feel that while people talk about how we girls today have an equal place I argue where? How do they feel like that, because I don't? So, I follow you because I love you as you work for all of us.!", "lakshmydas": "You really inspire me. Your words give so much courage and optimism to fight for ourselves. You being a celebrity has rarely crossed my mind while following you- the person you are is so much more fabulous than any glam thing about you. The world needs more people like you who knows what their impact is and how it should be. More power to you dear!💖", "anushka_joshi24": "Because u give me strength and power. YOU'RE A ROLEMODEL to all the girls out there going through tough times. You Go Girl!💕🌈", "thebrownwriting": "There are a lot of reasons to be honest... You are inspiring to me, the confidence you have and how comfortable you are in your skin and how boldly you express yourself and take stand of things that are imp. to you never ceases to amaze me. I love the way you love, i love the way you write about things and also about Rahul(you guys are sp cute together ). Damn you give travelling goals, relationship goals, self independence goals what not!! I'm a big big fan of yours ...💙💙", "shalini_isthatyou": "When I see you, I find the inspiration and positivity even on the shittiest of days 😌😌", "_aayyyuu_": "You motivate me, you inspire me beautiful ❤️", "thegreatanupamasahoo": "Cause your caption always inspires me!!💓", "_nikitasagar_": "I'm completely motivated by you and our youth needs to have a perspective like you. Though we will amongst different thoughts and everyone has different opinion but this Diversity should be used as a strength to make this country more open minded and safe for girls.", "pallavi_poojary": "Because I have been able to learn a lot more about myself through ur words about how we should not take our bodies for granted even if it does not measure upto to the ideal body images society has for us about looking and behaving a certain way, because ur words have literally pulled me out of very dark times in my life and becauseI love you for all that u stand for 💕💕eagerly waiting for em books girllll😭😍💋@redheadwayfarer", "_orphic_7": "Der is power in ur words... a strength💜", "brewed_thoughts_": "This time the comment would be I loved isha of girls on top, not knowing back then she is such a great person in real and motivates every second, being the most realists and generic person in her thoughts, romance, generation and equality! Follow you coz you are you, doesn't matter right or wrong at times, but responsible for what you are @redheadwayfarer", "deep_singh_honey": "Because you're so hot🔥🔥 N sexy i really like you 🔥🔥🔥❤️", "drish_2802": "I don't know if you'll ever come across this comment ma'am but I wanted you to know that I look up to you. You make me and other people know our worth. You make me question things. It's because of you and some other powerful women that I came to know what educating ourselves actually mean. I follow you because you talk about real issues through this platform and it's sometimes triggering to go through stuff you put on here but it eventually gives me strength to see you hold onto life with such optimism even after receiving so much hatred for doing the right thing. I learn so much from you everyday! It's just that you give me so much strength that I cannot emphasize it anymore. You are the woman I aspire to become(without losing the essence of who I am as a person). You make me more of a human! I love you so much ma'am❤❤❤❤❤", "debindriya.bhattacharya": "Because you are my inspiration. I wasn't like this what I am today. The way I see myself, the way I embrace my flaws, the way I love being me, I wasn't like this ever. I was never confident with my body, stretch marks, strawberry legs and ofcourse \"my old lady hands\". I am thankful to you, I am thankful that you exist. I sooooo love you Saloni💕. And, just to let you you from 'ISHA' to 'REDHEADWAYFARER' I just loved you always.", "ramandeepkhurmi": "I love the way you express every emotion with so much ease ❤️", "shweta___27": "Because you point out the basic points which we forget on our daily basis..you inspire.. to be free.. to be who you are. Nd to love yourself.. you actually feel so comfortable in your skin that makes me feel like .. why shouldn't I? You just light up my mood.. nd yes I do read your every post.. nd you empower.. you being so faaar feels like you are not.. you hit the good spot.. nd specially you give so much time an attention in your post just so that we could read them nd get them .. I just loved it.. nd i wana I love you too.. nd m a huge fan.. ❤️❤️😘 @redheadwayfarer", "priyanshi_tripathy": "Because most of the times I feel that you speak my heart out. ♥️", "okacupcoffee": "Because your words are lit ❤️ you inspire me to write too😇", "seerutkchawla": "I follow you because you think independently, and you use your voice ♥️", "nit2254": "Beautiful face looking", "charuuaroraa": "Because you encourage humanity, make people feel it's okay to be like they are and have been able to reach parts that are seldom discussed💕", "radhika_7599": "Your every post I have saved and whenever I feel low I uesd to read it again and again❤️Reading your words is added in my daily tasks❤️plz keep writing and add my name to pre order your book❤️", "_athiramv_": "Your thoughts ✨", "eric_m_93": "You change perceptions with your words❤️ I learn and un-learn through your captions every single time. ❤️", "khamkhaphotoartist": "Started following you like few days ago & really connected with your photo aesthetics & what you write", "make._a._change_": "Your content is beautiful and that drives me to read through each of your posts ❤", "_sagar.saxena_": "I follow you because you raise your voice against people's sick mentality @redheadwayfarer", "bhavana_bagrecha": "Because your making a mark, cherishing what you stand for and find satisfaction in what you do. You have a lifestyle that most of us don't!", "vidya1290": "Because it's rare and beautiful to see women be themselves unapologetically! ❤️", "urviiichauhan": "You actually motivate. N would definitely pre order a book by you. Now start writing already ❤️", "just.another.book.nerd": "Because your words are a reflection of the hidden, scared, unsaid feelings, of our vulnerability and our strength, in most of us and somehow a single post from you gives so much of hope and inspiration.❤️", "santoshi_jewargi": "I like how you talk about sensitive contents! Hit on point and straight forward but in very polite way! Keep writing and inspire millions out there! Happy reading!", "kanish_0910": "Because you make me think and question", "_snidget_": "Cause u are a woman whom we all look up to..❤️", "someones_indeed": "You do! You @redheadwayfarer motivate me. Your thoughts and words give so much power and positivity to me. Your words gives strength to so many women out here. Also, you're gorgeous inside out :)❤️", "soni_bhavinii": "I follow you for your practical words ❤️", "darsh__1118": "I followed you because I feel you relates me ❤️ Moreover every lines that you write in caption is actual and harsh reality of society😐 Every picture of yours has unique engery and you are spreading vibes for betterment of all ladies out there😍", "askap10": "I think I've learned something about Feminism from you 🙏", "monalisa.singh": "I started following you after the Hyderabad rape case when some of the other influencers I was following shared your posts and stories. And when I saw the name behind @redheadwayfarer , I immediately recalled this empowering article about one of the first #MeToo women to speak up against famous personalities. What struck me the most was that you weren't just trying to be strong and brave and empowering by calling out these despicable people, but that you admitted to your vulnerabilities and didn't expect every woman with similar experiences to come out the way you did.", "mayankcharan_": "Because you empower people by breaking taboos . Kudos for the book . No i wouldn't buy it coz I'm a broke student", "sukrity_tandon": "I really appreciate your thinking. And yaa your posts are inspirational, sometime relatable. Whenever you post something i want know what it will be about. So. You go girl 👍", "bips_here": "You are real simple 😘 you have the guts to do say things which probably I think I can't. Hats off to you.", "spruha_pandya": "Because when the society makes me feel that I'm making unreasonable demands when I'm just talking about equality or people tell me it's an unfair world and I'm not supposed to pick every possible fight and I'm just supposed to shut up and adjust at times, and when I say I won't, I'm called an attention seeker and many things more, your words lift me up. I read your words and find them relatable. You give a voice to every girl's inner struggles. You motivate women to speak up...fight for what's right... against all odds! Not a heros wear capes...You're my hero! Or should I say heroine?", "ishika_jk": "I follow because I love how your words are so beautifully put that you can't help but continue reading, while you think over it", "seekingsmiles_eee": "Because you matter a lot.. You are precious 🤗 Thankyou for being there☺️", "happierubyhannie": "I follow you to read your write u,the new challenges you take up as you started hula hooping,loving yourself more . Your writings inspire me to write too. People like you are really required to take people in positive space.your writing are love,every words you speak influence people.As we heard Many times (A pen is mightier than a sword) @readheadwayfarer", "_._unicorn_panda_._": "You are sooo Amazing and you’re the voice of so many girls out there who don’t get to speak. I don’t know if you’ll read this comment. But lots of love and power to you :)", "sanju_faisu07": "Isha cool look n expression wow 🔥🔥🔥🔥😘😘😘😘", "_.thall._": "Because you actually talk sense 🔥", "shubhangi_raman": "You motivate and empower me. Your writings are amazing and everyday I learn something from you. Many a times it is so much relatable. Keep writing, Keep inspiring. More power to you❤️", "rashmiipriya": "Definitely for your writing🙌", "kratika__gupta": "I follow you because your posts make me think and ponder on things which maybe I tend to overlook at times, I love how beautifully and honestly, you write about feminism and how to unapologetically live our lives. You have given young women like me motivation and inspiration to be comfortable in our skins and how self-love is the most important thing. I absolutely love you and Rahul and how amazingly you people share people the struggles and milestones of your relationship and don't fake it to be always dreamy but how in reality sometimes difficulties arise in relationships. Keep up the good work !!", "naveenraj1169": "Because u r sun shine to my world 😍😘", "eni_gm_atic": "U r motivation ♥️", "21_naksitimbadia": "Cause you inspire me everyday and make me aware and make me a feminist", "kayceethegoonerette": "I follow you because you have a different mindset, very different which not only empowers me but so many other beings. Your posts make me realise about the vulnerable world we are living in and your perspective about the same. Also, I love the way you put up things be it about you and Rahul or about the world. LOVE ONLY 💜", "cantnotprocrastinate": "I love you. I love your words. I love you as a human. You do make me think, you've changed my perspective about so many things. And I've loved and respected you since day 1, woman. You're just....amazing. AND I AM ABSOLUTELY WAITING FOR YOUR BOOK! I'm so excited to read it! Lots of love! 💕", "bluefficient": "Because you're one of the few people who have the right mindset and have the dedication to actually change our indian society", "_ananyabee": "I follow you because youre on of the strongest women. Your travel photos with Rahul not only give travel goals but also photography goals. About your writing, well you write about a lot of things like body insecurity, healthy lifestyle, your opinions on a lot of things, and among these my fav is when you write a heart to heart, a kinda vulnerable post. Also, i like your nose💖", "lobi_koch011_rajbongshiii": "💙you are of a kind ma'am!", "senjuti_007": "Because of our content n ur page and I love ur writings .", "__.l.u.n.a.t.i.c.__": "Theres various reasons starting from your show girls on top and ending with each word of yours which inspires a hell lot. I mean I sometimes repost your writings on my story so that people who doesn't follow you should follow not only you but the way you state everything. I think you are just another girl like me who wants this world to become a better place. Keep doing whatever you do. @redheadwayfarer 💕😍", "ididanoopsie": "because you make me consider things on a way i could never have thought. also, yes. where can i preorder?", "ketki_hemraj_ashtankar": "Because you are not plastic.", "maahi_hunki": "U inspire me in so many ways🙂", "rado_dat": "I follow you because you make me think about a lot of things from your perspective. You're amazing and I'm glad you exist ❤️ ☺️", "uttxrx": "You make me think, give me a different perspective on things, but most importantly, HOPE. ❤️", "swathi.srinivas.5891": "Cause you give a different dimension to think in and question why we do what we do.", "paapi_guddiyaa": "Your words gives hope and a lot of people can relate to it... Thanks for keeping ‘it’ alive inside us ♥️", "jeminiphukan": "Your fearlessness is motivating.", "_riya_singh____": "hot❤️🔥", "latitudesandplatitudes": "Because you give words to so many feelings and problematic issues that we women have just normalised in our lives 👏", "juggysinghsandhu": "I connect with @redheadwayfarer at so many levels. You inspire me coz u definitely have made me feel confident. That being different and being as the society labels u an outcast is not ur fault. It's coz the world doesn't understand u n has the perceptions u just shouldn't care about. U inspire me to be happy in my own skin n don't let the world bother me with their judgements. Thank u @redheadwayfarer for being who u r and always being yourself. #redheadwayfarer", "sagarpankj": "I find you bold and courageous to put your views and different from other regular girls.", "vaibhavi_thapa_xox": "Because you make me feel that my happiness as a woman as an individual is important and if I have doubts on my mind you reassure me.", "iamumar.khan": "Cant describes by some word...why we follow you.", "not_any_guy": "I first saw u in some Mtv channel show long ago & I found u really attractive so I followed u but when I started reading ur writings & saw that how hard u have been fighting with the persons criticising women like u in comment section then I started liking u as a person too. U are doing a great social work by promoting the truth & I think, not only me but everyone needs to follow people like u.❤️", "saloni.01": "I follow you because you talk about things we all need to hear about. Be it body positivity or relationships or life. You motivate me everyday and my feed lights up everytime I see you on it.❤️", "birpal_faiswal": "Hahaha You are a beautiful soul baaba!!😍😍😍", "deepapadmaparajuli": "Because I've adored you since I tripped on your account and read the posts. You're light.. Beam of knowledge. ❤️❤️❤️ @redheadwayfarer I adore you💓💝", "singvacation": "You inspire me to become better 🌈", "caramelrainboww": "because you are so shamelessly and so unapologetically YOU, that it makes me want to be that way too!", "crazzylegs0309": "I follow u coz I like the way u think.. when u write about the society issues, reading it feels like I am feeding my brain with some healthy food. Yeah u motivate me to argue with people when they talk shit about girls n other stuff . I don't read books but I read blogs... N yeah u got a pretty face too🤘", "drishtipatlan": "Well because you hav a powerful voice , you speak your heart , you fight to break the stereotypes", "hanushita": "Beacause you are the perfect combo of all of the above you mentioned💕🌴", "aparna.kesharwani": "U just inspire alot bye being d real voice which we find in our own self", "curiousaspirant777": "Cause you are breaking stereotypes ☺️❤️ @redheadwayfarer", "pragya__bhardwaj": "Because you choose to speak.. you are a living difference that the world needs.. and to encourage that I follow!", "shreya_501": "Kyu btaye? 😛", "amrithaa._": "because you are everything a girl is afraid to be nowadays.... free, strong, fearless✨ you rock🌀", "inspired_jogan": "I follow you because you say exactly what i feel🌼", "seriously.slytherin": "I do follow you beacuse your captions are worth reading and motivates in many ways. And it's beacuse of you that i came across the awesome page @humenorg . Thank you ma'am.", "ramitameht": "You write the best thingsss!❤️", "aromance_3695": "Because your thoughts and way if thinking are eye opening and inspirational. I think I'm like a young bud but I want to become a string independent bold woman and you're already that . I admire how you voice out unapologetically. I've recently been too conscious of what others think and in trying to change to what I want to be . 😊", "vedikaranga": "Cause you motivate me alot. you are a very beautiful soul inside out. And I love you. ❤️", "_preksha_joshi_": "You make me look world through a different lense and you are what feminism is 💕 I love you for what you are and what you are teaching me 💕 @redheadwayfarer", "the.neptune.girl": "your words are empowering 🖤", "mignonette27": "Because women have forgotten that they have a brain full of intellect that must be put into use, a voice that should be heard, dreams that they must chase, desires much like a man has and of course life that they have a right to. In short, you a reminder of what women are: fighters. I believe millions of women look up to you every time they forget that they're human and not just a piece of meat. @redheadwayfarer", "mylifebasically": "You always inspire me @redheadwayfarer. I'm a fan and there are days when out of nowhere when I cry, I wish YOU were my older sister, here with me. Iloveyousomuch and you're an idol ❤️ THANKYOU FOR EXISTING ! You, through this page, teach the right things that the youth as well as the adults need to listen, be it any gender or anyone. You empower us all !!!!", "kalpana.parida": "Because you are such a beautiful person . You motivate everyone,your posts are amazing. You are empowering Every girl. Only positive vibes 😍", "n_e_eti": "Cause you make me think about many worthy issues about which in normal life I do not think or look for.", "jyotirana777": "Yes I would surely buy. Also it’s not ur post or face but the fact that girl like you exist and there is nothing wrong in being ourselves. You give me strength. You have given me the strength to wear a bikini and post it on Instagram and feel beautiful beyond the likes or comments. I love you too as I love me", "suchijaggi": "Because you're a beautiful person, you're real, you speak your heart out and because I need to know it all 😋🤩🤗😘❤️", "_alisha__islam_": "I follow you because you are relatable, you have shared your opinion on lot of topics which never crossed my mind or maybe I have neglected it. But your posts really made me think about it and even broaden my perspective. You're really inspiring. Stay strong and lots of love to you💙 (Also special mention - you liked my comment once and I was shocked! Thank you so much, that made me so happy 😍)", "deepikarma": "I follow you because you inspire me with your words and photos. You make me want to fight for women and other minorities in India and the world. You make people think with your words.", "akankshak_20": "You inspire me alot💓..you taught selflove .. which I lacked in my life. @redheadwayfarer", "kalopsia14": "I started following you because I liked your character in MTv and then I fell in love with your words. You became someone I look up to for answers or clarity. For questions that I find hard to answer. For understanding both sides of story. And many more.", "_shivaaa_____": "Because I like you ❤️", "adhee_la": "I follow you bcoz your writings are sooo good..the things you write about 💞..the way you Express your thoughts are so amazing..moreover you are not a fake guy...💕..u r sooo positive and u motivate me a lott.. your captions also ❤❤...keep doing well😊😊", "divya_singhi": "Your words match my thoughts, it's like reading your posts and feeling, well duh! this is exactly what I wanted to say. It's great to read your own thoughts pened down so well by others. More power to you girl!! 💟", "niharika._.af": "Honestly, because there are times when I literally feel that there are hardly any good people left who believe in the right thing. I feel bad and it disturbs me when I see some certain bad things happening around but then when I read your posts concerning it, it makes me feel I am not alone who thinks deeply about those things and get affected too, just help me share my grief with you through your posts and helps me feel so much lighter❤️ Also I learnt the true meaning of Feminism with u I am so glad that I came across you ❤️❤️❤️❤️❤️❤️🔥", "sri_harsha_dantuluri": "Got a vibe that you don't give a lot of fucks and sorta like a rebel. I needed such people in my w", "_.navvyaaaa._": "Cause I love you for the person that you are and I'm proud of how far you've come. Your words inspire and motivate me everyday. Love you so much❤️❤️❤️@redheadwayfarer", "withlovesoniya": "Because you make me rethink the same thing with a different perspective on everyday life crises.", "muthumarisaravanan": "I love u all girls❤️❤️❤️❤️💞💞💞💞", "sains_jassy": "Because you are such an inspiration to all the girls out there ..and I absolutely love your ideas and thoughts.. love love❤️❤️❤️", "milikoirala": "Your posts always makes me love myself the way i am....a hugeee thanks to you ❤️", "amulya_jain": "Definitely your writing and thoughts🔥", "prava_see": "Your words have been a source of realisation. The importance of self understanding & self importance. It’s way more then your face,body,travel pictures. You have been touching hearts. I wish I could hug you and tell you, you have been uplifting lives.", "agrawal_prasun": "@redheadwayfarer you are like hope of light in the sky full of darkness for those one who never come forward in their life bcz of ridiculous barriers made by society you and your saying doesn't matter from which source they belong, but it's your feelings towards society which you are expressing and trying to give a check to those ones who are actually in need so thank you for be there... You are love..❤ I love you...🧡🧡🧡", "instamodel.agency": "I like the way you pen your thoughts in a much clearer and pinpoint the intricacies that are going through in your head. Few times I think that you're very complicated but most of the times I also get your view pretty quickly and think that 'Oh, that's what she wants'. But all in all, it's always wonderful to read the prose and make meaning of the process.", "ewwwwwwpallavi": "because of the \"karwa sacchai\" people get to know from your posts and some can't handle that and blatantly come for you... also the fact you're really pretty and I adore you... you tell something so powerful that makes me go damn🔥, makes me cry, makes me happy... love u for who u are❤️", "shrutiiprasad": "Because people like you help make world a better place to be in.....❤!", "photopado": "Because you are the voice for many unspoken stories of life my love", "deergha_02": "Because I learn a lot from you about how I should be thinking for better future..", "praaveeennn": "I just liked you in girls on top GOT", "mehakbakshi01": "your motivated words maam.. they're really worth of reading & i dont wanna miss any of ur posts♥️♥️", "shiny_bot": "Because you inspire and empower so many women to be comfortable in their own skin! And you're not afraid to have a nuanced discussion about so many issues, which otherwise get oversimplified and divisive 🙌🏻", "_deliciafernandes": "Because I love the walk you put forth your opinions, not harsh, but impactful! And that’s what matters🔥", "happyay13": "I couldn't stop myself from following such a strong woman with amazing thoughts and view. With your posts and your words you really leave us wondering ,you bring up so many amazing topics Everytime. I follow you not only for your pretty face but also for your courage and challenging attitude ,you definitely inspire us . Thank you for encouraging, inspiring and loving us each day ,thank you for making us comfortable with our own true selves. ❤️ We love you", "bipashamondal": "You actually motivate us. You do, woman. You do. Your words should be printed and put on hoardings in bold caps lock so that some sense prevails in people who lack it. Such an inspiration, Saloni!♥️", "upaashana": "I don’t agree with all of your post but I love the way you fiercely stand for women for yourself. I love how you ask questions people are afraid to ask as an influencer! You are real it reminds me I am too and so is our existence as women! 😘😘 Take care ❤️", "femmeordinaire121": "Cz women for women. 🌸 And also you speak the truth,bitter or not. 👏", "charitarthv": "You challange the little male-ego, patriarchal nature that has left in me. I like it. It enables me to think beyond and motivate me to look for different perspective in daily life.", "_ancyyyyyy_": "Because you are real 🖤🌻", "swt_n_spicy": "Cus ur thoughts really inspiring ❤️", "greyscalesam_97": "You encourage me in a lot of ways.", "ritu.raii": "You inspire me through your words to take more pride in what I am❤️❤️❤️", "divnoor_kaur": "Becoz ur words inspire me. And motivate me to create artwork on them❤️", "rashijain302": "Because you’re a ray of sunshine on the cloudy days ✨", "uma_maveli": "You’re an inspiration", "dhruvixdoshi": "Because you never tried to be anyone else to fit into an circle! You speak what you see, feel and think!", "shas_tra_": "I follow you because you are YOU ,you dont fake and you just present things as simple as they are actually ,that is what makes you unique.I like your blogging and the love you show to us is inspiring.❤️🙂", "shailitomar": "Nope not looks (though you're beautiful) . Not travel. Not to seek Monday motivation or to ape your attire. But, I feel connected with what you say, what you feel about women, about men, about this society, about humanity and everything in between.", "_alzenaz_": "I follow you because you're my biggest inspiration. I can relate myself to you. The way you feel the things, the way you say the truth. I love you so much. @redheadwayfarer 😍❤️😘 Your thoughts, your words heal. More power to you. The world need the people like you. Thanks for being here.💥💥🔥🔥💕💕", "thatmolekid": "😍😍😍", "kinjalgupta21": "For your writing and yes I'm eagerly waiting for your book😍 The way you articulate your stories and things you want to say...I wish I could do that too. You motivate me for various things :)", "karthik_varma_7227": "Your words are not just words. They got content. I love your captions. You are a beautiful woman as we..", "p.a.l.a.k_._": "Your words❤️", "ca.akshitagoel": "Strong women. Period.", "annlillyjose": "I follow you because I've not seen someone else portray and represent feminism so fiercely that it leaves a long lasting impact on viewers. I love how you post pictures and captions that the world usually labels as 'disturbing' or 'inappropriate'. I adore your fearlessness, and you make me believe that feminists deserve to be loved, deserve to have a good family life, deserve to be more feminine or masculine or whatever they choose or aspire to be. You remind me that everyone is worth their space in this world, and what we are fighting for is to make this space safe and comfortable for everyone. And you motivate me to fight for every person and their equality in this society. You made me realise that change begins within oneself and as long as one isn't willing to change, it's impossible to change others. Maybe, being a feminist, my life wouldn't be as sound as I want it to be. Maybe men will laugh at me for my thoughts. And maybe even women will tell me what I'm doing wrong. But you made me realise that it doesn't matter because I know what I'm fighting for is worth it. If I can create a better space for at least one person, if I can make them believe in and love themself, if I can convince them that equality is not an unachievable target, then, that will be success for me as a feminist, and as a person. ❤️", "littleshinybook": "You’re a silent warrior.. as they say the pen is mightier than a sword.", "needhisharma786.ns": "U motivates me in somway...that one should be happy n positive", "janvi0203": "I am pre ordering it", "ayesha.datta": "You are an inspiration ♥️ you help me to bolster my thoughts that what is unconventional perhaps should have been the norm rather than what’s the norm at the moment. I follow you because you challenge stereotypes, speak out against injustice and inspire more people to do the same ♥️", "monalisa9067": "😍beautiful", "tvesha9": "Because you inspire me to not shrink and be myself and be proud of who I am, what my opinions are and being unapologetically me", "bobblehead_meg": "It’s empowering to see a woman share similar views about the true sense of feminism, womanhood and life, in general. Many celebrities have Instagram accounts with followers shooting through the roof who could use that influence to create so much awareness, but not many do it. It’s inspiring to see a woman speak her mind without inhibitions and make no qualms about it!", "vaishnavii14": "I think you are empowering!!❤️", "avniagarwal1913": "Your words are thought provoking. Keep writing", "alwaysso_extraaaa": "Simply because U R REAL!! 💞 SO REAL. About so many issues", "supriya_k_s": "Because what you write is just not for the sake of writing. You literally write your heart out EVERY single thought. You put in effort to research, read books and understand what is what. And you make sure that you spread awareness about it. About feminism, about body-shaming, about happiness, about women empowerment, about travel and what not! And when you post your pictures, you make sure there’s variety. It’s not just dreamy, stereotyped flawless looking pictures that we’re made to believe it. You bring out and post reality and make me feel that I’m beautiful the way I am, and I’m awesome with the body I have. I LOVE YOU. And everything about you! SO MUCH LOVE AND SUPPORT TO YOU @redheadwayfarer! Keep going love ♥️😘😍", "obliviousnomore": "Because you're a true inspiration. The way you present your thoughts and yourself shows how bold , upright and amazing you are. You have this concerned yet carefree attitude which is somethingI aspire for. I love you mam. And ofcourse, I'm eagerly waiting to pre order your book. @redheadwayfarer", "apoorvaupadhyay221": "Because you inspire me😊", "dramaaaaaqueen22": "I follow you because you motivate me to be comfortable in my own skin.", "chicken_wings846": "I follow you because you're such an inspiration! I love reading everything you write. Of course,the travel photos and the gushy mushy love posts are a die for💙", "unsuitableboy5220": "The content you write inspires in a lot ways.", "eff.ulgent": "Because you are the most genuine girl. Your words matter for me. Whatever you feel you write down with great thought and meaningful lessons . Thank you so much❤️ your pictures most generous. I love you", "dishachandde": "Currently on social media where everything is just so \"perfect\" even when your life is no where closer to it. I follow you because you are so authentic and diligently and madly yourself. I love everything you write about from feminism to body image issues and just life in general. Can't wait to read that book of yours. @redheadwayfarer 😍", "mranalmandhane": "Because your thoughts are beyond the orthodox attitude carried by the millions and which is the call of the day needed to be understood by those same millions.", "sinnah14": "U inspire me. As a woman. As a human. As a young person. As a world citizen! 💛", "priyanka_raghavjuyal": "I m sorry to all,, only sometimes I read ur caption nd most of the time I stare your photo. Bt I watched ur maggi, nd some more vedio on YouTube.", "travelwithsassygirl": "Your captions make me think differently.. I have started to love my curves more,my flaws more..im trying to be wholesome rather than perfect @redheadwayfarer Thank you", "hippied_soul": "You inspire 🔥🔥", "trishita.singh": "Body confidence", "rravi.singh7659": "Yep", "_summer_girl_": "Because you are my inspiration❤️ I wanna be like you.🌸", "taranjeetkalra": "I follow u because you are a real person❤️not the one with two faces", "vipulkanodia": "You write good most of the times. Makes so much sense and it's real", "_kini___": "I actually follow u 'cause I think u r the real \"normal\" one. 🙌🙌", "poonamsangre": "Bcoz there is also to learn in ur posta", "trovellust": "You are so beautiful 😍😍😍", "the.demon.king__": "You are my travel goals, therefore I follow you 🙂", "sanjeev0999": "So Preety", "nehha_gulabani": "I may not always agree with what you post but I appreciate that you put out your views and thats inspiring", "kaurjhutty12": "I follow you because you're the change i always wanted to see. Your thoughts, ideology, morals, way of living, is what our world need. You give me HOPE that world will change and someone is out there making it happen.", "meghaa_1_0": "Because I love reading your captions and it makes me think and gives me ideas. You're truly inspiring❤️❤️", "vrinal_k": "Because you inspire. You made me love myself. And don’t even get me started on your writing. ❤️", "kadambari_anuannal": "I like reading your thoughts ( ps : I don't mean it in a creepy way )", "ayushi_jhamb": "Because you are inspiring ❤️", "ojosharma": "Because you are like an open book. You are what you are and that's commendable😊", "louis_varghese123": "I L u 😍honey❤️", "karan_singh_malik": "I see the motivation thought", "_ladyraga_": "Because honestly, you're the reason I ever believed that being our most honest and raw self is the most courageous thing to do and also , the best one. Thankyou for putting your work out there. I genuinely appreciate every bit of an effort behind it.", "karansehgal11": "Hey lovely hair colour. Suits you a lot", "pratyaksh.sikodia": "You really motivate us", "raipallavi1712": "Because you speak what every girl wants to say but is scared of judgemental society,there were many times I looked at your posts and thought this is exactly what I have on my mind. Thank you so much for being the voice of so many.", "pumpkin_skies": "You’re pretty and you get me thinking about stuff and I love how you express and you’re candid.", "kaveriponkshe": "Your views on feminism are truly inspiring 🦋", "mr.savage_07": "Because u r sexy", "srishttia": "You give me out of box thinking with your write ups in this conventional world of mine.", "tanya_pilli": "U start the feminist rage in me every time u post something", "rajdeep_patel27": "Mesmerising eyes 🔥", "whimsicalwordwitch": "I read every time. I follow you for the captions rather than the photos. 🖤", "rubal.hooda": "Because I love how you think and you are making a huge difference by being the change that you want to see. Love you ❤️", "aditi_gupta.11": "Your true words and the way you write really inspire me...", "thepatrickstruck": "Because you just keep things REAL even though it's harsh and sombre you'd always let everyone know. You speak up with inspires us to do so. Thank you for existing. 💙😌", "queenyashu": "I follow you because I relate to your thoughts. I really appreciate your writing but I'm sorry I'm not someone who reads much. So I'm not sure if il order books but, yes, I will forever be a loyal follower and il always have faith in you and consider your thoughts. 😍", "_divya_jami_": "I love the way you put your feminism into words. Your writings give me hope and a sense of liberation. Also, eagerly waiting for your book.♥️", "tsweta_13": "I love what you write, sometimes.", "_komaljangra_": "Being a girl who always fails to put her thoughts out, your words give me hope and a teeny bit of courage to try over and over again.❤️", "usually.tripping": "Tbh you're an amazing writer. Your writings actually make me stop and think about things. Lots of love. 💕", "ayushpandav": "I dont comment coz u dnt even bother😁", "mtmuskan14": "You're like my kickass idol .I adore you for saying shit that I've suppressed into myself for years for the sake of my own survival.To me you're hope that I may just get to express if I can find my courage❤️❤️", "pink_sagittarius": "You don't post for the gram U just post whatever u feel like, nd I like your English proficiency.", "lalit.prajapatii": "Ab tak ka best 💥🐾❤", "theofficialayaan": "Look slim", "manasikhopade": "I follow you because you inspire and teach me to love and accept myself in my purest form possible. Instead of hiding my flaws you gave me the strength to flaunt it. You make me think what is it that I should be ashamed of and well it always turns out to be “nothing”. Nothing of this matters if I have a pretty heart and that’s what I make sure to develop and nurture. Thankyou♥️", "akshaya.khushi": "Becoz it's you! ♥ And i first say you on \"girls on top\" since then i knew you and after that i started following you and came across your post which gave new perspectives about everything over the world! ♥", "sag_saggy": "Bcz you so good mam...good hearted women..and we love u mam❤️❤️❤️❤️", "_narcissistic_soul_": "You relate..... Your perspective... Way of expressing🔥", "knights_kings007": "Stunningly sexy, killer eyes", "zoi_bakshi": "BECAUSE what ever you write i find it worth reading... So courageous n strong person you are. I totally love the way you express everything you feel no matter how odd it is or how hard it is. #staystrongnbeautiful❤️", "lady_purple_heart": "Bcoz u don't give up and go on saying things tht needs to be said every single day. And u do a pretty good job at it. World needs more of u.", "that_girl_with_curlie_hair": "Because of the way u talk.. with unabashed authenticity 💖", "purnimakatal": "I feel freedom when i read your post. my gut feel inspired from your post. Conclusion I just like following you ❤️", "kusingh4642": "Bcoz you are a inspiration to me n many more ppl", "m_manisha9": "You inspire us with all those words nd all of urself!! You are evrythng a woman would want to be. Period💋", "darken_sky_": "@redheadwayfarer because u motivate middle class girls like us to work hard ,to study our ass off just to reach a level where our voice might matter to people. Hopefully u ll read my comment :)", "tasneem_noor_maisha": "Yes. I love the way you play with words and the topics that you address. Its very unique and I read a LOT of books. You should be an author, Im not exaggerating. Pre-ordering for sure", "mansi216900": "Bcz you're a badass women. 🔥🔥❤️❤️", "aleee_na21": "You make me think differently, more openly, less judgementaly❤️", "vaishnavi_maguluri": "Love you and love the way you stand up for what you believe in. And ofcourse, waiting to pre-order the book:')", "ankita_dutt18": "Because you inspire❤️", "pandekritika": "Umm wouldn't say i agree with everything u say but u do make a logical view point so the sole reason to follow u is love how u display it with an ease 😊", "durgeshnpatel": "You’ve the most unapologetically bravest stance the most important issue we face today on women’s rights. You’ve redefined the meaning of feminism for me, and that’s why I follow you. Your posts on Doctor Priyanka Reddy’s rape and murder touched me and gave words to my feeling. Your posts on gender parity in upbringing is my go to post. Please keep doing what you doing, and give voice to voiceless!", "thekevinwolf": "Of course the pretty face also theres a rebellious vibe that comes along every pic maybe it's just the look thou that is what triggered it that feeling #Yebandihatkhain \"Couldn't explain any better\" @redheadwayfarer 🔥", "diamonds.and.rust_": "Because I can relate to you. And you’re a great writer ❤️", "chainsaw_syndicate": "You make me feel good about my body and comfortable in my own skin for which i have struggled the majority of my life and I am just 19. You give me strength to stand up for myself and make me feel that i can be brave too 💙 thank you so much💞", "crazyycupcake_": "your aesthetic travel photos, what you write, how you write, how lovely you’re ✨", "shubu._._": "Because you inspired me in all the ways. Even if im in hurry I manage to read all your captions patiently cause it really impacts me. It makes me feel better and empowered. Thankyou for all of this love. For wirting such big ass captions and motivating us.", "7311raju": "Beautiful", "ashwarya_kalekar": "Because you make me think about a number of things which I don't think either ways. I love the way you put your thoughts into words. Everything is beautiful. Lots of love❤️", "ray.k.h": "Your captions, your thinking, your writing You make me think again even when I think I know about equality, women’s rights etc", "kinjalganatra0202": "Asking questions is necessary but asking right questions is really important. You've taught certain things in beautiful ways. Your Bold & Badass & beautiful positive attitude gets the purpose of serving many. Thanks for cheering hearts & helping us unlearn that we must & think beyond usual😃🙌 more power to tou😍❤️", "a_bookish_wanderer": "I follow you cause you make me realise that my opinions my thoughts are not wrong And you empower me to stand by it!", "vallabh_desai": "Travel photos", "harshit957": "dig the vibe of your page tbh", "esha_sakpal": "As a human being, as a women you really motivate me and you are such a great person to follow. @redheadwayfarer I love your writing alot 😍 and your words are magic for me so I definitely can't wait to read your book", "sapna_singh_rajput00": "Love love love and love.. Love your writing n gonna definitely order ur book 😘💕", "sadikbee": "You are my role model and I love you for being so raw and so honest with your followers. It almost feels like you're a friend I wished on stars for.", "scorpiomkh": "Some of your views really interesting and worth to think about them especially when they differ from what I believe or thought of....... ✌😇", "style_and_strike_rc": "I follow for you for the person you are. Confident as well as sometimes scared to say what you gonna say anyway and be the be the voice to those who still are searching for themselves❤️", "priyagang_": "You're inspiring. That's all💜", "kir6169": "You have inspired me in many ways ,i think about things and do nothing but you think and act accordingly it takes so much courage to do the things you do especially in our country , at least I'm not able to do but you are doing that is why i respect you and support you, I'm very much proud of you and Thankyou ❤", "anusmit12": "Cause sth in me tells me to b as bindas as u r", "the.forest.walker": "Because you are simply YOU❤️🙌", "prakriti_nature8": "Relatability", "niyatii.p_": "You are the reason why i started loving my self, ur captions help me boost my confidence to another level!!...Times when i feel low i stalk you account and re-read those captions!! And on the top of that ur photos are so amazing and real!....YOU ARE SO AMAZING AND REAL! I LOVE YOU😙❤️!!...and i just cant wait for ur book!💁‍♀️", "ali_a_namika": "U r so free. And you aren't afraid of anything. I follow you mostly for the confidence u have and the positivity u spread. Loves and hugs! ❤️💙", "devika_mohan_": "I follow you for your captions.. and for the fierce writing of yours... The kinda topics you deal with is very impressive..and u address concerns like body freedom, women's sexuality, equality, body shaming and everything else that has to be addressed.. you are a great inspiration.. and u give me hope on the hardest days.. u r sunshine..! And I m definitely gonna buy your book..can't wait for it! And also i follow you out of the admiration for the fierce personality you are! You are love! @redheadwayfarer is just love💕", "aabhiya_kanaujiya0_0": "am following you because you inspires me in every way, the way you carry everything without any hesitation of stretch marks or I like the way you live your life🤗🤗❤️", "curlytailtwirl": "Coz you are not pretending", "justgoaway_pls": "I love you, and yes I am more than eager to buy the book... Your posts move me, a book would just stir me up. Loveyoutoomuch❤️", "siddhartha0010": "Coz post ka msg hota h aapki..", "maya.raveendran8": "You inspire me ♥️", "unojunokimono": "I follow you because once someone close to me sent a post of yours that made me feel strong. And I stay because I want to.", "jiggstagram": "Because you make a lot of sense, your thoughts really resonate with me and make me want to be unapologetically brave.. and it’s important for women to uplift women and admire each other for each of us stands for 🤗🤗", "jsnoor26": "Because you give me so much power to be comfortable with what I am just by being you❤️", "kgunjan_": "u really make me think in way where no body has ever done and often i commented on ur post that u r an amazing idol and inspiration to me so m doing this tym tooooo😚...tons of power and wishes to u ♥", "neharawattt": "For everything that you do ✨", "ssneha2499": "You're the best at emphasizing on self-love❤️.More power to you🍃", "piinkykotwal": "I find u very real.. n I also do read what u write and u do motivate me for sure.. I like ur thought about freedom", "neha______ramesh": "You are probably the only source of motivation for the demotivated girls out there, includes me as well!♥️", "deepa_vasudev_": "I like how you keep stuffs so damn real 🔥", "methira._": "i love the way you expressing things. very bold and knowledgeable. ✨", "cliffandore": "Oh my God this picture is gorgeous. You look stunning 😊", "ch0c0late_cheeze": "I find you bold, encouraging and speaks the most unspoken taboo in a nonsarcastic way. I like and admire your free-spirited and give a damn attitude @redheadwayfarer 🔥you're a fire that went lit and sure to burn down the riot!!!", "perriflow": "Everything you share especially about women! You are an inspiration i hope more people follow you 💜", "princy2030": "Coz u r so dope!!❤️", "vinay0502_": "I am not an avid reader", "image_of_ink": "You have a voice, that resonates with us. You have a voice that matters. You have a voice that can make a difference and should be heard", "reached.indrani": "That’s a face right there...👆🏼", "anjali_bino": "Cos your captions r so inspiring.... simple❤️", "sugandh4431": "Bcz I find u so real ..your thoughts and what you write are full of actualities...such a incredible girl you are...❤️", "shruti__mayekar": "Write ups", "tooney_zy": "What you say are said by many intelligent souls out there. But the way you express it...", "riddhi.acharya_02": "I like the fact that someone is actually speaking about shit that needs to be addressed ❤️❤️❤️", "souravshetty7": "Motivation✌️🔥", "jananiishh": "I follow you because I see myself in your words. I am not kidding, when I put your captions in my stories, all my friends thought that I wrote it. There's so much vulnerability that you accept with strength and on a lot of issues, you make me think. You make me aware of a lot of small tiny little things going in my head. Thank you for that. 🌼", "thewritething123": "Sometimes your thoughts used to resonate, I don't kmow any more haha", "tarun.007": "Because I know you are a Secret wala Superhero who will Save Earth future mai 💫", "shivanipr_": "Oh Girl ! Is this really a question to ask! Ask why we shouldn't follow uh? ❤️ You speak loudly what I whisper in mind ❤️ more power to u, keep going, keep believing, keep shining❤️ #inspiration", "susmita_22": "Your captions are empowering 💕", "sr.uti": "you are unapologetically and unabashedly yourself. you talk about things that are important, things that matter. you are a great storyteller and you are raw and unfiltered. that is why I follow you.", "kriipaaa__": "I will forsure pre order your book but make sure that it gets delivered here on Nepal too.", "thesagittariantraveller": "Your travel photos. ❤️", "instadeeksha": "because your insta look so real no drama like others @redheadwayfarer n i love the way you are ✨", "preet_1405": "Bcz u give us the confidence to like ourselves🤗", "zaan.0": "ap payaar ho ❤", "a_n_j_u_4": "Your write ups are always super awesome 🙌🏻❤️", "anshitakoul": "I am a big sucker for long captions. And you write so well and while I'm reading your captions, I will also look at your picture and be like, she is beautiful and then continue reading. It feels nice to read a well articulated post. 💛", "nitika_ch": "Coz you're everything that I'm not but want to be❤️. You inspire me to re-evaluate myself and my approach in life.", "sankalita_59": "I follow u not bcoz u r just another pretty face on Instagram, bt bcoz u r one of d prettiest girls I've seen on Instagram, inside-out. U r really really doing a great job through ur posts & I mean it coz I read each & every caption of urs, actually I guess I'm in love wid ur writings, u inspire me & everybody out there through everything u do, or maybe I guess I'm in love wid u❤❤❤#myinspiration😁", "_ankxta_": "Cause you say stuff that resonates and make me think - ' oh, there are great people too, everyones not bad'", "yeah_me_misha": "Following you since 'Girls on top', Loved your character. your writing does make me think, over the years my thoughts have enhanced. You do inspire me be it feminism or travel posts and how you describe your love towards Rahul. Just love the way how you be unapologetically 'You'. Love you for that 💕 No brainer, excited for your book 😍", "gothic._.butterfly": "Would love to read your book 🙌🏻you inspire us to accept and believe in ourselves everyday 💖💖💖", "vivekkk98": "I love to see your posts ,the wordings you use into your posts and the places you travel and discover, i get motivated from them ..Motivation is about moving people to act in a way that achieves a specific and immediate goal. When you're motivating people to do something they may not necessarily want to do, you have to offer them something they want in return. When coaches give their teams a pep talk during halftime, they are using motivation. Incredibly you're my motivation to travel new places and make memories...thankyou for sharing those pics and keep me up to date about uuh....thank you ...and that's why I follow you❤️ @redheadwayfarer", "nopumpkinsplease": "You make me feel more like myself", "niyatist": "Because you’re such an empowering female. ❤", "prachi_jain10": "For Optimism and self love ❤️", "_averysmolperson": "Because whenever i start to doubt myself all over again your posts are blows to my imposter syndrome.", "_chaotic_life23": "U Motivate us💖", "pardeshitaniya": "Your mind, it amazes me.", "sim04_bfc": "your words are beautiful", "cheshta.menaria": "For your great captions 🙌💜", "deeptijaiman": "Your post's captions are all i need to read. You inspire, motivate and bring out the best woman that I'm. 🙌", "a_creator_of_possibility": "Coz u r awesome,! Ur guts to say all the things are awesome!", "_mystic.m0ses_": "I follow u cuz u inspire me with your looks, wits , nurturing thoughts and zeal ❤️", "ananya_shivamurthy": "I read your captions because it's so meaningful, relatable and worth it.", "in_wtfmood": "I follow you because youve made me feel okay about being braless or nipples pointing out of tshirt, giving me the ability to think that it's all normal and youve actually amplified my thoughts about spreading the good feminine energy all around. Your writings and evrything were definetly a push to a 18 y o evolving into a strong women :)❤", "sukhsamruddhi": "wow!", "queen_of_monsters_nidhi": "YOU ARE SO PRETTY DI🙌🌸♥️", "anila_reza10": "You not only motivate us @redheadwayfarer, but you also give us appropriate reasons as to why we should stand up for or against something. You writing inspires me and I absolutely love your travel diaries! Thank you for being real and Thank you for being YOU! Looking forward to your book and good good luck to you. ♥️♥️😌😌", "ardra_nair05": "Ur inspirational words💗💗", "sudhir_shad_mastfakeer": "Reflection of bindiia ji....", "nitin.rao.91": "❤️❤️❤️", "karanmanak1982": "U put creative pictures and the write up for each gives a different perspective of things. Makes one read the whole thing.", "trishakapoor._": "Because you have empowered and educated me greatly❤️And I love love love you x", "simran.ranaut": "You're daily reminders for feeling better🌈 😌💙", "bazeelabhat_": "your content your words which are actually filled with so much emotions . i love the way you motivate and encourage people. Maybe on a small scale but you are trying to change the world into better living place for everyone @redheadwayfarer", "neeti_drishya": "U motivate me. That's why I follow you and read your posts.", "iamjasbeerkaur": "I follow you because I love what you write and also I love your thinking about girls ❤️❤️...and also consider you as my inspiration.", "khesveny": "Your wonderful captions! 💕", "miss_greeeen": "Acceptable*", "anjalitonday": "You truly inspire me❤️", "khushisagar2002": "Bcz of your liberal thinking", "ishan28mkip": "you provide a perspective I do not find in my vicinity.", "ligna_leo": "You really motivates me... You are such a soulful person to be followed.. and your words inspired me a lot.. especially about racism sexism and even I thought about how much do Rahul admire you... U r such wonderful person to be followed... Just as it is...", "_anaswaraharidasan_": "Your writing and the way you express your thoughts is gutsy and inspiring♥️", "mahak15_": "Because I adore you❤️❤️", "locked_lad": "@redheadwayfarer Not sure about the book but I follow you because you look pretty 😍 Ur hairs r really nice and your behaviour is Jolly, I like the way you are nothing else 😘", "luvarora14": "I follow you bcoz of how you don't let haters stop you from writing, I have never been one to express my views and still don't very publicly bcoz I don't like arguments etc especially with imbeciles who won't understand shit. Plus you do give me a more diverse look into how nuanced being a woman and the entire feminism movement is. You open new avenues of my thought process regarding it. Moreover, you don't mind showing how gorgeous you can look and the exact truth behind the gorgeous, hot look and how ugliness is just a part of life. Also, I have some self worth issues, including my own body image and knowing people as successful as you in this glamour Industry, as well make me feel, like I'm not alone, even though you're a woman", "shutter_bong": "Cuz you are an amazing creator and most importantly an amazing human being ❤️", "rish.chad": "Ur bebak andaaz", "natashanoel001\nVerified": "Verified", "meghanagvr": "You da besth💞", "swati_bonal": "Ofcourse writing 🙌", "vanshihihikaaa": "Because you are who you are, you don't fake yourself over a huge platform like ig just to get some likes and influencing comments.", "anditscalledlife_": "You make me think and add on to my perspectives.", "hathiparinda": "I follow you to read your words. I’m going to pre-order 5 books of yours because I want my friends and brother also to read it. You’re beautiful and your words are powerful. Your words give me strength to go on with life. You make me question everything.  I love you @redheadwayfarer", "vanessa_treesa": "Cuz our thoughts really have the same wavelength❤️", "tehreemabbasii": "i like your writing.", "sanjanasaxenaaa": "Because you talk about things that most people don't, because you're living embodiment of the phrase 'the dogs bark, by the caravan passes'. You inspire and motivate me everytime I read your posts. 💛", "_bhattacharyya_ankita": "I adore you di you radiate positivity ❤️", "eshwarya_": "FOR YOUR WORDS 💜", "jyeshthajyotanshi": "You motivate me :)", "anjali__kulkarni": "@redheadwayfarer because you are that voice of many women whose voices are either dropped or made silent.. you give so much strength", "simransabharwal15": "because I love you ❣️", "omikasingh": "For ur captions 💙", "shivani__09": "Actually the content on your page is so pure and real.", "gurkiran_toor": "I follow you because I really like your work, your creativity and the way you write. I would definitely preorder your book.💖", "tea.writes": "Because you are such an inspiration. The things you write about, make everyone aware about, are so important. You're no less than a goddess."}