{"nishusoni1211": "👌👌👌", "alexynagaroor": "respect", "mayankpanchal168": "Beautiful", "verma_ankima": "okay its good to explore your about society's darkness towards women... but this is too much of posting theses kind of posts.. we all know that women are exploited, harassed, abused but please take a break from this kind of posts... we are irritated to see and read this darkness again n again.... pls take some break and take a breath of happiness laugh and peace", "a_blush_of_pink": "Loved the caption and the concept behind this post... India has a lot of problems and the solution to these problems, according to me, is in talking about the problems more clearly and educating the mass about it... 👍👍👍", "amit1diem": "I like your lips.. Damm hot.. Girls on top", "kshishthakur._": "Thankyou for the sweet advice 😘", "reminizence": "This is amazing stuff written!", "raagmusic_": "Its good to be a feminist..pr aap had kr dete ho😑", "_mdeepsikha_": "Way to feminism everywhr! Agree with you but atleast cover urslf up in clothes no one can roam around naked.", "stars_vhf": "Kisses 😘😘😘", "t_h_e_drug": "Stop exposing. . without dat too u can praise women...don't need to take off ur clothes to prove...if dis was d only way Dan women who have set a history in d past would roam naked 😂😂😂😂😂😂😂😂😂😂😂😂", "aroy40": "Lovely concept", "nandini_kapoor_": "@vaani_gera_ more people need to get this 🍷", "ziyareshi": "Ur so beautiful ❤️💖💝💕💞", "badalti_fizaa": "Loved the caption nd concept behind this post.india has lots of problms nd the solution to these problms according to me,is in talking about the problms more clearly nd educating the mass about it👍", "satu_1995": "We(youth_against_rape) are working for a mission rape free India and also against false allegations, we need volunteers to support us and work with us, Dm at @y.a.r_rajasthan @y.a.r.support.team", "twishamohin": "Wonderfully written", "tanvi251": "@ashaa__x holy shit", "meghapurkayasthagautam": "Miss #doublestandard fully dressed and covered when with family and nude (almost) and mind full of filth when on social media!!! Disgusting is what you are!!", "nupuromg_99": "Kya smjte ho aap apnee aap ko😡😡", "doctor.rays": "It’s so sad to read so many comments here stating that this picture is sensual. This picture is exactly what you want it to be, if u have a filthy mind please don’t blame a picture for it. When i first looked at this picture all i saw was how beautifully the shot was taken and the emotions, damn. Why is that a man’s bare chest in not inappropriate but a woman’s chest is. Anatomically they are the same, both have nipples, just the male breats have less fat content. Why is that when men post pictures in boxers women don’t feel like raping them? Why is nobody shaming men for posting such explicit pictures? The society and it’s double standards! 🤦🏻‍♀️", "_that_bong_girl_": "😍", "khushi.julka": "You always steal my heart❤", "nidhii_chauhan": "What about those who faced this every night? Or those who r older but can not say a word. Close to their childrens but can not share the words.... ND yet celebrate krwachauth 👎in the name of rituals......", "koliflower.25": "seriously, we watch it but act like a blind.....thankyou for ur thoughts", "billion_dollarproject": "Yes but justice needs fight", "danceholic____komu____": "The right age for marriage and sex for women is 18 bcoz scientifically womens body are physically ready for sex at the age of 18 below 18 sexual intercourse may cause harmful effect to her body and yeah definitely man have no rights to touch the woman without her permission forceful sex after marriage is also a rape if ur husband it doesn't mean uh hv rights on her without her permission the worst part is some womans don't support each other bcoz of jealousy girls its time to unite n fight if we dont unite and keep fighting with each other how will we fight with this rapes n molestation from my side the best way is learn fighting and fight if anyone touches you girls dont need to complaint at court or do such stuffs bcoz they do nothing the fight is the best way", "sanyaj0shi": "Right to Privacy, which is now a fundamental right, should be able to criminalise marital rape.", "imprateekshukla": "amazing", "xo_shreyarajput": "@artoholicsoul yeah . I think he feels he is making a earth shattering argument here shashi tharoor style . 😂. Let him live that illusion", "truu.living": "Babe.. u may have ur own way of self expression.. but I though feel like u r just exaggerating the matter the way it shouldn't be ...", "zaaria06": "Totally my story!", "mr.pauls.insta": "@asmitaloved not in this yarr.. thr r other pic... and gussa bhe nai hun .. bss aise he.. bss unko follow karte hai. Eslia 😉", "the_fair_brown_girl": "So basically, if you want to have sexual intercourse all you have to do is get married because you don't need to fucking care about her consent cause that's very much LEGAL. Congratulations Supreme Court!! You've ensured women empowerment.", "poorvshi_b_5545": "Shiii how ugly ur😖😖😖", "asmi0304": "Tumhare gussa karne se use fark nhi padhta...duniya me bht chize hai we may nt lyk...but dnt mention the way u did ....lyk in sentences😷", "pareenavet": "Wonderfully penned down. Truly a moving and powerful piece. Hats off @redheadwayfarer .", "gemini_illusion": "👏🏽👌🏽", "navkar.shroff": "@redheadwayfarer there will never be equality. If a man hit a woman he is coward and if a woman does same she is brave!!!! I respect person not because of gender but because of deeds. There are many examples of many women misuses their rights. They are to protect them not to use as weapon. You people show man as sex hungry dogs who doesn't think anything except sex. Be real and educate yourself.", "hiren_maru4real": "@redheadwayfarer You said that Marriage is apparently the consent of having sex at any time he may desire!! Now that's wrong Marriage is not only the sex between two people for a lifetime and he can have sex at anytime he may desire!?, by SEX IS BETWEEN TWO PERSON AND MARRIAGE IS BETWEEN TWO FAMILIES! And WHAT IF HE'S SEXUALLY ASSUALTING HER! what do u call then ''its not rape she's above 18!'' ??!! Well that's MFNUTSS!", "shubhangi.dharmik": "YOU inspire us @redheadwayfarer Love youu!💕", "machhi7297": "So sexxy", "thedishabasu": "@naresh_garlapati And you are a big example of men demeaning mankind and humanity and logic and everything else that is sensible.", "kunal_sagguu": "Dislike", "theuaeshow": "😍😍😍😍😍😍😍", "ushasmithhalder": "👏👏👏", "appy64": "@coolpritish As long as people like you look at other's body, my thoughts will not belong here. That's what you should do, you shouldn't care😏 Thank you so much for not caring 😊", "karan_shantly": "bassss ....ho gaya tera??", "divya_1162": "@douchearoo HAHA! what can be more worst a woman criticising another woman ?? Be a woman who lifts other woman..dnt drag anyone down..go get some life...", "eggplantsanyasi": "@douchearoo this picture isn't even sensual except to perverts like you who'll see even a little bit of skin and go hard. and even if it was sensual, it wouldn't matter because she can wear whatever she wants and say whatever she wants to say while wearing it. who are you to say that if you wear that you cant say this ? you're demeaning someone who has written about marital rape. is her picture more important than the issue ?", "naresh_garlapati": "@redheadwayfarer why u always post's semi naked pics in the name of equality&feminism.who are u to judge our judicial system?To wish karvachauth ,is it necessary your lengthy baseless theory on Rape.In this society anything is in the favour of women.First of all think before you write these baseless stuff..... in our society there are many women who claims that they are victim of rape even they are not commited to rape and they blackmail the men and demand money from them.I have seen these kind of stories with my eyes.Thousands of men in rape cases are falsely convicted.Now a days in these women favouring society a man can't defend himself even though he is innocent.", "simrankraina": "Ohh. Spot on!!", "pahadiahimanshu": "This post is amazing. Much needed one. But the people here mocking every other comment that is against it is disheartening. Everyone deserves their own view.", "_iamtripti": "Savage young lady 🔥🔥🔥", "monu_theretohelpyou": "Marital rape should be punishable by law.India needs to make its laws stringent.", "margaritasth": "I pray that this changes for all of your sakes. This sickens me. God bless you 🌹🌹🌹🌹🌹🙏🙏🙏🙏🇬🇧🇪🇸", "ashish_chandolia": "Sirf instagram se kuch nhi hoga madam apko kuch aur bhi krna padega", "amritaaaaanair": "Caption and you are lit af! More power to you lot's of love", "darshankanada": "Now this is call real example of beauty..now this post can be really motivational for lots of plus size... pls Continue dis work which gives othe boost ups.", "_being__mj_": "Changes needed. @srinethranarasimhan", "casejunkindia": "Follow our page ❤️", "sidharth.vasuram": "👌👌👌👏👏👏👏👏🙏❤", "10stkid": "Every time I read ur caption I get inspired... N it's gave me some kind of strength to fight against all d bullshits rules & regulations of our society... All I want to say is that thank you!!! Don't know abt others bt really it's mean lot to me...luv ya❤❤❤", "kuntalsarma": "Elites like you are the most privileged creature in earth. So, stop playing victim, men r also subjected to domestic violence... If u want to fight for a real cause, fight against oppressive/Misogynistic Islamic laws.", "etcook": "@redheadwayfarer 😃", "tarun_kashyap__": "Hey r u stupid??", "emharz": "She is perfect in her perspective!what she is trying to show the globe is tremendous.BT why to convey it with a semi naked pics? to grab attention??", "vedi_vakdi": "I've started calling it Kadwa Chauth.", "benz_tanmay": "True .Yeah I totally agree with you bt you know wot .. the main problem is it's implementation , how will someone convict husband ???? You knw rite 80% dowry n domestic violence cases r false . So Don't you think women will misuse this law . Please thinkk", "shubham_raj_18": "How many husband 😂", "deeminda99": "And you think the country is moving forward...#fuckedup", "mariia_margarita_official": "Пожалуйста, если не трудно, подпишитесь на меня ❤️!!! Буду супер рада и очень, очень благодарна вам, за вашу подписку)))) 😜 🌸 🌸 🌸 🍓 🍓 🍹 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬 🍬💗💋💋🤞🤞🤞🙏🙏 (подписка будет взаимная😉) 😜 🌸 🌸 🌸 🍓 🍓 🍹 🍬 🍬", "being_b.a.r.s.h.a": "You're doing a great job💕 words indeed are powerful ❤️", "oti_media": "Wow, I love this.. wish we can be this wise in Nigeria", "koualwaysflying_": "I'm speechless after reading this ..🔥 you go girl❤", "arshi___khan___": "Amazing👏❤️", "thatkomalaullakh": "🙏🙏🙏", "iamshilpichowdhury": "You really stick to an important point today and you're right. You hit on the mistake and it's an irony that India is being properly civilized only because of the British government. There are so many mistakes in our constitution and it needs to be corrected. I know people will tell us to move to Pakistan after these thoughts. Yeah, I'm a patriot but I can't ignore the social contribution of British people to our country which had rituals like Satidaha and Balyabibah and recently also Kadwachauth. I don't know who are these women who are so desperate to be tagged as goddess and so sacrificing day by day without realizing the fact that they're also human being. I connect to you here @redheadwayfarer and your writings are awesome as usual. 💗", "vedu__": "Speechless 💕", "dhanyakumar.mh": "I truly I'm speechless at the way you put across the issues that exists in surrounding environment ! Respect you ma'am", "_alishaamjad_": "Beautiful ❤", "_txxna_97": "Hats off🙌😻😻", "kritikapandey_": "Ma'am whatever you say is right but these men will never understand it .keep posting ❤️❤️❤️ @redheadwayfarer", "akshye7899": "The biggest problem with our country is, there are so many f**ked up & illogical things...,😠 mostly with the system..., it feels total shame..., and even if someone tries to put efforts in order to things being changed, the law & order or the political people shuts his mouth or him directly...,", "browneyed.panda": "Saloni, you have bereft me of words ❤", "thebeautywonk": "For some indian men, marriage is their license to have sex. Doesn't matter if they have the consent or not. Marriage is all about having sex and making babies, not about standing with each other through thick and thin. 😑 Beautifully written 😀", "_shubhendu_": "Yaar stop being so much of feminist yr seriously and all men not always the same...we always gear women being harassed by men but do we hear something vice versa I was about to write a paper on it but my professor stopped me frm doing so bcoz she said its not correct 😑", "gulfasafarhin": "Fabulous sister", "mr.rage1337": "Every 1 has it its not disgusting", "abhatitarkunde": "@nrashmi @ayushi.1395", "anukshabharat": "This country needs more words like yours!! Thoughts like yours!! I really wish if they really consider this though they are listening it!!!! We need more Saloni Chopra like you!!! Salute! 👏", "anmoldeshmukh95": "@shwetajawle @ketki_h @siddhi0909 @arohi.c @shreyad.1 @van_i_ta @geet_2411 caption", "karishmasinghrajput": "The definition of RAPE is sufficient to explain it \"Sex without Consent is RAPE\" ... There should be no argument on it, when its simple NO. Someone is denying for sex, be it women or men because the word sex does not mention the sexuality of partners... \"No consent means No Sex...\" Not only for women's, for men as well... (Though there is no such case has been heard of men getting raped after marriage or being harassed by his wife for denial of SEX)", "avinash.rathor09": "Huge respect . Smone is talking ... salute", "bhakti_kaushal": "❤❤", "a_unicorn_adoptee": "💘", "soulwanderer_surabhee": "Amazing! I m speechless! Many people still unknowingly or knowingly think that marriage is a licence for having sex, its not a big deal for them whether their partner is willing to have sex or not! U write so so well saloni @redheadwayfarer 👏👌🙏 like u write what every woman thinks!", "psyche_wolf": "Really...not only boys...but girls (some) too treat themselves as materials for their husbdands to hv pleasure with n have kids....n this hppns because we hv been grown this way....its not like we want it...bt it has crept into our mentality...no offence bt iv seen mny ppl(PARENTS also) sayin lyk learn smthin odrwise ur in laws will scold u...beat u...what will they say...i mean its soooooo stupid...yeah its gd to learn cooking its usefull...bt treatin girls as a material for pleasure n household chores....its shit. The total concept of marriage n going to in law house leaving your father's house n then being treated as a reproduction factory...its all so scary...so complicated...it reminds me of Angahard from Mad Max:Fury Road😕", "rituajwani": "Truly agreed..🙌🙌", "m.b.adil": "Nice essay ! I vl gv u 97% marks... Deduction is of handwriting 😂 ! But from where did u get this much content..?...", "acharyamegha8": "Oh no", "dianabiswas143": "Don't u have mother? If have I think she should pity on her child... @akashbhagat89", "semantimanna": "I saw a spoken word performance once and it was titled \"the legal rapist\". At the end the guy said these amazing lines, \" if what our society tells us is right and marital rape isn't a crime and being a housewife is a job...then isn't it harassment at the work place!\" And that has kind of stuck with me. I mean it's ironic how people tell that it's not that big of an issue and then they are the first ones to silence us. Life's really unfair for us, in literally all the spheres. But then I read your posts and I don't know...I guess it feels nice to know that it's OK to speak about the unfairness instead of clamping our mouth shuts. P.S. My comments are really long...xD @redheadwayfarer", "shanu_vikas": "👄", "_theintrovertreader_": "Marital rape is a real thing n happens in India which needs to brought in light so that women know that marital rape is wrong and such thing exists!! Last month I read about marital rape in TOI n the comments of some men were so absurd which shows the mentality that’s exists in the society!! Thank you @redheadwayfarer for speaking abt it!! Ur writing is always very inspiring!! 🙌🏻👍🏻😊", "sunray_of_sunday": "Truly..", "_anush.__": "The vermillion out of place speaks out so much. More strength to you. 💗 @redheadwayfarer", "hudabeautycafe": "@respect_women_protect_her see this", "_dharna_01": "Truee💯", "muankim_simte": "It's definitely a funny topic because rape between husband wife is something which is very hard to digest.I meant people get married to walk shoulder to shoulder and be there for each other always. This is not rape. This can be named as something else, but rape uhh huh", "advshahbaaz": "Respect @redheadwayfarer ✌👌", "gauriherself": "@redheadwayfarer pls check your inbox I had sent you a poem for yesterday. :)", "chaitanya.cix": "It's a two edged sword, and 375 & 376 are very serious sections. Marital forced sex needs to have it's own framework as well as definition. 375, 376, 377 are one of the few misuse sections like 498A. Most of the cases are not reported or settled through compensation as it's compoundable offence. Bringing marital rape in same framework is very dengerous. It's crime there's no doubt in it but it needs it's own framework to protect both husband's & wife's rights. Otherwise marriage as an institution will not survive.", "___insta._grammer___": "I am so blessed to have access to listen to your thoughts. ... I love you since girls on top and this is insane!! You go girl? You are one of those who have that kind of impact that is just unforgettable :* Keep going and never GIVE UP on this👌👏", "hot_cupid05": "Truly agree wid you mam...... nd shame on the d grls who r posting against it.... They can't even know how big this topic is and how important it is to understand for a woman tht after marriage it is not only her duties to understand his husband and keep compromising all the time... It is not lyk tht, tht she got married to his man only to fulfill his sexual needs... We have to understand this..... Asap", "pinksyrup__": "Its simple no is no which means disagreement...anyone n everyone has to accept no! Marriage is a bond.. Not slavery! U donot own ua wife's body...", "shatabdidutta_": "Well written @redheadwayfarer 💙", "bethstacks_96": "Bull shit it is still rape.", "greengo10": "So monotonous ☹", "vermavaari": "Well said. ......infact still today in various parts of India women see their husbands during or after marriage and then when that complete stranger forces you to sleep with him just because being his wife is not rape by law....how much justified is this ????", "gaurangipande": "💯💯💯💯", "joyna_ebbi": "Well said", "4837warriorking": "Well said", "virendra7053": "Nice", "_bhavesh_mirani_": "Caption 🙌", "sarita.927": "fucking true", "iamyashanand": "@fuzzy_chic first i thought this is you 😂", "dillipkuwait": "😍💋", "smolhomelessbean": "It's still rape if it's done if it's forcefully done who ever the rapist be then 🤷‍♂️ I really hate this 😡", "soultraveller115": "accordin to survey 57% cases in india are fake , and why fake bcs if a girl is married and she is above 18 or lets assume she is 30 , but due to conflics btwn there marriage .. jus to teach a lesson to his husband .. they file a case accordin to ipc 376 , even though they didnt have sex from last 6 months but it is still consider as an rape ..yes its incredible india", "prashu2721": "Well said mam! @redheadwayfarer", "archanakhandelwal": "@tarun_kashyap__ I guess you are to raise this stupid question", "adeena_rahman_malik": "This is such an idiotic tradition! Marriage doesnt give you an invisible certificate to have sex whenever you want. Recently, in Pakistan a guy broke his wife's collarbone because she refused sex! Shame on us!", "bokadiapriya": "@kinjalbokadia @priyanka.bokadia @megha.jain.718 @raveena19doshi @varshakanungo @palak98bokadia @palaksanghvi18 @nikitha_salecha @nishabokadia3 @divyanshishah", "shivani_bisht_b": "Why so negative ? There are enough pertinent issues to raise . Why so regressive @redheadwayfarer . Why not talk of the issue and the solutions that are underway by the government- women's groups - women's empowerment groups . Spread positivity lady! What goes around comes around!", "___womaniya___": "Immense respect for u Mam @redheadwayfarer.... U r an inspiration for millions of people around globe ... Keep it up 😊", "the_movin": "you looking gorgeous !!", "abhijeet_mahat0": "Yeah ! Seriously... I don't get this whole concept that if she is married, then it's not a rape... On top of that the law says it's their family matter... What law when legal age for marriage of girls is 18 years and law will only take action for those who are below 15 years... It's like if a girl is married then her husband has got the license to rape her... Thanks for posting this and bringing this issue to light with all the facts... #fighter #keepinspiringus #loveyoudi 😄😘😘 @redheadwayfarer", "rathi.vinit": "Gud going @redheadwayfarer", "priiii08": "@ajaymajethia", "guitars_n_chopsticks": "@priyanka962 rape refers to the forced sexual actions, against the will of the other person. Regardless of who it is, rape is considered rape.", "cutepiedeeshayadav": "Nyc", "palakpreetkaur_8": "👏👏👏❤", "classypath": "pleasant ❤", "avaniiappalla": "on point,girl", "varnikazzz": "Preach 🙌🏼🖤", "sharended": "When I see the pic, I thought that this girl has mental problem.... But when I saw the name, I am sure that she can do that things..", "simrannssingh": "You make a very genuine point here. And I totally agree with it. We really need a law about it but @redheadwayfarer it's not like the legal system is doing nothing about it. They've been looking for making a law which cannot be misused like the rape laws. There are 53% false rape cases and some people are misusing the law which is totally wrong. They know the consequences of making marital rape law at this point because to verify and check if it is actually marital rape or false accusation is very difficult. A lot of discussion about this is happening and the legal system is trying to come up with ways which won't lead to damage for an innocent person. Also another thing , we cannot deny that recently the judiciary system has made many laws which are for the upliftment and empowerment of women. Many laws in India empower women , and it's high time that women start taking stand for themselves. Till the time the law is not made for marital rape they themselves should get up and take a stand for it. As a law student I can tell you that mere laws won't help , Because already their are thousands of laws which are not even used. It's the mindset of people that needs to be changed more than the laws.", "mr_vasu07dz": "https://www.instagram.com/payu__15/", "khush25.m": "@redheadwayfarer You are a blessing to our society, that needs to reach out to all. My ultimate eye opener. #nowords", "anjana_ma": "Reading this made me cry. I just can’t understand why criminalising marital rape is even a topic for discussion! Rape is rape no matter what the bloody situation! And who are we actually protecting in this situation?", "krypton_adalphous": "👏👏👏👏👏 hats off mam !!! #respect", "aishwarylakhlanii": "I have always talked about this & tried my level best to make people understand even if i actually tell you Saloni my mom is a victim of this shit.. but as you said the mindset of women's & the society 😑? My only msg through this comment is - Hey all the beautiful young ladies over here don't do this with your children's.. Make sure that the mindset our mothers, our elders are taking through.. Won't affect our daughters, our new beautiful once #StepTowardsChange ❤️", "shweta_choudhary_9": "Well said👍👍 u r an inspiration♥♥♥", "siddharth_a.d": "Your captions 💝", "kulshresthasanskriti": "It's not only that government denies the existence of marital rape but when we discuss with our adults about this **by the way using word sex is censored because it's not sanskari** they also deny it or maybe they don't want to discuss...Women suffering everyday are not coming forward because they think it will hamper their and their families izzat...anyone who is forced to have sex before or after marriage... It's CRIME... when elections come up rather then playing dirty blame game politics our parties should focus on such issues... it's democracy... it's our government...", "rahims_khan": "hot n spicy 🌶", "ma_ansi": "@redheadwayfarer you know there is this part of me which says no one can bring change to this society untill there are people with this kind of mindset but there is also me who believe in you and your words ! AND Trust me you've changed me to be a better person today... So be the person that you are and you will always find me by your side...", "ogyukta": "My inspiration🤗🌎", "ayushsaysrelax": "People facing it in the country might not be able to read your thoughts on Instagram.", "tarot_rooooop": "It's a sad truth ..I don't und the law n the law makers", "sydellejasolaguiar": "This is just perfect girl...!", "the_capricious_one": "\"Rape\" mainly is getting encouraged since we don't have a solid punishment for it and even if we do it doesn't get into quick action always. How long does it take for a rape to come into limelight? Even if the girl isn't married and she gets raped she's told to keep quiet. Why? Cause it was her mistake that she got raped. Why? Because she wore short clothes? She drinks? She smokes? She hangs out with the opposite sex? She provoked the man. And it being a martial rape encourages them since it's \"ghar ki baath hain ghar ke baahar nahi jaa sakta\". The total mentality revolving around rape has to be changed.", "gracy_modi": "You just nailed it! 🙌🏻 hays off! 👏🏻👏🏻 @redheadwayfarer you’re an inspiration to many! Love ya! 😚♥️", "abbhinavsrivastava": "These days your Pics are so dark Y ?", "impramodkaushik": "👍", "gauri_lp": "This. This. This. The importance of this. The reality of this. The brutality of this. The NO that is treated as a yes because of the label of marriage. The disappearance of consent when under the 'sacred institution' of marriage. Marital rape not being treated as rape and using culture and tradition to fall back on, because how else can you justify a sexual assault in a marriage: why of course, when a woman decides to marry, she also gives up the freedom and choice in regards to her own body. @redheadwayfarer I cannot ever thank you enough for starting conversations and talking about a variety of things that are unbelievably important. Thank you!!", "samreetksandhu": "Such powerful words #morepowertoyou", "eish_xix": "Appreciated 🙏🙌", "rannvijay_prince__varun": "@redheadwayfarer We need people like you in the society You are such an inspiration I am 13 and you are making me a better person day by day. Your writings inspire millions . Love you loads ma'am😘 Hope I could meet you someday.", "teejay_beatz": "@douchearoo that you joking/sarcastic commenting (idk what that was 🙄) about female genital mutilation is pathethic", "isabellaaaa07": "❤❤❤😌👌", "priyadadriwal": "U always post such awesum pictures with a massive message. I love the way uhh always detail the issue its just wowsumm😍 go ahead girl proud🤗👏", "cllasy_rookey": "one word for u....Amaznggg...an amazng posttt wid d right words...", "iam_zrk": "You all should read this! @nancysingh7322 @srivastavashubhi590 @aisha @__mariyam_naseem__ @itsavijitsingh", "_simransatija_": "🙌🙌🙌", "tali00624": "Seriously your post always ignite the fire in me to talk and share my own feelings with others though our society is male dominant I still support Feminism..N the problem is not in our society it is the mindset of people and the system of beliefs we are mold and shape by the beliefs of the people if a girl hang out with her friends she might get pregnant etc. etc. How can be one so judgemental not all hawkers how sell their products on the roadside are poor they are actually enterprenuer atleast they are not begging U for money.", "chirpy_lil_sparrow": "@redheadwayfarer ma'm please check your massage request", "amitaggarwal8": "Yrrr Kya likhti h... 😎😎😎😍 @redheadwayfarer", "smritirana17": "I want you to talk about human trafficking as well. Little girls are forced into prostitution and they never see light again", "kalyanisaji": "👏🏽👏🏽👏🏽", "tiyashakrishnatrey": "The fact that they justify marital rape not being criminalized because of false dowry cases really pisses the fuck out of me! Like is 2+2= frog!?? They want to avoid the supposedly \"false accusations and harassment of the in-laws\" what about the rape victims? Women who have to live with their husbands raping them who are silenced by their own relatives and or family members who have to live with someone who doesn't view them as anything but mere sexual objects? What are they supposed to do? They cant even file a case now because \"it's not rape if her husband does it\" I love living in this hypocritical patriarchal society 😊", "preeeettt08_": "❤️👌🏻", "tejaswini__bakshi": "you are an inspiration for kids too😘😘😘😘❤❤❤❤i just love how to express you thoughts😊😊😊", "pri.luthra": "👏👏👏", "vaish_ransubhe": "I have been reading your posts since the time I joined instagram. This is the first time I am commenting. Every one of your post is powerful, meaningful, igniting a fire in us to stand up and speak. I am a huge fan of yours ma'am. Hats off to you! I just love you a lot ❤", "iamsbhattzz": "You are such a great inspiration for all of us 🙏", "aayushi_syahi": "Many get the drift of the image and the message conveyed. What amuses me is that @redheadwayfarer 's profile clearly explains what she has to convey to the society, yet Some 'literate' yet ignorant folks treat these posts as a medium to showcase the mediocrity( read below-mediocre) of their thoughts! Does the older generation read this? May be,may be not too many! But do the youngsters read this? Most do! Here's when these goddamn words matter...They are shaping mindsets of the present generation, her readers that mostly consist of 'youngsters' ! Ye sab yahan likhne se ye hoga okay!! Nobody's pressing you to go on someone's profile who has been trying (and very efficiently so) to bring a change in the mindset of her readers. Only the welcoming can understand the point made! A rule of the thumb for social media is \" praise if you want, but don't spit in someone else's efforts.\" If you think you are better off, ignore this and go get a life!", "ns8760129": "Always demoralised post...😤", "pranavgodsephotography": "Such an Inspiration are you!!! Well said @redheadwayfarer 👍", "iamfinelikewine": "Wow i love the action here.. The comment section... Lol", "a_crazy_vibe": "U killed it man...!°", "agirlthatknows": "Message understood. Why the need of such a sensual image?", "cra___z_": "Proud of your worK 😘", "pooja_joshi94": "@the.arcane.fille", "shrishhtirawat": "I feel like reposting this. absolutely amazing.", "pratzrai18": "Well said!", "poojaakhimani": "I love you more and more as i read your posts❤️ more power to you! And much love♥️ i thought your picture was powerful. But damn. That caption killed it🔥🔥", "shefali_aphrodite": "you and fatimashekh are almost alike", "anannya._": "❤️", "vikrammehta934": "Hello beautiful", "i_anejahoney": "this is a serious problem and this does happen even in well educated upper class families.. i just wanted to clear above 15 is for Muslim girls as there religion says something like a women is ready to get married when she hits puberty and for other religions it is 18 plus which is in itself a joke.. it should be one country one law for all.. I hope this matter to be looked soon", "heyitsbulbul.___": "something which truly needs attention", "ansari_arbaz4": "Appreciated @redheadwayfarer 👏👏", "sinful_cinderella": "u r just awesome....lots of love💜💜", "kanchan_jadoun": "You are always unexpected..... superb post...@redheadwayfarer", "flickeringminds": "🙏🏻", "indecisions.kevlar": "Yes girl, yes 👏👏", "alvin_unofficial": "It's an ugly truth which the society is trying to divert in the name of culture... Glad u spoke about it...", "pallaviiaawhale": "So beautiful you write.❤❤❤", "debalina_saha_": "This is beautifully written :)", "sharma_yolo": "Wow, again this is something that I am so proud you highlighted in such beautiful words. TBH more than the legal system, it's the mind set of the people and the society. Generally speaking, people won't give a damn about criminality of the issue, they'll do it regardless @redheadwayfarer babies they believe it to be their right. So I believe it's more about educating the \"educated\" as they call themselves.", "pujaramteke5": "I love you", "freesoul_lifegoal": "👍", "mansha02": "Well written saloni.😍", "the_filmy_kid_": "Appreciated... 👏👏", "kimchindsprite": "Great words! Always inspirational ❤.@redheadwayfarer", "nikkidas": "More than th law, the change needed is in th mind of Indian men... Its pathetic tht we r even discussing forced sex by a man in or out of marriage... Hw can a man even think or enjoy forced sex? Its pathetic to c such men still exist... Wer is th love... Wen did lust take over? I m still feeling disgusted to knw tht such men still exist, whose idea of sex is jus a physical need rather than an expression of love n passion... I m sorry on bhalf of such men.. They dissappoint me... 😞", "aadityabhutada": "Something which truly needs attention. 👏", "_thelostbreed": "Gorgeous 😍", "sanjanaaaasen": "Our government needs to be reformed. And induced some brains into. Bloody patriarch society.", "_ihatehealthyfood_": "Dis writing is wonderful..😍 indian society need to change..", "harsad_kumar": "👌👌👌❤❤❤❤❤", "1um0smaxima": "Using a sensual image of oneself to talk about marital rape? Cognitive Dissonance", "absolutely_sky": "strongly by your side...🙌🙌❤", "sohiniibose": "Its again beautifully writ by you... About the changes that really need to be focused on in the society... Its about changin the mentality of people", "ajay95019": "Sooooooooooooo beautiful mam 👌", "__g.a.y.a__": "The shade tho, fuck yess.", "imytnsolanki": "You’re motivator...true thinker...truth speaker...I follow you nd respecting you👍🏻😇", "raghav_ryth": "#love 😍😍😍", "keyshore_raju": "So hot", "anikate_monish": "Cutie", "_neha_insta_06": "Very well written", "sunflower_little.funny": "You are justtt beyond wordsss ma'am @redheadwayfarer 😍❤", "tahirali_manj": "O nooo", "jayamishra621": "So true @redheadwayfarer", "_sakshii__": "@manvviii This 😐", "swarabhujbalrao": "Love this", "hansoloandsoami": "Love how straightforward and honest you are 😍 @redheadwayfarer", "rjt__verma": "Owsm👍"}