{"emilymatthews0986": "I wanna suck on those and cum right after that", "bilal_multani87": "So I guess there is no difference between rickshaw wala and you @redheadwayfarer .....both of u are doing the same ..... publically only difference is u r educated and he is not........", "_yoyoshwetasingh_": "😢😢😢", "the_mayanksoni": "Superb thinking 😊😊 really impressive 👍", "ashraf.sayyed": "You are True 👍", "high_guy_2020_m": "Yeah its just a body part.. show me more of this", "divyasasidharan": "U must be such a brave human to just do human things n have to explain urself for that. The comment section is such a disgrace. I sometimes wonder this is a good place to fish all these perverts n finish them off. The world would be beautiful and peaceful place with them rascals.", "rockysir1818": "Kammal ka hai ye compare to Dipika", "thulunganzy": "Sexy", "k__sam.07": "Captionnn🙌🙌❣❣", "sunilkumarnayak": "Put it all bare then if it's just a body part. We are waiting.", "sahilbinmannan": "Heads of you Mam 🙏🙏🙏🙏🙏🙏@redheadwayfarer", "sukhsamruddhi": "@vaibhow.mp4 read?", "iamsayan312": "Wow", "mr_mukesh_sharma": "Tight maal", "parves___lm": "@manish_bhansali619 bhai samjha", "sultansumra007": "Look like katrina", "restinpiece._": "To what the contents and your arguments are leading to i would seriously like to add to it. Coming to the point where you want to fight for the freedom of not wearing bra's as a matter of fact not wearing anything at the top, calling it freedom, let me tell you something, some things are meant to be this way, Talking on a broader perspective, animals (humans come under this) especially females have some tricks under their sleeves or a body part which attracts male and there's as reason to it , reproduction ! Taking the species forward ,protecting it. It is that in humans we hide that body part so that we don't run on continuous reproduction cycle. An animal goes on to reproduce from its maturity age till he is maybe old because he's not able to find females (They are for dominant). But humans are intelligent species so they have other things to do than reproduce. Now coming to the point of rapes, they usually happen when your things are exposed, exposing or showing that fancy thing means a yes for sex in animals. Go check all the insects when the females shows their part she means she's ready to have sex. Which is why the society suggests to wear proper clothes so that your don't end up misunderstood. And replies in polite languages will be appreciated and answered! Remember humans are intelligent species, don't talk rude unless you want to be heard rude.", "be.in.rythm__": "@adarshchatur18 😂😂 uncle ji ye account apke liye nhi hai ise block mar do", "namansrivastavaa": "@rishitasinghh I can read all of her posts ! Wonderful !", "rishitasinghh": "You find katrina everywhere @naman041196 !", "aman_alpuria": "🔥🔥🔥🔥😍", "ambica9": "@nishtha32 caption", "samyak_garg_": "U r lyk Replica of katrinabut boobs like aalia and lips like nargis fakri", "prags23": "Salute✌", "melissaraisin_15": "@shwetz97", "__mayurgram__": "I ❤ ur post...empowering", "_mitesh1010": "😍😘", "pranav_pai": "But as soon as feminists see women dressed scantily on screen, they complain about how inappropriate it is", "little_ashish": "Jab itna bol hi rhi ho to pura khol ke hi dikha do bx", "aashish_rathod": "@my_world_unseen", "husnaahhmmeeddd": "Beautiful you and you caption bro ♥️ it's damn awesome ... You are such a great lady I appreciate your positive attitude and your words .. your caption make me feel good for myself and my body .... We have mutual thinking .... Your post your face your personality is so bold and strong they can motivate any one to be great and proud on being a girl ♥️ ... I don't know how many times you have faced this gender discrimination but your caption is genuine and I can totally feel you ♥️", "harsh94": "I am blown away by the amount of stupid comments on this post, power to you @redheadwayfarer for being brave and speaking your mind.", "ilakshyajain": "Hey..oh my god..! Caption..❤ it contains all what everyone should read. Everyone should read this and must chnge their mind..Now a days our society is being so cheap that its now so hard for everyone to change their hell mind. I totally agrees with you..According to me everyone should spread this msg so far which can clear the dirt from the mind of fucking shit people..❤ Salute to you..🙏", "akshayasaravankumar": "Did I just blocked people , who commented nasty things on this post??? Yes, I did..", "ashvipathania712": "female bodies but the real fault is in some men mentality", "godvin_rakesh": "Q u d dyr...", "theamrinder007": "Nature wants men to get turned on seeing the breasts. Women want men to suppress their hormones on seeing breasts. Damnit! It's too hard to be a man.", "watchamit": "Juicy side boobsss", "ig_namomitro": "Even after seeing your pic many turns on", "amitpub99": "Omg saloni u r too hot dear.so boobilicious", "psy_being_human": "So cute 👸😘😍😇✌🙏", "ashwini_ale": "Caption❤", "all_about_beingme": "Faltu ki nautnki hey .....Ese CaPtion krne se kya matlb .... Jab comment me fir se \"boobs \" ki baate kr rhey hey log", "vishnurz66": "If u dont think breast as a sexual organ, then why are not giving full picture of your breast.", "adarshchatur18": "कम से कम अपने माँ बाप के बारे में तो सोचो", "ziniab12": "#respect", "oye_obaid": "Uff so hot dear", "bitterbywords": "You have copied the caption from @imalcolmmistry post @redheadwayfarer..", "shizan_khan": "Black arm", "maine_pee_nai_hai": "@redheadwayfarer great caption 👍🙏", "o_b_l_i_v_i_a": "Have you been living under a rock, you delusional hypocrite?!! Hopeless bunch of sheeple", "stars_vhf": "💋❤", "thefadingsoul": "Caption.. Yeah.. Caption that is what matters the most for me.. As captions express everything.. Its like even if the picture is quite the caption speaks💛", "garima_rajour": "@visionreality just read your current blog , so wish to tag you in this :)", "harshi301": "@redheadwayfarer I couldn't agree more ❤️", "mahir_jeseem": "\"Men rape women.. so why cant women rape men, people steal from others to finance their needs so why cant I.. some people kill others for pleasure so why cant I\" this sounds stupid.. but if you look at the caption above u can see something similiar! Instead of solving something.. you are being a part of it!!😑😑😑", "nandinisaha17": "@tushtuu dude read this", "mai_nikon_wali": "Mam kuch logo ko dekh k aap society ko galat nhi bol skte!! Nipple show kr k hum apney aap ko ladko k barabar smajhney ka bachpana nhi kr sktey!!", "himsxwolfie": "This photo will surely not gonna influence other people there in the country", "notemptingusername": "What you said deserves a commendable praise", "skapa.xd": "I'm fappin today", "dramatb": "♡", "randomchutzpah": "Very well written.. why don't things like these never get viral.. ?? #sadbuttrue", "vikas_jangid_09": "Wooh", "mr.nikhil5633": "Saram aati hi nhi ....sali log desh ka naam kharab krti Hy or Kuch nhi aata", "aghajani5": "Salute for your thinking @redheadwayfarer", "nirvitasingh": "Read @harshdeep._.kaur", "zordan3500": "I love ur boobs..", "prakritinatarajan": "You are such an inspiration ! Well said", "happygolucky0505": "@thesanjeevni @khushbu.lohiya read the caption.", "raaaaainaaaaa": "I'm a guy n i really don't get y people criticize women for the clothes they wear n the way they behave... It's their life let them live the way they want... Get yourself a life", "samjohn6789": "Ur words do have the truth!...but India is full of assholes to understand that...", "shk_hulk": "😍😍yah", "mineecifi": "Thats what i m also being concerned about position /status of women in society. Acutally women holds a very high esteem and should be respected for her intellect ,her heart & beautiful soul and should not merely serve herself as a flesh of meat before the guys .who doesn't even deserve to look at her private parts .also the freedom is not earned by showing off certain body parts @riyasharma104", "muskmalone": "Dont do this stupid fake feminism to cover up ur shit.. the pic u posted and ur nipples where flashed😂 just to avoid those things... stop doing such stupid fake things😂", "angel_hrits": "👏👏👏👏.I love the way you live your life and the way you encourage all others to live.😘😘😘😘😘", "tumuskura": "👏👏", "vivekdhimann": "@benfordexter asshole feminist spotted.", "mauji45": "also ur boobs are not attractive ☻", "perfectcouple0620": "@alishavermaa even no one want your fucking opinion here me and also everyone in this comment section..so keep your fucking opinion in your pockets..", "the_soul_healer_2019": "Wonderfully said mAdame", "rahulchoudhary4642": "Luv u mam", "maneeshsaggar": "Nice boobs show ur nipples also", "insta_hb_183": "@mahirasheikh5101 well said👌👍", "devangmahulkar": "You are my queen! And to all the men saying that this is being shameful and all, well, then try being a part of society which is suppressed by YOU. Try being a gay guy, a lesbian woman, or a girl who likes to be free. Bet you can't survive a day.", "florisjermano": "@redheadwayfarer you can wear whatever you want to, you can go wherever you wish to! Even if you have posted naked no harm 👒No one's stopping! This is independent India.. And you're definitely a independent women! But you know where you went wrong when you linked your fashion sense or clothing or showing a Lil bit of private part or whatever you call it to equality! When you are stupidly relating exposed body parts with gender equality that's where you went wrong 👎", "_richu_raj": "Because men are not getting raped", "vaishali574678": "To upload a picture which one is not going with this appreciating sentence", "theshreyaaaa": "Pretty ❤ @redheadwayfarer", "racky_gill": "Utter rubbish....👎👎", "shrutiiieeeeeee": "Love you gal! 🔥", "mdakhtarjsr.11": "Nice pose 💋💋💋💋💋💋", "brarsahil": "U r absoluetly right @redheadwayfarer .. i just love u for ur thoughts which i think r same as mine n of course for urself as well u r too gud darling n its very correct that u cant compare nipples or consider boobs as sexual organs as they aren't .. they just deserve more respect than that of ours, men's, because mothers feed their children by them and y everything that turns men on cant be called a sexual organ", "_limitless_flaws_": "You have the total freedom to listen or just ignore her post . Well, somebody is fucking jobless lmao", "riyasharma104": "Here's the thing, Breasts are secondary sexual organs. So are Adam's apples. So if men agree to wear turtle necks all year round, maybe we can talk.", "_jaymistry_": "@krutimehta30", "shrey.s17": "Anyways awesome shape", "akashhhg": "Small boobs love it 😘😋", "rainbow_._blooms": "💓💓💓💓💓", "subhro.nath": "if you want equality.... get the shirt off and uploud with bare breast just like man have bare chest", "kefalfaazpoetry": "👇👇👇👇👇👇👇👇Dear Artist and Models follow us for free promotion and shoutout. @patialashoutout", "_prashant.bhatt_": "Yes it’s a sexual organ because it seduce a women . Y to show just a glimpse if u comparing it with men cheat 👍", "__probably__shant": "I admit your feeling....but think befote u write .....do see what ur writing is really worthy or absurd..", "prakash.rock8": "Lovely", "optimistic.shreya": "Aap apni izzat kyu waste kar rhe ho apne boobs dikha k caz is India ka kuch nhi ho skta ..", "ravikant16appy": "Awesome pic its really very hot and sexy...specifically your boob", "rakeshkumar7696": "Looking so hot👌", "raashidshah4": "this is not freedom this is called mental disorder r besharmi....", "yaiphaba_thangjam": "We are all human being we all are same", "randheer_gopal": "😅 so deep.. from today i won't look at any cleavage. 😇 oops!", "chanakya_chatterjee": "@redheadwayfarer it's insecurity in the mind of man or woman that comes in the way of a happier and more natural life. Whether it be a closet mentality about the very thing that have birth to all of us as in sex or the killing of dogs, snakes, spiders of any of nature's creatures that insecure people fear. Most people don't live, the survive and at their last hours, they regret...", "fitindian.passion": "Beautiful and hot ❤️🔥😘", "muskanpandya_": "The caption tho ♥♥♥♥", "kingkhan_king": "Nice", "azmeerafshani": "😘😘😘😘", "monish_walkar": "Fuck equality fuck everything...Bandi hot lag Rahi hai...😍😍😘😘😂😂", "nandarehan1903": "Than what if they are giving me boner", "thatcrazybrowngirl": "Seriously? So much negative comments for such a beautiful post? I mean we should be appreciating her step guys. And especially girls, you can't criticize someone just because they want to be their usual self or are standing against something as bland, by saying \"It has been like this.\" I mean either you ban male nudity scenes too or either support the same for females. Aren't these double standards? This post is way inspiring and these negative comments just prove that whatever she said is all true. This just proves how sick mentality some of us have. My support and applauds to Saloni. @redheadwayfarer #feminism ❤ I truly love this post.", "_sheeba._": "Appreciate you ❤", "anand_dalal82": "Thank you, feeling so liberal ..", "itsniki.ta": "Inspiration 😩❤", "whoperryarora": "@muaji45 lol , I think you should thankful to your mother , jinse aapne janam lia , warna MAUJI45 kis bala ka naam hai , kya pata hota ,who cares !", "last_hippie_": "@redheadwayfarer i totally agree wit you a well toned body of men is appreciated bcoz it is not considered as a visual raping na u cn say ny thing abt the mens bare chest or his six pac abs but id u talk a same thing abt a womens body its considered as a visual raping blaming men and abusing men became fashion now nd yet we call it mens world ohh really ur taliking like u have never watch a men body fantasies abt him but i men luks at u u thing he is visually raping u stop blaming men nd get sum life we all are humans and its are nature to get attracted to opposite sex. so plz do", "sun5_1994": "@jesrobfenty we are happy with whatsoever we have. You want to make things better for yourself. Go on and live in your own fairytale.", "mustu6233": "Posting nude... attracting and gaining followers... with social messages.. babe the one who looks for slut is coming to your page and you are giving him material.. so better you keep ur nipples in your shirt.. men will definitely do what he want.. it is the indian culture then men alwsys do tough jobs and earn few money for his family and due to its tough job women suppose to be at home...so the men will not be worried peeing anywhere because he suppose to do since an early ages.. and as far as our culture and our mentality is concerned we are not a western country. We are the people who still diverging towards western not all of them are like Americans or brit, so in diversified culture you will face such environment where some people are completely open and some are closed in the same way as the richer is highly rich and poor are highly poor in India.", "faheem._.irshad": "But feminism is suck", "p00lisma_": "So much of negativity for such beautiful post ? Gosh can’t really understand people. @redheadwayfarer thanks girl for inspiring me every day. Love ya loads.", "jawaad_mj": "Hats off 👌", "alkesh_khan": "Fuck off yaar @redheadwayfarer what I can't say", "d3921k": "nice", "rahul_k07": "Paisa bolta hai", "shubham_193": "You are ❤❤❤❤", "ritikaagarwal": "@riaz537", "poojaupadhyayvp": "You are inspiration ❤", "super_cabbalistic_girl": "👏👏👏👏👏👏 inspiration 😘", "2.99e8": "Now that's how we need everyone to think about✌️ awesome caption @redheadwayfarer", "russwest40": "Shouldn’t be a big deal", "nitin.aa": "Awesome caption and pictures too... #SALUTE", "ashu_ajoshi": "This woman is having a serious misconception, is anyone gonna dare to point out ?", "i_am_aaryan_mishra": "Didi thandi ho rhi. Hai tab to phensakte ho. Baaki apka mannn. 😊", "aaruk0312": "love writings n ur very step u take @redheadwayfarer", "cinimol": "@redheadwayfarer your posts almost always echoes my thoughts, and the negative comments on them only feeds my anger, anger because of the realization that there are so many 'padhe likhe gawaar' in our society, living amongst us, perhaps even pretending to be pro gender equality. Whereas in reality they might just be one of those people who keep venting out their frustrations online by trolling and abusing others whose opinions don't match theirs.. I'm also glad that these negative feedbacks don't deter you from writing your mind out.. 💙", "sai_plabita": "U juz nailed it @redheadwayfarer", "abhinandita.m": "I love your feeds @redheadwayfarer . Continue writing them, I'm a feminist as well, though I can't express myself as well as you. You inspire me to the throbes of my heart. You are courageous and I admire your courage.", "okayjatin": "CAPTION OR we can say TRUTHFULL LINES.", "real_pammy": "U looking so sexy", "thats_rex": "True said🙏🙏🙏", "fizzyshk": "@owais1454 kyu khud ki maa bhen pe aya to kadwa laga ?...", "its_nikita14": "🙌🙌🙌🙌🙌", "gargakash9999": "Fabulous", "nehal_bhardwaj": "@vibham07 her captions are on point always !!!", "random_shots1": "Bang on", "mukundjhaofficiall": "Will you post? @redheadwayfarer", "officialnafy": "Heart winning 😍😍 @redheadwayfarer amazing u r", "vibe.tribal": "P.S: Had left a DM too but I guess it dint reach you. Requesting you accept my plea.", "t_h__e__s_a_n": "wow", "sarfyshaikh": "Tat's the big diffrence between open minded and narrow minded people .. a womens body is the most beautiful thng .. and yes breats is the part of the body .. its depends on a person the way he/she look @ it ..", "adison_biswas": "@__sharonhz__ ❤", "sangfroid____": "@thakur_anoopsingh", "tchoujar": "On point girl! Fab fab post!! @ankita_2607 read this! 😍", "bright_moon_shines": "I really appreciate when people actually understand the post and then like it or comment ..... And for you girl Thank you to share and spread this ..", "c.r.a.z.y_g.i.r.l_": "You are such an inspiration for all of us. Only if everyone think like dis, this wud be a perfect world 💗💗 #respect... luv ur thoughts @redheadwayfarer 💕", "highsenburg": "I bet you to go topless in front of your family. Then we'll talk. Otherwise just see a psychiatrist.", "who_prashant": "Always on the point 💯", "rik_walker_panchal": "👏🏻👏🏻👏🏻👏🏻👏🏻👍🏻🤘🏻🔥", "kevxn_.x": "@random_guy_0102", "im_harishq": "Hiding something🤦🏻‍♂️"}