{"little_komal": "Sakshi already sent me the screenshots beb😂❤️💙 @ankitadalmiaa no point deleting comments", "saaaakshi__": "@ankitadalmia firstly.. plzz improve ur English. secondly.. may be u'r grown up but only by number not by that Orthodox thinking.", "maira32000": "U impressed me babe! 💕 @redheadwayfarer", "_nafisa_parween_": "I was with an exactly same person you mentioned above and I had opted for B and asked him to fuck himself!! My life is better now.", "misscrackhead": "@lunatic_asr padh ye", "abhinav.gu": "Ok then y u were it? I think u r psycho..u r frustrated with you body and sex..", "piyashree18": "So true!!! 💕", "riccckkkkky": "What hppnd to ur face ???", "takshhhhh": "@nikkkii__18", "shirazzz_": "Thank you so much for this babe💕", "gamersince2005": "@swathi_jr if you wanna prevent rape cases then change women's mentality i.e. how they look at boys. I'm a 16 year old and I've been called a rapist and a pig. If that won't change, the mentality of men would never change. Misusing 498A without even thinking that a man has a life out of marriage. He has a family which also includes his parents. If girls won't stop wearing slutclothes, thrn rapes wpuld never stop. Let western tradition stay in the west, also feminism as it was originally started in Paris then became a storm in the USA. Feminism is not fit for out countries.", "_jami6": "Osm 😗😗", "thisaintausername1234": "@hoodafok lmao, are you afraid that all my points are right? IDK why you created a fake account. Lmaooooooo.", "edge_of_honey": "R u a slut! Taking up such issues is grt but showing your own cilvage is shameful", "deepanshu.pandit": "Appreciated 🤘🏻Cheers Girl !", "cosmickid08": "Who gives a shit about feminism? It's a 2017 thing. If you really care about women empowerment think of making India a communist nation. What is mine is yours. Including my wife who is an object hahahaha", "anshuman.baidyanath": "You will get what you advertise. So if you wear skimpy clothes boys will get attracted to your bodies only. So then you cannot complain that no one loves you for your mind or how intelligent you are. You will be loved for your body and not for your mind and then you cannot complain for shit. @monisha9107", "aabra_ka_dabra__": "@redheadwayfarer but how does a woman cope with all the 'I-want-to-kill-you-stares' a girl gets from all the aunties and 'What-a-slut' stares from all the other people when she goes out in a transparent top (her bra is visible) or in a dress that shows the straps of her bra! I am tired of all the people, educated ones, judging all the girl for every single thing we do or for every cloth we wear! It is like we were born to be judged by the society! And trust me, it is especially not easy for a girl to walk around in such dresses if she doesn't own a car or doesn't have someone to protect her against all such people! But that's just my personal experience! What's your say? How do we deal with it?", "viraaj___mishra": "I support u", "masterxom": "It took an evolution for humans to understand what is shame and what to hide and what to show developed clothes and became civilized. But there are few XX chromosomes whose brain development didn't happen. They still in the uncivilized caveman era.", "sagariikasuresh": "@triumphal_cliff", "khaleelkhan": "Really", "truetalelive": "Question objectification by posting sensual pics.Just to gain followers.I hope all young guys understand that India is not USA. We have had Many women leaders,thinkers,rishis,teachers.If only you guys put your head together and work for it.Respect and success is earned. Further more: men are visual biologically so yes bra strip will excite them.This is not justification for any harassment,which is crime in my view.India is pretty much free.Move to a different city if your family is not supporting you.Go fight for what you want girls,no one will give you anything.Just by complaining with western agenda that do not match our society is fruitless.We do not praise rapists ,we punish them.Things will be better only if we work towards it.Or just feel victim and do nothing.", "sparsh__tyagi": "I m masturbating ryt now on bed @redheadwayfarer", "fulsmita.bhattacharjee": "Appreciate those lines. !", "natureloverboy1": "Nudity is just state of mind.. Cheap people r there we just need to ignore them.. I m proud of u and trust me would beecech u infact implore u to sign an autograph for me. U r face of the world not only India...", "avani_taylor": "@pinoforlyf_0503 @anushka695 @jill_padsala1405 @dhanu_desai", "sarjeetsharma": "i just love this girl thoughts... what do u say @sonishjmd", "_ayka81": "Supersin ya", "ruchi.rupramka": "@athilium @shilkaabraham @bhumikapunj @riturupramka @sohini2017 @beingvini @pearl.dhingra @pallavi.paranjape88 @jaiswar_neha @makeupbyaprajita", "chaibiskit": "@piyaeyer this is why I love this woman", "bhagyeshmehta": "@chauhan.hiraniya", "straight_through_my_heart": "@stuti_vaidya16", "blenderbump": "They should see Africa. They are open minded", "sardaresham": "R lagbo", "macrisissbich": "Well wearing a green/blue bra underneath white shirt which ofcourse is see through, & women pointing it out is not bad mentality its bad sense of dressing up! Lol #nooffense @spliffin_", "swornima_goldisntfoundeasily": "@kavitakurunju", "shantanuspeak": "Totally agree", "bhavanimenariagmail.1373": "Aoooo", "uuuuuugghhhhhh": "@piyush.gokhale :)", "main1292018": "@redheadwayfarer to chalo phir kare sex😜", "shwetasingh1130": "Totally agree @syed_amaan_akhtar 👏👏👏👏", "gautam.shukla.92": "Jst u want to spoil indian cultures", "saumyashukla__": "@shloka96", "vrinda_rishii": "@redheadwayfarer thanku foe makin a difference.. 👍👍 you're soo real..", "theinbetweenchapter": "Wow! So well said!", "_saaksshhii_": "❤", "dr.tony.tony.chopper": "That glitter💯 @redheadwayfarer you look alien🔝", "bimstagram__": "@yogeshsingh69 I'm sorry you had to read this all cancer 😔", "the1800guy": "Whoa this is well written.", "rohiit13": "Cool", "shreyolo_": "@sachee1710 caption 💯", "missnisharawal\nVerified": "Verified", "11khalisa13": "Ягьарин это чеее", "aldrinthearmadillo": "Addressing the most important issues we face. More power to you girl! #GRLPWR #FreeTheNipple #OhTheEmpowerment #NippleAwareness", "srishti_roy_": "Omg some ppl. This is her picture and her page and guess what ? Her body too. If you are so offended just don't look at it. all this shit about how feminists should talk about education and sanitation, feminists can talk about any damn thing they want that's the point.", "patidar2195": "@redheadwayfarer you are bra lover", "dishwasher17": "Oh wow. You read my soul. And i guess its completely right abut what you stated and also i guess people shouldn't have a problem with bras or anything related to that because it wouldn't change the amount of food they might have tonight or in future. Our bra isn't gonna change your destiny.", "yagya.jasuja": "Every word on point but those last few words. Its like millions of girls screamed together💪💪💪💕", "rahul_gurav143": "😂", "honeyipsudas": "@redheadwayfarer You spoke my heart out !😊😊😊😘😘😘", "aarav_dass_": "Nothing @_cutest_fille_", "saanjh_gidwani": "@zaidkhan4717 #mtvindia #mtvtrollpolice", "kinjaladodra": "@vidhimadia @shailymadhani @ankitadoshii", "pratikgawade346": "So cute of yours", "shardulborhade": "@owenwilson_official", "zenith_lead_": "Bhye itna hi shok h kapde utarne ka then you should upload a naked pic too my dear😂😂such an asshole you are", "marlborohan1": "@mehul_solankii_ the caption surely will. Only if you could stop staring at the bra. Lol *Ab taali bajate rehna bas bc*", "_.mmalikk": "You look like Nargirs Fakhri!", "pallo152": "Girl you are amazing", "miss_bidisha": "bravo girl m with u👍👍👍u r absolutely right", "tomskaslaifu": "@tgarima23 a person can speak about more than one cause at a time. No cause is exclusive.", "analytixmachine": "Nicely said", "tgarima23": "Who started this movement #freethenipple? For me it's a fad! We have thousands of other problems in our society and country. Poverty, illiteracy, population, pollution, corruption so on and so forth. Freeing the nipple or showcasing your lingerie is not going to empower women. Choose your movements wisely✌", "raghav_dhanvinder": "Yeah absolutely right said dear 😊appreciate u n ur words", "tittt_s": "True 👍", "anupama_katre": "You fucking rock.", "mehul_solankii_": "What now showing bra makes u and other downtrodden women feel powerful ....it is also a hypocrisy of yours.", "i_am_sanketdesai01": "My fvrt girl saloni my love cho cute", "bruh.ngl0": "Free the nipple ❤", "anjali8538": "It's easy to post a picture wid some great captions but in actual nobody can dare to do dz in our country dea ....sad but true", "kulshresthasanskriti": "Get*", "sonnaayyy": "@sheff_u @theprachigoel read this ,that's why I say there should be no problem with some posts we talk about", "livelifestylelife": "You're amazingly inspiring @redheadwayfarer", "immsalimm": "We have came so long that these things should be looked just as ordinarily than anyother things and for that we need to be calm and patient about bcz we cant go wild on seeing a girl or her boobs and tits bcz it is known that all of us that she has a vagina n we have a penis then i dont find anything strange in it we just need to have that mutual understanding to go intimate", "jamkhandipriya": "👍👌👌👌", "khandelwaldisha": "💯", "pritam_you": "#redheadwayfarer😜☺❤ so big", "deepa8529": "@tgarima23 absolutely right", "medhamehta": "This is so gorgeous and inspiring. Our narrow midsets need to change and only then will we be able to change the world and make it a better place to live in.❤", "npreoty": "What’s wrong with her . Stupid", "kishore_jaisinghani": "Keep it up... A big 👍 @redheadwayfarer Our society needs stubborn personalities like you. 🤗", "mebhattarai": "awesme ma", "larissmo_fit": "Sau 😜❤️", "my_ashiyana5678": "Amazing u are😍", "shrutimangla": "You go girl😊👍👌", "ecrivainnnnn": "Woah uh made those assholes shut 😂😂😂✨♥♥", "archakrabarty_200": "actually i also want girls to free their nipples!!", "pihu_diva": "U r so inspiring....", "stars_vhf": "😍😍😍", "satyavirsinghbutola": "What is dis ...", "the.alluring.thing": "Commendable 🙇👏👏@redheadwayfarer", "_muskan_b27": "I respect you ,It’s pure bliss to have people like you in our society ❤️", "kavi_s27": "Your posts are amazing❤", "billion_dollarproject": "Lovely", "dhrutiful": "ah...those words..❤💫 beautiful...", "tchoujar": "Well said 👌🏻👌🏻👍🏻", "k_a_j_a_l008": "Read caption @_khushi_panchal_ @swaliya_shaikh @queen__but__not__urs @mingar_07 @rawalnikita65", "im_apoorvsharma": "I guess this girl has gone mad.. feminism k nam pr kuch b post krna h ise..", "iammissoleo": "Well said deA", "f.i.d.a.t.o_": "😍❤", "itspavan_here": "The caption on this pic is d most amazing thing i have read today....cheers to ur thoughts....ur practicality is on point and totally subtle.....and its so true....i dont know about those type of who dont want to change their mindset but i know some who want to change their perspective and trust me u would have definitely given them a different perspective....pls keep up the gud work and keep inspiring ppl....the world especially India needs a lot of these words🙂", "iamusername_1": "you are lkng vry sweet", "sayan_tanny": "But they say, Shyness is the resource of every woman. How can one show off the body is society speaks of shyness that's only meant when we go covered. What's your take on this @redheadwayfarer ma'am", "the_maharaja_2299": "@redheadwayfarer rightly said.... We must brng a change about this and you are being a motive a lot of people..", "drjenheerdt": "I always love your posts 💗", "vatsalaasharmaa": "@coffeekitty123 this is mindset. First change that. See the world as what it could be not as what it is. Respecting an union and supporting it are two totally different things.", "95_bhaskar": "You are right. But you can't change the public mind in few seconds by showing just bras traps.. girls feel ashamed just because the public isn't open minded like them and they judge them. And when you are living in society like this you need to understand about common sense. Those narrow minded people would have no problem if their girl showing straps on streets of United States but at the same time you do this same on Indian streets then yes that narrow minded guy would like to defend their Girl from society narrow minded judgement. Simple as that.", "rituajwani": "This is so true.. people always say that you should wear full clothes when you are going outside.. why? If we wear shorts they say she is Awaara.. why? We can't wear shorts, skirts or else.. we love to wear them and we will wear them.. we don't have any problem.. And even it's none of the people bussiness.. but they can't live without pointing fingers on the girls.. I just want to say you.. You rock🌟 More power to you love❤", "jaiveersinghbajwa": "Sira gal......!", "ramandeepkaur15": "God damn .. sira girl! More power to you and atleast maybe on after reading your thoughts some of us will start accepting the fact that Yes, we wear a BRA and the strap showing on our shoulder is not a thing to be ashamed of!", "saavygupta": "@manvi.j read.", "nikitha_g_o_w_d_a": "👌👌", "hishubaladia": "Itna bada lecture.", "kritisundardeb": "Righteous and effective", "__a.nshika__": "Awesome writing. Awesome you. One of my fvrt girl. Seriously you are going places. Salute to the thought.👌", "divyvarshneyy": "Yuss gurl❤️", "khamosh_kolaahal": "@_arka._.ghosh_ yasss, tu isliye jaaneman h mera😘😁", "the_make_over_salon_": "So true and touchy thought u shared we couldn't do anything until the old woman's will change there rituals about new generation gals coz not by mans it's happened by the woman's more", "kbkhaderbasha": "Lovely looking so sexy", "theladki_nextdoor": "Bras are cute and all. Not shameful smh but honestly, I think feminism is a bigger word. There is more to it than visible bra straps or sex. Idk", "charu_singh99": "so true u inspire me @redheadwayfarer", "dimpllii_agarwal": "But is it good to wear a top which is showing your bra colour in office or corporate places? Is it? I am not denying your thoughts but some places do have some dignity, if it the bra strap come out by chance then it's ok but showing it by intention at holy places or some quite decent places is it good? @redheadwayfarer", "abhijeet_mahat0": "Thank you so much for existing ... Otherwise whenever we talk about these things openly, we are stared like we have committed a crime or something ... And not just in one place, everywhere it's the same case ... But because of you, finally we are able to come out of the shadows and people are also changing theirs mindsets ... Thanks a lot ! Di ... #supergirl #freethenipple #loveyouloads❤️ 😅😍😘😘 @redheadwayfarer", "prernaakashyapkhatri": "It feels worse when girls tell you to cover up the strap!", "mayankkothari12": "🙏respect @redheadwayfarer", "rawalrohit2007": "Take it off", "zankhanadalal": "Concur with u girl. I have seen people telling to hide bra straps mostly by women n that's actually funny coz I never understood how it can arouse someone", "neha.deshwal.10": "Bang on!!!", "m.k._anjum": "Who told you don’t do just do it if you want", "sharonahluderitzjewelry": "Oh this explains a lot, I didn't know. I love showing my bra as a layer, and now that I know I will do so even more 👊👊👊", "trilokipriyanka": "Hatts off to uh😘", "r.k083": "Nice and sexy", "deepthichandrappa": "Awsme", "vipu.la": "Oh love the pink one. And I would seriously love to live without bra in the first place as pregnancy only makes your boobs hurt every minute.", "sasha.desouza": "I need fancier bras SMH. #flauntit", "coffeekitty123": "Feminism is much more than showing your bra and nipples. Get that inside your head first. There are loads of women in our country who are deprived from simple women rights. Why don't we fight for those deprived soul and uphold our country's status and dignity first then talk about these shitty forms of ur so called pseudo feminist stuffs?", "subasri_srikanth": "@a.mess.__ da da damn", "snook.san": "1000 likes.. Fuckin sure.. Yeah it is.. The fuckin disease.", "akankshashettyy": "First of all Thankyou so much for your incredible words, and this post made my day @redheadwayfarer 💕 honestly you have huge amount of guts and courage to encourage the youth to be themselves and breakfree themselves through all the nasty things told by a mentally sick thinking person. Yes we go through alot of it! Honestly me too I wore a fancy top where in my bra was seen underneath, my parents don't have any problem with it because they are looking at the strongest women of the future and they do also trust me that I can handle myself. The comment passed by an assh∅le \"dekh bhai sab dikarahi hay\" agar underwear ka strap dikake marandgi dikha sakte hay? why not with a bra man? Fancy hay accha hay so let it be :) That's what got into my head and slayyinnng all day everyday not taking in any negativity from anyone. You're truly a motivation to the nation thankyou so much again saloni lots of love from Bangalore ❤😘 we love you #salonichopra #nationsfavourite", "nochill_nidhi": "I'm glad that there are people like you in this world @redheadwayfarer ..... No matter how much we talk about it , these people have the same mind set and they fearlessly carry that around, one of my friend who always try to speak out for girls was ashamed to go through a lingerie store and buy herself a set !! She asked me so that I could just ask the shop keeper ( who was a middle aged man ) and she was so scared just to ask for a bra .....I mean I was all like why do you flaunt Everytime you say something which is in support of women .....you can not support other women when you can't stand for yourself !! It's just a damn bra , it's just like other wearing clothes why do every other person have to make it a big deal out of it .....and the other day I was talking to this lady she suddenly put one of her hand on my shoulder saying \"beta strip dikh rahi hai \" you know I felt embarrassed that day but then I realized there's nothing to be embarrassed about.....it's the lady who should get these things into her head not me . You're words seriously do have power .... I love you and I'll keep supporting a person like you ❤️", "ganeev99": "Beautifully written 😍😍😍", "playwithestilo": "😍♥👏", "_rashmishetty_": "Fab😍❤ I love u saloni ❤ @redheadwayfarer ua writings b the best....so are u❤😍 #inlovewithyourwritingandyoucompletely", "a_littlelife_": "I seriously wonder if each person in the society actually had a mindset, this bold, where would we be by now. I'm so proud of you 💛💕", "m.spiritbee": "More power to you girl @redheadwayfarer 💓😘", "dishasharma1204": "Really hats off to you..few ppl around me were awf similar mentality dt you described but now they r awf from my life.Thank God I am away from those diseased ppl", "raza6711": "Dubble bra cute pc", "basi_heartthrob_kid": "@redheadwayfarer mam, u have inspired many women n girls to be outspoken. n d society every human deserve respect irrespective of religion, caste, creed n colour. as football stands for respect n d se", "speakingtree2016": "Reason people listening to ur shit is the bra strap do be thankful to culture otherwise u bring nude in West would not have garnered attention with this old school thoughts which ever girl in town know...", "lalit_madhukar_gawad": "Very well said @redheadwayfarer", "thejain_yj": "Incredibly written. 💛", "blues_ay.dee": "@redheadwayfarer You're inspiration!", "shabbyahmad": "Kill these fuckin.....diseased people.disaster", "_tamataar_": "@pakhi.06 read the caption..!! She is aaaaaggg nd inspiration too..!!🔥", "themaahie": "The best", "soulful_womaniya": "🙋‍♀️👏👏", "hereforsocialvalidation": "@subasri_srikanth", "malvika_pattenset": "Ur words of courage make others be courageous too...", "_._jaydeep__": "True !!!!@redheadwayfarer", "vrr0624": "Is that glitter on your face?", "nehaaa16_xx": "I have been reading your posts for a while. They are lit!!! Seriously ilysm for this article. I have the same problem with my Nani. Idk what to do", "darshankanada": "This is actually cheap pose.. Content is great but...", "menickchouhan": "nic script😂😂😂😂", "heerva_damani": "It brought tears to my eyes 😩", "wanderer_sneha": "Oh fuck @tanmayee_parti you were amazing girl....The way you just scared the shit outta that guy ....I feel like applauding👏👏👏👏👏👏 this country really needs strong women like you !!!! Kudos to you 😚", "funnnani": "@sshifa_sagheer your mom needs to read this 😏 and mine too 😄", "namratabhatt109": "@ashwaryaaparna @nishtha_bhattacharya @anjali3690", "parijakta": "Amazing .. kiddos to you . Let's meet someday .", "thisisncy": "I cannot express in mere words how much you have inspired me❤️ your posts and the thoughts through those posts have strengthened me as a woman and has made me comfortable in my own skin. Thankyou soo much❣️🌟 @redheadwayfarer", "stories_of_a_voyageur": "Do it....", "nikooberryy_04": "💯💯💯💯💯💯💯💯💯👍👍👍👍👍👍😘😘😘😘😘😘😘", "nalawadeaniket": "Wow it just made my day", "shivanijha.932": "Waiting for ur next meaningfull uploads @redheadwayfarer", "rheasinghparihar": "I love you Saloni🌸🌸🌸🌸🌸", "ayushi.natani": "@rahulsharma8078", "sampathcricketer": "You are absolutely right mam", "sudhanshu_singh_0013": "😞😞😞😞😞😞", "adarshchatur18": "इससे अच्छा तो porn industry join कर लो", "sejalsinhahaha": "Just go n Kam see kam rakho.....AGR koi achi chiz support no KR skte toh roko toh mat🙏", "202.nihar_zirvi": "ur words r so liberating...👏👏", "srishti_infinity": "❤", "nishant_sharma8583": "Well said👍", "the_colossal_vibe": "You write beautifully. ❤️", "habibii.i": "You inspire young girls like me to be feminists ♥ I love you", "tanmayee_parti": "@vroon_m and ya... Thanks! Coz atleast you understood the point *nicely* unlike few other people..", "akankshakumar11": "@geetanjalidembla", "charmingly10": "And finally there was someone who put to words all those misogynist can finally shove it", "verma_aditya": "Very well said mam", "the_liberal_flawesomist": "I am thankful to my parents for being more open minded especially my dad. Honestly i am not bragging at times when i run out of pads or i have buy bra my dad is very okay to go and pick them up for me from the shop and yes i believe he belongs to this society and he is one of those men (i would rather say real men). And when i wash my bra and let dry inside my room my mom goes how will it dry just go hang it outside. I am proud of them for this. Sometimes i think it's me who holds myself back.", "eshu1107": "True..Vry Well Said..👍❤", "quixoticquagmires": "Agreed completely. In that sense visible thongs were quite progressive, wonder why they have disappeared", "alishapagare": "❤️😍😍😍😍😍🔥", "sneha.koney.gxh_": "@dakii.shr @stutiii.m @kripsss_ @christinalimbu", "sheikh_mehak22": "Mam u r dam inspiring.......well there z an another option fr that kind of ppl they should go n die somewhere.........", "aashish_rathod": "@my_world_unseen", "eggplantsanyasi": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "bhoomika_94": "Well said appreciate 👍🏻", "vishal16950": "So true👍", "vinodreddy_7787": "Breast is one of your body part...ok I agree for that...can you Show them to all your body part without bra ...tell me", "girl_with_glitter_": "@pari0108", "ramyasri.m": "Brave one @redheadwayfarer ❤️", "shantanug28": "#freethenipple", "aslam3455": "Ohhhhh my god 😲😲😲😲😲😲😲", "niittiikaa": "More power to you young lady ♥", "shrishhtirawat": "I love your words, I love the person in you, but sadly people who are having this mentality for whom you write cannot hear your bold voice. I hate when i go out and the morons watch me even when I'm not wearing any skirt, any short dress. Stilllll i ignore. But what to do when the one who saw you and follows you all the way you've been to. I hate it here. I don't like the people around me. It's not that everybody is like this but most of the men do this. When can we see change. When? Recently i got a message on instagram from one of the guy in my school. it's been 3 years and after school we all know how badly we change. He said Itni badi hogai h ki mjhe unfollow kardia, kahi ki victoria h kya tu? or jaha jati h na sab pata h mjhe, tere pictures bhi liye h maene. And i was like whatt firstly who the fuck is this guy. Then i got to realize ohh that one who never got any attention from any one. He called me, he abused me idk what the fuck is people's problem they just know how to move their penis around. Many things happen to many girls and this is nothing in front of it. But I wish there comes a time when parents get bold and let their beta's not become Chutiyaa's. I wish they control their beta's as they control their daughters life. Ps I love you saloni ✨", "kaashvigarg_kx": "Amen!!!", "troll_anthammas_official": "Good one...👍🦁", "yogita_raj": "May god bless u my child @sagarika09", "itisshubhi": "Such inspiration much wow.🙌 💞", "sherin_edison": "Well said 👏👏", "avvngrs_": "Loved ittt ❤❤❤ you go girl !! You are an inspiration to so many ladies and even men who are facing gender inequality in their day to day lives , including me . Alway look forward to ur posts. Keep up the good work 😍😘😘", "_.nobodyyy__": "💯💯🔥", "ananya_sharma67": "@hiteshi_pant Read this✔💯", "syed._.tanzil": "Yeah! It's pretty. You don't have to be ashamed just for a piece of garment. Love you @redheadwayfarer . Your work has always enlightened us💕💕", "komalpreetkhullar": "There was a reason lingerie was made to look pretty, sexy. Not for men but to make ourselves look beautiful. They r a piece of clothing.", "fakkadd": "But their still lies decorum in formal wears, so a No-No to underpants/ bras when a formal wear is attired.", "aishnand_96": "True .... Why should I be ashamed ?... Thank you .", "chetnasingh878": "Saloni Chopra! Ma'am you are love❤💜", "sahilshaikh9786": "Impressive", "manvijn99": "@redheadwayfarer it’s really a damn struggle to live with these diseased persons...firstly i too was the one who didn’t talk about my periods in front of anyone but since years ago it’s been like why the fuck i m ashamed of PERIODS? Like really!! Its a woman nature damn !!! N i have stopped being ashamed about it. And wen it comes to bra or its strap and its visible behind our tops den ppl say like “wo dikh rha hai” i be like wat “WO” damn its just a piece of cloth covering my body part🙉 rather i show it n i fucking don’t care abut those ppl around...its my life n my body i knw how to wear n wat to wear ❤️ n a big thanks to you @redheadwayfarer you are such a humble n a practical girl whom i think is wonderful❤️ love uh loads❤️", "mr_sahil_37": "@redheadwayfarer your posts are so inspiring .... Keep it up Saloni and keep inspiring others👍👍👍 #womenempowerment", "reality_bite": "👌🎂", "born.as.human": "You know what @redheadwayfarer this mindset can be changed from basic parenting & schooling in our next generation which is really powerful.current people need to wake up from their dream of living in 19th century India which has now completely extinct in real life and only exists in history. The scene is changing in my surroundings with girls becoming more educated about their rights and are aware about freedom/rights. We are working on this with our team, your posts and writeups i belive inspires atleast one girl who reads it, & its a win for us. Keep motivating but if you could write the same jn local languages/ translate it would effectively reach to few of them who doesn’t understand English well . Thanks", "raka.roy": "💪👍", "meenakshib_25": "Well... Said.. @redheadwayfarer I admire u a lot... N believe me... Ur words are so inspiring... Thnq for such posts that helps our society to change their mind set..💪💪💪", "shk_hulk": "😍😍😍", "aahna30_": "❤❤", "cranky_cake": "@redheadwayfarer rightly pin pointed. The problem is not just with the society but this is also deep rooted within the women. I agree with you every bit. In fact, I have been asking this particular question to my mom since childhood. But the answer never came out to be \"Because they are men. We have different body parts and structure to which there are certain limits which we need to follow\". Bullshit!!I could never explain her the reason for the arrival of such a question in my mind. 😶 MEN can be men in various other aspects but how does this restrict a woman?huh!!BRA, sanitary pads, breasts and nipples are not the identification of a woman. It's just natural and need not to be concealed. Moreover, i would like to add an issue of virginity too which is again a symbol of dirt on girls. Therefore, I would request you to write a few article on this. Also, I am highly inspired by ypu ma'am❤❤", "ashish_g0208": "Y do u use those glitters on ur face in all ur pics", "anvisha_raychand": "Love it..", "_menon_shraddha": "Yay! The writeup's🔥💕", "aree.zz": "❤🔥", "dreamified017": "Perfectly said ! 👍🏼", "hrprt.mkp": "Caption👌😎", "breadomelette": "❤️❤️", "amitaggarwal8": "Kya bola h 👌👌👌 I'm true fan of your 😘", "santoshkamalstudios": "One of the best posts I have read 👍👍👍 I support this", "quote_3214": "totally agreed to what u said .....bt nt every men r like that ...u can put some exceptions ..the one who do respect women nd thier respect doesn't change with thier appearance or thier clothing or boldness .......i totally agree that women should nt be ashamed ...if thier bra strap if visible or if they r wearing western cloth ....infact those men whose narrow mind make them see everything in wrong way ........they need to understand that bold cloths r nt invitation for anyone .....it is just that they r comfortable in .....nd no one has ny right to offend nyone comfort ..... ..... @redheadwayfarer saloni u r up for a right cause ... we all r always with u ....its nt on the oldies ..its on the youth to change the society to make it safe for our next generations ....#sorry_if_nyhow_offended_u_in_writing", "tapsipahwa": "❤❤", "lost_freaky_soul": "@redheadwayfarer hi..earlier I used to be cautious all time about the bra strap show.i even told my mom n friends that it's inappropriate but honestly you helped me in fact encouraged not to be bothered by it.Now I flaunt my coloured straps 😁", "_asfiah_": "Aah this is something so beautifully scripted ❤❤ n i agree with each evry word u said... Power to u @redheadwayfarer 😍", "bollyntolly": "Check out @bollyntolly for heart touching songs", "sahilyadav123123": "Nice pic", "ritesh_241": "Looking so .. Hot 💋👌", "rajendra9114": "So hot", "mr.jakke_911": "😑", "gagarin.p": "Ki", "aman2050official": "Uffff", "mr_busy_24": "Hahahaha kya baat hai", "shefu07": "Your posts are so amazing! They give me hope. Unfortunately whenever I step out reality is really harsh. The people who actually need this majority of them don't use internet. However I hope these posts pour some sense to those who are on internet or at least get them thinking!", "fernweh_akira": "Let's free the mind and the body...👌", "ojaswijoshii": "@jharanaluitel 👌👌", "sonali_chugh": "I am not sure if that's going to help men succumb and let women resist. More power to your words and more wisdom to your dictionary but not too much for the society. I really like you but that's beyond Instagram of course. Thanks. @redheadwayfarer", "samritimalhotr656": "@manya16s read this!!", "akkisuitok": "❤️", "vr_influencers": "Your words are really refreshing..theres no reason dat ur post is nt gnna get loved", "riyajoshi__": "💯💯💯💯", "mandal7008": "Awesome gorgeous one", "imran.bashir.8299": "😂😂😂👍", "sarah.fit.24": "Absolutely ♥♥♥♥♥", "i_am_aaryan_mishra": "Always its not about narrow thinking sometimes it is because it wont look good", "jharanaluitel": "@ojaswijoshii", "teatwentytwo": "More power to you and your thoughts 🙋💯", "stutijain__": "Its so trueee u are my biggest inspiration to speak up to stand up for other girls please write these inspirational messages often because i love what you write and it inspires not me but everybody and this was as usual inspiring we support #freethenipple #equality #women", "_paromitasarkar_": "And like every time, you enlightened me again. People need to first realise what #freethenipple means and what your thoughts actually convey and not interpret things in a way their mind works. It's been generations of this mindset. Agreed! But if we don't start with little changes in our mindsets, nothing will ever change for generations. People point me out saying, my bra strap's visible every time and Oh! They won't say it loud, they'll show god knows what signs and looks or whisper, as if I am supposed to be very embarrassed and that it's a sin showing your basic piece of clothing. People it's cloth, meant to be a basic necessity, it's not quantum mechanics that you stare at trying to figure out god knows what. Kudos to you @redheadwayfarer ! Your thoughts make me feel better and not alone every time. 🌟💯", "_pretty_madcap": "That was one of the most beautiful things ever written FOR women, BY a woman! ❤️", "raj_kamal_bagri": "😂", "jaan1624": "Ummmmmmm", "aryaavinash94": "Salute you 👏", "ahahahnand": "@sufuzahid123 bhai sadak par mut te samay jism ki numayish yaad rakhte to swatchta abhayan ka bhi bhala hota .", "manisha_mehra_": "The caption was awesome ❤", "_m_u_s_s_u": "What words. Amazingly amazing! Very well said❤", "n_i_s_h_i_k_a_n_t": "Not a single roam outside bare except salman", "shrutipriya_kumar": "I just love your posts! Your thoughts..your beliefs..your genuineness. You inspire! You motivate!❤️", "cyanide.poisoning": "@akshcupid", "sumitrobandyopadhyay": "To all those having an issue with the post or its contents I say with a particular satisfaction: CHOOSE OPTION 'B' you all \"samaj and humanity k keede\".", "pardeshitaniya": "Yes 🖤", "cool9rock": "👍👍", "simi_mathew28": "great thoughts...you are such a inspiration for girls👌👌", "jung_n_complex_shachi": "Please don't send these diseased ppl to the doctors.We don't want to deal with them either.😒🤐", "tara.ngam": "👌👌👌👌💪🤘🤘", "racky_gill": "Dear I really praise your thoughts but than one thing always poke me that it's quiet impossible to change our belief in indian culture....our up bringing is such that it runs in our blood whether girl or boy ...limitations will remain same ...it's like day dreaming...but yes if this will be in context of some western place than it will be possible but not in our culture....best of luck 👍👍and keep on sharing your thoughts 💭", "nancyjain03": "I really appreciate the way you put forward these hollow minded thoughts. These disease people really need a treatment like this. I am really proud to be a woman and I don’t feel uncomfortable in showing my strap :)", "kajal29_sankhla": "Great.. 😍well said", "sanjana1990": "@rashmos", "aayushi_syahi": "Wear one and it's visibility invites issues.. don't wear and see how it invites bigger issues! Matlab society has made sure that ladki ki life isi me nikal jaye! BRA and BREASTS have been made such a hype in this world! 😵 I don't know how this situation could be avoided but it is definitely not a topic any girl should ever feel burdened with! 😤", "tamanna.tahsin": "Agree with every single word. Exact thoughts of my mind though sadly I'm surrounded by those people everywhere 😠😠", "anaarisistaanem": "@imadhaaan", "sourav_rajput2611": "Main 5th fail hun wo bhe krpiya jo bhe kaha hai use hindi main bole", "the_soul_healer_2019": "Wtf", "__mxxnnsiii__": "❤️❤️❤️❤️❤️", "evalalwani": "Proud of being a woman @redheadwayfarer and you make it even better❤️ #equality #freethenipple #women", "sanfiya_writes": "@redheadwayfarer don't you think women themselves accept the societal norms and fears uttering a word against such stupid norms? Recently when a controversy happened between the mega star mammootty of mollywood and the qarib qarib single actress parvathy, people including women didn't support parvathy who said misogynistic and derogatory terms in movie dialogues shouldn't be glorified.... People went against her and said things like she doesn't deserve to have a voice because she enacted a lip lock scene and smoked in a movie. I couldn't believe when I heard girls are girls biggest enemies.. But now I do", "syncslip": "@redheadwayfarer what dimension is your consciousness in?", "srushti.tambe": "@_dia__ameen___ @sampadalokhande @nehabt", "_pr3ttypriceless_": "So true! It's so irritating to have to look over my shoulder (literally) because my bra strap might be showing or have random aunties on train doing weird secretive gestures to let me know they can see \"it\". Seriously what is the big deal? Haven't these people seen it on their clothesline or when they wear it themselves? What's so shameful about putting a bra to use? 🙄🙄🙄", "_aishbafna_": "@redheadwayfarer People will never get rid of the shit which is completely surrounded around them and for some it's for lifetime disease. You are absolutely right that why the fuck women should be ashamed of it man. Basically, some few days back my relative was travelling with me and the she saw a girl on roadside with shots and a offshoulder top...i was amazed after hearing her out..she said that this are the people who is spoiling our country. Damn what's wrong with people..i spoke to her about it and then she claimed that i don't have any sense. It is really upsets me, a women is not allowed to do what she wants .. the way she dresses..she talks...she lives in the society.. every damn thing is being judged basically by the people who are well educated still illiterates talking about it. But what makes me more happy is that @bindiia supports you so much. I wish even my mother would have understood me the way it should be. I am not allowed to wear dresses of my choice..always being judged in the family for being the way i am. Sometimes my mom literally tells me that be nude or go nude if you wanna wear a sleeveless top which she finds is exposing body parts. It fucking kills you everyday to deal with it. Your post are really a big inspiration and motivates every girl out there to be the way she is and wishes to be in her life. Respect 😇", "payalvedant": "I dont understand how some people still have the balls or maybee the urge to commentotherwise. Yes, B. GO FUCK YOURSELF. I LOVE YOU @redheadwayfarer you go girlll.", "adityagurjar9": "Long caption", "shreyadas01": "Society at its large have been attacking us with their Baba adam zamana pistols loaded with looks, talks, and their kind recommendations. Thank you for this post @redheadwayfarer. Its a slap to all those stereotypical humans coming up with their new ideologies.", "shobhitjain_": "@redheadwayfarer 🙌", "missniazoher": "Whoa some impactful set of words... Love it... It's like reading my own mind", "_divya47": "@redheadwayfarer mam 🙌🙌🙌", "ravmalhotra": "Absolutely love the caption and that's my birthdate haha!😂💘", "globetrotter_1108": "Well said👏🏻👏🏻👏🏻👏🏻", "_nital_": "Wow amazing❤️❤️❤️❤️❤️❤️❤️", "akanksha_611": "I think option B is instantly effective. I, as a doctor, can tell u with enough medical knowledge and extensive research that this disease isn't curable with medication. And it runs in families too. So be sure to parent ur kids properly and help em grow into healthy and sane adults who don't feel ashamed of such choices.", "arshi_safdar_": "@tuba_tahseen", "anmoldeshmukh95": "@van_i_ta ❤", "sameera_khosla": "Why why", "saket_juneja": "Thought changing post👍🏼", "ritik.jolly": "#Awesome...🔥", "sauban_israili": "sooo sexy", "gayathhriii": "Preach as fuck,💯🌻", "ameek_mahal": "Need more people like you in our society💯 More power to you gurl🏋️", "officialz_imran": "Clap for you 👏", "tanveerhala": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "docgauty": "Totally agreed @redheadwayfarer", "sass__wati": "Admire you. ❤️", "anima__mishra": "More power to you 💜", "itsmbitxch": "If someone tells you to stop being inappropriate and cover your bra strap, strangle them with it.", "deeptisingh1990": "Bra straps should not be an issue, nor does a lingerie should be.. However, i still believe that you cannot just roam around braless around.. Nipples peeping out of a t shirt or anything would attract attention.. Not that the other person wants to rape, but you would still get a strange stare.. Not just from the men, but other women as well.. Also, boobs are not just a part of a woman's body.. They are sexual.. Men are attracted to them. Also women get aroused or get uncomfortable when boobs are touched. My friends and family cannot just come and touch my boobs or hold them, because they are just a part of my body, like they can do it with my waist, legs, arms etc. Boobs are sexual and that cannot be denied. But yes, again, no one has the right to judge anyone based on their preferences of the clothes.", "manishhmittal": "I have huge respect for you saloni <3", "surbhi_sagar": "i jst love uh ma'am... i mean there is a less people who understand this thing... respect for uh 😍😍 nd ya i agree with uh my dear @pizaaa_01 #girlpower", "meghasingh.x": "More power to you sal💟", "happymanish84": "Just wow", "rishav_kesar": "Why are you so obsessed about these things, if you really dont care ,then it really doesn't matters,...?? World cant be full of good ppls, as u expect.nd this expectations is as like expecting a dog not to eat you just because you don't eat him...", "rudrh_nigam": "Aaj ki naari.... sab par bhaari 💪", "khushoe_": "This was actually, very motivating but some people won't trade their orthodox minds for a brain. Also, thanks for putting every girl's words and desires into this one post. I respect you for everything you do. @redheadwayfarer", "veebzbhargava": "OMG PREACH!!! 🙌 I love that people are slowly starting to embrace their sexuality not just in the West but also in \"conservative\" societies like India! Let the movement spread!!", "snehaqu12": "exactly ....how a part of clothe arouse anyone😑😑😠 or men are tooo desperate or pervert or psychopath or may be mentally sick", "shamli__": "@redheadwayfarer this was needed. Thank you👏👏", "famiakhann": "Well said!", "_miss._.bagmita_": "Didi, I wanna know what is respect n dignity?", "apooorvvaa": "Preach!🙌", "pink_sagittarius": "@mag_kri", "harshitathakur001": "I respect all your thoughts ma'am , i really feel proud when i read your views", "_thatbungirl": "@redheadwayfarer I remember I started admiring you after reading this post back then when I had just learnt what feminism was all about. I would like to give you the credit for the kind of person I'm today, who stands for feminism and voices her opinion when needed and who also fights against sexism and inequality. Keep up the good work, you've no idea you're touching lives of many people like me. Lots of love to you Saloni 💙💙", "dipal.patel.56863": "You are doing very good job to do such seriously and reality of the women that freedom and it shows the personality to the world Or society. And I am big fan of you best of luck 😘", "vijayshree_parihar": "Woaaahhhh😍😍😍amazing....❤❤❤", "shiku_5169": "Your words are always so inspiring ❤", "dibyendu.sarkar78": "Dear you are hot", "iamrisharajput_": "True 😍👌👌👌", "manishibist": "💯💯💯💯💯💯💜💜💜", "__escapewithmee.__": "✌✌✌😎😎💝💝 here you go girl after so many times you writed on such topic", "__.v.r.___": "More Respect for u 🤗", "mustyouknowmyname": "I love the posts but I love fighting with the haters in the comments more", "sumitiiiii_": "Nice one and truth one.....", "_nxndini_": "Damn! More power to you girl!", "_muskan8299": "Uh nailed it girl❤❤", "saymak_": "wowwww.. ur posts are so worth reading 😍", "sayantani__paul": "Salute to u!!RESPECT!!🤗🤗😘😘😘😘😘😘😘😘😘😘😘😘", "pizaaa_01": "Amazingly written @redheadwayfarer proud to be your follower💙😘💪", "niteshmuhla": "Way to go! 👌👍", "reetisharmaa": "OH MY GOD!!! The caption was so beautifully written!! So true!! Every person this goddamnnnn world need to read this!!! All love to you saloni!!!,💞💞💞", "cornerpen": "❤", "bafila92": "Shuru ho gaya iska fir se😏", "ashwinanand.17": "🙌", "rushalidey111": "❤❤", "vikrammehta934": "Good", "designer_payel_samajdar": "Perfect❤❤❤❤", "pank_0230": "You add beauty to the words, reading ur words gives a grt power, uhe have the spark!!! I dun have words how amazing it is but yes, definitely i would say uhe give q grt motivation!!! 😘 #youarethebest ❤️", "rahul_mecwan_143": "Hats Off Caption👌👌 @redheadwayfarer", "tanishakirashakira": "Free the god damn mind, indeed!!", "fairyygoblin": "❤️❤️❤️❤️❤️", "ipsitatata": "damn!😍", "sumbul_farooqui": "In love with you and your words 💞 You're an inspiration to many girls out here. #Yo_Go_Girl ✌", "monish_walkar": "Yeh chutiyapa hai...aur kuch nahi....", "vaibhav__eu_vrey_fofo": "Hot", "hansoloandsoami": "Youre flawless ❤️", "rajmalhotra2": "Face p kya hua", "gigi.ajith": "What's on ur face though??", "_.anushka_agarwal._": "❤", "thatgirlinvogue.n": "❤❤", "aarbtee": "True✋", "pooja_bhavana": "❤❤"}