{"aashi__a_k": "😂", "arti___singh": "Ohhhh stupid boy !!!!!!!!", "amar__joshi": "He is absolutely Wright....no doubt", "aaryanmenen": "Pervs like these are the reason for hashtags these days #justiceforabillionwomen ! So called mother India 😫", "human_noreligion": "Oh man....\"still\".. He said india STILL NEEDS rape. What does this even mean??? Is Rape solution to something?? Or cure for anything??? What upbringing he have been bought up to ??????? #feeldisgusted #shame #tobepartof #thissociety", "sumanthjshetty": "#fight back cool.!i mtv troll police s good show for such things", "tanmay_lahiri_7": "this man is shit who told this...", "_._vinita_._": "That guy is such a fucktard and his mentality is shit on another level", "asliayush": "nice comment", "shrastagram": "They just cant see women achieving their goals and being carefree and independent. Becos \"hey we live in a patriarchial society u cant do that\" seriously he needs medical attention.", "bilal_multani87": "@shrastagram in society a woman have much higher status than man ....coz she is the goddess.....just you think ....if a girl is showing or revealing her nipple publicly .....is it ok ....and if u think it is ok coz a man can do the same as well....then I real feel sorry for u ......a good women is one who take care of her chasity ......and u tell me what she is getting ....in posting her nude pic .....I guess nothing.....don't mind it please .....just imagine a girl is posting her nude or half naked pic on social media ...and her parents see that ....then u tell what they will feel......", "__raj30": "Ur the slut ,right?", "i_anejahoney": "I hope he does not breed. We need to get rid of these kind of special morons ASAP", "bjtrng": "this Jay person is just so out of his mind I believe \"That's why There should be Capital Punishment for these type of guys\" #sicko", "sketchesby_archit": "@maey.dha nailed it💪🤙", "purvawarang": "@clarri.sa @_karnika", "clarri.sa": "@thesiddharthrathi", "malika_e_sarcasm": "No, men like him show why India has such high figures of rape. And @redheadwayfarer you should not even give him a minute of silence because he might even consider your silence as your consent that you didn't give and also he is worthless seriously for a minute also!", "deergha_02": "Needs ? Wow 🙏🙏", "parvarora7": "Some people have just lost their minds", "tannnishka": "🌸❤❤ you be the bestt @redheadwayfarer ❤❤❤", "jhanvigoyal24": "@harshi_tha_fan you are so sick...you need treatment.", "_surbhiii": "Help this poor man 😓 and please ask him does he need anything like rape for himself too?", "mannan_parmar": "Such sick mentality till exist 😳 no doubt now why rapes occurs ~_~✌️", "girl_inwanderland": "India NEEDS it.....Wtf who needs this thing to happen... Awful 😖😖😖", "chilihotfrenchfries": "Oh God!! What is happening😖 Such disgusting mentality!", "_princegupta_": "If someone know him kill him", "prasadnair22": "That dude whom commented such is a retard...", "iamnajmussaqib": "#biggestilliteracy would be a great definition", "shalini_chin_up_princess": "Am really ashamed of reading such deplorable comment here... @redheadwayfarer i knw its very difficult to read such comments and hatred from those morbids... These are the creatures born without flesh and blood... They have nothing to lose or gain in their life.... They r useless piece of shit.... But they are the reason why world is changing day by day from bad to good... Yeah, but u saloni u r damn good and brave girl i must say.... We all love you and just be the way you are... If 10 people hates u there are hundred people loves you.... You are sweet and clever girl, this kind of comments should not bother u at all..... U r a strong woman.... Anyways be happy and stay Blessed.. 💜💜💜💜💜 #LOVE FROM KOLKATA 💕💕💕💕", "manojextreme": "Sick, inhuman, these type of man don't deserve in our society, pathetic mentality. You don't worry girl. You go on.. Tc", "lakshitasivakoumar": "Men with such a pathethic mentality are the biggest reason for it @redheadwayfarer .", "_nainaa_._": "India has got men who are grown with shit in their heads. And trust me they dont get along too far. One of the best posts i read. M blessed to have women like you who want to chnge the sick mentality of indian men !!", "pranshiwho": "@akash_dadwani either u didn't get the point or u just don't want to. The video is just about how guys starting judging girls for having one night stands (\"waisi type ki ladki\"). The video's about how girls are judged for getting attached on the first date itself. But that doesn't happen most of the time. How we having definitions about \"ideal\" girls, from the way they \"should\" dress to the way they \"should\" behave. She's portraying a character called Maggie. It's a satire on our \"sanskari\" society. Also, IT'S A FUCKING VIDEO.", "valentine.silveira": "He seems to be an offspring of ‘sex without consent’.... In better words 🤣 jokes apart , pls someone contact this person and sit him down to a hypothetical story involving his mother or sister if any to being abused by strangers verbally physically or sexually and just record his reaction to it and post it. #negativity", "sristi.jain.16": "🤦🤦🤦", "elita_dsouza_": "Ily and fuck these ppl who judge .. just cause Thier life too bad they tryna make u feel low but don't worry ily and will be there for u.. @redheadwayfarer and if they don't like what their seeing tell em to effin leave", "hadi_zarik": "Incredible india😡😡", "kalyani_kofficial": "So damn true.. J for Jay go get some brains😂", "griffinpinto": "Wow...just wow...😑", "s.maaaarie_": "Bad bad bad! Such a shame to humanity. Wow!", "bhavnids": "Assholes like these show why India still need jails", "__hari_krishnan_": "Carried for 9 months by his mother, taken care for a decade by a women and he grows up to comment like that.He should be sent to the moon with one way fuel.", "salik_diwan": "@redheadwayfarer we are with u ..go ahead and do what u doing ..coz u are truely setting example of being a strong and independent woman and inspire many women who really don't have that courage to stand against these shitty people with such cruel mentality .They really need to know it coz they use the word rape in a casual manner and they don't know how much pain is it for the victim . Stay strong and blessed .", "christine_j3ya": "@irramsabah I'll slap you in the face have some respect towards other religions go to sleep kid", "samikshajoshi27": "It's just sad that people like these still exist!!! How is this person still alive...like how !?????!! 😒🤦‍♀️", "war_bhetnar": "@akash_dadwani madarchod ka bachha .....tera maa SE leke Dadi tk teri maa ka chode kela ka bhau bikti h...rape ka paidaaish madarchod ka bachha ..jaan maar dega madarchod just din dikh Gaya...Tera maa ka gand me bottle ghusa k na muu see nikalega re madarchod ......mil madarchod..band ka rakh lega zuhu gali me madarchodna...jaan maar dega madarchod", "myserieux": "We need rape like the person who commented needs venom .. These kinda people pollute the mindset of the country.", "jetha_lel": "Hey @redheadwayfarer these are some bunch of assholes who keep demoralizing you because they have never achieved anything in their whole fukin life...so just ignore the shit coming out of these assholes and keep making videos . .....btw I really liked your last video it was actually funny ....all the best keep growing 🌷", "deepak_iili": "Mc h kon h", "indian_barbie_doll1": "2 mins of silence please 😂😂", "rupantyakid": "This is such disgusting mentality.", "desi_girl_56": "Vry inspiring video..", "tanyadheer1": "Sick humans , who cannot be cured , no medicine can do them favours! Penis-es of men like these need to be chopped of .😁", "neha_shetty__": "And fuckers like these are the reason India needs Vasectomies 🙄", "kaciburns": "Yes, keep sharing things like this. This is exactly what we need to be discussing and, like you said, confronting.", "ritu2564": "Really... Kuch logo ki mentality kabhi change nai ho skti.... But hme action to Lena Chahiye I believe ki logo ko ignore nai karna chahiye.... Otherwise ek side hm kuch message de rahe n next kisi ka comment delete or ignore kare", "bhxrgavi": "@akash_dadwani ☺☺☺ that's so sweet of you to ask baby boy. Why don't we talk about the rate at your house? Dm me your address then maybe I'll decide to name my price or chop you dick and slit your throat with it. Oh wait you're worth something worse you piece of filth.", "aryatroy22": "However..... I would like to say something more...... Girls lyk saloni..... R an inspiration to girls..... To knew India..... The only thing is.... In name of feminism.... Please dont overdo it...... U people have a privilege to be a girl..... Dont waste it on some dumbass people in the comment section writing shit..... U girls are better than this..... I dont know about saloni..... But there are. Some girl... (Some i know) who overdo this.... They try to be some1 else... Nd after beinn asked... Tell them its ri8s nd ol..... Why do u girls want to change urself just fr the sake of telling some boys who u CAN be.... I just wanna say.... U girls are better than this... Much... Better.....", "himansh.deshmukh": "A slap on his face is wht he need ...😡😡", "__simmi_gupta": "A strong woman is not a slut or bitch, but I guess he never learned that in school. Actually uk what Don't mind what others think! You're who you are and you're awesome being that way! Don't let the nasty names get to you, you know you aren't those things they are saying you are. You're strong and you can overcome this! Wait hv u evr wondered Why would they be calling you nasty names? Oh, that's right, they're actively trying to drain your happiness. Ignore those fuckers ''all he need is love in his devastated life''. BEST WAY TO GET OVER-- SMILE and SMILE and with a *middle finger fuck you BRO.*", "cinecstacy": "@ravii_saini- Change begins with ourselves. In order to deal with patriarchy and its highly flawed ways, we need to start at grass root levels in our own houses. We need to start treating men and women equally.", "vicky8595": "ase Bando ki wajah se hi..all girls think that All boys are same... Stupid Troller 😒 and Sorry M'am a sab dekhne n sunne ke liye.", "sign_n_cut": "He is a sick Troller he is unnecessarily trying to get footage . Just Ignore his stupid comments.", "rhl04": "What You Mean By RiP india. Remove that Tag", "imsrk20": "Mentality of these people will never change as they don't even hv Respect for thr own Mother and Sister and see them d same way they do wid other women. They won't ever think or tk anything positive or say good things as thr mind is only stuck in Porn and nothing else. Women shuld check mentality of all men before calling them frnds or marrying them to see if they r not Stupid Assholes who culd screw anyones life n mk it hell.", "_stars_will_fall_": "People here are having problem with her \"RIP India\" tag rather than the actual purpose of this post.. so here it is #RIP_INDIA ... GO SHOVE THAT FILTHY HEAD IN UR ASS! AAs far", "silviaa.aaaa": "What a bastard", "alisaloni": "Its ur life ur choice not anyones business. .😘😘i love u 😍😍", "ravii_saini": "Why not make small team of like minded people on this issue and start to do a survey and make an effective plan of action .......anything becomes a trend so easily nowadays ....so why not make a trend which actually have a good cause :)@indra", "g_.o._k_.u._l": "@redheadwayfarer y did that asshloe commented u like that... This guy has to answer .... #mtvtrollpolice", "ravinderkumar14": "Prime example of sick mentality.. Need take strick action against these type of bastards", "blackbeauty_006": "This kind of people are may be greet their sisters with this kind of names also.And if not then who the hell are them speaking about someone else's sister like that.ess log bs apne parents ka nam khrab krte hain aur kuch nahi....", "sakshisaxena1": "What a moron 😠", "urs._.sidhu": "fuck this man .. just a shame for our society .. just ignore him", "lifeofnitin": "Idiots like him are the reason why India needs better education among men. Ignorance is not an option, action is needed. Filthy mentality due to presence of filthy people around.", "the_malini_gallery": "I am sorry saloni that u had to face this for being yourself its depressing", "samkirky_": "Majority of ur posts are quite dumb, bt this time, this person's mindset was more dumb. Not just in india, unconsented sex should be strictly dealt with evrywhere on this Earth.", "soniasherin": "Shame", "6.67x1011xcx": "Sure, India needs rapists to rape the mentality of such people.", "itsabohothing": "what an asshole!", "madeiramonfo": "Disgusting. Evil lurking on earth", "rajaspsingh": "Bloody hell.. His father should have slept that night or must have used a condom than bringing this asshole to life..", "prakhyatshetty": "😡😡🙅🏼‍♂️😡😡", "anjalidesai_27": "& he needs a psychiatrist!!!Get well soon. @imvimmy @ayushishah9 @khyati_jariwala @aashivyas_07 @_khushboo_1412 @shikha1_8gautami @_parishi_jariwala @dwija21 ...let’s pray for him🙏🏼", "_mariaalby": "I wish his mother and sister could have seen this... The fact that such Deadhead people exist , makes world a very scary place for womens to live in.", "aaryan.lokare": "Because of idiots like him India still suffers from rapes😒", "survivor_vk": "File a case against this scumbag but RIPIndia just because some idiots like him exist?", "sumitbembi": "Cheap Guyz with cheapest mentality..dont give dem a damn..YOU ROCK GIRL 👍U r awsumly stunning", "rituajwani": "Now this is disgusting😒😒 Because of these people our society is not changing their thinking..🙄 God.. He need to get education again.. These people are 😑 what a mentality 👏 #RIP", "lisa.bardhan": "What a fucking asshole", "dreamy_custard08": "Ghatia log, ghatia soch... @redheadwayfarer", "aayusshhiiii": "salute to his thinking wow", "avarmada": "Oh dear", "ahujarruchi": "What narrowminded men I swear", "g_puff_": "Wow so matured thinking...", "cookiemamalisa": "WoW 😮", "aroona_jojo": "You standing up to such comments and not being 'silent' is one of the steps towards change! Power to you girl!", "mamatha_rp": "The rage this brought up in me.. what an ass! Woah, unbelievable..", "chelsymittal07": "Can you say his id we could report him", "itsbinny": "Hey, you’re quite beautiful and bubbly! Please stay the same! Sometimes some COCKROACHES find their way into our clean lives but we smash them and move on! The irony of life is that such things can’t bite but they’re disgusting and hard to kill!", "rajirk22": "A fucking mentality where shit is filled in brains of such people.#stopbeingjudgemental#stopbodyshaming", "ayu_thakur_": "Make his name public.... bloody swine", "surbhichopra_": "I wish I could kick his ass", "krishnaasreekumar": "Shut up you sexist toad", "iam.jamdagni": "Some men make insane statements. They should be put in asylum", "its_nihaar": "India will never ever ever ever change till we have people like this in our society.............better go and live in some good country which is safe for our mom and sisters", "warrier_girl": "\"Needs\" is seems 😤 more than rapists , people with such thoughts are the ones who deserves punishment ! 😤 Asshole!", "aarzoogambhir6": "My understanding says Beti Bachao Beti Padaoo campaign is useless first beta padaoo and Beti will save automatically", "sarika0_0": "What the fuck is this ..... such a lunatic person he is ....", "vira_kshi": "These people are the Flag bearers of 'Rape Culture'.", "charmingly10": "Reasons like these are why women must learn raise up to their strengths and fight back and show these swines THAT NO ONE ANYONE \"SHOULD\" BE RAPPED. Don't they have a SOUL?", "zahirsyed": "Shameful #notallmen", "r3nu_moju": "Such a bloody d##*head.", "elf.ish_heart": "He is a chu*******", "shettykavya": "And for men like this we need women to punch his face", "kshitij_wizardiam73": "Why attention to such mental illnesses let them be six feet under😈", "demigod_s2k": "Dnt let it slip..words are as cruel as the actions ...i hope he gets punished smehow😤 i guess we can lodge a complaint maybe to cyber crime", "themaahie": "chutya jay!", "snigdha.burman": "Seriously! Troll police, kindly call him up to give him what he wants-some ATTENTION! 🙄", "la_pervah": "Lmao he needs flying chappals from his mom and dadi", "zeashanashraf": "This is our society's cancer", "ajju2": "At first i start laughing at such idiots thinking ki 'kya Chu hai', then i realise that this asshole might actually go and rape someone cause she \"needs it\" :(", "inastiyaroy": "Firstly... Our country men has no balls to follow us from there real profile... They create another profile with fake pics... N talk shit like these.... SHAME", "darryduh": "Fucking chutiya Jay may your balls be ripped and eating by wolves!", "ailurophilic_bast": "You should file a case against such assholes. We will support u in everyway possible ❤️", "navneet_tango": "Smtimes i just dnt get dem ,i mean watts ur issue can't u guyz understand dat evrythng is just a part of soul which differs men and women dats all! N if u hav dat power in ur eyes and mind den just do 1 thing dnt just look inside clothes increase ur dat potential n look inside skin ,its just bones which complete skelton same as urs! Grow up dude just grow up....", "msfantabulo": "As long as guys get can get arrange married, they won't realize how to respect women, who will like them enough to marry them. Women should stop getting married to these douches until they know how to respect women.", "mariaakirmani": "Wtfff. That lunatic shithead clearly doesn't seem educated.", "anish_kumar_h": "Hey can you remove RIPIndia word from this post ..because we are still alive including you @redheadwayfarer 😎😕", "sukulkhanna": "These people are the reason India needs gas chambers", "lil_monster_of_daddy_": "Wtf 😑 fuck this kinda mentality and I can't understand who are thy ,i mean whr thy come from !!! This is fucking disgusting!!!!", "borntoberichandfamous": "Creepy assholes. People pull them whom they think they might achieve tremendous success. @redheadwayfarer keep going didz", "iamrishov": "the person is clearly demented.... he is in a world of his own... This person should b severly punished", "mustafa_ali2101": "These fuckers deserve no attention. Ignore and move on. Cuz there are millions.", "psyche_wolf": "Bapre so pathetic mentality n choice of words of the boy😂😂😂😂😂😂 lol @ishika8609 dekh bhai ki dinkal elo", "surve.abhijit73": "BC we should kill such people", "trend_shopholic_": "Nothing will cchnge... Until we change our self...... FIRST", "chatterjee.niladri": "Morons like these are the reason India needs capital punishment for rapists.", "yakob_vijay": "I love Sluts......", "threequarterrum": "@redheadwayfarer this proves why India needs education. Quality education on priority.", "ashishuikey97": "India still needs rapes!?? Is he mad or what?He is a Certified psycho !", "nithin_91": "That's so vulgar!! :3", "sassy_soull": "He is one of those rapists who think that if a girl is cool and independent then she should get raped ,coz you know india is a country of customs ,values and woman living her life according to herself is against our so called indian culture and he is protecting our society like other morons (rapists) . I m feeling so so bad about his mother and family kese jhel rhe hnge wo ese ghatiya insaan ko 🙏😡 @karuna_rajpurohit @vodka_shottt_", "khushi_280": "This is what I like the most about you. Instead of deleting or blocking such comments you try to teach them something. And most people just don't do this.", "antumandalslg": "@redheadwayfarer that man needs public dhulai......but mam u r not dudh kA dhula hua ,,,ok....stop posting vulgar photos.....", "basilica_anthony": "It makes me feel sad 😞", "cutting_chai_bun_maska": "Can u just be stoned to death! Bcoz men like u are causing more pain and harm in society.", "paddy6.k": "They r nothing so don't be worried about it", "aradhikaaa": "Hunt him down! 😡😡", "heheheheheheheheheehhehehehe": "Twats like him are the reason why our country resembles the by-product of Donald Trump's digestive cycle", "lightthewickk": "I'm so sorry for such sickening twisted comments people can post. You are amazing. And so strong. Xoxo", "flivver25": "Here we go again!!!", "leafoholic": "Certified Cowards !!!", "susshmita_": "Peeps like these need to get raped of their mentality first. Cuz they will never know the brunt of their ill thought word. I won't even blame the parents. I will blame the mindlessness he uses to put his thoughts out.", "d_indian_stallion": "First and last thing is that india doesn't need men like you!!!!", "spandan_kumar_das": "What the fuck? \"India needs rapes \" really.are u crazy boy?", "the__iconoclast": "@shubhii_pande chk", "vishal_bharadwaj22": "@redheadwayfarer it could be a guy who would sympathize with you but in reality thinks otherwise, it could also be a girl who publicly might appreciate your work but is jealous of your progress or it could be a mentally ill person in serious need of some counselling. Social media is something you cannot trust nor can you let it affect your thought process.", "preetisandeeppatil": "#trollpolicehelpline", "lee_bflysakura": "That person just raped English. Peace be with you🙏🙏", "mohit.natesan": "Chutiye...", "myself_kkrishna": "#trollpolicehelpline please checkout this", "_benipalharman_": "Fuck this asshole🖕🏻he’s just a pity pebble on your way, kick his ass and move ahead proudly!", "avinandankundu": "I am so sorry :/", "bhartibhatt_": "I'm quite speechless after seeing this comment.. I believe this is pretty disheartening to see such people, who can think so, and can write it publicly. You know, @redheadwayfarer I'm a die hard fan of yours. I adore everything you do. I appreciate your work and i actually get happy when i see your such videos or something on YouTube. But really, when i read this comment, I'm disappointed. I'm sorry . Please don't let yourself down. You're lovely, super talented, flawless and beautiful. There are certain people who'll try to pull u down. But plzz do not. It's great that you shared this thing by this post. People who love u will keep loving you. Love you to the moon and back 💋💋🖤 but i still wonder how can someone write this. Like how!? Jesus..! Such people don't have the balls to do anything..", "_krishmaaa": "These people can only pass the judgemental comments online. They dont have the balls to say it right on the face. They dont get the content and the concept you've brought. Just because they didnt understand they think this is all wrong. I myself checked the comments on #wakingupwithmaggie and they are too bad. People don't give a shit about the efforts someone has put on to make a video like that breaking the stereotypes. They just dont get it. You in a society like this came forward to bring a change. And that's really great @redheadwayfarer love you always💕", "sarthak_rajawat": "..!. Society", "ritikamohanka": "@mrunmayeenagur what the actual fuck😳 like seriously dude😐", "nishagabrielle": "Wow this is... I’m speechless", "weird_noize": "I think these people dont get sex properly. Thats y they are so frustrated and start speaking such words...... Inki to biwiya bhi inko bhai manti hongi coz they are such pervert..... These people seriosly needs a dose of slap that too in a public place.", "rikhari_pooja": "U r my strength @redheadwayfarer Thts all i want to say nd i love uhh 😘😘", "heyanyc": "They're the most riveting element of our society bec all of 'em have double-standard which makes you so confused , sometimes they use to say that \" soceity needs to be aware , you're doing well . Go on \" and some of them wrote like this fucking sentence which roll over our mind . Hats off to them . Now , this is the time for a big challenge ! Step a forward for a spank to all of them ..", "shakesaima": "@taqdisshaikh @afczar_sayed03 what the hell", "xiamor": "Lol I hope he'll get raped 🙂", "sakshipatankar143": "What a Move @redheadwayfarer ✌ People like these are the reason behind Rapes", "sanahmed21": "@redheadwayfarer Fuck them! (Can only think of the most eloquent way to put of these prehistoric, uneducated, insecure chauvanists).", "ahana0997": "True. RIP INDIA. RIP the sick society of INDIA. People should realise that calling names isn't the solution for a grave problem like rape. It is a bloody epidemic for crying out loud. RIP HUMANITY. I bow down to you @redheadwayfarer for your bold moves. India needs to wake the fuck up, smell the coffee and", "saraazamana": "@_thechakravarty :))))))))))))))", "myslfsagnik": "People like this are the reason of rapes in india.", "princedastaan98": "Y don’t u go in MTV Troll police!? Kick their ass off!!", "irahull": "@redheadwayfarer Savage 🔥♥️♥️♥️", "mihiraurs": "Narcissistic idealists like that are the reason why the world needs serial killers #dexter", "nazzzzuk": "I wish to slap him from the bottom of my heart", "_anushka6": "Men like these are reason why the whole fucking mankind feels ashamed.", "insane_iyyat": "OH MY GOD, WHAT AN ASSHOLE.", "aarushi_p": "I hope you reported it as SPAM!!", "_supriya_bansal": "He needs to be reported to authorities, if he is saying it, he is probably doing it or is thinking about doing it. Reminds me of the guy who posted a comment on YouTube saying how he is going to be a professional school shooter and then went on to kill 17 people in the Florida mass shooting.", "thetravellingshrine": "I think these views live on quietly in many homes. People think- “good girls dress like this and behave like this” otherwise they deserve whatever happens to them. Each of us needs to challenge these views whenever we hear them. Fighting patriarchy and rape culture begins in the home and we can all fight it when we hear it come out in the attitudes around us. This is shocking and also “normal” in a horrible way. The world will not magically change for our daughters. We need to press for change.", "nayanamadhekar": "I pity his absence of education!", "m_pinaki_": "RIP to that guy.. not india", "being_djb2": "Whoever this guy is.. This guy needs to know the meaning of RAPE.. I'll show this MFr", "raghav.hf": "I guess people like these are not gonna change and they aint got the mentality to handle ups things i guess either a very strict action should be taken against these people or they should be ignored...", "karanbirpartapgogna": "Sick mentality 🤒", "rohit7912": "Kill them please @fuckersneedtolearn", "shareefbachcha": "That's why sometimes I hate #rightofspeech freedom given to these idiots. I hope someone can teach some decency to these idiot who is justifying an inhuman act like rape as a need. Poor felow", "its_not_ur_comfort_zone": "I think u should go in troll police n kick ass of someone like this, maybe then these kinda people will understand😡😤", "vrindabhutani_22": "Slow claps for that comment guy JAY amazing it is", "pankaj.summan": "Kudiya da aukha he aa @neeraj_o7 @prince_1n", "rhea_susan_john": "tht guy is born without a brain...wish i could slap him", "bhavya207": "Stiil these kind of people exist", "the_joker_in_the_darkness": "People saying these kinda shit.... should be shot dead", "motwanimeghna21": "It's sometimes so hard to comment on your posts becoz you're such an eye opener and and inspiration to many and your words leaves me speechless like everytime .. but this Comment here is Incredibly Awful that I'm literally in tears and I cannot stop myself from writing this to you.. Honestly @redheadwayfarer I respect you now even more seeing the way you deal with trollers and with people like him(I don't know if this person can be considered as human or not) I cannot believe the way this single Comment has affected me so much and I always look forward to you. You're an incredibly Strong Woman and I believe oneday All the women in our country also will be and most of 'em ll b thankful to you and your posts! Lots of love!", "_sanghamitra.sahoo": "Y d guy is still alive?!?!???? Somebody just kill him😡😠", "pari__star": "😡😡😡😡", "subhra_deep_adhikary": "Mentally slave peoples can't bear others' freedom", "bboykaus": "He sucks", "the_indian_girl": "Rip poor commentator🙏🙏🙏", "shreyasonal_nasha": "This man took dis actually to a verge of shamlessness n fucked up mentality beneath.. Wonder y women are not safe, bcs of such assholes.. Keeping der mind in der ass n stating der views like such.. He has gone way far.. He actually need some bloody cold lessons which will make his such mentality chilled n frozen forever.. He shud think more dn a billion times after wt he thinks n shud spit out through his filthy mouth.. Shitty brain filled wid shits on his tongue.. Dis man shud be trolled till he don't sorry n strt respecting women for wt he sed.. 😡", "shazdah": "Caption @neha_siddiqi @zainakhan3912 @masira_khan23 @taibahdesai", "kurlykaur": "When you misuse the power of internet.", "_vidwhoshe": "Disgusting.", "anupriyyaa": "Oh really? ' needs' rape? And who exactly are YOU to tell the country what it needs? What India really needs is , a second massacre of all people who thinks like you. :))) And again, who are you calling a slut exactly? So Mr. You know the ' needs' of the country but donot know the basic rules of it? You CANNOT humiliate a women like this on a public platform and act like a godsent all your life. If you think that rapes are a necessity in the country, you better change your country cos we clearly dont \"need\" you and your point of views.", "gtnjli.k": "One word answer for such people - immaturity. He really needs to mature himself first 😂 @redheadwayfarer", "deekshaprabha2": "N he needs a doc...😑", "yeahiamkhushboo": "What the fuck! @notdatusualbabe @__shewhodares__", "_madhura31_": "I love the way you speak for women @redheadwayfarer ❤️", "arpang13": "Need not give him any importance#these are the loser who will be first to run from home if something happens to their family", "mystic_rmac": "he is auditioning for mtv troll police", "itskruthika": "Wait a minute, WHAT!!!!!? Needs ???? I doubt even a psychiatrist can help him!!!!", "i.mustafa1": "Shame on this sick guy!", "lostiswhereiam": "This guy's overdosed on bullshit it seems. Fuck. They don't know how to respect women. They should be taught some sternly", "amritashukla_001": "@anshulsingh20 can u even believe this😡someone even can think of these shits😡😡😡", "aadit_tilak": "WHAT IN THE ACTUAL FUCK", "gongyoolovebot": "#menaretrash", "suchita.aruna": "😈😈😈", "ll.sid.ll": "Follow me", "nazar__hussain": "That comment doesn't make any sense. Such an idiot he is.", "imhites": "Actually I still can't understand why the fuck somebody can tell a woman that u should this,u should do that... this was,or that day...", "nishitaa._x": "I am glad that we have ppl like you in India @redheadwayfarer to shut up mouths of ppl like these! More power to you! You have not only inspired me but continue to inspire more girls in India! #yougogirl ❤❤❤", "___sky____9": "Such a bullshit", "akshat_wankhade21": "😑", "ravishingtwinkle": "Such comments need reporting to Cyber Crime Department", "idiosyncrasies.exe": "My goodness you've gotta be frigging kidding me. Who tf are these people and where the hell do they come from? When the eff will we completely be able to eradicate such monsters from our country so that a girl can fucking breathe! What do these assholes even think of themselves? And this guy, defending rape and molestation? For heaven's sake, why didn't I die before seeing this.", "coolmin333": "Like really why don't these people change there mentality", "rupeshpadwalkar": "Looking at the comment gives good insight though that rape as context is not just a physical thing it's a mental sickness of making someone show they are weak and helpless. It's the grooming and attitude that society needs to change if it seriously thinks of solving this issue. Merely saying man like him him needs to taught xyz won't do anything great.", "jvyesh_pvrmvr": "Fucking bitch ass I'mma stone this mudafuckas ass", "jatinbisht_": "U all are same all of u", "swami1984": "With Assholes like this India need's capital punishment and extra judicial killing.", "sagarmukesh10": "@redheadwayfarer there is difference between man and bastard. U cannot tell him man.", "navvjyot_kaur": "Assholes do rapes... U motherfuckers", "naveen_agarwal07": "No one can educate these kinds of people😡 @redheadwayfarer", "_tamataar_": "These ppl are born to set an example as *SHITS OF INDIA* 😡 Be a man bro not the person who do all these nonsense in the commnts..!! Uh have to make one thing clear that #THINKBEFOREUHSPEAK ..!! @redheadwayfarer Uhh r a true inspiration for every one😘 nd we lv yuuu frm the bottom of our hearts💖", "milinduikey": "RIP....... Actually this category of people have deficiency in their upbringing. They have not been taught the way of thinking. They are inherited with the minds with long chain of filth and dirtiness, without windows. They are unable to take care of their families or society or even themselves, without any aim in life they are just emitting the poisonous words and thoughts. High handedly now a days they have smart phones with them and an internet connection. @redheadwayfarer I humbly request that, this guy deserves a proper treatment and a case needs to be registered under Cyber Crime act against this type of miscreants.", "ritam_ghose": "@redheadwayfarer : thnx for uploading ths comment. Thr r ppl, who would simply ignore ths ppl, bt ths #jay 'bhaiya' needs to realise what ppl actually fèel for him. #jay (u asshole)We enjoy sex, n we love talking about it (unlike u).More power to you girl. Lots of love. Cheers.", "sushmita._.pathak": "Wtf .. cheap thrills by Mr. Jay !!! U know wat saloni men lyk des the reason y India needs a change...n u deserve 💩 for ur thinking", "jiniieeeee": "We need people like you more, to change the society and to change the mentality of people who support gender inequality and degrading other humans. It's a salute for what you've been doing since a very long time. #Support @redheadwayfarer", "anikate_monish": "Such a jerk he is , you should complain that type of people to cyber police", "kathamrita__": "Guys like you are the reason Y INDIA NEEDS MORE SALONI CHOPRA! OR MAY BE PROPER EDUCATION WITH PROPER MENTALITY!", "ranjanayadav___": "Peoples like this are the reason why we think guys Should not be born in the first place 😤", "june_delphinia": "To whoever this man may be: \"Needs Rape\" Excuse me! Does he even realize what he's saying! It's not only the words but the mentality that disturbs me. It's a very casual thing no, to people like these? Rape. Molestation. Abuse. Happens everyday, just another thing right? Kitne casually boldiya \"India NEEDS Rape\". Do you even know what rape is? And before you say something like this, do you realize that it's people, wait minds like you that we women seek protection from? You, make me realize the epitome of filth where you'd want people to be Raped in a country. You see, you're far away from giving solutions to problems. You're the one who needs to be educated about them. You need to be educated about rape, about it's aftermath about it's trauma, because for people like you, India NEEDS Rape.", "shuvam__chakraborty": "Why the hell on earth these people exist!", "tehniyyat.khan": "@riddhima09 can you believe this. 'needs' it seems. Idk how to eradicate such living beings.", "dhrudo_": "Y dont uh go in troll police show on mtv for this types of cmnts", "neji786": "U r a strong women @redheadwayfarer ...... u dont Care about such people... u go on doing great staff", "mr_faizu_______": "Rape bhai tm logo ke wjh se hota mr#jay admi ko apne upr kaabu rkhna chahiye", "jyo_2526": "Okay Jay... And human (can't even call u human though) like you NEEDS to kick out of this universe....", "high_on_sarcasm__": "What India \"needs\" is a second thing...but first...this guy needs to be educated...", "tarun_naresh": "@theskinnypotato bhai.", "ankiee_04": "I don't think you should care about people like this. Sitting behind and writing shit.I really think he would not be able to talk a bit also Face to face. People like these shouldn't exist. @redheadwayfarer", "costaclown": "@redheadwayfarer this is incredibly saddening to tell you the truth. I follow @mallikadua as well and she was mentioning about another account that had some next level bullying. This is really sad. The fact that on a daily basis that our family, friends or for any unselfish or whatever reasons say someone out there has to deal with this kind of rubbish is beyond understanding. Why...? The act of pretending or acting to be machismo or patriotic or religious is an actor s job. They are paid to pretend. Have a friggin identity of your own and stop hiding behind the anonymity of the internet. This anonymity was created for the brave and to protect the privacy of anyone wanting to shelter their individuality from the hawkers. What this is...is cowardice. Please, if you are one of these...it s not cool bro. Lets talk it out. It ll only mean better things and positive vibes. Peace.", "jagannath_pathak108": "No", "pallavi_zore": "Bastards like these do not deserve dicks... Indian men like these needs a process called \"castration of their family jewels\" so they do not reproduce jerks like themselves at all.", "kiritivity": "These kind of people are pervert and mentally retarded, need doctor 😡😡😡", "kartavya_sadh": "Not afraid of society, humanity not being ashamed of anything... No respect!!!", "hemang_vishrut": "That’s exactly right what u did is abso. correct. If I being a boy am offended by this post (comment) and am angry at it; then think what the girl who this fuckin idiot is calling slu# would be feeling. Such bastards should not be forgiven... #weragainstit", "umm_air_husain": "Best way is to ignore these retards. They crave this attention. Fucking cunts.", "dhyan_204": "This type of man are what #India does'nt need. @redheadwayfarer ✌🏻✌🏻", "natashaaajwani": "Are you serious man!!!!! This is the height of Insanity. What you are trying to say? This is the reason why nowadays people laugh on the word \"Humanity\" & \"Intelligence\" Speechless!", "devashphotography": "His comments showing how sick he is mentally.....", "46manoj": "Brave girl never give up", "tleelat": "21st Century it is, but still, a person who knows how to use a smart phone, how to use YouTube, how to browse \"stuff\", says such things. Better RIP uncle ji :)", "the.alluring.thing": "AND PEOPLE LIKE THESE ARE THE REASON WHY INDIA STILL NEEDS TO EDUCATE.", "nitinnnpal": "Okay Jay, you retarded bloke! I wish you appeared in front of me somehow and I would get a chance to strip you and cut your frickin dick on national TV. Saying that satisfies me to an extent, thinking of it does it even more. God, if I find you, I'll be the luckiest man on this planet!", "himansh1996": "Ese logon ko to society se nikal dena chahiye", "shuklaspeaking": "There is no need to comment on this morone. The person is really insane and I guess mentally challenged. Avoid this bullshit. 😏", "saloni__nair": "Oh my god", "cranky_cake": "@redheadwayfarer lol. People havin this kinda mindset are rather emerging \"rapists\". I doubt if he will ever have a wife or a life partner in his life, whether a girl or a guy. Mentally sick and lacks knowledge and pragmatism forsure. He has given us a clear account of his history and thereby his future too. At times more than feeling any kind of rage, I deeply pity them and their psychology.", "drishtantchauhanhihai": "He is sucha infection .", "only.ankita": "😤😤😤😤fuck those people 😈😈😈narrow mind", "abhijeet_mahat0": "Please stay strong ... Don't feel low ... These type of people are everywhere ... Aise hazaar aayenge hazaar jaayenge ... I think people with such mentality have this disease/disorder of putting their long nose into other people's business ... We all are proud of you and even look for inspiration in you ... #staystrong #supergirl #lotsoflove❤️😅😘😘 @redheadwayfarer", "mdx01": "He must be raised by a slut hun,fcuk haters & keep rocking @redheadwayfarer", "ini.meeny": "I wish we could just delete people the way we delete these comments. So much easier, no? Plus population control.", "i_m.pm": "And people commenting all these bullshit are the reason why India needs cock cutter... Seriously... Shame on you man,whome so ever you are.... Kindly go and get a mental checkup.. and i am sure this guy dont have sisters and even mother too... Bloody asshole", "aruntiwari.jsr": "We're ashamed to have such disgusting citizens maculating our society. Yuck!", "a.k.s.h.a.y_c.h.a.u.d.h.a.r.y": "Ohh Ji Sorry, On behalf on him, chutiya hai ji BC, Ghar mai maa behn nahi hogi ji....", "njasra": "wat to say such assholes....let them think wat they want to..... just ignore such loosers.... but chop their head if they try such acts", "vaanipandey": "Seriously a minute of silence would be enough for dat person....#rip and such message s should not be deleted hatsoff of to u 👍", "mooochman": "Women, ew.", "kurianlive": "These kind of people are a shame for us in today's wolrd. As the saying goes \"A Lion doesnt concern himself with the opinions of a sheep\" so lets give a minute of Silence to this dumb bastard and march ahead! @redheadwayfarer ✌", "weirdoboy_.in": "#mentality", "jinks_shine": "After written by this shit..... I think \"जय\" is converted into \"पराजय\"...😂😂😉", "nsi.rumesa": "And proud of you girl and dont let these shameful creatures disturb you.😊", "akshta_k": "Wtf! He needs help", "shantanug28": "BTW WATS 8TH WONDER OF THE WORLD?", "riyanagpal24": "People like these are the reason sometimes our indian culture feels ashamed that they were born in this country.", "krishnaa76": "Narrow mind people😠", "harshitha_manjularaj": "Here we are conquering space and still there are douchebags like these that are actual wonders of the human sense of reasoning...Irony at its best !!", "martialartist26": "Report this idiot to police", "harshitarathod_": "First of, these are the kinda guys who sleep with sex workers whom they call 'sluts'. Second, India doesn't 'need' rapes, it needs education. And I personally think this guy needs death.", "mashmoool": "GUYS LIKE THESE IS WHY INDIA NEEDS CUTTING OFF THIER GENITALS.", "jeet_sarah": "@redheadwayfarer no one can fade away the spark you have within you....❤you are the real superwoman who accept the reality and don't give a shit about it....and yea one more thing I always try to come to the house just to see you and meet you...I'm trying this from last past one month but couldn't find you...you are a true inspiration and the love you spread by your articles...❤❤", "tanvicious_": "U can't even educate such Ppl with such nasty thoughts...and how shamefull it is that living in a democratic country we hesitate to show our skin and if we are bold enough there are d**k heads like these trying to crush our confidence... But such Ppl and such comments won't stop us from being who we r and and what we aspire to be...keep going girl @redheadwayfarer , ur doing a great job", "siddoku": "This dude needs a rod shoved up his ass", "_rakhi_sharma_": "India surely doesn't need such shitty heads. A minute of silence for him.. RIP.", "karansidhnani": "Because of such hypocrite male chauvinist Indians ka Naam kharab Hota hai", "trapqueen_se": "Oh my god. My blood is boiling. Men like these are the reason why castration is a thing. ‘Needs’? Seriously???!!", "_urvee_": "This is actually very depressing to see... people still think like this! How can they have the guts to say such stuff. The sentence should be “ Dicks like these are the reason why India needs Education and Awareness...”", "aayushi_snehal_": "BASTARD 😡😠", "ashutoshpatil000": "Then wat abt the guy who slept with her?? Matlab ladka kare to dude aur ladki kare to slut?", "____safarnama___": "#RIPIndia", "nancyrawat84": "Why you called him man?..!!! Such a asshole.. @redheadwayfarer", "thepensieve_": "What the fuck is he saying! My. God. Exactly, the choice of words. The way his thinking goes.. Eww.. Cant believe really.. Can't believe..!!!!", "harry_.69": "People like this man should get fucked by a transgender", "____whats_in_a_name___": "I hope he realizes that he \"needs\" to get a life🙄", "_youngpoet1406": "The only punishment for such a narrow thinking is to cut down the fucking penis of such guys in the front of public.....bhosdike apni behan ka rape karwa road pe", "ankitabiswas18": "Killl him...plzz...people like him should not be alive..!!", "kannan_x": "WHAT A CUNT HE IS", "anshuaanya": "@redheadwayfarer what you are doing is awesome... these people are shit... move on and keep going... love you loads😍😘😘", "madhuk_jha": "Uk what just happened.. You r an inspiration for me From now onn. Yesterday a random guy texted me.. His words were \"hi 🔥🔥🔥🔥 I wanna fuck ur ass\" for a min. I thought to post it and ow him how to fuck someone's ass. But then I declined it. Idk what was I thinking.. I really felt bad becuz m not a kind of girl who just ignore such things. Uk aisi baatein ldko ki Hume hi gnda feel karati hain. Aur jb abhi maine insta check kiya toh aapka post dekha. It just clicked my mind and u texted back that guy becuz I couldn't got that msg back. He was denying it first but than I told him to remember that social media is not just for dirty talks. It is more than that. Soo keep this in mind varna izzat kho baithega. Nd than the magic happened.. He said sorry 😜 I won this battle. 😝 sachi bhut acha feel ho rha abhi. Kaash uske msgs mil jaate toh post hi krk gaaliyan deti. Thankuu soo much @redheadwayfarer", "diva_priyasha": "Okay all I want to do is .. find this \"Jay\" and kill him 😬 #RIP", "butter_chickkken": "Okay....This person needs actual physocological help 😶", "the_short_hair_girl": "@redheadwayfarer I don't know how to deal with people such as this man but I just want to say that I admire how bravely you have decided to confront this problem with the mentality of our community. You are an amazing human being. Lots of love❤️", "_ghunghat": "@rannvijaysingha do something of this man....do we girls have any safe place", "chaotic_corpse": "This are the people who count bars for some or the other sexual offends. Plzz get this thing Rape is a offense that can effect the victim not only physically but Mentally.Don't support it by this shit thinking.", "cutestgirlpooja": "#slutshaming... U know such type chauvinistic afraid of women and their freedom... Basically chahte hi ni Unse Aage Nikle or equal ho.. Thts why they keep dragging u and insulting u and create more reason to prove themselves right... It's okey let them @redheadwayfarer ..keep writing girl... Hathi chale bajar Kutte bhauke hazar", "priyanka_kintsugi": "What level of shit is this...seriously till date i didn't know that any country needed \"RAPE\"but thankfully some misogynistic and burden on this planet people are present to let us know everytime..like heyy!!wake up its us...the fucked up mentality ..and we are here to share our views that how a woman who is strong and independent and who is bringing a change in society by doing so much of grind is a slut...like seriously...PLEASE god let the wifi and mobile data signals get cut off for these kind of people...they dont deserve social media...all they know is so spread misogynisty and their fucked up and lame thinking...Ahhh...God..bless that poor soul..", "architsingla4": "rather than just educating India there’s a need to make a wiser India. People like that hide themselves and comment and reflect their level of upbringing, they don’t even think for once b4 choosing and utter those words #WakeUpIndia", "star_lordxp": "Fuck these pigs.. 😑How can they say such things?? What's in their heads?? Shit?!", "_.snuggle.bug._": "Report this asshole 🙏", "aishchir": "@avani_reddy what the actual fuck.", "grow.me.along.smriti": "I feel like smashing that asshole.", "the_shubham_bisht": "@redheadwayfarer I'm really fond of what you write and i want to appreciate you for this💜💜 and talking about these type of stupidheads leave them with their shit thoughts...", "clutch_emperor": "Rise above hate mam", "portraitsaditya": "😠", "waysheblushes": "Seriously such people are a burden on this land...", "lakshi_singh": "Rapists like him is d reason why india is not getting better.", "nehawagh_": "that j should be fucked instead.", "bjaytamta": "We want a RAPE free INDIA where ANYONE can walk free and safe .Jerks like him still think like that WTF", "kalpdheer_aanchal": "He is just asshole", "_simmmmy_": "Whoever this \"Jay\"... Its to you... \"And for fuckers and assholes like you beautiful and kind hearted girls are said to stay at home as if some gross lion is roaming around to eat us. You bastard!\"", "mentally_curious": "Wow. Rest in peace sense and sensibilities.😓😐", "ditiiee": "OML OML", "__unnuu": "Commenting shits are easy thing to do! So I wanna say that he is lucky coz he is on back stage nd commenting this SHITS .. Otherwise he'll be die that's for sure..+ Public will heat him with the burning IRON ROD in his ass.. RIPINDIA #mtvtrollpolicehelpline #mtvtrollpolice #mtvtroll #troll I want that this man should be found. ASAP and teach him some lessons! If anyone can really teach! \"IF\" ! Period! Peace! #mtv", "sonal_sehgal10": "India surely doesn't needs such shitty heads. 😑", "mehakhuranaa": "Omg @redheadwayfarer it is so frustrating to see such a comment. You've been giving out such awakening messages out here and look at these demons -_- i can totally understand how difficult it would be to deal with this all. It's just you who has guts to face them all. A big salute to you Saloni✌🏻", "negi.aayushi": "This is so fucked up man.. People like \"J\" who support rape culture can not even categorized as animals and let's not talk about them being humans.. having the freedom to speech does not mean that people can talk about others dignity.. @redheadwayfarer thanku for sharing this post..", "himali14": "This is sick! People like these need to be legally punished before they actually go out there and harm some one for real.", "irahulmittal": "Have people really lost the sense and the sensibility that comes with it?...Is this how you talk about women or any other human being. What a jerk...if you really have to voice your opinion at least maintain some basic social hygiene. What India really 'needs' is complete ban on such people who have the audacity to speak such ill.", "nixondhall": "Haa to Rape is cutiye k samne iski patni ka kro", "komalpreetkhullar": "No words for the boy who is also there. Girls are always targetted. Cuz u can't control yourself u do a rape. We don't get aroused by seeing such stuff. At all. We don't see any man and get aroused. And the one who will debate on this will be the biggest asshole.", "artamuly": "#betapadhaobetibachao", "winsome_thatsme": "What kind of asshole he is?? Does he even know what d fuck he's talking abt.... U r such a brave girl @redheadwayfarer", "vatsal.sharma92": "I think he needs to be tagged as well!", "dear_mojo_": "Y guys like these r alive ? #kesebadegaindia", "ankitpatil__": "BC pagal hae kya wo aadmi....asshole 🤦🏻‍♂️", "shernhi": "God! Yes a minute of silence for the man.", "iam_anuragchaudhary": "And people like him shud be hanged and the thing which is already hanging shud be kicked so hard so hard that there shud be nothing down there", "rahul28engg": "This guy does not know how to respect the woman.i think this guy need the mental check up and education how to talk a woman and how to respect the woman.....", "tushar4rana": "Insane this guy is........he #needs to be counselled.......feel sorry for such people......@redheadwayfarer to go girl....keep on inspiring people........😎I wish u were single and I was ur best friend.....but I'm happy for u", "tejalsawant": "@rannvijaysingha find him on troll police", "deebbaaa": "That dickhead is the reason why rapes still occur at such rate and women can't be free even in 21st century.", "shradha_baligar": "Wdf does he mean by India needs rapes ... Like dude get a life", "hewasingh": "Potential rapist spotted.... !!! दयनीय स्थिति है देश की 😌😌😌", "unladylike_sanyukta": "Wtfffff.", "pratiiiksiiingh": "Kaun hai ye log kha se aate hai ye", "ree_nal_dee": "Well this kind of boys are first of all PERVERTS😡😡😡😡", "bimishahahaha": "@rannvijaysingha", "tanisha_sarkar": "Such a asshole he is......", "rockstarr1430": "This guy surely needs some basic education and sense, rapes are not something which are induced or needed.. they are the results of cheap mentality of the society and the males who feel that the girl is their property and this kind of people should actually be terminated at first instance of when they show signs of such sick mentality.. people like him should be actually either educated which I don’t feel might help, so preferably the should be terminated and at least will create a lesson for others with such mentality..", "berrysplaash": "@tashinakadian97 wtf", "poojasreeram": "Oh my goodness! I can’t believe it that this man had the balls to say this out loud?! India ‘needs’ rapes?! I mean?! I’m flabbergasted! No country, no human, no living being/thing ever ‘needs’ rapes?! Rapes are meant to put women in the lowly place where they belong?! No mister! A woman will not be known by her vagina! Her dignity is definitely not in there! Men like these must be caught by the cyber police and jailed before they ‘show a woman her place’.. I feel sick!", "unravelmytravels6": "Wtf. I’m appalled. And yes, we should speak up when we encounter such things.", "pushpraj1888": "Sometimes it feels shameful to be indian because of these basterds", "riya_meshram__7": "Who the fuck this guy is.... Seriously..... 😠😠", "life_goals625": "Such a moron ... I guess he'll happy to see his family (females) to get raped cuzzz its a \"need\"", "thebindassguy": "@rannvijaysingha plz look into this", "sutosome_m": "Guys like him are the reason why IPC should include castration as a punishment", "_rakhshanda": "Chutiya like him NEED A BAMBOO UP THEIR ASS!", "_iamappy___": "*india needs rapes* like seriously! ! ? ? 😐😐 he needs the middle finger salutes. . . Bloody half-wit ignoramous jerk 😤😤", "bhargavabodas": "-_-", "palison.in.wonderland": "He should be hanged", "ritz.mak": "@chithramurthyiyer yet we're taught to be good girls who forgive and forget", "being.geetu": "Rape is not needed in India or anywhere on the globe for that matter ... what we actually NEED is better education and and basic human decency #ya.all.need.to.wake.the.fuck.up", "__imparfait__": "ripthisperson", "pencoffee11": "Can we just share this on fb or somewhere over a large platform, so that this misogynist asshole, can be exposed? People should know that these type of rapists exist. And that they should be punished before any thing happens to a girl.", "sonali_0009": "👌👌👌", "reenasah_93": "O god 😑😑😑", "_rajatrai_": "Sad part is... He is not even gonna see this post. So let's think🤔 how we gonna make him realize what he did🤔.", "callmebips": "😡😡😡", "arty_tyagi": "These bastards, wish they have the balls to show their faces; say something like that to my face and I'll tell you what India needs", "jesuisprayanshu": "Hes/shes needs tos works ons englishs😂😂😂", "officialz_imran": "👏👏👏👏 Good Work!!", "l._.anwid_": "Means no shame,no humanity WTF! Now what he think of himself India still need rape ...Saale teri maa ne dekha nhi yeh comment.Tujh jese logo ki wjah se India mein saans Lena mushkil hai baat krta still need rape ..Tujhe toh doobo kr mardo .Ek baar address bta fir tujhe definition na btayi na lihaj ki....Nerds", "shah12emmanuel": "I know what India dsnt need... India dsnt need ppl like him", "nuckingfutz2": "@mtvindia troll police", "agirlthatknows": "Who the fuck is this person, Saloni you should report this to mtv troll and let the world know from where do this type of assholes come. #mtvtrollpolice", "_shubham_tembhurne": "Wtc kill that person 😲😲😲😲😲😲", "anan_12": "And people throwing statements like that", "theunique_sim": "Hello there! I am a strong supporter of you! I usually scroll through my feed and not really read celeb captions. But whenever i see your posts,i make sure to read them,absorb them and be proud of being a woman . I am inspired by you. And i hope to be a strong rigid woman like you!", "koulakhil": "Chutiya", "ankita_saini": "We don't have majority of such people in India. The majority wants change, change for the best. Don't hype his choice of unpleasant words so much, that's his way of showing hatred without even understanding where it can lead him to. I hope you take an authentic step againt it and teach him a lesson. More power to you, girl. 🙏😊", "kannika_shetty___": "Men like these r reason for rapes in India...", "namrata_pawar": "👏👏👏👏👏", "aminaki_._._": "A misogynistic pig with probably a retarded dick. Lol, he can’t even write properly. Someone with that kind of mentality are the ones who are actually promoting rape culture . #suehimalready", "i_tood_map": "Asshole. . Do u even know what u r talking? Rape? Go tell the same shit in front of ur parents.", "niha_maske": "Mention his name so that the whole India will get to know the \"rare species\",who are yet so backward to understand a girl character by the clothes and thought she share", "nisharoy3798": "Cheap mentality ppl ...... Until such ppl will change their thinking it will continue to hppn .... Actually these kind of cheap mentality ppl r d reason y India has d largest no. of rapes cases .....", "yuvraj.sachdeva": "Isi ma ka popla khud ki luli khadi nhi hoti ajate hai rape ki baatein krne betichod.", "oshikaaaaaaa": "@redheadwayfarer you go girl ♥️", "ashwinipandey08": "I dont understand why do even these kind of people exist ....i hope if this species of morrons could extint ...bloddy cheapster", "swastika_soul": "You are so damn inspiring and so incredibly brave!!!!!", "abhishek_verma23": "Plz dont say RIPINDIA just bcz of such poops. We respect here.", "prakritijain92": "Want to give him 1 tight slap for dis.", "simmojaddu": "#trollpolicehelpline", "__schrodingers_cat___": "@bohobihari Bhai , yeh kaise chutiya log h.", "ricky_bansriar": "Shity people like these should be gang banged", "ishitaaasingh": "FUCKERS LIKE THESE R THE REASON Y INDIA STILL \"NEEDS\" CHANGE, EDUCATION, AWARENESS, FEMINISM!!", "yashshree_1108": "OH MY GOD! I won't say that I don't believe it, because people like these do exist. And to our bad, there's nothing we can do. Well, hello India and its citizens! Fucking democratic country.", "rnkanthony": "Serrrriously man", "sharmita_": "I pity this manchild.", "deansamuel": "Wtf 😶 ...", "beldeabhi": "Wow such a low life educated scum, how dare is he to say that??!!", "cheee_nikhil": "😮😮😮😮😮😮", "shikhs5parmar": "Hey dear totally agree wd u,do not delete it confront him give him back on his face u dont need worry abt shit people who havnt achieved anythg nd just cuttg down dere vella tym by posting shit dey dont got anything to do wd dere life so d bitter truth is dey exist cheers to ur work nd totally love u😘😘😘😘", "nitro_zeus__": "That's the most fucked up lines I've seen in my whole fuckin life. These people needs to get beatdown by a fuckin baseball bat while cutting his dick out by a chain saw. Fuckin illiterate dumbfuck", "vivekchoubey143": "Fuck you asshole..", "wildernesssssss": "I stand by you.. This is where it starts #RapeCulture and we are sadly struggling to fix the mentality!", "akshaynambiar195": "Because of people like these the remaining ones have to sit and watch in theatres about men being bad towards women in movies and all .", "monisha_bachina": "Super caption......😘😘😘", "prakash_12_96": "Hadd ho gyi bc 😫😫😫 kha see aate hai ye log 😑😑😑", "utsav_ketankr9": "@redheadwayfarer you should also have posted his profile link.", "_arti_pandey_": "Losers always talk like this!", "the_northerner_xi": "Mam, why r u entertaining these type of shitty people there is no need of justification", "neel_ekka": "Fucktards like the man himself are the main reason why \"Our country apparently seems to promote crime and defend the offenders\"", "smilingface_06": "@_itaintmeh_ @shikha06_ what the he'll is wrong with some ppl... y do anyone or any country needs rape 😩😩😩", "behudalog": "Hahah some ppl just can’t handle success of women ! 😂Nd they can’t go out nd fuck their self out so , they just judge 🤬 , slut shud be not ashamed of, shame on those who goes to them and think like this.", "shravanijadhav24": "Actually these guys r the reason y we 'needs' mental hospital in india", "nikhil4174": "This is redicoulis ek sale ki gandi soch aur dus gadho ko incorage karegi whis is not good dude this guy needs to go to school for reteaching process", "the.virgo_queen": "Illiterate bulls 😒", "_lil_trouble": "I guess 1 month baby is also a slut for wearing short clothes and seducing Men's around and getting raped by their own family members.", "miss_messyhead_": "Babes ... Go to #trollPolice .. we need girls lyk u stand there to show mirror to these type of monsters their true colors", "upenravs": "Expose him more and more in media, even in newspaper, that way many will think before posting", "rajshree29v": "That comment makes me cringe. It's absolutely disgusting that such a mindset exists. So much for our country progressing. It's a sad state of affairs. Sigh.", "tarun111kumar": "Fuck this kind of mentality people they are morens, you just ignore them", "its_megha_g": "Seriously 😑😥", "________scarface": "Oh fuck I can't just believe..", "thebeautywonk": "Instead of ignoring it, you should file a complaint. That's a potential rapist, this definitely comes under rape culture.", "thetrickypanda": "People like these always try to pull down women... We have to face it.. Not to ignore... The mentality of these kinda person are just shit.. So they comment or think just shit... U are the queen @redheadwayfarer .. I love u", "haninder_1": "This guy needs a hug from a rope and a cyanide pill.", "misty__mane": "@redheadwayfarer this is absolute nonsense!! I respect the suggestions others made yet On our level,i wanna suggest u that put these type of guys on ua insta story n ask ppl to report it... PLEASE.. You have done an amazing job by posting these comment it really takes lots n lots of guts to do it.. i m really proud Of You and U ARE TRUELY AN INSPIRATION!! Keep Going... Lot's of LOVE❤❤❤", "dudenitx": "What!! Rape is a solution to solve ego problems. .. bhai be a man!! And men don't do such things. ..", "surrealrashi": "Not at all gobsmacked. Have seen women commenting the same for other women. That makes me more furious and frustrated. One thing in India we women need to understand first is to stop fitting in the perfect definition of the society then only n then only we would able to bring some change. Candidly we all at some point of the time or daily try to live by Indian standards not Indian law coz here females have to abide by society law not judicial law. For instance if a man chose to have one night stands then he shouldn't be called by names or get raped coz cmon he's an Indian man n law doesn't punish you for your sexual activities but if a woman,oh no no she shouldn't even think about any sexual desire leave alone having it coz here where the law comes in, oh yes the society law which doesn't allow u to be human even. Wish our female ancestor's would have acted the same way @redheadwayfarer is then atleast the present generation have not been reading these kinda comments. Do it for our future generation Girls. Do it for our #daughters #Indianeedsequality #Indianeedshumannotrapists", "kari_malv": "Absolutely disgusting.", "ektaajoshi": "@redheadwayfarer men like him need to grow up, in every possible way! India needs rape? Seriously? Just because he has a dick, he feels India needs rape?", "riyasharma104": "I don't want another person to tell me we don't need feminism anymore.", "bongeyes": "Disgusting", "laishramthoibii": "India needs to bury this person alive.", "1ntronaut": "The mentality of the majority of our population in India is certainly demented.", "goolabjamun": "@pri_priyaanka I was talking about this profile.", "sarvil.makwana": "Truely said... and bold too", "anukshabharat": "RIP his mentality 🙏🙏", "dr_pixel_": "People with mentality like this r reason girls can't enjoy liberty..", "shivaneedsni": "People like him are reason that something like RAPE exists in India and that there is no change, till the time we have mentality like these, our country is only going to deteriorate", "you_know_nothing0014": "Its these kinda people who comment so ugly for a person trying to make a change... if you can respect anyone, please don’t even comment..... all she is doing is to make every person feel comfortable in their own skin.... and its nothing wrong.... all we should say to such people is GROW UP... and lets others grow too....", "miss_chatujjey": "This post made me cringe so hard. This man here is a potential rapist roaming around freely defending himself by saying \"not all men\" when at any moment any innocent girl (deemed slut by the society for carrying out their free will) out there can fall prey to this pig's sickness. He commented like this freely in a public platform without any inch of shame imagine the level of vileness he along with thousand of unknown men foster. To all the men..Please stop defending men, let's make it \"no men\" from \"not all men\".. ahh. Perhaps one day.", "srinidhi_reddyshetty": "These are the men because of whom we are only growing by population but not by thinking", "_boroe_": "😂these are the true dogs who can only use there big mouths over social media only", "amitbhatt369": "Narrow minded man", "sanjeevansinha": "I feel bad for his kids", "shagun.dubey": "He's an asswhole", "ranveer_2121": "Teri chuth marthu lode", "shristi_guleria": "I think this person should be hang to death infront of the people of who are the victim of rape let them allow to punish . These people are garbage of India which clearance is a necessity for India . And ya girl Ur my hero 💖 I will break his face if i ever met him. And wait minute if she is earning money through her talent ,then she is a slut wow man u real need a punch on ur face u r no one to say bullshit about her because she is dependent and it takes alot of courage to be there . # bhai teko toh Ganga maiya main dub ja😂 sry Tu toh usko BHI gnda krdega", "queen_of_monsters_nidhi": "Needs reps””🙄🙄🙄🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️ chutiya h ye bc kya bolre h kyu bolre h na jane kya khate hai mko pkka pta h inke dimag mein koi big fat disorder hai tbi ye aise h or inko india se nikal dena chiye dumb heads pgl gadhe log bc diii you’re the best we know thats it @redheadwayfarer #maggie #lovemaggie", "leahsansoha": "Assholes like you should get your dick cut off!!", "aakashleo19": "MINDS LIKE THESE ARE THE REASON WHY RAPES ARE HAPPENING IN INDIA AND IN THIS WORLD.", "preethi97_": "@ritz_mak", "sawansuman1": "Gyz likes these are the reason why Indian is a country where many of girl's think To Born in other countries.....", "shivanisharma.23": "Omg I mean seriously \"needs\" to be raped ? Idk how someone can comment like that. I mean kitni gandagi bhari hai logo ki soch me . Why do such ppl even exist . And you're right @redheadwayfarer it's very important to speak and talk about such things . Every person has equality and deserves respect whether rich or poor , celebrity or non celebrity.. such comments effects celeb also (they are human too) Lastly I 'll conclude by \" Rape is provoked by his sick mentality , not her short clothes \" #talkaboutit #educateppl", "raj______singh_________": "This kind of man leaves in his own lala land of thinking", "_amruuta": "Did I like actually read these words??!!??!!??!!!!!", "riyacr7": "He actually rapes himself by his words.. hat's off to this narrow minded man😅", "apocalypse_immanuel": "Wtf, like seriously?? How can someone say such things I really don't get to know, what if it's your own WIFE? Because tum to ek number me Mc aur Bc log ho na. How such person still exists I don't get to know that. UNBELIEVABLE! RESPECT WOMEN.💐", "mrinaalinii": "Retards like these are why we need feminism and education tbh", "shubhmverma": "and these moron's are the reason why india is known as the place where girls are not safe", "akshat310": "Why to even take out your important time and waste your time on such bastards who doesn't deserve the same!!", "yashaswinee_saha": "@bose_debam see.. another one. Can you even believe what they say? I don't understand what they think while writing all these things.", "rahulkinger56": "The person with this mentality should be kept in mental hospital", "tandon_j.r": "Absolutely disgusting @shaguntandon94 @suhasi.m", "hathiparinda": "What the fuck!! He is an asshole. People like him should die.", "yashika.in": "@mtvindia That's a troll we reaaaally need to see the face of, infact hmu and I'll help you f him up.", "the_little_side_of_sunny": "Please be strong and make sure you take up time to punch these stupid comments in the best way possible.... These are the ones who make cultural an excuse and do all kinda rubbish....whatever you're doing is making a woman lady or a gal realise that she can see the world beyond the boundaries of men. Keep making more Maggie videos and be strong", "pallavi_mech": "People of such mentality literally has no right to live on this planet.That's it!", "______a_n_k_i_t_a_": "Like what does it makes him to talk this kind of shit such a moron is he when the rape kind of thing will happen with someone from his close ones then he will kW it well"}