{"ashhwini": "@saurabh941890 so hips are pornographic? lol so should I say that guys shouldn't roam around shirtless because it's pornographic????", "eshaanghosh": "@ashhwini sorry to intrude but @saurabh941890 paagal hai Kya. Just because you can comment doesn't mean you should say something so offensive. Insaan hai na tu. Do you even know how hurtful whatever you said can be? Leave this woman out she's strong and she won't be giving a shit about what you said. But don't call a girl a slut. It's very disappointing to see guys call other girls such offensive words. Makes me feel ashamed. Grow up and try to accept the people around you. Stop demeaning people.", "astha_raina": "Baap re baap @redheadwayfarer", "ajit_lahon": "Very sexy", "greeshma_naidu_": "@redheadwayfarer I'm allergic to water!", "viraaj___mishra": "Sexy n cute butts", "tvikram316": "Hot", "absolutely__correct": "Wow.. this post and the following post... Like . Srsly...", "tamit930": "##सुन‬ ‪पगली‬ तेरी ‪मोहब्बत‬ ने ही तो मुझे,सिखाया‬ है I ‪LOVE‬ U बोलनl ,वरना स्कूल मे तो हमे A_B_C_D भी नही आती थी.", "god_giftzz": "Follow for free shoutout @shoutout_worldz31 ✅❤️ like for like comment for comment follow for follow #followforfollow #like4like #commentforcomment", "bhargi_madhu": "I am allergic to water too", "billion_dollarproject": "Lovely", "ssaurabh9": "@ashhwini First of all, let me tell you that I have not said this to you. And yes she is definitely low minded for me! Yea definitely & I am proud of hindi!", "yashika.in": "slayyyyyy sista💁💁💁💁💁", "berry_smoker": "Even I am allergic to water", "_bhavika07_": "It seems like you have aquagenic urticaria,u should use topical to prevent it or ofcourse i dnt need to advise you... you're also taking medication! But dw it's all doesn't matter just take care of yourself...keep writing bcz you're the biggest inspiration for me😃love you😘take care😀", "satish_yadav_836": "Woww 😱😱😱", "amiransari4545": "Hot hot hot", "parthkukreja": "And yes, this allergy is called \"hives\". The best remedy to it is. You can simply add \"baking soda powder\" to your bath water. Or you can even add \"aloevera extract\" to the water to get rid of this hives.", "raviteja_9": "👍👍👍👍", "alex_tatak_": "Nice 😍", "sujeet.reddys": "Awsm", "imbluedup": "Hey this is going to be a message I want to deliver to you, as holi is approaching, people are ready to launch pichkaris and waste water. If role models like you express why it shouldnt be done, (like Cape Town running down anytime soon, And water being really precious) it could be helpful to the world. You could start a revolution just in time.", "thatduskywoman": "Yesssss there are people who are allergic to water... @niahselway is allergic to water... I can feel the pain of people who are allergic to water because i myself love water so much... Summer is all about swimming for me... And even imagining the absence of water in my life give me chills... 😥", "caramel_without_salt": "@intimate_enemy you bish.", "neelendradixitt": "Bold look", "evrythng_happens_for_a_reason": "evn m allergic to water....", "vridhi__kapoor": "I have been body shamed since I was in 7th Std and till date people do. Yes I'm flat chested and maybe I need to lose some more weight and guess what I don't give a Damn to them. Standing for yourself and being able to convey the real you and accepting yourself as who you are is all I have learnt. @redheadwayfarer You're flawless You're a amazing person♡ and special thanks to you for somewhere being a important part in my life as a inspiration♡♡", "thesuraj_jaiswal": "Sexy ass😘😘😘😘😋", "docshash": "It's not the water, it's the chlorine used to disinfect water that's the cause of ur allergies", "aanchalbharadwaaj": "Nice ass tho", "anayshabh": "Hey. Just a suggestion, you should try applying coconut oil daily after a shower! It really helps.", "shaikyaseen15": "Nice bikini", "ritesh_241": "Wow so.. Hot & Sexy 💋👌", "aditiparab___": "Hey I don't have any problem like u have said above..we even dk each other nd how can u say it man @chubbybootwala", "rohit8775": "Work on your body babe @redheadwayfarer", "rajni1322": "Only 50 people in world have this problem", "shivani0019": "@redheadwayfarer it is the salt plus the sun . When you go in salt water and along with it there is sun exposure, it makes it worse. You should see a good homoeopathic physician. I have a similar skin type and I only take homoeopathic medicines . And it has helped me a lot. Your body will change inside out.", "drunkandspill": "U aren't wierd, its chlorine", "aleynamansuri": "Maybe it is the salt meggi, I mean Saloni. I think you should try the water with no clorine. sensitive skins get burn when expense to salt", "ketanshah555": "Wow gorgeous", "sun5_1994": "@srma_sorbh_911 leave it bro. There's no point in arguing more with such maniacs. You stated your opinion that's your choice. This women stated her opinion that's her choice. But someone people have problems with each and every comment. Leave her.", "parul.tanwar.39": "There are many people allergic to water. You should read about it. Takecare :)", "s_a_h_e_b_21": "What a botty🤤", "rish__abbb": "🙈💕💕", "connecttorishi": "Yr kuch bhi", "agirlthatknows": "Ohhh that cute booty😄 You go Girl #inspiration", "mrityumuksiya": "@redheadwayfarer then ur lucky haan ..U won't have to bath daily 😃😃 ..", "psy_being_human": "Psy being woman 💃👸😘😍😇✌🙏", "umar_sady_khan": "Don't think that much... Weirdest think often dis appear.. with time", "itsranveercool": "wow its amzing pic.....", "jagdishk94": "Y u write so much essay in every post ... May be u Wer first in niband lekhan in school ...", "mesatoic_sapien": "Your badass attitude and straight forward intellect inspires a lot many women. Especially those who are conscious about their external features. Your posts help me in dealing with so many chaotic modes of life . 🙏", "_notmara_": "Another one allergic to chlorinated water but yeah it’s totally worth it. Can’t resist the pool or the shades of blue. Keep slaying our feeds ♥️", "1_number_jaat": "Saxy back dear", "harman_butari": "love u", "pratyush__shukla": "U really really really need to go gym ⛹️,, and get in good shape 🙌", "mihika_chauhan": "@prernarai_97 she is allergic to water like you. You get tablets for it, girl. 💪🏻", "inactiveuser3993": "Actually, there are people allergic to water! I read about it somewhere but I forgot the whole thing!", "scorpion_princess07": "It is the salt.... i get it too... tears, sweat, sea water everything...😣😣😣😣", "d.e.v.i.l_t.a.y.a.n": "😊😊 happy to see no vulgar comments....", "vimal.chaudhary.9": "Bikini 👙 don't suits you🤔", "keayadumra": "You’ve been such an inspiration! Lots of love.❤️❤️", "ravisharma1995": "Love u baby", "ketan.roy2012": "May be it's because of all those chemicals they use to purify the water!!Chlorine and what not!!", "milan_rai": "Well I am allergic to sunlight 🤦🏻‍♀️🙄", "mr.manojdas": "Hui ass 💋💋👌👌", "sparsh_gandhi": "@lovely_aryan8 ..", "thalarishankar": "super hot bum", "_beingevil_": "Anyway nice ass", "_b.h.a.v.e.s.h_": "Maybe your skin isn't nourished or something . Not a expert or anything . don't mind me lol 😂❤️", "gauriherself": "I am allergic to water too. Heya✋ @redheadwayfarer", "adityagurjar9": "Hot", "prince_9398": "Nice ❤", "realsubham": "Slaying @redheadwayfarer 🔥🔥🔥", "sparshpandey": "@redheadwayfarer It's Vagator not Vagatore !", "aatishsontakke": "💜💜beautiful 🌷🌷🌷", "anshita_17": "Hey.... I am one of ur fans... I still remember your 2017's new year resolution... Yes... Last year's 😂😂... Which said that u will work hard on ur thighs and stomach fat.... I must say that u really have somewhat reached your goals... But any ways.... I love the way you are girl... 😘❤️❤️", "anish_kumar_h": "Hope god heals your skin issues soon.", "vineetsr17": "Let the comment war begin #keepitup", "teejay_beatz": "Lovely! 😊😊 However, did you get the allergy checked. You might be allergic to the chlorine in pool rather than water itself. 🤔 Just saying.", "_itsybetsy_": "I remember that Icthyosis vulgaris post... ❤️", "avengers7777": "Nyc", "hansoloandsoami": "Youre perfect 👌🏻", "sanjanaaaasen": "Such an inspiration! In today’s dark society, you really need guts to post bold pictures with exceeding confidence, and what your definition of body goals is. The message that you spread, that loving your body is body goals, is mentality goals. I just love the way you are! I’ve seen many fake feminists , faking how progressive they are, but you seem to be so genuine! Do I really need to tell you how much I love you? ❤️🌸🦋 @redheadwayfarer", "hina_ameeer": "Like wise", "rituajwani": "Yesss!!! We are readyyy😍😍😍😍"}