{"sneha.rungta": "@redheadwayfarer you just wrote my mind, some part of it:)", "10.rohit": "Please girls boys ek Bar Jarur Pade ओर अपना विचार बताये.... #माताएं एवं #बहनें ध्यान से पढ़ें, अगर बुरा लगे तो माफ़ कीजियेगा  #लड़कियो के नग्न घूमने पर जो लोग या स्त्री ये कहते है की #कपडे नहीं सोच बदलो.... उन लोगो से मेरे कुछ प्रश्न है??? 1)हम #सोच क्यों बदले?? सोच बदलने की नौबत आखिर आ ही क्यों रही है??? आपने लोगो की सोच का #ठेका लिया है क्या?? 2) आप उन लड़कियो की सोच का #आकलन क्यों नहीं करते?? उसने क्या सोचकर ऐसे कपडे पहने की उसके स्तन पीठ जांघे इत्यादि सब दिखाई दे रहा है....इन कपड़ो के पीछे उसकी सोच क्या थी?? एक #निर्लज्ज लड़की चाहती है की पूरा पुरुष समाज उसे देखे,वही एक सभ्य लड़की बिलकुल पसंद नहीं करेगी की कोई उस देखे 3)अगर सोच बदलना ही है तो क्यों न हर बात को लेकर बदली जाए??? आपको कोई अपनी बीच वाली ऊँगली का इशारा करे तो आप उसे गलत मत मानिए......सोच बदलिये..वैसे भी ऊँगली में तो कोई बुराई नहीं होती....आपको कोई गाली बके तो उसे गाली मत मानिए...उसे प्रेम सूचक शब्द समझिये..... हत्या ,डकैती, चोरी, बलात्कार, आतंकवाद इत्यादि सबको लेकर सोच बदली जाये...सिर्फ नग्नता को लेकर ही क्यों???? 4) कुछ लड़किया कहती है कि हम क्या पहनेगे ये हम तय करेंगे....पुरुष नहीं..... जी बहुत अच्छी बात है.....आप ही तय करे....लेकिन हम पुरुष भी किस लड़की का सम्मान/मदद करेंगे ये भी हम तय करेंगे, स्त्रीया नहीं.... और हम किसी का सम्मान नहीं करेंगे इसका अर्थ ये नहीं कि हम उसका अपमान करेंगे 5)फिर कुछ विवेकहीन लड़किया कहती है कि हमें आज़ादी है अपनी ज़िन्दगी जीने की..... जी बिल्कुल आज़ादी है,ऐसी आज़ादी सबको मिले, व्यक्ति को चरस गंजा ड्रग्स ब्राउन शुगर लेने की आज़ादी हो,गाय भैंस का मांस खाने की आज़ादी हो,वैश्यालय खोलने की आज़ादी हो,पोर्न फ़िल्म बनाने की आज़ादी हो... हर तरफ से व्यक्ति को आज़ादी हो। 6)लड़को को संस्कारो का पाठ पढ़ाने वाला कुंठित स्त्री समुदाय क्या इस बात का उत्तर देगा की क्या भारतीय परम्परा में ये बात शोभा देती है की एक लड़की अपने भाई या पिता के आगे अपने निजी अंगो का प्रदर्शन बेशर्मी से करे??? क्या ये लड़किया पुरुषो को भाई/पिता की नज़र से देखती है ??? जब ये खुद पुरुषो को भाई/पिता की नज़र से नहीं देखती तो फिर खुद किस अधिकार से ये कहती है की \"हमें माँ/बहन की नज़र से देखो\" कौन सी माँ बहन अपने भाई बेटे के आगे ऐसे आदे कपड़े पहनती है??? भारत में तो ऐसा कभी नहीं होता था.... आपसे अनुरोध है कृपया भारतीय संस्कृति की रक्षा करें, आगे आपकी मर्जी....!.?", "lohori_": "So Fucking True ! 🙌🏻", "bhawini_bhardwaj": "I soooo deeply feel you 😔😔the worst part of all is that even young educated girls use \"madar/behn\"abuses and slangs without giving it a thought. Changes don't happen all of a sudden, but again.. every step towards it counts. 🌸 I'm proud of myself to never have used such abuses.", "emilymatthews0986": "All of us are waiting to see you topless", "peacexoom4": "Jiski okaat nhi hoti real life me voh ghr pr bethe bethe ese gaali bhonkte he social sites me jese bde don ho 😂", "chandu_7_1": "Sexy curves", "grizzly_icarus": "@swetaa_m", "zd_memon": "@redheadwayfarer like it will be interesting see .... like from madarjaat...to fatherjaat..same rhyming ..like teri maa ka bho...# ... tere paa ka bho..# see same rhyming.. by the way ur doing great job buddy salute...", "sahanamira": "@__.sanjuuu.__ Read the caption. We live in a wonderful society.", "sagarveer_parmar_official": "Itne kapde q pehne h? Wo b utar do", "earnestwriter": "@dampact", "entanglednerves": "I don't understand some of these fucktards who act \"moral police\" in India! They impose dress codes on women and the next thing they'd do is watch porn on their phones and either have one with a sex worker or go shag in their bathrooms and hit the sack. Sick!", "arnieroysjourney": "I know what she is saying is somewhat true but these days such lectures on fair treatment of girls have become so repetitive that hardly anyone reads the captions, I doubt if this is the photo, platform or place to address this issue...😕😕", "nikitall": "@raghav.sengupta", "the_warrior_breed": "Is @fatimasanashaikh ur sis @redheadwayfarer .... U both look like same . 😄😄😄😄😄😄😄😁😁", "gurdeep.kaur16": "👏👏👏👏", "kk.92_": "👏", "salonimausi": "Ye chaddi bhi kyo pehni", "hippyhappybyanjurani": "Wish India had a prime minister like with your guts and intelligence.....infact you would be perfect for the job 🙏🏻", "themoonstonegirl": "So rightly said!!! Never thought this way..! Hats off to your way of voicing out! All love and support ❤️", "guptakritika1602": "You write amazing!! Indeed mind blowing work! Each and every post seems so relatable! 🌟😍 Loads of love. ♥️", "notemptingusername": "This needs comprehension. This is perhaps related to women being subjected of docile behaviour. Patriarch and parochial mindset is prevalent in our society", "bhandaririshiofficial": "Damn hot", "snap_attack": "Problem is before we learnt how to behave in real we got the Internet", "ashiville": "Its so true about the hindi swears... I just realised that it's the same for women... Lol.. U shud now come up with man swears... And make a change.. We shall follow...", "dark__dad": "Beauty 😍", "_ravi_bhatt_": "@kaushikatinsta 😷😷😷😷😷😷", "raj_brahmania": "Loved ur pics n ur attitude...", "rahmankhan501": "Hi", "varsha_srinivas": "@zruthi", "chestharajvanshi": "Congrates.. we never use madar/bhen abuses.. we use bhaichod, tau ka poda , bhai ka loda , fatherchod ✌️ @purvi_up my baap bhai ki gali partner😎", "mr_taher_": "Are you made of copper or tellurium because you are cuTe 😉", "hansoloandsoami": "😍😍😍😍", "abdul_qadiir77": "Latii kha seh ho itni bc photo dalni h dalo itna bada lecture likhna jaruri h bss feminism ki popularity Leni bina baat ki publicity ksm seh bewakoof 🤣", "m_o_t_o_k_i_d_4_6": "Only women's compare themselves with man no other man compare with women or think they weak...when a girl gets in trouble in public only men's came forward to help no women even try to help or came forward...Only a women called a girl 'bitch' 'slut' etc. Only a women judge other by their clothes n all...you end your life by comparing yourself with men...everyone is better in their own way either it's a Man or a Woman......all your feminism is \"BULLSHIT\" instead of Shows you better by posting naked pic on social sites if you just work on yourself and improve it will be far better...else is just to get attention..nothing more", "nishhanntt": "Why your every post is about feminism", "amairalal9": "@sagarveer_parmar Will 'pity' those women who become ur wife or daughter.. Problem kisi ke kapdo mein ni, aapki gandi nazar mein hein", "_shivaaaaniii_": "Will u be my lady 😍", "_ishasingh": "I’m moved.", "pratxzy": "@sauranav you should read this.", "pooja.18970": "From now on try and avoid using the BC word. @mridulkanania", "sakkumyself": "You talk about each and every topic that need to be talked so badly ! Perfect perfect you 💕", "raviteja_9": "😍😍😍😍😍", "junejanatasha": "True", "spikerohan": "hot", "w_o_o_e_r": "Beautiful @the_perisher", "bhavyaaggarwal12": "❤️❤️❤️❤️❤️", "mridulkanania": "@pooja.18970", "an_ambitious_soul": "Ma'am, in the same line what I find insulting is when someone abuses saying *dick-head*. Shouldn't that also stop.??", "prajeshelar": "🎀⚡🌈", "poojavishwash": "You slayyyyyyyy.😍⚡", "fk4gpc": "Don't u know sometimes u r so wrong ..!!! Girls like to be abusive now a days.. what's for them ?", "syncslip": "What dimension is your conscious in?", "rohit8775": "@redheadwayfarer - Dekho beta aisa hai, ki ajkl even girls bhe maa behen ki he gaali bak rahi hai, pehle unko samjhao , mere hisab se tum bhe apne friends ke beech maa behen he krti hogi, ab baat yeh hai ki yeh Jo chala aaraha hai WO ek tarah ka trend hai, its good you took a step to change, but you know your conclusion are always one sided, U ONLY TRY TOO SHOW PEOPLE ONE SIDE OF REALITY, JUST TO COME IN LIME LIGHT, and yes is maa behen ki haan itni izzat bhe hai , ki agar koi kisi ko gaali bak bhe deta hai, toh kai kai baar toh in baato par murder bhe ho jaate hai, YEH KON BATAYEGA, Well I just want to say TRY TO SHOW BOTH SIDE OF PICTURES, STOP PLAYING POLITICAL propaganda HERE! GOOD LUCK😈", "runam.p": "Agreed. But what about the men who don't abuse women but adore them, love them , respect them be it their better half, sister, mother or any lady for that matter? With every post, shouldn't there be a post script mentioning that too? Yes, women in India need much more recognition than they get. Times have changed. They younger generation is much aware. Women are reaching peaks of success. That doesn't mean you give an universal statement directed to all men. This is not feminism. This is fascism. Not every male is a chauvinist. #food_for_thought", "gaurang_patel16": "Loved itt💙.. caption🤓", "jasonj1992": "Appreciate the good men that are out there once in a while. The portrayal of men in general is beyond limits.", "moon7lunar": "What a thought..... Hats off to your intelligence 💜💜", "aaarati": "@shraddha19more @iamshrey1720", "fast_guy5925": "All the feminazis can comment here 😂", "rituja_jagtap": "Caption.👍", "niveditha060": "U r ri8 absolutlyyyyyyyy", "iftikarislam": "I don't know about others but I do admire your thoughts and the way you present them.", "ar_kamalkumar": "Thankfully I use only one word... “f...k”. Well not supposed to be proud of Tht 😅. Atleast it doesn’t offend any gender.", "illustration_420": "@parthsarthii_ captionated", "rajeshraaz480": "O Gosh,, how deeply ur mind thinks about d negativities of this beautiful world in which such tongue of ppl slips about insulting a women only 🤔😶 really extravagant", "makrkapa": "No not all of these but sometimes for few I'll use the word SELFISH", "sherinkonghot_t": "So freaking true !", "nilakhilmahajan": "Great very true words", "coca_8368": "Bht khoooob 🙌💕", "about_miks": "I salute u girl... I can really really connect with the madar/bhen abuses, why nt menly words dragged into the same scenario. So it is like being a girl /women is like \" free ka thing, utha l abuse mai daal do, jisko jahan laga chipka daala.....\" We need to solve this tiny but soon gonna big hole in our mentality game.", "aditya.naman": "Being a women is tough, and they are so strong, men can never be that strong, Great respect for every women ❤", "_boi143": "Yr ab tum gandi pic upload kar rahi ho... @redheadwayfarer", "brewtress": "@vandanawadhwa yeah I read. You know I have thought about this so many times. Even tried to switch to baap/bhai. Hota hi nahi.", "sanjutechy": "Cant you wear any clothes.......showcase", "aamna_10036": "Inspiration ♥️", "reema21rathod": "This is so true @arzoobathla", "lovebonvoyage": "U looking So Alluring", "sadiyaaaaa__": "OMG.....i legit hate the fact that people around me do that.....i just wanna confront them right away every single time😡😒", "tamannah_sarmah": "@susy_lalrinkimi read the caption and the comments section.", "zala_mahima": "WOW ❤", "akshayraw": "I'm all in for women equality and stuff. But all these abusive words you're talking about, have evolved as an expression now. I don't think, when you say something like that, you actually want to sleep with that person's sister or mother. In present day world, I don't think it means something when you say bhench*d and stuff. They're just meaningless expression used just to abuse someone. Just Derogatory words, they are.", "star_world____": "Looking so beautiful", "aishnand_96": "Now that is something to think about isn't it . ..", "somyaistrying": "I prefer actual insults. Eg- \"I fart in your general direction!\"", "sourav_datz": "Gd one", "riyaz7085": "@mrinalinimahato yaappp u r right", "insto_punaws": "😍😍", "aayan_guha.ray": "beauty pic frnd…superbbb", "pavintheran3795": "Hai", "__hemapuri__": "Love", "simran_sharma1315": "U r just best...it takes so many courage to talk about such things👏👏👏......you go girl", "roshnitomar_": "@khatrimuskan19 caption!", "vaiishvii": "What the fuck how easily do you do this omggg I love love you 😭😭😩❤️❤️❤️❤️", "sagarjha9595": "Good concept ... and sorry because I done it too...and now I promised to me that I will never do this again.. and thanks for changing me.... now I'm waiting for your next post and hoping for a new change in me .", "sakshi_sarcasm_shukla": "🙌", "divya_bansal15": "@__kewal.chaddha__", "cokepiya": "👏", "syedwaseem_official": "It's hard to be your boyfriend", "gauravrathod367": "Aunty", "soni__sakshi": "Ohhh someone is sllaayiiingg in this picture @_divaa__ look at those hairs", "satya.k": "Also @redheadwayfarer woman were not given the right respect and position in society that they deserved. Hence the chauvinist mentality kept dominating and the abuses that came in to being are all directed towards disgracing a man. Eg: Mc Bc primarily you are insulting the man you want to insult right? Sometimes you don’t even know his sister or mother. But people still abuse cuz they want to hurt the person in front psychologically.. the actual thought of his sister or mother doesn’t impulsively come into the abuser’s mind. Slowly it shall change my friend..femininity shall gets it due without having the need to be masculinised to prove equality to the world 😇🙏🏻", "nehaldedhia": "Seriously, hate it when ppl use words like 'haath mein chudiyan pehen le' or call them a girl to insult guys", "arzoobathla": "@reema21rathod Read this! Never thought of it this way", "dailyearnings1996": "It looks like horny but...wont comment any faltu thing..", "mr_fickle_minded_": "Dude... Wtf.. terko apni pictures vi daalni hai.. Its ok... Par oske baad itne bhaade bhaade lecture tw mat diya kr... sahi h! When you are ugly but thn also you want popularity 😑", "meeraarora5653": "Whore", "fatimamasud95": "Everytime I am pissed off and say BC, it pisses me off even more. Why abuse someone’s sister everytime? You’re right the social conditioning is very strong.", "travelpandaonline": "Wow super 😘😘😘", "ashahidjkhan": "Haye. Heart feels this. Must change in the new generation", "singh.dilpreeet": "@yashchanne read the caption", "flawed_hrt": "For Your first question, my instant answer was the word WEAK. @redheadwayfarer", "zreyuuu_23": "@tejas316 @anni_1611 go through the caption", "priyanshirajjan3": "True", "aasthaa_raut": "Caption!!..😍", "prasadkelkar2805": "I don't think there is a word created to call a girl in worst perspective. Coz there is no such condition that exist that can call a girl worst. Girl or women they all are awesome in every aspect of life.", "kaushiki.srivastava_": "Inspiration you are!", "ferrerochelle98": "This. ♥️", "dishanandwanii": "I came up with a conclusion here is that world is other way round when it comes to abusing men . This was always a question for me about abusing. And this is almost true like I have seen men commenting other men with curses that are related to them. And I guess both as male and female in equality needs justice here. :-)", "swatikrish6306": "This is an eye opener", "mushy_muffin": "You're so right, more or less every insult moves around a woman. In every language. \"Son of a bitch\", \"motherfucker\" and so on. It's a sort of win for a person to humiliate other by bringing his mother in the conversation. Sickening", "theaullakh": "Awesome", "_amruuta": "Generally, men call each other \"pussies\" to insult a person whom they think is a coward or weak. Ironically pussies can push out an entire human being on its own and women have the balls to endure that pain whereas they use the term \"dick\" to insult a person whom they think is tough or a prick and ironically if you kick a man's dick he will fall on the ground, nearly to his death. Really wonder if they even think before using these terms. They want to look cool only to end up looking dumb as fuck. Men of this generation should really learn to use their brains instead of their egos. 😒", "meenakshijain215": "@choprasapna @meg__9", "priyanka_kintsugi": "Amazing👏👏", "basheeerz": "Soooo truuueeee", "vandanawadhwa": "@brewtress the caption 🤔", "hemanshikumar_": "@sashsinghh", "amritashukla_001": "The same thoughts i have been thought when i was in 8th standard..and me and my friend talked about this that why they say madar/bhen why not madar/bhai..afterwards we decided why don't we give these things back to themand now most probably when we abuse we call for bhai/baap/sasur things.. #titfortat and one more thing that whenever a boy cries in my group we say ladka hai islie ro ra hai..we kinda have changed us cuz we just know we will give them back.", "jelly_wanderer": "Words @redheadwayfarer <3", "swatikr.music": "Fucking true..", "a.window.pane": "Thought-striking 😧", "suman5143": "♥♥♥♥♥♥♥ @redheadwayfarer", "bing_sparks": "You know what i just saw Begum Jaan. Such a strong portrait of feminism. @balanvidya and her co-stars tought the real meaning of being a girl and now that i read this post! I feel you,me and all the WOMEN around. I salute women and i promise i will lesser the use of a women's abusive content. Let's teach men what they are supposed to be. Thank you so much! @redheadwayfarer you women are INSPIRING!", "ilovesohagkhan": "Nice", "kelly_graphics_": "MESSAGE ME FOR🎨🎨🎨ALBUM COVER🎨🎨🎨CARTOON VERSION OF YOURSELF🎨🎨🎨LOGO🎨🎨🎨🎨AND ALSO DONT FORGET MY WALL FOR COOL ARTWORKS😎💯🎨🎨🎨🎨💯💯💯💯💯💯", "apoorvaaaaa.__": "Caption❤️", "yashimabhatiaa": "@bruh_nauk caption!", "mayura.412": "Not really true! There are insults related to the male organ in Hindi , Marathi and English that I have heard boys calling each other.. and i have also heard women use mc/BC insults knowing what they mean.. some things like insults are wrong, gender has nothing to do with it", "25adi": "@shruti.khole didnt we talk about this ! 😓🤨", "charmingly10": "Preach", "ssharma911_": "Jis desh me 90 percent Hindi use hoti h wha caption English me likhe jaate h angerj chle gye language chod gye", "__a_b_h_i_n_a_v___": "Cute😍", "ranaut__": "You are beyond this world ⚓ ❤", "p_r_i_y_a__n_k_a_": "Caption on point...👌", "abdulqadeerkhanthaheem": "UFFFF UFFFF", "thedreamytale3": "Well that's true.. And terrible too!", "shetur23": "Dayummmm woman, I never thought it like this! So fucking true! Shit! Though I insult a man ( of course when it’s absolutely necessary) by calling him a dick, jerk, asshole or bastard! Lol seems mein andar se feminist hun 😁😁", "ihskas._": "@vaibhavmiholia caption!", "rajesh.ra777": "Well said ...appreciate it", "akankshatrvdi": "main upr ke limhe cmmnt pdh ri ti nd unme ye cmmnts jyada te ki is pic me kitni hotness h kya dikh ra jyada kya ni...but bht hi km logon ne caption pe cmmnt kia.....i mean ldkion ke bare me acha sochta hi kon h ...bs srf jb tk mnn bhlana ho tb tk ko chhodkr...... this is ridiculous...", "hritesh.mishra": "'Girl' is not the worst thing you can call someone. You must have heard about these things- 'Dogs', 'Perverts', 'A-holes', 'Pigs'.... These are words used to replace this word- 'Men'. It's not always a girl, it's not only about feminism but mindsets have to change for both the genders. To be honest I know people who use curt words for a girl but I have also seen how the whole masculine gender is shamed (I am not saying you're shaming anyone here). I couldn't think of the worst thing that could be said to someone. So it's not that every other man is alike. This isn't to prove you wrong. I am not prooving anything here. It's just that the worst thing you can say is what you really are from the inside.", "sushantsaklani_": "Almost true..bt the most I have heard a guy being abused is by being called a d*ck and and various other synonyms in hindi n other languages! Surprised it wasn't mentioned in the caption! Making a point is a good thing but can't be selective in stating the truth. @redheadwayfarer", "rudripanchariya": "@be.you.tiful_rani @sharayu.b @samradnyetaware @tanvishendge read the caption here.", "suryavanshikamakhya": "mujhe apki bate bahut achhi lagti h", "lpurty126": "Ya exactly ..", "sun5_1994": "This question girls should ask themselves. I've seen a lot of girls calling themselves feminist but in the name of mc/bc and all. I asked them this same question. In return I got reply 'Don't you dare to say that it's our choice'. This is so funny. Btw i don't think the 'gender' in abuses should be taken that seriously.", "_aanchal_adhaulya": "@abhishek_verma23 caption Ko pura pdho. Usme kisi ke liye hatred Ni h Mr", "paul_shrija": "Ohhhhh hottaayyy", "jhanvishroff": "They remember us when they are angry or in love , they love our bodies but when it comes to loving our mind they forget that we are allowed to do whatever we want. We are important to them in all the aspects , but when it comes to respecting us they forget that we stand the same as them.", "___rahul.nair___": "m jo comment kiya delete ni karunga but okk...... sry 4wt i said mujhe bath samj ahgaya i will chng my mind set", "shaluverman": "@__nee_raj read the caption", "theperfectlyconfused": "Preach. 🙌 Someone talking about things that I’ve always asked myself why it isn’t the other way around....the whole world has women stereotyped that even when we call each other bad terms out of anger, it’s about being a girl. Male privileges has men thinking that “being a pussy” is the ultimate insult where as “being a dick” isn’t even though it intents the same meaning.", "anukdichamodak": "Spoken too well❤", "eat_like_repeat": "Couldn't have said it better myself. It's quite fucked up I agree ☺️", "shufiinaaz": "I love you @redheadwayfarer", "danish_igm": "Pagal psycho idiot", "queen_of_monsters_nidhi": "Yessss this is what really is nd sometimes I’ve also heard when somebody talking if one says “Kya hua??? Second says ladka hua hai!!” They never said ladkii huii hai !! You’re so god damn right dii @redheadwayfarer", "beguiling_womaniyan": "So True This is one thing I contemplate upon hell like an insolent and though I use baap ' bhai ki Gaali, but this entire thing can't change only by me abusing or not using abuses based on maa. Behen. It has to stop altogether by all! 👌", "premoholic_": "I love u ❤", "mrinalinimahato": "Truth is being pussy is not an insult .. Atleast they are stronger than balls", "swechchha178": "♥️", "aashaysahai": "Being a girl or a woman is the ultimate blessing. Y'all are the truest definitions of strength and power. And to be honest, without women, men nothing - YEAH YOU READ THAT RIGHT. Our planet needs to believe that, the sooner it believes the better place it will become. Thanking y'all for your existence. :)"}