{"parmar.disha.19": "So truu", "ms.jolllyyy_17": "🔥🔥🔥🔥", "saishree19": "🙌🙌🙌💯", "vinita_1979": "Omggg i loooovvvveeee itttt🌸🌸🌸", "_namu__2002_": "Really I love it✌🏻", "heenamehta1312": "❤️👏👏", "jeonhem": "So True 😊❤️❤️", "kjchugh": "😍😍😍😍😍😍", "stalleyyyyyyy": "❤️❤️❤️❤️", "__purviii__2002": "Truly said dude it's totally correct ❤️❤️❤️", "krina_shah22": "@radhika_jasani @yashi152", "yashi152": "👌👌", "reneemariedias": "PREACH🙌🏼❤️❤️", "twinkle.galaa": "💕💕", "siligudi": "the second last line though 👌👌👌🙌", "cdubvbb": "Best ❤️🙈", "tanishkaa___": "PREACH AF👏🏻🌍", "_kookie_ash_": "Burns to all those dickheads.... 🔥🔥 🔥", "abbaniiii": "This is the best post I've ever read!!!!!", "_teertha_07": "Best one ..👍👍", "riyadaiya_": "PREACH ❤️❤️", "gyaneshwar_": "👌", "kusum_vanvari": "😍😍😍😍😍", "_nish29_": "❤️❤️❤️❤️", "sylvia.horta": "YOU GO GIRL!😘", "y_a_ss_hhh_": "This is such a strong post. A blow in the face of every ignorant fuck.", "palakmaru_": "😍😍😍", "dhadve_sakshi2000": "♥️😍", "jasmine.alappat": "This was what every man and woman in india needs to read. You are changing mindsets one post at a time. More power to you👏", "errorrrrrr____6": "🖤🖤", "khushi_kw009": "True Mam.... U said a real thing Wen my real days r going on👍👍👍😘😘😘😘😘", "juhiiii.y": "🙌❤️", "mahek.chomal": "❤️❤️❤️", "kunal_marathe__": "@theprojectamara", "anmol0618": "@devika0618", "prathikshabhojaraj": "I always admire for the greatest of the feminist you are. But certain things in this piece of writing regarding why we women aren't allowed to visit temples or cook our food is for the concern our elders show on us. My granny makes me do these stuff like not going to temples and makes me sit at a single place at home during the first three days of my periods every month. It is solely because she believes what her elders have taught her that 'a woman is required to rest for those days because of the impulse of amount of pain what she witnesses' and not because of the orthodox narrow mindset. The way our elders impose these onto us becomes important. Some ill-treat women like how you said and on the other hand someone like my granny 'takes care of me' . About entering temples, the reason is temples are built at places where there is concentration of positive energy which is directed normally (perpendicular with respect to the Earth) upwards and during our periods, the energy is our body is directed downwards. During menstruation, Vata is the predominant dosha. Apana vayu, one of the elemental air functions of the Vata Dosha, is responsible for the downward flow of menstruation. Therefore, any activity that interferes with this necessary downward flow of energy during menstruation should be avoided. During menstruation, women are more likely to absorb other energies in their environment. We tend to witness more cramps and intense pain because of this. This forms the basis of most of the cultural practices around menstruation in India. So this is the prime reason behind it. It all depends on how women are made to understand this. Some people have a very bad sense of treating us and that is the cause for such thoughts arising in us. I completely agree to you but the reason is only this as to why they don't allow us. It is for our own good. Just remind yourself to ask 'why' to them. 😊", "glamourandritz": "You are amazing", "pranithahaha": "Holy fuck", "swati_1401": "This is beyond amazing. Speechless.", "diyashah_": "This is amazing ❤️", "urjja_": "Damn right, u speak for every girl going through this , respect❤️", "___shuchi___": "@rewa.m @tvishaa_gala", "mishkatillu": "this is so good🔥", "tvishaa_gala": "@advaittj7 read. a girl hates it when anyone says that they are PMSing or even that word annoys us (no hard feelings).", "musicosaur": "YOU GAVE VOICE TO MY WORDS. YOU ACTUALLY WROTE MY HEART OUT. I LOVE YOU SALONI AND LOOK UP TO YOU. THANK YOU FOR EMPOWERING EACH OF US! @redheadwayfarer ❤", "adityachoukekar": "@gauri_gambre read her fucking captions", "gauri_gambre": "Preach @adityachoukekar", "rjt__verma": "Owsm..... Priceless lines ........", "aditii_kashyap": "@ashichaudhary45", "troll_anthammas_official": "U r life... U can do whateve wish to do... Nobody is dare to ask u... Just enjoy the every moment n make a wish...", "_manya_mm": "@queen__stalker_ please do read this. So amazing 😍", "irene.rova": "U r my inspiration... Love u lots", "ritukaur289": "Well said", "mallika._": "real", "_harshi_nialler_": "@_pooja_zquad_", "devina_sathe": "U r the one person in this world ...that no one can take ur place ...love u alot ....nd thanks for inspiration", "_jazmine.31_": "@bunny_insta92", "anupama09": "👏👏", "madalisha.tomar": "@__insta_pahadi", "abriellepoetry": "This is lovely. But I would like it a whole lot more if it wasn't as illiterate. Not insulting, it's just my opinion...sharing it because it might help.", "_sunaiina": "@mehakmaliik I'll check em out. For sure.", "mehakmaliik": "@_nainii I've read every single post of hers.", "varsha_pathare": "@deshpande_arpita @ishrutibhagwat @poorti_palshikar @shrutirpatil", "mayaranveer": "Woow.....i m inspiered....wat a epic thought......,.mmmmm gud bae", "vs31072014": "Very dirty bleeding, but I'm sure you are prego", "aparnadv_13": "Amazing. Proud to be a girl", "pareekshit_vashist": "👍true", "sajal_kohli26": "\"@chavi_kedia22", "chaaaaviiiii": "True @sajal_kohli26", "tej.inder": "The Indian society is messed up, I'm glad I grew up elsewhere and didn't have to face anything of those things.", "minakshigariya": "Respect 🙏🙏 and it really feels good that yes the re are some who think the same as me and vice versa 😄😄🤗🤗👌👌👌@redheadwayfarer you are just a star and i am day by day becoming a die hearted fan of your's .u r a star with the brightest light 🤗🤗and yes i am also a \"Proud Feminist GIRL \" 😍👍👍", "jvikaskataria": "\"For those 5 days, maybe you should keep your impure selves out of my kitchen, my temple, my work place & come back when you’re ready to accept my body\" EPIC. Absolutely EPIC thought. My respect.", "divisha.nanda": "though i'm just 15 years old but your words inspired me.. i salute your words.", "yeahiamkhushboo": "@ishalove8", "divina_anil": "For every 'man' out there", "_sheetalsharma_": "👌🏻🙌", "__neharafath__043": "👌👌👌👍👍👍👍", "hannaharya_01": "@anushka_24_", "thelifelover_anil": "Chillllll. Ignore the shit. 😂😂😂 do what ever u want to do.", "jerusha._": "Rd this. Its long but worth every word!!!👌👌👌 @saachika_28 @sharmasaloni0801", "_heart_leess_": "Hahhaha respect 👏👏", "saachika_28": "Wow this is really nice @jerusha_14", "megha__jhala": "@ektajhala", "ektajhala": "@megha__jhala @avisharma9 @purvi_borliya Must read", "ridamjhala": "Guy's @astha070 @chandelatanya @falgunichandela @neharathore22 @jaimansi_deora", "dijanaxristic": "RESPECT 👏👏", "lm_99_": "@_aida_diz @__b7___ @sevada_ahmetasevic @marija_0611 @sanja_begovic", "heratshah95": "Respect 👏👏👏👏👏👏", "poulami_2727": "Plz check my msg", "_nemirna_": "👌👌👏 @redheadwayfarer", "cobra0077": "Cheapest thing I ever c.... Pure feminism", "infinite_flame49": "🙌🙌🙌", "priyankabam8716": "🙋🙋🙋", "_m_o__o_n": "Caption👍👍👍😘😘😘", "vaishnavi_negi": "@shrutifrootie must read!!", "ranaut__": "Nailed it! ✌", "_tanu6000_": "Waoo clap 4 u❤❤", "hodzic_91": "Hahah fuuuuuj", "suman_rajak": "Wowwwwwwww must read", "sabhyawew": "You know the world really isn't as stupid as you think it is, and trust me man, a lot of us have better things to talk about than periods and blood and goddamn tampons and sanitary napkins, to be really honest lot of us boys just sit back and ride our melt, out of 1000, i think there might an anomaly whose head just zooms in that direction but come on man, its 21st century, don't target an entire gender community, social media has a lot of power and looking you up on google, you work in media, you have the power to influence mind so be a little a subtle about it.", "gloria_cihal": "👏👏❤", "bogicevic.298": "Respect for women ♥", "rashi_panicker": "well said.. 🙌💛", "iamtijothomas": "I haven't known a girl who have taken a step to say during my periods I will enter temple. In fact thy try to give justifications why it's right not to enter temple. Becoz there MOTHERS have taught them like that. Change the mindset of Mother. We will definitely get a great nation. Becoz she will teach her son and her daughter what is right", "nemond3": "@phernoob", "phernoob": "Que massa, Ju! @julia_msz para quem talvez goste: @alfacedourado @bea.mv23", "alfacedourado": "@phernoob simm, louderr", "sau_chavan": "Awsum..from heart of every single girl👐❤", "harpreet_k_official": "Alwayz be like this praise ,,,,for this .", "dhanashree.shah": "Superb 👌🏻", "manishhmittal": "Best", "shelindhra_das": "👌👌👌", "debs_devu": "Loved it.. . Hats offf", "hemanshusober": "@redheadwayfarer 🙏WoW -men", "shilanfayaz": "@kianna_zn", "melissalalla": "🙌", "artbyjodie": "🙌🏼I love this. I embrace this beautiful purification process every month. I use this time to honor my body and what it is doing for me. As a woman, I feel blessed to have this for myself. Your words are moving and a great reminder of why we should teach young girls to love everything about their bodies. Thank you.", "ankitadas_04": "Simply love it", "sharma_tannu": "@mesassy 👌", "_flawless_soul_": "Hats off❤ I love u girl ....", "loumarlowebooks": "Thank you.💛💛💛💛💛💛💛", "amyx.o.x": "Yes! @hannah_wiacek", "prriyanka6": "@subuu06 @ayushii31 Caption. ❤", "ayushii31": "@priiyankaa6 true 💖", "ria_s_16": "Nice caption", "susmita_patra_sb": "You touched my heart with these damn words @redheadwayfarer . Every girl must have a look at this post so that every girl out there is not isolated for those 5 days....love this post saloni", "_a._mani_": "Hats off to you saloni", "ps_06_19": "@humlayengechange", "mysiapaes": "@einsteinmenezes", "0jasvi_": "@paws_and_love she writes amazing stuff na", "prek_a_boo": "@paws_and_love .. 🤗", "mrymagra": "How lovely you are..", "hollyfae_art": "@namanarora20 dude. This isn't feminism. It's just being a woman! It also has nothing to do with sex (like your boner 🙄) every women has this every single month whether she is sexually active or not! It's a normal bodily function like digestion or sweating or even hair growth, but just because only women get it, and it has to do with blood, \"men\" -mostly pansy ones like yourself who can't take the sight of blood - freak out and condemn us to have to hide it. A better analogy would be if you started to grow your beard, and all women freaked out saying, \"that's nasty! You have to shave it when no one is around, how disgusting of you to let your stubble show! I'm going to vomit!\" THAT is an accurate analogy.", "73moons": "You are truly godly saloni di ! I love you ♥♥ @redheadwayfarer", "artbycolleentully": "Hell yes! Scream it! <3", "desi_wine": "Amazing ♥️", "sanskritiii_": "@palvaashaaa caption", "palvashasingh": "@sanskritiii_ oh my fucking god", "garamgulaabjamun": "@ashviii_ 1) Men are biologically stronger ( Scientifically proven), enabling them to have a better immune system. 2) women do have a better IQ than men( Agreed). 3) Women are fully equipped to carry that baby. They aren't doing anything against biological nature. And like seriously? Please. Pain is individual specific. You don't know how much of a pain a man can bear and i don't know how much of a pain women can.(Suggestions).4) Men are better investors that's why the investing industry is male dominated( sad. But true. Though not supporting it). 5) The creator of the Benz was a MAN. 6) and the final point. To everybody. @redheadwayfarer incase you haven't noticed. There is no s'he' without 'he' fe'male' without 'male'. Wo'men' without 'men'( literally speaking). Also. If you decide to ever let down your pseudo feministic propaganda. Feminism is equality. Not comparing both the genders. @ashviii_ clear?", "_aflaatoon_": "Sad.You are not allowed into holy places during your period. Not because you are impure but so that you could stay home and rest and may visit when you get rid of your pain. I agree talking about periods is treated as taboo but shit man! You just can't go on blaming it. 😑", "namanarora20": "This is pathetic. Not because of periods thing but because of the level of feminism you've crossed. I understand you're not ashamed of it but it is not even something to be proud of. I don't have a personal opinion on this that 'males are better or females are better' because it doesn't matter, both are equal. But the thing is I mean we don't post our boners. Please don't do stuff out of insecurity, it's all right to be a feminist, just don't make it vulgar, and by this I don't mean this post is vulgar, it's okay, you just don't need to post this. This thing doesn't deserve this much of efforts. I strongly condemn dominance of men but I also do not support feminism.", "himanishahaha": "@avaniparikh92 @eshah_20 the caption", "veestyleit": "👌🏻so on point! @himanishahaha @hiralvyas21", "taha_ahmed390": "this is not worth it😑😑😑", "sharanyamulpuri": "@sravani_cutee @chicken_pulihora @selfie.queen.forever", "courtninoshka": "Ua captions rock gal😘😘🙌😊@redheadwayfarer"}