{"sherowali_ki_fan": "Avi jb dhruptyagyi ka murdercase hua ue ashamed nhi feel ho raha he kuki vo ek man he to uske sath kuch bhi ho vo bhi to apni daughter ko safe krne k chkkr me mara.. Sab celebritty sale bhare k vo tattu ho jo bhed jhund me ghumte he", "sh_ivam2229": "Stop being selective each and every time", "guru_bhai_offical": "India desh h pure desh ko gali us shame ho raha h to bhaag ja yaha se pakistan", "asliayush": "#justiceforpriyankareddy", "rekhatawani": "Because of this Stupid actresses exposing men are not able to control their emoticons and becoming rapists", "dr__bhaskar": "@redheadwayfarer https://www.facebook.com/ModirunIndia/posts/1099406473532556", "dwivedi.juhi": "@redheadwayfarer don’t you think now INDIA need more than protection and candle march", "im_priyamsrivastava": "Oh u r lol", "joyhimanshu": "Shame on u for giving  dis rape case a religious color, justice shud be served for her whatever religion she belongs to...", "94diivya.jangiir_cpl": "What abt barpita & sasaram rape case....a Bangladeshi living here illegally, raped an Indian girl...kuchh to sharam uske liye b kro...bhagao mc bangladeshiyo ko...ni to secularism hi rh jayega..ye desh ni rhega", "rp.tavor_21": "@redheadwayfarer You all are angry ,as you should be and even all Indians are. But holding a piece of paper and writing \"Justice for Asifa\" won't break the ice. After a month, you and everyone else will forget her,unfortunately.Your struggle for her would be just limited to a few posts on social network,THATS IT!! You won't go to the court on every court hearing date asking justice for her. Would you??? Ofcourse not, you would be busy posting your photos and talking about feminism without doing any real work. This was a good opportunity for you to really help her but you WASTED it.", "the_warrior_breed": "Jisne rape kiya use fasi honi chahiye ..pr jo aap sab hindu or dev stan temple ka tag leke gum re ...bihar sasaram mein muslim ne hindu bachi ke sath kiya uske bare mein chup kyu ho.... Abhi tak investigation report bhi nhi aayi...temple mein koi proof ni mile.... Aapko log follow krte hai ...kuch bolne se pehle facts ko dekh liya kro pehle... Bhed chal mein 1 ne poster pr jo likha sab whi kr rhe hai....aapko court pr trust ni kya ... Pehle judgment ka wait to kro fast track mein ja ra case with in 5 6 month mein aajayega .... Jab muslims ne kashmir mein bacchi aurato ka rape kiya.. 20 20 ne 1 ka...or fir jinda kat diya unko ...100s mein hai unki ginti us ke bare mein kab poster pkdoge....mein kisi ko defend ni kr ra...jinse itna ganda kam kiya hai usko fasi ke alawa kuch manjoor nhi ...pr plz selective protest bhut khternak hai society ke liye.... Har rape victim ko insaf milna chahiye hindu ho muslim ho ya kisi or religion ka", "midsummerwind9": "....", "mr_beard_1": "Serial a actor,,,actress,,,nd bollywood k v tabhi neend se jagte hai jab media chahti hai...inlogo koi farq toh padta nhi...publicity k liye acting kar k chale jatey hai...Why only ashifa??? What about laxmi,,,saraswati nd many more??? Awaj nhi nikalti tab???", "moha_65432": "Ghanta...Hindustan is not ashamed...N u double standard ppl if we call india Hindustan on normal days u hve problem in it...N now in rape case u r mentioning India as Hindustan...Great double standard mam...N @redheadwayfarer I was ur fan since frm MTV Girls on Top bt now I m no more fan of yours..Good bye n get well soon n know the fact of the case corrected...I was, I am and I always will be proud Hindustani, proud Hindu and proud Humanbeing...", "pranav_dagli": "@jhalli_nalli", "omkarsingh777": "Never seen a feminist having selective approach on rapes...keep your placard blaming religion....totally disturbed @redheadwayfarer", "vartika_mehta": "ab toh hata do didi 😒 she wasn't rape.. make a new banner and then post something", "indro_169": "😥😥😥😢😢😢😢", "world2713": "@prashantkumary asshole your comment is shit just like you face", "btownreviewer": "Go girl!! This is a time for all of humanity to band together and fight for justice and change - we need to raise our voices to affect change - Indian or not, Aasifa's story hits all of humanity! If you have a voice, influence or position of power - please speak up - use your voice . #prayerforaasifa #timeforhange #standup #useyourvoice", "vishal_nirmal1": "😢😢😢", "__merc_with_a_mouth___": "Even you following fake news 😂😂", "tinderranchi": "In India people are like if you want something which is indeed hard to get, RAPE", "winter.kys": "Nothing worse than collective guilt. This is not the way to ask for justice.", "thatredphoenix": "Ignore the trolls. These are BJP it cell folks and they've been trolling whoever threatens their position for years now.", "shekhaar_vorra": "Modern punishment which will be painful and agonizing— in front of the whole nation chopped off their penis and one arm and let them live — so then the suffering will remind them for the rest of their life and after that they will ask for death but death is not the solution for them they have to live their life without the arm and the penis till they die —", "arya.neha.1": "You should not write any such news for which you are not sure about. And yes! We are Indian not hindustan, atleast spread some good mesage to society. And dis new about rape is fake made by politicians . You wil get to know soon! But the thing is you don’t deserve to be followed by me😊", "ca_ch_et": "Don't write Hindustan, write India. It's logically wrong to call it Hindustan coz of its diversity. 'Hindustan' supports some kind of religion discrimination. Whole India is ashamed. 'hindustan' suggests that Hindus should be ashamed. It's our country and we are spoiling its dignity by doing all this. We all are equal irrespective of gender, religion, caste etc. We all belong to this land. That's why i love to call it BHARAT or INDIA.", "meenalvivekbanerjee": "Here we are asking justice for Asifa & there in Surat one more rape happened of 9yrs old girl.... we all need to do something about it..", "sagarika_sengupta": "I don't know what the rest are thinking. But i feel this case is purely politics. All those bustards involved, did this for their personal grudge. That fucking Hindu Muslim barrier. I might be wrong. But, I don't know, I feel that way.", "komalishq78": "awsm", "bumba_94": "Stfu go back to your kitchen", "averageteenager.x": "What is Religion when there’s No Humanity? This left me in tears truly. What was the 8 year old’s fault? That she was a Muslim? Completely not. HANG THE RAPISTS. I am Hindustan and I’m Ashamed. #justiceforasifa", "rohitthakur123456": "Wonder how many protest for ISIS sex slaves and rape in the name of Islamic Jihadi .. many mullahs gang rape cut girls into pieces burn alive .. no voice against them .. Rapist should be Hanged to death be it any one.. but there's a cowardly selective approach and selective outrage in our sold out Bollywood and opportunistic Media .. wonder how many Hindu Girl childs are Gang raped by mullahs in masjid and where not .. but never saw a single protest as such cuz fatwa lag jaega n beheading kr Dega mullah log .. have guts then protest for all .. Justice for every girl child irrespective of religion of the victims", "shreyaa.1602": "I mean the same... I feel the same things which all of us do... #mayhersoulrestinpeace🙏 #justiceforasifa", "ishi_rawat_": "👌👌", "prashantkumary": "You bitch. Prostitution industry. Rand", "impriyankasharma01": "😢😢😢", "austin_cameron_shihtzu2012": "Thank you for being brave and standing for Asifa, cause we are human beings. We need more people brave like you.", "sadiyaaaaa__": "This is so disgusting. This kills me from inside. #justiceforasifa", "twilight_mess": "We need justice .... Need laws to be reformed and our govt to do .smthg", "memiss__eye": "#justiceforasifa", "attitude_nishu_": "Bilkul", "sidharth__oo7": "आसिफ़ा को न्याय मिलना चाहिए बच्चा चाहे दुश्मन का ही क्यों न हो बच्चा केवल बच्चा ही होता है लेकिन जो लोग आसिफ़ा को लेकर हिन्दुओ को नीचा दिखाने की कोशिश कर रहें हैं उनको बिहार सासाराम की उस 6 साल की बच्ची की चीखों को ज़रूर याद कर लेना चाहिए जिसके लिए कोई मीडिया trp की रोटियां सेंकने नही पहुंचा ना ही किसी साहित्यकार ने साहित्य पुरस्कार लौटाए क्यों भई .... किसलिए ये दोगला पन क्या घाटी में रहने वाले मुसलमानों के बच्चे ही मासूम होते हैं बाकी भारतीयों के बच्चियां भेड़ बकरियां होती हैं, घटना बहुत शर्मनाक है आरोपियों को सजा अवश्य मिलनी चाहिए लेकिन इसका ये मतलब नही हम औवेसी जैसे कुत्ते को अपने ऊपर थूकने का मौका दे दें", "heyprabhu_": "This is what I am exactly feeling right now.", "_the_notorious_needle": "1st change our fucking laws........... Then cut & kiLLLLLLL that bldy bitches", "heenajiki": "Don't u think k hamri filmo mien itna sab kuch dikhaya jata h k ye rapist banana hua unko provoke kiya jata h.ek bhi film mien normal romence nahi h .khule aam porn jaisi movies ban ri h", "boris_707": "@redheadwayfarer you have the followers and influence. Please organise a movement/protest against the issue. Which will actually make a difference. If you can organise as such I'll join you'll for sure.", "cb_queen_": "Reh gayi fir ek baar akeli, Is jalim duniya me Jaha deviyo ke desh me hota hai tamasa.. Bachpan me kehte hai gudiya, Or badi ho kar use se hi khel te hai, Jaha deviyo ke desh me hota hai tamasa.. Jau kaha khabr nahi, Sab chehre juthe hai yaha Jaha deviyo ke desh me hota hai tamasa.. Han rehti hu parde me, Har sam meri hi koi behan ka shwabhiman lut jata hai Jaha deviyo ke desh me hota hai tamasa.. Papa ki ladli thi me Aaj hu jinda lass me Jaha deviyo ke desh me hota hai tamasa.. #justiceforashifa", "bailey_4650": "exactly! we all need to start being sensible. regardless of what religion we maybe were humans first. one day it might be me or you and we should try our best to stop such disgusting crimes.", "siiiimmmssss": "#justiceforasifa 💔", "vaislek_kavi": "ख़ामोश रब..! उठाकर मुझको सम्मान से जो तेरी दर पर लाए थे तेरे ही बंदे थे शायद क्या तुमने ही भेजे थे बेहोशी की दवा मुझे पर तू कैसे बेहोश हुआ इस बेहोशी की हालत में कैसे करती तुझसे मैं दुआ  तेरी आंखों के सामने ही सब घट रही कहानी थी क्या तू भी उनमें शामिल था जो देखने की ना ठानी थी  खून के आंसू रोया हर पत्थर सर से जो टकराया था खूबसूरत मूरत होकर भी तू खामोशी से पेश आया था  सुनकर चीख मेरी कठुआ की गूंज उठी हर चोटी थी क्या इसी बात की सजा मुझे के अल्लाह की मैं बेटी थी... -कवी वैसलेक", "dystopian_renegade": "Again... Humanity is given a second chance because of people who do good.. Like you! And every single one of u out there getting. Scared of ur sister or your daughter in the future meeting the same fate.. Let's do something.. I think castrating these Fucking bozos is the best thing.. How bout we make them famous and let the people do what they want to!!! Show their pics who did it.. And let people do the rest of the work!", "x1988ra": "Ni milega usko justice kyu ki india h na india m koi janwar ko Madre to jldi saza hogi but koi lrki ka rape murder krde usko nhi hogi bcz india h na ....... india me ase lgo k khula ghumne ki azadi di jati h jati wo fir s kisi or lrki ko ase hi kre or saza to hogi nhi pta h india k rules", "kabir.jangid": "We want justic", "anurag_wta": "aise log ko jeene ka haq nhi hai...taang do faasi pe", "araag___": "@redheadwayfarer who the hell said you this nonsense of raped. In medical report doctor clearly said she haven't been raped it's murder case and there are daily 319 cases are filed of raped it's a shame to us but please don't post fake news as the character of her is gone more worst and in Indian law it's clearly says irrespective of sex you can't show or write his/her name of raped victims.", "dhritianandlal": "Trying to take a stand because if not now then when would we stand up against the wrong.", "aneesh_angadi": "@redheadwayfarer you can for sure stand for justice . Knowing that the poor little angel was killed , but how was she actually killed , was she actually raped .. how can you be so sure . Do you have the FIR report with you ?? Do you have access to the postmortem report . Tell me honestly on what basis have you hastaged rape .. prove it to us that she was raped. Then fucking post a placard .. else don't feed of it .", "singh.anutosh": "Tumi khanki", "pooja_samundre": "Thank you u talk about it 👍 dis is a time eveny person should take a step to stop all dis shit !! Wakeup youth", "ajeetsinghjaipur": "सृष्टिस्थितिविनाशानां शक्तिभूते सनातनि । गुणाश्रये गुणमये नारायणि नमोऽस्तु ते ॥", "sushmitaaaaaaaaaaaaaaaa": "Clicking a pic with this wont change anything go to a advocate instead to sue the morons to the court nd sentenced them to death if i had money i would surely do dat but i dont have so much money", "mahimishra2893": "Justice for aasifa", "poungkiam": "Justice for Asifa", "kminu13": "#justiceforasifa🙏", "hansajeswani": "#justiceforthechild", "syed_yawar_786_": "#justice~~ so that next time no1 can ever think such a worst creepy thing", "drsoumyashrivastava": "M heart is aching reading about it.", "patel.kinjal94": "@redheadwayfarer for the very first time I support you 👍🏻", "sharmarucha14": "So people are against and protesting for safeguarding bastards just bcoz they are hindus ... what the fuck dont they see that they have committed this sin in their temple (place doesn't matter) but if they are so religious and so the proud hindus they should themselves punish those dumbass its high time that we should not be proud of our country bt start changing something in society at our level so that we can say we are proud of our humanity..... A girl is a girl is a human is a daughter a mother a sister a friend a wife and all of them deserves dignity and freedom of living... indian cinema has from time to time contributed so much for uplifting and changing attitudes but it fails to go deep down from where the muck comes. Calling a son to fulfill his lust with an 8 yr old child is not that any religion would support and if this is what they think is Hinduism they are living in fools paradise..... bt a lesson needs to be given to them .. and police officers they are supposed to be protecting us and look .... got so much to say bt no words 😶", "i_am_ubi": ":(", "juliedesai": "Waiting for this only☝ thank u for writing this 👊", "anzashaz": "#justiceforasifa 💔", "saurav_aswal": "Tum log sirf social media me hi protest kroge agr krna hi hai to bahari duniya m aao asal jindgi m aao tb kro protest pic daal ke insaaf thodi milega us bachi ko", "aman.___choudhary7497": "A rapist is rapist. And no matter if a girl is Hindu or Muslim she is daughter of India.", "ankitsharma3268": "Fuck goverment", "f.e.r.v.e.n.t._.g.i.s.t": "This..is..rugged..down.diplomatic.. Society.. Where..people..do.worship goddesses .. BT. Feel..no..shame..in..ripping.. Off .her..dignity...in..each..form.. Of. Mortal..females", "that_white_raven": "You are right every time something like this happens something inside each of us dies and as much as i want to talk about it as much as words don't come out of my mouth. We have a long way to go before we make it safe for our \"female children\" let alone teens and adults.", "tani1524": "😫😫😭😭 loss of words... Exactly d same... I don't know what to say on this...", "abhi_panicker": "@athira_emmanuel @russel_sproutz This. Also this chick posts some amazing shit about feminism and stuff in general", "neelu_sharma112": "Ab isshe jada kya bura hoga yr...😢i dnt knw ki kiss trha ka dil hota h ase logo ka apni satisfaction ek bachi s puri ker rhe h yr ....or bi jgha h jha satisfaction dene k liye hoti h ladkiya likn ek bachi p issh trha kiya uske sth my god😢i dnt knw ki bgwan h ya ni but yhe jo hua ab asa lg rha ki bgwan ni h 😢itna bura ek chooti si bachi thi usse abi pta bi ni hoga ki kya ho rha mere sth yhe sb😢😢😢😢", "_raghavkhushboo_": "@sofiaali537 religion is being blamed because 1) it was done by some Hindus In a temple( i mean that's so fucking horrible) 2)when a fir was filed against them many people of the same 'religion' protested saying that the police is not understanding their religious sentiments.", "thedevilindeed": "@narendramodi", "insanely_desi": "Celebs with hashtags ain't gonna fix it now is it you Bollywood actresses just wanna join the \" trend \" you guys all post but it benefits no one and y'all get more attention out of it too smh", "miniatureamazon": "@mishnnilla 😢", "j_barot123": "Ask for justice for those 1000’s of hindu kashmiri pandit girls. N then we can talk abt this one case", "moloybhowmick2015": "I ashmed of this shameful act ....but I can see your hypocrisy....why did mention hindu religion here....? When hindu girls were raped in Assam and Kashmir have u ever said that those muslims cowrds did that shameful act...no you didn't...and that's called double standard... don't use religion here....I also want justice for asifa....the culprit should be hanged till death....", "kunal____gupta": "Saloni I am sick of such weird and creepy people who can even think of doing such things.. #kathua", "thesoul_onwheels": "@redheadwayfarer and you're all busy the evening in an event with drinks, living away a fancy life. And YES, IT MATTERS, cause even the ones with large following (\" influential \") can lead up a protest or movement that can shake up the system. But the truth - naah, that won't t happen. Why cause the events we have are always more than the protests, we participated. In real. We don't deserve it, cause we don't act worthy enough ourselves.", "high_on_candy": "The fact that people do stuff like this in the name of God is blasphemous and disgusting. No God of mine or any good religion would ever want something so vile and atrocious done in their name. Its sickening.", "aasshhiiqq_": "✔", "suuu_it.is": "I respect ur words.. U always thinks beyond my thoughts and gives m a new level to thinks.. Thnk u for such amazing thoughts ❤️ @redheadwayfarer", "wan4_xch": "This is why I don't want to be an indian, all these things puts me to shame", "amanyadav11099": "@redheadwayfarer i think this is very henious act which is shameful and intolerable foh us.But u can't blame and target on any specificReligion #hinduism. the society is ashamed not Hindustan.Plzz... don't make any misconception about Ourmost Divine and holy Place.", "djboydeep": "❤️", "pixxatron": "RIP Humanity! 🙂", "karanbirpartapgogna": "I feel like saying something about this on social media right now but tbh i am so ashamed and so afraid of india's reputation.. I have a lot of friends from other countries.. I wish I could hear positive and good news from India, this often. Can't tell if this is going to stop😢", "_dini_sha_": "And wont change nw as well", "syed_shawana_gilani": "YOU KNOW WHERE THIS SOCIETY IS GOING .... i feel sometimes ... its better to kill girls ... 😢😢 either .... genocide is best .... our parents should teach these little children to fight literally ... no punishment still ...... they wont be hanged .... when Damini rape happened .... no one gives a shit .... after tht ... rapes were like .... hr din ki baat hai .... who cares .... n still ... n i hope meri yeh baat galat ho jaaye --\"i know it will prevail more n more \" .... even hashtags wont do anything .... 😢", "upasana_koul": "We want Justice for asifa 💔💔💔"}