{"i_yshak": "I wish u had bigger boobs", "avjitbose": "@redheadwayfarer aap zaroor mu mein leti hogi, apke hoth bataa raha hain woh sach 😇", "abhirajsiingh": "hizdi lgti h tu", "trishayadu": "She is such a bold girl man! Inspired her! Never seen anything like this on Instagram or any social media where people have come out like this! Well appreciated. @shivaniiiyadav", "candycanemissyalien": "Edr h ye....esk hi th nudes dek k h mene....with blck nippl", "tonudas7003": "Sexy figr too hott", "thestarstruckchase": "❤️❤️", "yelika___": "@ranaashwina", "umair.s57": "So Sweet Boob And Body", "aasthadhasmana": "I cried. ❤️", "who_aakash_kuntal": "I just read all the comments and I was like what the hell is going on? Just because you have right to speak doesn't mean you use these disgusting words for someone and before commenting you should see yourself where you belong. 😔😔 What's wrong with India change your mentality guys, you really need it. And nobody is asking you to see her posts so if you guys have that much problem then don't watch her posts.", "javidsalif": "Hot sexy body", "divyakshi__": "Thank you for the caption❤", "div_daryani": "Thank-you for the caption. And thank-you for spreading so much positivity !!! Love x", "bhaviishaaa": "@redheadwayfarer omg I just love u ma'am .....your thinking is amazing. The way u look at the world is something that everyone should know n understand. I'm inspired ❤️❤️. Keep breaking these stupid mindsets and stereotypes of this world . N specially girls really need to understand that they should love themselves regardless of their looks . Sending loads of love for u from the bottom of my heart ❤️❤️", "satish_kargwal": "Apni nigahon👀 se na dekho kudh👰 ko heera💎 b tuje patthar 🗿 lage ga... Sab🤔 kahte honge ki chand☪️ ka tukda h tu.... ❌ Meri nazar👀 se dekh chand b tera tukda🌙 lage ga 😘😍🌷🤝💝. 🤔🤔 beautiful smile🤔🤔👀👀cute 👀👀👰👰princess👰👰🤔🤔 beautiful smile🤔🤔👀👀cute 👀👀👰👰princess👰👰👗👗nice👗👗🤳🤳selfie star🤳🤳👌👌👌👌👌 awesome👌👌👌👌😄😄so sweet😄😄 Gorgeous🤗🤗lovely🤗🤗❤️❤️queen❤️❤️heart tuching❤️❤️❤️❤️❤️😍😍😍😍😍😍 beautiful hair😍😍😍😘😘😘😘😘😘😘😘😘💔💔💔💔🔥🔥killer🔥🔥🌷🌷like u🌷🌷🤝🤝 🤝🤝 looking fabulous👍1ਪੀਸ ਬਣਾਇਆ ਰੱਬ ਨੇ, ਉਹ ਵੀ ਪੂਰਾ ‪kaim‬ 👸👸", "nazil_khan__": "So hot🔥", "loverboy1175": "🔥🔥34\"🔥28\"🔥🔥🍌🍌", "a_s_h_w_i_n123": "So sexy😍😍😍😍", "om_ishaaa": "Motapa", "rockysir1818": "Any one said hwz u so much hot", "charlieadimani": "I can licking your navel", "sushil_gupta5996": "Wonderful sexyyy figure👅👅👅👅", "imtyaz2711": "Sexy. Man😄😄😄🌹", "anita_sapkotaa": "I wonder how much u score marks in free writing?! May be full marks😎 #love fromnepal 😇", "emilymatthews0986": "👅👅👅", "manushribhat": "You are beautiful", "bollywoodhotnss": "I tk u 3month pregnant", "anuprikachu": "I wish every girl should read and most importantly realise this:') I've been through the phase...every single day waking up and hated seeing myself...and just wanted to be loved...i realised how selflove is important...and thankyou soo much @redheadwayfarer for all your writings...these are inspiring many...daily...LOVE❤ your fan💕", "boho_gram": "Beautiful.", "aastha_kaurrr": "@_.stubborn_heart._", "deepteshghosh_": "Ohhhh too sexy🔥👌", "sakkumyself": "Self love is the only thing you teach us 😍👌 being comfortable in your body is the best precious gift ❤ luvyaaa mam !😇", "rajkumar007kingmaker": "Most ravishing Beauty and astonishingly charming", "eduardovillarrealw": "Fea", "thehyderabadii": "Could self-love help in forming an idea to shun the society driven selection of attire for women. What about giving preference to women's choosing? @redheadwayfarer", "himali14": "@anujb2910 read the full thing.", "im_priyamsrivastava": "Nice", "divya.damodar": "Literally so beautiful! Totally agree with you 100% ❤️ Stay awesome and keep slaying!", "raynabiswas": "You look soo gorgeous!!!! I am soo jealous of your beautiful body 💜", "rajputvarsha8": "Caption n you❤️😘", "he.llo5280": "❤♥", "saanjh_gidwani": "Jusssst wow waale words😘", "samikhan_alfathan": "Fuck", "manasi_shirke": "@sthitaaa caption is everything", "j__kayyy": "@_mockingjay07_", "_the__demon_kid__": "Fat", "gurveerxo": "❤❤❤ thank you for this 😘", "arif_masani_": "I felt almost vomiting wen i saw her picture", "sonalv3": "you rock ❤️", "watchurstyle": "Bingo the sexyy nice cuts", "the_obstinate_grl": "@redheadwayfarer M amazed how can you write this much....bcz it's obvious it's not copy paste...", "tan_phadke29": "❤", "bibikagurung": "❤❤❤❤❤❤❤❤❤❤", "bikiwigg": "sexyy", "naqvi_sarah\nVerified": "Verified", "xtaylish_asif": "So sexyyy yummy", "secretlyworst": "Definitely there is a improve body😉😉", "raia___": "Looking absolutely gorgeous!", "_tashaag_": "I love you @redheadwayfarer 😭😭😭", "tahzeeebb": "Beautiful post but I still feel bloated & ugly. Thanks for this anyway.", "mayur.maral": "Looking so sexy boobs 💋💋💋💋", "witty_wild_hurricane_": "Gorgeous", "monikapatelvishnaram": "Helo", "jshree1994": "Just what I wanted to read . Thank u so much.💗", "tejaswinidivyanaik": "Thank you so much. I really needed this. Especially today, especially right now, when I am being constantly reminded by my own father, who almost made me cry and leave all that I was and am eating, because of whom I’ve left eating dinners since past four nights, lessened my breakfast and lunch. I am getting back into that ugly pattern of starving myself, something that I used to do in college and I don’t know how not to.", "abhishek_bitolia": "Motu 😍😘", "adwuti": "I really want to repost this, because i find it very very inspirational. Hope me reposting it won't be a problem. Plus thank you for being such a positive person and motivating many people.", "krantimalviya55": "ppp", "camara3818": "Cute", "alastair_crowley99": "Don't mind me saying this, but I would really had loved to see you in a booty pose @redheadwayfarer", "the_sonali_singh": "Didi pet bahar aa rha hai gym karo", "prince_charming029": "looking very cute", "amataboban": "Lurve this post 😍", "krishna_rathi2608": "@riyaagarwal1904", "pc.11": "The good piece for today!!", "cybs_01": "love this😍", "rituajwani": "Oh man!! You know I love you and your writings.. you always made me feel so special with your writings.. This is what we have to understand.. we should love ourself❤ Thank you for this post love❤😘", "kashyap8865": "hottttttt sexy🔥🔥🔥🔥", "official_rajbirsingh": "Cool", "koulakhil": "❤️❤️❤️❤️❤️", "jashansandhu8": "That caption is the best consoling thing in the world", "gourvw": "U r really very cute😍😍😍😍😍 i love u @redheadwayfarer", "world_backpacker_love": "@kaushiki.srivastava_ Ths 1 IS TOO GOOD.BEAUTIFULL", "merlin._.mathew": "Beautiful................❤ #Inspiration @redheadwayfarer", "anikate_monish": "Beautiful and stunning", "vjay_jay___": "@ajantahazarika", "meraki_vim_": "Beautiful and inspiring.. stay blessed and keep shining", "aditi_subhadarshini": "That's really inspiring that you just wrote you honest feelings, which is actually true. It was never a cake walk and it never will be. Heck it will even make you avoid 🍰. Let's just try to do the hard the hard thing as even hard things can be fun. Thanks @redheadwayfarer. Keep writing 💝", "suban3520": "I like last pic looking so cute @redheadwayfarer", "akziev": "Love, just another girl. 💛", "__cherrryyyy__": "💙", "deva.shukla": "Such a chic", "yashika.in": "Your writng, honestly made me feel a little better about myself as im going through my \"wow youre ugly' phase again :)", "ketanshah555": "Lovely gorgeous", "simranbhatia111": "Wow! You inspire me and thousand others each day, every day ❤", "iamsunilpandey": "Superb words 👌❤️ I can completely relate to this (not the girly stuffs)", "madam_eats_a_lot": "Gurrlll ! You is Pretaayyy 😍😍😘😘😘", "shilpiliciouss": "Every single word is true!", "fieryjalapeno": "That's a lovely bikini, looking awesome!", "yashshree_1108": "Each and every word means a lot.♥️", "saee3012": "This is beautiful! More power to you😘😘", "dharmin_3939": "Bhabhi jii 😂", "harshita_ahuja_": "I love you.", "srv_luv": "Is the water so clear or Photoshopped", "shumayashaikh14": "Love your body", "chirag760": "M ur big fan", "drawat38": "Lady Dabang", "vaibhavi_sawant": "Love love love 😍", "priyavarrier6667": "U are very chubby but cute one", "mili_bardia": "Beautiful pictures and well written ❤", "saakshimaurya": "@srishtinegi_", "nikkitaxs": "Very pretty💕", "__.niiviiii.__": "Damn. Words. 🔥💫", "p.a.l.a.k_._": "Damn i love how u express my thoughts 💥", "dhwaneeprithiani": "I’m so proud of you❤️ Respect❤️", "i_m_abhijeetavi": "Sexyy😋😋😋", "akky.aakash90": "Baby mote ho gaye aap", "cornerpen": "I love you. ♥️♥️♥️", "shar_kriti": "Much love for the caption", "thekevinjoe": "@veera_patil", "silhouettteiiee": "You are beautiful in your own way❤❤❤ love you 😊😊", "rushika_gajway": "❤️❤️", "robeagarwal": "Your so beautiful in the world", "_shreshtha_oberoi_": "I can't write in words how this inspired me for rest of my life. Loads of love.", "kshumit_malla": "Lukin NYC", "ohana__m33": "Lady, u r such an inspiration 😘", "akhandpratapsinghgaharwar": "U look suppa cute..big fan....😙", "sushantsaklani_": "I believe self-love has mostly become an excuse to be lazy and is looked as an option to not get up and work for a better, fitter body instead!", "harsh.was.here": "tu to moti hogayi😐", "pompous_puchka": "So true. I used to hate myself for being fat. All my friends and family would constantly pester me to lose a few kilos. But now I know how to love myself and accept how I am and how I look and not care what others think of me. I tried explaining that to my doc, but that body shamer kept saying how unhealthy it is, and I said 'you know what's unhealthy doc? Your mind. You're just like the rest of them'. I feel so empowered and happy now, though heavily diabetic and there's this high blood pressure thing, but whatever man, I got self love on my side. 🤘😎", "gurleen__13": "❤❤❤💞", "anindita.mukherjee96": "Since, after your show on MTV I started following you, believe me, I love reading your post. Each and every single day you motivate me. You are an inspiration. You are indeed so so beautiful inside out. That's so important. Learn to love and accept yourself and every one will love you. Love you loads @redheadwayfarer", "m.b.adil": "Oh my god... 😍😵😂 fat girls....🙊🙊 I won't say anything otherwise except saloni everyone vl offend", "bongfeed_": "🔥", "ishitasingharoy": "@riya.ghosh.94402343 @priya_pathak_993 @nisshka @sonai_paul @paramitabhattercherjee", "harshita.panthi": "That tan 😍😍🌝", "taani1502": "❤️❤️❤️❤️", "dorabhowmik": "Wow... Big fan of urs❤", "priety.c": "I totally agree with all the points you have written above. I too look fat when I wear a pair of jeans or a one piece. Everyone used to make fun of my body shape. My relatives always forced me to wear salwar only. But now I really don't care what other people think about me. I know what I am and i love myself for what I am and for how I look. #Discrimination_by_anyone_ is_not_acceptable.", "rakib.mirza": "sexxxy", "rajdolee": "36..24...36 ur figure", "allthoseflaws_": "I love you. I hope you know how amazing you, your heart, your body and your state of mind is. ❤", "day_dreamer012": "💙💙💚💚❤", "shweta_1806": "I love you saloni😘😊", "ujwala_poala": "🙌🙌🙌👏👏👏👏#preach.... YESSS.... so true this is a very hard reality that everyone tend to ignore.... nope not talking about the whole zero size figure part.... but talking about one’s health, loving yourself setting some really hard realities.... Seriously these should be kinda inculcated in parents first.... where they are so conscious about their children.... and there are very few parents who give two flying fucks about their children’s figure.", "satish_yadav_836": "Awesome 😘😘😘", "sancha_sancha": "💛💛💛", "arunarajpurohit45": "I just loved you're caption😍..you inspire each & every gl including me😇..the way you keep on saying that self love is all matters first nt what people says..they will judge instead of accepting the way we are.i used to be a kind of body obsession gl who starved fr months just to look slim bt then you thought me ..we are beautiful in fact every single lady is beautiful in her own way.i have learned so much frm you're captions,your pictures, your stories,& your a beautiful person I have ever seen😘I love you so much..hope one day we can meet😢..& ya one more thing to say.. you & Rahul look awesome together😉may God bless both of you forever togetherness💝@redheadwayfarer ❤", "gopika.rajan99": "@redheadwayfarer love the way you express your thoughts😍😍", "abhishek_verma23": "Fatsom", "shruti089": "@bhavikas1", "iamsubhrajeet": "U look cute...", "sejalalalalal": "Well-written. ♥️", "callravi": "💖", "musafir_huyaro1": "U look beautiful @redheadwayfarer", "beingadream": "There are things you can’t do anything about. Those are the real flaws you should be asking people to embrace. Not the things you can do something about. Body weight,big stomach and arms are not something given and can’t get rid of. It’s not about starving. It’s about taking care of yourself and your health. How you look is no one’s business to be honest. Nor I am pointing out. But being unhealthy is your own business. It’s not about starving yourself but it’s about eating healthy and working out for it if you flaws that can be made better.If you hate something go change it. I have always admired your writing but this caption made me wanna write this to you that this is not done. 🙅🏻‍♀️😒 @redheadwayfarer", "sanjeelmalik": "I think you got your pic to use the take abs ap🤣", "hrisikhaxx": "Your posts are 🔥", "kajoled\nVerified": "Verified", "__yoju__": "❤❤", "veronii._.pepperonii": "No it's not just another girl it's THE SALONI CHOPRA ! I LOVE YOU ! ❤", "sivani2525_": "awww... so cute", "your_parthsingh": "Beautiful", "_neeta_15": "Caption 💕💕you true inspiration to others! Carry on girl keep inspiring 💯", "bisht_surender_": "Beautiful😘😘😘😘😘😘", "honeykaarak": "That last picture tho.. i could just eat up your arms!!! 😍😍😘😙😚", "a.r.m.a.n_7": "Why is it so important to look and feel beautiful? I mean, I get that it is but there are so many more important things in life to worry about. Beauty is subjective. It is in the eyes of the beholder. We are born with our bodies and sure, we can change a few things but not a lot. If the purpose of life is to just be beautiful, then it is a wrong quest.", "musaafiri": "Caption absolutely on point. I'm generally not particularly unhappy with my body. And I always thought it was a simple thing. But suddenly I realized - the reason I'm not unhappy with it is because I don't really look at it, or think about it most of the time. But when I do, do I love it? I am not entirely sure. Thank you for these words. They give courage, and goals, and inspiration, and motivation.. Oh, and the pictures are really cute! 😁 I really like how expressive you are in front of the camera.. And the bright colors of your bikini..", "__itsmfahad__": "Never see that too much cute face", "sakshibajaj04": "Thank you. You are beautiful ❤", "karishma_verma10": "❤", "wonky_bibliophile": "@kritikasingh5678 Read this! 💓", "palakbatra2405": "❣❣❣❣😘😍😍😍...", "simransingh.7": "Lots of love and power to you girl❤ @redheadwayfarer", "yukti_verma9": "This ✨ Needed this today, because I've just started on the path of self-love 🙃 You say all the things that should be said, but hardly anyone ever does. Much love and power to you ♥️⭐️ -- Just another girl(who thinks you're one badass, amazing woman♥️)", "____khwaabida____": "I love your words ❤❤❤❤", "sabalemayuri33": "Hey u are so damn right. ... I completely agree", "pranita_shail": "Seriously self love is not that easy bt very much needed! what a inspiring post.Thanks for this positivity💕", "soumyakhanna": "@redheadwayfarer thankyou for this🌸 i felt so good after reading this. And from now, self love is the only thing i am gonna focus on💫 you are an inspiration😘 more power to you🙌♥", "rajoltavade": "Much needed ♥️ Thank you 😘", "nidhi_singh0501": "I read the whole caption,its quite inspirational! Keep going", "rohann3": "That cute face!!!!!!", "travelling.dentist14": "Thank you for the positivity.", "kritikajhaa": "@areyoushii dil jeet liya. 🙂", "prateek435436": "U gained weight ✌️😂😂 but still looks hot", "sshreyashii": "You gained weight..... ❕❕❕", "shrutiiijhaaa": "Oh my god! I just thought of starting my diet plan! today!😑😑😑👅😂", "anika._.vashisth": "We don't get to choose the shade of our skin, not even the way our lips curl or arms fold, we don't get to choose the structure of our bones and the weird metabolism, nor the perfect places to have moles, we don't get to chose our insecurities, our flaws. They are there, along with all the other things we like about ourselves, the flaws, the constant nagging in the brain about how part of my stomach is supposed to have this % of fat and how my thighs are not allowed to kiss each other. The persistent annoying skin lightening cream or fat burning scheme just light up our insecurities, things we are always trying to cloak behind some invisible veil. But that what makes us, us. All those imperfections, moles, darkspots, hair at wrong places, this makes us 'us'. What we do get to chose is how we love those folds, those tiny black territories, our dark side, we do get to chose the way we deal with 'parlour wali Aunty's neverending criticism', we do get to chose the love we want for us, and if we are not able to love our flaws, why are we seeking the same from others. Self love begins, it's a struggle, it's a war we have wuth ourselves and one we have to conquer. @redheadwayfarer ,your words always gave me power to look beyond my petty nose or pesky eyebrows.", "_r_i_y_a__": "Thanks girl 😇 you made my day by making me realize we have to consciously love ourselves.", "gargiimishra": "I wish I could like this post a million times.", "bushrasubhash": "I love this post..n I'm loving you. Honestly, easy it may sound but its difficult to love the way you are, love yourself wen you know the world out there is way ahead of you!! Loved this positivity in you. N I'm sorry, having asked you to tone your tummy", "period.fo": "💖💕💝", "ankit_mittal_218": "That is gold. So relatable to so many people not just women but all of us. That is what people need to start understanding and believing.", "suryadeepkhungar": "You are such an inspiration. In this world full of people pretending to be others, you are you. ❤", "adi.anjaani": "Cute 💓💓💓", "nehaaw.k": "@nainithaanoushka she's the best too 💗👀", "kahaani_tasveero_ki": "I have same body structure like you. But the way you're carrying it confidently is really amazing. I would feel so conscious about wearing a bikni on beach. But when I see you I feel. Fuck people. I am gonna do what I want to.. because. Self love is the most important. And I feel the acceptance of others about my body will come the moment I ll start accepting my own body. So, Thankyou! For being so flawlessly beautiful!💜", "s_sourabh___02_": "Wow ..... amazing, adorable as well as gorgeous 👼🏻", "anshika_sapehia": "You are seriously amazing the way you turn each word into inspiration. Loads of love gurlie ❤🌌", "amanda_iona": "@twobees_inapod", "dollycious03": "❤", "iam_swarna": "I needed it so bad today. Hugs ♥️", "vaiishvii": "FUCK NEVER SAW SOMETHING SO ON POINT I SWEARRR😭❤️❤️❤️ MUCH LOVE", "the_silent_speaker03": "So beautifully written", "sakshmakakkar": "@supaarwoman", "__soniyaa___": "❤", "shivanir_": "♥️", "saltybuttercup": "Very well said saloni ♥️", "_somya_pandey": "Lots of love for you, u always inspired me with your writings.. 💖💖😘", "iamstutisharma": "Needed this today, just looked in the mirror and sighed and then read this. I feel better ❤️Thank you @redheadwayfarer", "dreamcatcherhub": "Going through your captions each day is all one needs to feel beautiful! You inspiration😘", "pashin_25": "❤️❤️", "si_pragya": "Needed it!! Thankyou 💜", "sanakhan780563": "A big lov for u ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤✌", "kirbyamour": "I adore you wonderful lady", "maltimuchhadiyaaaaaaaaaaaaaaaa": "I can't believe 1st when i see pics... I feel awkward... But after reading caption... I feel proud of you.... U just making girls to feel comfortable in every situation... Some people call it feminism but for me... Its to encourage every girl to feel herself beautiful...... Nd u are so beautiful... Thanks for sharing this...God bless u every day... 😘 Loads of love 😍 💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋", "james7romulus": "Sooooo sexyyyy 😍😙😙😙😍💋💋💋💕💕", "happyhooman_": "You’re so gorgeous", "_jindal_mansi_": "But you look perfect 💕", "bongojoy1": "❤", "nimishanayak_23": "❤❤❤❤❤❤", "_rinamehra_": "Best post 😘😘", "vhukangel": "Nice and inspirational caption.#selflove", "khan_fou": "But you’re PERFECT @redheadwayfarer ♥️♥️♥️♥️", "rinibot": "Lots and lots of love to you! ♥️", "nandini_miglani": "Caption 👏🏻👏🏻👏🏻", "myinfinitemixtape": "Preaachhhhhhhh!!!", "vanshiaintasaint": "That’s so true! Ours flaws show us that we are all humans ❤️", "ankkyadav": "Ohhh it's jss so relaxing to read this... How your words inspire the world!! XoXo always 😘😘", "anjaliroy__": "I don't know when I'll start feeling this way but this right here is exactly the kind of positivity I want. Thank you for putting it out for me and others like me.", "nehapandit23": "@varijaa @__lagna__ @eona_simon_ She is amazing❤ you'll need to read this plus her other captions", "bagsandeep": "Awesome", "einateylon": "You're stunning ❤️", "satakshiiiiii": "This means soo much!! Thank you for the much needed explanation ❤❤", "pragyaa_gauti_": "Thank you for this . It's magically a dose of relaxment ❤️", "wopatlasaladka": "@redheadwayfarer well thought out and written. Societal pressure is something we always feel as an individual. But the thing is, no matter how perfect you look, people will have opinions about you. And that's not gonna stop. Perhaps one way to deal with it to not give a fuck about what they say. Moreover, it is about how you feel about yourself and not about what others feel.", "tiyaheeheehee": "you aree beautifulllll🌸💕", "gargakash9999": "Very nice", "_shaikm": "Try bodybuilding.", "akanksha_gv": "❤❤❤❤", "satya.k": "Just the right amount of chubbiness", "_shubaika_": "❤❤❤", "merakisoul777": "You are just beautiful in your thoughts! And how much today’s girls need this to know how self love is important! It’s not easy but it comes in bits and pieces and you need to embrace yourself! Your emotions, your body, your thoughts, we all need to accept it! 💚💚💚 much Love 💙", "bhadra_photography": "Always #awsm #free #kind #lovable #powerful #woman @redheadwayfarer", "8474648pr": "💕👌"}