{"rahmankhan501": "Give me pusse", "hansoloandsoami": "You’re so pretty ❤️", "foringkeya": "Wtf?", "abhijeet_mahat0": "I totally agree with you ... Actually the problem exists in the mindset of our own people and society ... Our society thinks that if a couple has got married then a husband has got the license to have sex with her ... But no one cares or even tries to ask her opinion whether she is ready for it or not ... I still get frightened when I think about her situation where she is so helpless that she can't even lodge an FIR against it. 😧 @redheadwayfarer", "anotherrainbowchild": "Can't dare to even read the comments on this post. OMFG", "altafb22": "Perfectly perfect ...!!! All yours and your choice ...! Agreed", "janvi.manchanda": "@shreyvats @redheadwayfarer so here's the thing. My mom hates sex. She despises it. Even after being separated from my dad she doesn't want to be with any other man because then she will have to have sex. For her sex was just about the man. He did what he wanted when he wanted. The concept of consent in a marriage did not exist, the concept of satisfying a woman did not exist. Not in their times at least. She is scared of sex and doesn't even know what an orgasm is because sex was never consensual. It was always about the men. And it has been for ages. Even today in the village women don't enjoy sex, they are not asked if they want it or not. Their husband just rip their clothes off and, sorry for this but that's how it is, stick their damn dicks in their vagina. They don't care if it hurts the woman or if she's ready for it or not. Nope, they want sex and they will force their penises down their wives throats. No one cares about what the woman wants and no one asks either. How would you feel if you weren't asked if you want to have sex or not? These women aren't asked. If doesn't matter if they're sick or if they're bleeding and most of the times these men don't even use a condom and these women not only get raped but they also give birth to their rapists child and then get god knows how many abortions because these men do not want to use a condom. Can it get any worse? These women live a painfully long life. What is more important being scared of sly women or helping out these women who suffer so much? These women wake up every day and make breakfast for their rapist. Imagine how would you feel if you had to do that. For 5 mins step out of your shoes and step into theirs", "whoperryarora": "@shreyvats sir, I can understand what you want to say but imagine kisi woman k saath uska husband uska rape Kar raha hai, forcefully sex Kar Ra hai or wo kisi police station mein apne husband k against FIR likhwaane jaaye aur saamne aapke jaisa officer baitha ho aur wo kahe k ye to 'little things' matter karti hai relationship mein yaa ye to naturally hai ! To Kya aise dilaaoge kisi ko justice?", "appy_vyas1": "@redheadwayfarer tell me one thing if your bf wanted to have sex with you and you are not in mood but your bf keep saying please and convince you and you agree after that in the morning you feel that omg he rape me . First you love your bf second he convince you he didnt hit you or abuse you third he also loves you so u will leave him and file fir agaisnt him ? Same thing happens in marriage life husbad dont force and hit wife or abuse wife for sex so #maritialrape jesa ku6 he hi nahi aur ha humare gaav ke log bhale educated nahi he tumhari tarah par vo bhi sex ke liye naa force karte he naa hath uthate he ... agar drowry ki vajah se he vo baat alag he ke roj hath uthata he sex ke liye majboor karta he naa bolu to marta he etc etc .... but for having sex only no one is abusing their wife or hitting them and force them to have sex", "themoonstonegirl": "So bold and brave!!! 👏🏻👏🏻👏🏻", "shahriarrajoshi1234": "@redheadwayfarer", "chandu_7_1": "Baat too sahi hai...", "rakshithraghav": "NO means 'NO' ...", "fae.starlight_": "It ends with us @naushinmuntaha", "roshila_jamil": "@elqakhan", "doc_onwheels": "I maybe late for the debate. The question is, how does a woman prove it was not consensual?", "anshruta_ban": "Legalising Marital Sex isn't going to help any further. Finally what two people do inside of their bedrooms is absolutely their business and hence acquisition of proof's going to be like almost impossible. Honestly, for both men and women if you've gotten married to your partner then it's kind of their right to have sex with you at any time unless you're biologically unable to. Isn't that the primary function of marriage? Legalising sexual bonds between two individuals, I mean it's just absurd that people are actually stupid enough to start a whole debate about denying the primary functions of a social system while IN that social system.....Funny.", "mehmudbhuiyan": "My dick so I fuck your choice.", "haclum78": "I have been raped by my partner. But apparently he’s done nothing wrong.", "satu_1995": "We are working for a mission rape free India and also against false allegations, we need volunteers to support us and work with us, Dm at @y.a.r_rajasthan @y.a.r.support.team", "bing_sparks": "I think marital rape is just an extended word foe rape. Isn't it? I mean how can someone be good in bed when not happy or comfortable! That's so gross. That's just a bound! If that is to be done i think the man should go to prostitutes for satisfing their needs. They should not trouble the one who is uncomfortable. That also offends religion! I hope it does. Anyway, that's a completely different matter and i owe @redheadwayfarer for picking up this topic and talking about it. Marital rape doesn't sound comfortable so how would the victim feel. I think the people who do this are big fat psychopaths", "____shivali____": "Is it really questionable even? This thought itself is evil. Why always for giving rights and justice to women we need to think ? Why is it that we need to take opinions from the people? Rape is rape after marriage or before marriage! It needs to be understood that after marrying a girl you have taken the responsibility to love and care for her , you haven't purchased her !! But in our country that's true people purchase women. It highlights a bigger problem of dowry . Our government when it comes to women is useless af. We need to demand our justice we need to fight for happiness and rights of a human we are never granted it though we deserve it...", "__mohammedkhan": "aap hamesha point ke bat karte i always supoort u @redheadwayfarer", "vijay_khamkar95": "Very hot", "sumone0385": "I agree with u bcoz my frnd goes through", "realsubham": "Don't be a dickhead 😑", "abhishek_____paul": "R u still virgin ?", "varun_singhh_naruka": "Hahaha", "raviteja_9": "👍", "akhtarp43": "Mr swami u may be right but the marriage dont gives right for husband to rape his wife, no sitution give husband right to rape his wife , every wife has right to say no , even bitch dont allow the dogs if she dont want , we are human so must understand and respect our wife feelings, i agree her pussy her choice,", "piku_21": "Osm", "lame._impala": "It's a debatable topic. Marital Rape is completely wrong, no doubt. But also, it is very difficult to prove the authenticity of the case. If a someone is raped by a stranger or some relative, it is quite believable that the act is non-consensual. But when it is between too romantic partners, you can never really prove whether it was consensual or not.", "beelzzzebub": "NO to anything means NO. It's not about sex specifically. Whenever your request is denied. It's denied. No more further explanation or discussion should be needed. Get it in your head jackasses!", "rahul_sloshed": "You speak too much", "menlonghairstyles": "Can't you just stop posting same shit in every post. Why are you so unhappy, always complain mode. My pussy my boobs my ass. Do whatever u want, but stop telling everytime u big time attention seeker.", "page3_bolly_holly_wood": "Excellent...i will follow same \"my pussy, my choice\"", "the_young_wild_freee": "Barabar छै", "sagarveer_parmar_official": "Your pussy your choice. To kitne leti ho din ke?????", "jhajagriti98": "@redheadwayfarer I feel even though you r married to a girl you can't really force one to have sex anytime u want..this is something which involves both the partners and so each people choice should be respected..forced sex can result in infidelity and mental trauma..steps must be taken to avoid this..", "deshpande_bhimsen": "Looks like Emilia Clarke of Game of thrones 😍", "princeheart007": "Yeah---- that's absolutely right girl @redheadwayfarer", "_anushkaa_._": "There's no doubt, that forced sex is Rape, be it in a married couple or the couple in relationship. If a Girl choose a boy as her life partner, there is no contract saying \"You can have sex with me whenever you want, even against my will\". She chose him to accompany her in her life's decision and choices, not to give him her possession and let him do whatever he wants to do with her. System, society and relatives are the villains of this era. But, a Girl, who is someone's wife, or girlfriend shouldn't care about these 'Thekedaars' of society and should absolutely file an FIR against the man molesting her. What is wrong is wrong, irrespective of the relationship. I don't know the census, but there are so many women, forced to shut their mouth, preached by their parents just to save the liberty of their family, when they should support her instead. When a girl is molested by her own family member, this society and her own family member call it 'its our family matter', which is worst a girl would face. I wish no girl gets affected by these people and raise a voice against the rapists, without caring about how many people agree with her decision !", "advikadwivedi_": "It should be illegal.", "joed_97": "U stupid", "bigdog_pk": "Cuty", "souvikcmusic": "@redheadwayfarer do you think only women are victims of marital rape? Your post doesn’t seem to be aware of the fact that marital rape goes bothways. What would be ur take in this issue when the victim is the husband?", "_deboparna_": "@redheadwayfarer your statements r sooo true mam....a lot of respect for u.....this is so inspiring for all the woman.....and those who going against u being a woman r dumb....r soooo dumb.......its true that......its a personal choice of a woman weather she want to have sex or not....doesn't matter may it b ur husband ,boyfrnd an unknown person...if a girl is forced to have sex..its a rape......and the woman should always stand against it......and take severe step otherwise these things won't chng", "aslam__k": "@farhaan_1503", "nik.r.k": "Its simple... Keep aside this marriage topic for a moment and then think about it, two people having sex with or without their wish.... And then point comes if both are happy with it then what's wrong here??? Nothing... But if she or he is not willing to but the other one force it... Then it is called rape or sexual harassment.... So now u put that relationship on or off... As per logical rules if you force it, it is wrong... But then there are many routes to this...and honestly relationship doesn't gives u right to misbehave... Your behavior proves your relationship with the person... Partners are supposed to support and respmemm", "abhiduttsaxena": "Rape is a rape whether it is wid man or woman.Marital rape is something you cannot easily prove ,it is bad for both the party .... ...people's nature do change wid time...how can you justify that the sex is on consent or without consent...both should have right to walk out of it very nxt day when u start feeling bad about having sex wid him or her....because u cannot prove it is a rape when we all know what he or she desire after marriage.... It is part of married life.... Donot play politics over such issues... It is a very serious case...plz do not try to demonise it...what we have to do is that to make society so much broadminded so that one cannot feel bad n get strengths to leave that relationship", "tweetyyyyyy": "Maybe this is all because in India sex is still considered as a taboo. And many people don't openly discuss about their sexual issues with their relatives and friends. We can only help anyone if they come forward with their problems. And the problem definitely lies in the system somewhere. It has so many weak loopholes , they should make the laws more user friendly.", "bysamrat": "The very fact THAT we got people here trying to justify \"rape in marriage\" is okay is exactly why every day thousands of rapes go unreported.", "iamsps_official": "Nyc pic", "siddeshsv": "Will you please stop thinking about pussy,, sex.. there is alot other things to do to inspire people", "masood_ul_haq": "🌴🌴🌱🌱🌳🌳❤❤🌸🌸💝💝🌲🌲💟💟🌹🌹💙💙🌻🌻💛💛💐🍀💮💮🌼🌼💜💜Masha Allah so nice sweet", "positive_vibes0108": "A NO means a NO whether she is your wife, gf, any girl or even a prostitute...i know i am quoting dialouges from PINK..but it is true and it to be followed....she is ur wife learn to RESPECT her choice. If its not her choice it is a RAPE I know it is hard for some men to accept this fact over their big ass ego...but stop when she asks you to...and yes it should be punishable ...but sadly maybe not possible in India...maybe in another decade or maybe not even then...the way they rake actions against rapists...", "whensumshines": "@redheadwayfarer It's easy to voice out loud that marital rape or any kind of sexual abuse in a relationship is wrong when one is not a victim. But when you are the victim, you are at your lowest, not in the right mind with absence of support and you begin doubting yourself as to if something is wrong with youself when the love of your life is telling you as such. And because of that,we often develop the thought that though we may not like it and disgust it, we will eventually come to like it and maybe be ok with it in the course of time. And so when you are raped, you take the blame again and again and don't equate it to a rape. Because ofcourse, how can someone you love 'rape' you? It becomes a machanical process. And this is worse if you have been an uncared and unloved child because at such an age she feels that if she is appreciated and given more love by doing something even if she disgusts it, she feels 'nice' and 'loved'. It's disgusting but a victim is voiceless and mindless in times of abuse.", "venaythakur": "Then after marriage i should write its my dick and my choice too", "__faizan__khan__": "Shadi hone ke baad ek wife ka apne husband pe or husband ka apne wife pe pura haq hota hai to ye faltu ke naye naye words invent karke use itna bhayanak dikha ke galat mat thehrao", "_._priya_.__": "💗💞💗💞💗", "chirag._.10": "That's your attitude,I like it keep it going 😉 @redheadwayfarer", "aman_meen_": "@redheadwayfarer please dont waste your time by replying these bastards...!! Lots of love to uh!!! ❤❤❤❤❤❤❤", "zordan3500": "Yes", "giggle_waters": "The world is so psyched, it needs the government s support to ensure a male and female stay together !!", "themadclairvoyant": "It is truly terrifying how stupid people can be sometimes. Just because you are married, doesn't mean that you disregard your spouse's opinion or forgo her consent. Traditional and frankly archaic views of the society have convinced women not to voice any troubles in their marriage. What starts as sex without the wife's consent often develops into domestic abuse, both emotional and physical. Marriage is just like any other relationship, mutual consent is paramount and regardless of society's perception marital rape is not incidental.", "nidalatif_nl": "@amna.qureshi.315 it might be helpful for your research report.", "mara.schl": "of course marital rape should be illegal!!", "sasha_raiya": "❤️❤️❤️❤️❤️❤️❤️❤️", "cranky_cake": "@redheadwayfarer marriage nowadays has got many definitions, both positive and negative. But \"rape\" has one simple meaning & cant be ignored on any grounds. If marriage is the sole reason for letting go such people then i think every rapist should have married the victim and set himself free. Like the concept is illogical. Marriage doesn't always mean intercourse. And to be practical, i got one of my friend married recently. Due to financial crisis, she got engaged at 20. However, they didnt indulge in any sort of sexual activities and now it's been a year or more. Yes, people like them exist. In fact, \"sex\" is not something that cant be condemned or spoken of publicly.", "reyanshh_rahul": "In my opinion forced sex is rape... marital status doesnt matter", "mgfiifvbjhsgjozs": "If we don't agree then nothing your pussy can do alone", "ashishkumar2184": "Surely ...but choose wisely", "sinhaamit067": "In this pic u looking like my garl f", "ordinary_meee": "A woman, after marriage, becomes a partner to another person. Not a property given to him over a signed contract of marriage. That's what we need to remember. Women are humans who stand on an equal level after marrying with a man and whatever may happen thereafter, it should be with consent of both. Or it will be considered as a forced act. Now be it sex or any other activity. It's a very simple logic really. Remember to treat women as humans and not objects.", "cannibalsunny": "aree kai nai, zavaycha, lai majja ae", "_mimansa": "Rape happens when consent is neither expressed nor implied. Marrying a person does not give a spouse sole right to have sex whenever they want. Marriage does not mean the consent for sex is \"implied\" when it is not expressly granted. Also, there is a lot more to marriage than sex. Sex is not the only factor of getting married. Martial rape as a concept comes off as a taboo in India because here, one of the main factors of getting married is to have kids and a husband is deemed a god-like figure. He can't be wrong. There is a whole power play going on, when it comes to marriage. Husband is considered superior to the wife, so he is a position to influence the wife or even coerce the wife into having sex. Now that's where martial rape comes into effect. The wife can't raise her voice or even discuss this issue with her partner because he is superior to her. Martial rape should definitely be illegal because marriages are about co-existing, being equal to your partner and have the right to say no and still have a healthy and loving relationship. Not about coercion and manipulation.", "ary_achillies": "The so called civilised society has led everything into chaos! In ancient time love making was your freedom. Choose anyone you like and have commonality! There was nothing called Marriage! Human beings came into being from more 1 lakh year before. And So called Institution of marriage came into being like 4000 years only! Which is nothing but a certificate of each other's property! If one goes beyond the norms of the certificate he/she is termed as an adulterer! Which is totally against the animal instinct that we still have inside us! Some one truly said that in this free world societal norms are the chain that doesn't let us live! Relationship , marriage etc are reason of hatred and selfishness all around(\"He/She is mine\") If one truly wants to be happy and have a fruitful life one must live with his/her animal instict.. not bonded by any chains! But the society will never let you do so! Thats the Irony!!", "dancing_doc_rk09": "Marital rape is a Rape .. what happen if two people are married? concern is must of either people to have sex ....", "meggie_scott": "@nitika__singh its kinda sad that its even being debated.", "aishu_1903": "You always have the right to say what you want..A no is a no, no matter what.. Marriage does not give you the right to sex whenever or wherever you want..", "iamsaumil": "Well, in my opinion what ever before or after marriage, female have their rights to say \"no\", if they can't say no then it must be count as a rape. But here is an issue with who take stand first and also may be quite difficult to live their rest of life because also society speak about that why she said no? Does she has affairs with someone or something else and so on...i think its a mutual understanding there is may be one solution 'education'.", "debayandd": "You look so so beautiful in this picture ❤️", "shookriya__": "People who think rape is a free pass to sex are fucking cavemen. I don't even know where they get these thoughts from. Whether it be a woman, or a man, the choice of wanting to have sex or not is totally theirs, regardless of the fact whether they're married or not. Reading these comments honestly has me shook. What the fuck is wrong with this world?!", "mdriyadh27": "U r nonsense because u have time for written this sh*t", "varinder.gill.545": "So cute", "geekfreak03": "I really don't know where am I living..........It is disgusting to see such pathetic comments and thoughts in this 21st century.........", "cra___z_": "Your life your wish that ain't a good post👎", "wish_ak": "Rapes n domestic violence are and will always be a hot topic when it comes to the crimes against women but what I feel now is that there are nowadays majority of false cases on men accusing them of rapes or domestic violence against women . I really wish your page can also bring awareness n be supportive to those innocent men who face harrasment in such cases.", "nayanagale": "Come and join me, let me fuck you hard", "pallavi_zore": "Sex is a choice of 2, rape is the enforcement of the powerful. Only way to solve this case is that the weak have to be strong.", "we_shall95": "Yes, sex is a matter of choice for both. If a wife doesn't want to do it and still the husband forces her to do it, it is a rape. And he should be punished the same way any rapist is.", "sugarypie_mutiyaar": "@redheadwayfarer Sex without consent is a Rape no matter whether it's between two strangers or husband wife. A wife can still say No for sex to his husband nd if he's not convinced with her NO then it's a rape attempt. Marital rape should be illegal coz marriage doesn't mean selling your body", "melange_mistress": "Marital rape is a crime and should be treated as much. And for all those who are saying, \" sex is an important part of any relationship.\" ,have you ever considered the fact that if you need to force sex then the institution of marriage has already weakend. Having said that, Marital rape is often used as a medium of revenge and an abuse of your gender stereotypical roles. And in a situation like that it is all the more imperative that we criminalise marital rape.", "the_august_buoy": "Nice T-shirt 😎", "pallavibakshi": "I used to b a feminist but not anymore (I believe in gender equality ) ..marital rape is something which has been exaggerated by females .. those women who may or may not have gone through this situation where their husbands are imposing sex without their consent.(I have seen hell lot of women who actually take advantages of such crimes by creating fake stories ) HoweverThere is a certain section of women who are going through it in their regular lives for real but they are not aware of the fact that it's wrong and even if they know they won't do anything about it .But lemme tell you one thing that there are also lot of women who are asking for sex without their husbands consent. But unfortunately no one talks about it cuz according to our society and feminist mindset marital rape can only happen with women . There is a flip side of the coin too !!", "smritik04": "Well my view point on this is that yes marital rape should be illegal. It happens with a lot of girls around...Either they stay quite due to the family pressure or sometimes due to the fear of society...Sometimes even if the husband sleeps outside with someone else and comes home to sleep with his wife she cannot say no to him and they have sex forcefully. That should not happen... Both the partners should happy agree to have sex even after marriage", "deep10gram": "@redheadwayfarer Rape is a crime against humanity. In any rape the victim is not considered a human being. And the person who doesn't consider another as a human being doesn't have humanity left in them. I unambiguously say that marital or any other rape is a serious crime. But today's world is complicated. Women used to have less economic power, less social support for them. All policies have been made by men, mostly favouring men, and some, out of humanitarian consideration, for women (say banning sati). In today's world we still have women without social support and economic strength but we have powerful women too. And a law providing specificallyfor marital rape would do a lot of good to every woman but especially to those who have less social security. But, the concept of consent is very delicate within the framework of marriage. It is not unusual to assume physical intimacy is subject to a standing consent - always present. The key factor is whether one is forcing the other or manipulating otherwise. Things can be a bit difficult to prove for both the parties - whether alleging or denying. A law is needed for protection but it must be kept in mind that no gender should be more privileged than the other - equality must be the requirement. Having no law is not good but having a law that can be used to tarnish the image and life of someone who is innocent is not a better idea. So the law needs to be framed in a way that protection of one party should not make an innocent party worse of. The law should not put men under a preconceived suspicion. Further, in today's world, how such law is going to impact same sex couples is something that should be thought of. The situation is delicate but demands serious discussion and a decision with no emotional bias.", "harshitarathod_": "There are women who's consent isn't asked for marriage and there there's women who's consent isn't asked after marriage to have sex. And a few women won't object it because 'we're married and he can do whatever with me' or because 'society functions that way'. All I have to say is, it's your body, and you're consent is important. The society doesn't decide stuff, it's your private life, and a woman's personal choice. No one, not even your husband can do a forceful act of 'pleasure'. And if he thinks that it's alright and doesn't consider forced sex after marriage as marital rape, then something really went wrong in his upbringing. So yeah @redheadwayfarer your tshirt says it all.", "aamir_asloob": "I have a dick but I don't have a rule", "praveen_rana_": "@redheadwayfarer I loved this post 👌🏻", "amreeta_cho": "Marital rape should be criminalised because marriage does not give you a free pass to use your partner's body as and when you please. Consent is paramount at every instance of our lives.", "thatcrazybrowngirl": "You are a true inspiration @redheadwayfarer ❤", "__geetz__": "Omg @redheadwayfarer ...im in love with ur thinking your so damn ryt fr this", "purestmaleheart_delhi": "If it has to be ... Rule should be reliable for both men and women ....it's not like women can take it for granted to charge men....", "i_m_nazil_2407": "Ofcourse your pussy ur choice 😂😂", "dreamsubhas": "@redheadwayfarer", "quratulainrazakhan": "Definitely. A girl can say no whenever she wants. Marital rape is a thing. It exists. And it should be illegal. A woman is married, not bought. She is your wife not your property. She is a living breathing human with a soul, not a sex doll that you can fuck whenever you please without any objections. Consent is just as important after marriage as it is before.", "bina_samal": "It is really difficult to make people understand. Because lots of them still stick to the stereotypes.", "theycallmepoohhh": "Well, i think that it should be made illegal and all the men or husbands out there need to understand that a women before/after has the right to decide if she is comfortable with the sex or not. Especially in india, where most of the husbands think that having a wife gives them the right to do anything with their wives,emotionally or sexually or mentally. This mentality of men/society needs to change asap!", "adi_saggi15": "You are disgusting", "rajashree_hunsimar": "You look Beautiful @redheadwayfarer", "johnsrk_bishnoi29": "Lovely things n respect choice @redheadwayfarer woman freedom fighter", "_i_prajakta_": "@___aakashkadam07____ follow her.. She z so inspiring", "himayunmakroo": "Can't it be vice_ versa also, I mean when husband are not ready for sex but wife insists....", "avi_dip_roy": "Marital rape? No matter what term we use to represent the crime,it's a crime nonetheless. To rape someone is to force them to have sex with you, it doesn't matter whether that someone is a stranger, your friend, someone from your family or the person you are married with.A rape is a rape and it is not only illegal, it is one of the worst crimes there is.", "vijaysingh060": "@redheadwayfarer u cannot wake up someone from sleep at 2am night n force to have food just bcoz you are hungry.", "_subrata._": "@shreyvats This is again no vindication.. to say that the women/ victims should be denied protection just because it is difficult to prove. You are actually discriminating as you're separating out marital rape from rape by not recognising that marital rape should be equally punishable. Illegalising of marital rape would serve to recognize rape in marriage as a criminal offence and would admonish or have a deterrent effect on potential rapist husbands.", "aarushi_p": "I absolutely agree with you.....marital rape should be declared illegal and punishable", "parthrupani26": "Hey Saloni, yes marital rape should be illegal because even if two people are married, that doesn't give the husband to force sex on her! If she is not willing to, he should not and can't! Being a guy,im honestly telling you how ashamed I am being one. We can't change the thinking of these senseless people but at least we can raise our voice, when a girl says no, it's stays no! No means no! @redheadwayfarer", "damy_cee": "She can definitely say no. Rape is forced act of sex, married or otherwise. She can have sex with you everyday and still say no when she doesn't want to have sex. And as a couple, I think, there should be understanding between the two of them that it is possible that one of the might not want to have sex on a given day. Marital rape should be equally punishable. Sex is an act with consent from both parties, even in marriage.", "amanda_iona": "The poll you put up ... I couldn’t believe that it even was a question to ask. Since when did the anything rape become legal? Married single divorced rape is rape husband brother lover or friend.", "kashyap8865": "right mam👏👏👏👏👏👏👏👏👏👏", "i_m_abhijeetavi": "Nycccc t shirt", "juz_tanu": "❤", "prabhakar273950": "Ye India h", "ashmitdyes": "It's actually a very tricky situation because just like the Fake Dowry cases, there is a large scope for misuse of this law. Hence, SC must tread very lightly. It's not that they don't care for the women. It's simply that they have to look at both point of views when making decisions.", "the_fiery_leo": "Someone said here.. it wud be misused if made legal.. please tell me which law isnt being misused.. Juz coz some bitches will misuse the law.. does it mean we take away the right of those who are suffering from getting justice ?? Where a woman is not treated as a human rather justa sex object.. Wud u say the same if smday ur sister has to go thru the same ? She comes to u and tells u that her husband is forcing himself over her. Wud u say its his right ? And that she shud Obey him and let him enjoy her body ?? Any sex WITHOUT consent is RAPE. Period !", "mitalii.lokhande": "Yess!", "flivver25": "@im_poseidon my line", "arpita.deb.mohanta": "I sense double standards on the part of the Judiciary in such regards. Firstly, the law demands a person, regardless of gender or relationship status to be a free person, with his/her own choices & fundamental rights. & then, a woman once married, becomes the sexual slave to her husband, & loses her right to denial. I mean, isn't that hysterical?", "8_triskell_8": "I think the root of this problem is that girls are forced to get married to a specific person going beyond her choice and as we all how in what proportions a normal girls voice could be suppressed in india and i think that if she gets to marry with her own choice and will then i think this would atleast minimise the problem but yess i am of the opinion that marital rape is a crime cause no one can count the pain she must be going through and neither can one say that just cause she is married she is less tortured moreover she is being raped everyday so it is more important to educate both men and women with what is right because its been in a survey that the states with a favourable literacy rate and a favourable sex ratio has tracked a low rate of rapes so according to me changing the mindset and teaching each person to respect eachother is a must only then others will respect us so it's time to educate but we also have some people called as educated fools but i think that education can reduce it atleast by some means so this is what i think i may be wrong as well i am just 18 so it's time for me to grow and learn the right things", "soumit_bose7": "Yeah baby", "som_sahu_1495": "A husband is a lover of her wife... and a lover never even try to force her if she is not comfortable...... and if he is forcing to do so.. then it's called rape..... so simply he is no longer a lover nor also a human being..... punishment should be given..... @redheadwayfarer", "theoldgoan": "You say it girl!! ❤️❤️❤️", "alydoshambe": "Rape is rape.. Marital or not. Its a marriage.. Not slavery... It's a human being not a sex toy that u can just use anytime you want. There would be no marital rape if you are good and keep your partner happy. It's common sense. It's simple.", "shivyaasingh": "For me , a no is a no. In every situation , to anyone no matter how close he is , or if I have done it before with him.. it all doesn't matter when I say no. At that point it's a no.. married or not if you forcefully try to have sex with me against my consent it's a rape.. I don't know what is so hard o understand in this. If I chose to marry you , you have to respect my consent and I will respect yours. Marriage is nothing without respect , so let's start from there.", "makrkapa": "Looking amazingly simple and beautiful 😍💕💓", "heal_you_up_with_a_smile": "We seriously need to to think about it deeply.", "nish_aryan22": "What is the use of marriage if u cant luv and what is the use of luv if u cant hv sex,its just u r taking permission to takeout money from yr own wallet.", "samachilles": "Wow😊", "yashhwardhan": "*famenist*", "tarun_kashyap__": "Stupidest concept \"\"maritial rape\"\"", "atul_razz": "i am totally agree with it.. Men are abused too.. But here we are talking about the concept of martial rape especially with a women.... But let me take a look. A man can be a victim of rape too... Its more serious issue with women coz they have a history of oppression and they suffered allot. And we are at a stage where we are trying to uplift the half of the human being and that women. Yes, martial rape is illegal but it can happen with anyone men or women.", "meghnaduttaa": "No one understand tht😏", "madlyshen_b": "I have talked to many rural people regarding this whenever I would get a chance, their view point being, that they have to wait almost half of their lives to just have sex, which in the urban areas is considered just a matter of choice for both the adult genders, for them marriage is the ultimate ticket to get out of their sexual frustration. And sadly, in those areas, women consider it their fate and husbands their only Gods.", "17_clementinee": "Man you are Amazing man your thoughts are fabulous m do damn inspired by you. Stay same💯💯", "cheryl_m_5": "I think it’s still called as rape ..", "prashant_singh.________": "😂😂😂", "sakshi_sarcasm_shukla": "So so so many marital rape cases aren't even filed because the women in our society are made to believe that it is OK but it's NOT OK. It's NOT NORMAL.This is traumatic.IT SHOULD BE ILLEGAL.CONSENT IS NECESSARY WHETHER MARRIED OR NOT.ASAT. #mypussymychoice 🙌", "ranjan_krishna_paul": "It should definitely be illegal,but for both.. \"Men and women\".. Coz only men are not the one's who are desperate.", "maverick_debarati": "I think the problem lies much more with our phallocentric society where a women is treated as a commodity and men possesses her. And when you possess a woman, her soul and body belongs to you. And how can one abuse something which belongs to them. So, perhaps the idea of marital rape is in graspable for few(or for most). Its high time that we need to understand that even in marriage and after marriage a woman is still a human being with her own rights. And she has all the right to say NO to sex and to everything she wants to say no to.", "rinibot": "Forced sex is rape, regardless of the capacity of the relationship in question. Marriage definitely isn’t a free pass for the man to put his dick in his wife whenever he wants. What marriage is about is mutual respect, courtesy, love and understanding enough to take it easy if your moves to have sex are met with a “no.” There is absolutely no justification if you still go ahead and have sex anyway. It is rape. As simple as that.", "adityagurjar9": "Agree", "akanksha_kumthekar": "The woman have right with whom she want to have sex...even if she is married if she dont want to have sex..she can say no to him...after saying no if her husband is still trying to have sex is clearly called rape...why the hell man does not understand No means No...if women does not want to that clearly means she dont want to.....", "arpita_arun": "Sex should happen only with consent from both the people involved. Doesn't matter if they're married or not. Martial rape can NEVER be legal. Never.", "dimple.parmar.902": "Rape is defined as forced sex. It does not matter if it is between a married couple or not. A rape is rape , be it inside a marriage or outside. One should not have sex forcefully even if she is your wife, having forceful sex will affect her much more than not having sex would affect you.", "beerfully_yours": "I think forced act of sex, even if it's within the purview of marriage, should be made illegal. Society gloss over this issue 'cause it is thought marital rape isn't real rape and peep naturally assume, if married, you need no 'yes' for sex and that you can force yourself down her throat without having to seek her consent. Most men think they can get away with it. There are many such cases where men come back home drunk and throw themselves upon their wives. Wives are overpowered and suffer silently.", "bobblehead_meg": "People, marital rape is a real thing. It doesn’t matter if the woman has decided to spend the rest of her life with the man. She has given him the right to be a part of her life. Her body is still her own and she should be the decision-maker of what happens with it. And people here who think marital rape is just a concept and “oh-so-unreal”, grab a cup of coffee! Maybe that’ll help you wake up!", "gemsaditya": "yes baby", "syedrub1": "non sense post", "balooneyy_12": "\"your pussy your choice\" \" my dick my cum\" @redheadwayfarer", "the_bitter_stone": "It's like people who voice their opinions about marital sex ,I must say a victim is some1 who suffers and", "wasimkalmabi": "The force is with choice.", "_aishbafna_": "Damn .. on your recent post, i accidentally clicked on 'No'. I regret it 😣", "tahirgabatiya": "Very hot", "mr.kanpur_": "Rape is illegal. No matter it is marital rape or whatsoever. There are so many Boys there think marriage is a free pass for sex. And I think if a girl disagrees and a guys still does it forcefully then it's rape. And it is illegal. :)", "kajalbhardwaj19": "may be I send wierd but according to me no one should force any one for sex weather its a husband or a wife...they both have their own choices...its 95%that men is always ready for \"sex\" but still there are situations when men also say no to their wife in that case women sometimes feel exhausted nd says she is not physically satisfied ..she should also understand that he has also right of this thing and on the other hand its totally based on her choice if she is not comfortable during that entire night or day she should have all the rights to say \"NO\" nd men should'nt rape her weather its in a couple relationship , or marritial relationship...Also if they are having it daily its totally their right to say yes nd no .....", "dhrumilkalyani": "At any cost forced sex is a rape either u are married and forcing ur wife or doing it with random women forced sex is a rape thts it.", "ashmitamandoth": "A rape is a rape before or after marriage. A woman is a woman and her No is a No. One bond of paper doesn't give anyone the rights to rape a woman. If she says No you just stop and not force her into something she doesn't want to do.", "rashijain302": "@redheadwayfarer is this even a question? Of course marital rape is illegal", "vidurgupta07": "@redheadwayfarer - answering to the vote you put up before - “YES” - I did however click on the wrong side - the premise of a relationship does not make any act of abuse or violence acceptable. Sex without consent ... i.e rape... is an act of violence.", "chackosharon": "N", "roxx___krishna": "Nice", "capt_peegie": "The best thing I have seen in 2018 ? It’s fucking awesome!", "i_am_instaholic_": "Well said queen @redheadwayfarer", "___saloni___": "There is a girl I know who was recently married. She wasn't comfortable with sex at the first night with her husband. She asked for ' some time' just effing 'few days' to prepare mindset and be ready for it! She tried to convince him by saying, we are partners and we can certainly understand each other.. it's just about a lil time for me. But he said NOTHING but raped her THAT NIGHT itself! So brutal with all DARK BLACK marks on her lady parts! If this doesn't make you go mad and burn your blood then I dunno what will! Just imagine the state of that newly wed girl who expected Nothing but some understanding from his 'husband' but got THIS RAPE in return and the 'BEST' part is she couldn't COMPLAIN! If this isn't rape I DUNNO WHAT IS! ☺", "imafinemess": "Just because she's married to him ( which may or may not be according to her, if it's arranged marriage them she might not even know him well) does not mean she has approved of him forcing on her. That's a big no. Martial rape is a rape none the less. Our society really needs to rethink about such issues well before talking gibberish", "the_girl_wid_no_name": "Marital rape is still rape... Just because it contains a prefix doesn't really justify any one's ill deed.. I really wonder when we actually start looking it as a crime.... By we I mean all of us as the people of India...", "83833729191010_": "@redheadwayfarer . Inspiration for manyyyyyy ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️loads n loads of love and respect 🙏", "abhishek_bitolia": "Such a slayer #teamredheadwayfarer #teamsaloni 🤙🤙", "sarahliampaynee": "Rape is rape. Whether it is done publicly or whether it is a martial rape. If the female says 'no' she mean it. And that's how it turns out to be that she is not ready for sex or she doesn't want to have sex. People believing that martial rape is legal are seriously not at all in their senses. Of your wife is not ready to sleep with youh that night- and she straight away says a 'NO'. So you're no one to force her and if youh do so. It will be taken as rape into consideration.", "anjuyadav___": "Rape can never be justified. Be it a girl, boy, man, woman, minor, adult, girlfriend, wife, prostitute, whoever involved. Even thinking and talking about how people still justifies it on the name of religion, relation makes me sick but what can we do, they will never understand the meaning of consent. @redheadwayfarer", "vimal__08": "I am not against the concept of marital rape , that is morally wrong but where i disagree is regarding the implementation of the law and misuse of the law . We live in 21st century . We should do be doing something on basis of our moral conscious not because of the fear of punishment . Rather then making it legal and enforce this through penal provisions , it shall be promoted through other media , that the consent of your partner is must and without the consent , not only without marriage even in marriage also . See i believe we just cant make change by laws untill we bring change within because law just complexes the situation more rather then solving it , thats my opinion , i do believe it is rape only to have intercourse without consent even with your wife but i disagree the legal pathway @redheadwayfarer", "ms_shanu76": "You know I am your biggest fan.. from girls on top.. (MTV) but now I realise who you are .. I mean fuck off... I don't like you as a person", "shuvv_ghosh": "My dick my choice!!", "tankandthetwins": "Love ur tee by the way, wish i could wear it. Does it come in XXXL 😜", "crochetnow.in": "I personally think that marital rape must be illegal. But many think in a different way. People think that they own their wives or girlfriends. They feel that they are their own property n ask things like \"I should take permission from my girl? To touch her?\". And when the answer is no they feel that they are getting rejected n that they are not beautiful/handsome enough.", "neha_vadhwani": "sexy af💕💞", "farhaan.ginwala": "@redheadwayfarer I think it's all about mutual understanding between a couple. Also, nobody can force anyone for the act be it man or women.", "an_insane_insan": "A rape is a rape , where a one forces another one against her will is nothing but a rape itself . A marriage is for sure a license to call someone a part of your life but it surely is not a license to make them a part of your desire or fantasy . It's just ridiculous that we live in a world where we talk about Feminism , women empowerment and Equality but still at the end of the day a man feels so superior to grant a wish to woman . I mean who the fuck is he to do that . She has her life and she is fine to live it . It's her pussy , it must be her choice 🙏", "rohit_vickey_kumar": "It could be said the thing which shouldn't happen ... Ye cannot termed it as rape... What if wife forces husband to have sex when husband dosent wish to or tired ...Is it a rape ... Its about understanding.... Both should respect the feeling of each other rather than calling it as rape", "sidgoku1996": "As simple as that ‘His Dick His Choice’ i am not saying wether its wrong or right but just think what if the man cannot satisfy his needs and go to another girl for that ? Than wont it be considered as cheating ?", "the_phenomenal_one.fzk": "Yu r right saloni @redheadwayfarer #alwayswithyou lotz of luv😘 to yu and your thinking♥️", "itsmenirav100": "Nice caption", "swteighteen_": "If a girl says no. Then even a husband should be understanding . And if a husband forces then yes it is called a rape. No matter what. If they are married to each other they should respect each other's decision and should support em too.", "__s.h.r.a.d.d.h.a.__": "Too good ma'am", "serenitysilenceandme": "@redheadwayfarer , any problem, may it be rape or abuse or bribery arises from a root cause. I feel the root cause in any kind of rape is the misuse of patriarchy and because the man hasn't had a right upbringing. When it comes to sex, usually men think it is a granted boon for them after they get married, they do not consider the sentiments of the wife, because they do not know what the Relationship between a husband and wife should be like....I believe that if it's an arranged marriage, the Relationship should first grow on an emotional basis and once that is reached and both are comfortable they go on to the intimacy part. Most men fail to understand this, they usually use the tagline 'I'm your husband and you are mine, don't I have this right over you?'. A good upbringing is required so that a man is taught how to respect a woman before getting into her pants, which is the main reason not just for marital rape but all rapes. As men don't know how to differentiate between right and wrong, they do the wrong, all because their thinking is limited. It's just immaturity on the part of men that takes a much bigger and violent form.", "theconsocius": "A law made in 1860 (IPC) is way too old and needs to pass away(die) peacefully. The arguments are so dumb that its Epic AF to even hear them", "abhishek_verma23": "Chote kapdo ki vajah se kabhi balatkar nhi hua, hua hai to choti soch ki vajah se", "sakshisankhwar": "If you are married and once in a while you say no for sex then guy obcourse should not force him it's her body her choice every male person need to understand that. We are not toys to play with. If girl says don't get touchy then better back off man.", "mselfin": "Loving this Tee ❤️", "prachisethia_": "It is illegal! A forceful sex with your wife is no less than a rape! in a relationship it's choice of both the men and women. If she doesn't want to have sex he cannot force her and if he does its so obvious he is trying to rape her. \"Lipstick under my burka \" is best example for this! There her husband just come and keep having sex with her even after knowing she is having health issue! he isn't bothered about her all he want is sex sex sex! Men who forcefully have sex with his wife don't love them their wife. And so according to me wife has all right to file a case on him! because anything done forcefully is a crime! Whether it's your wife, gf or xyz! SO every wife have her own rights, her own choice! If she is not ready to have sex her decision should be respected! @redheadwayfarer", "twelveshadesofhappy": "It's weird that we're still debating this. Of course you criminalise marital rape. You criminalise anything that includes the word \"rape\" in it, cuz just because you walked around a holy fire and said some vows, doesn't give you ownership over your partner's body. On a different angle, I find it annoying when my peers tell me \"but it'll be so hard to prove in a court of law!\" (I'm a lawyer btw) Well, it's not like our legal system is super original, let's figure out how it's done from over a hundred countries that have criminalised it!", "gatacdo7": "Oh and then good folks of our country have failed to factor in another kind of marital rape: one where the woman who steps into her husband's house suddenly is fodder for lustful satisfaction of all her male relatives. Uncles, in laws, brothers, cousins, distant something's... Why because she's married and the apparently the man who 'owns' her now decides whom he'd like to share her with. Squeemish as this sounds it's a real fact. Basically that's GANGRAPE. For life.", "peacexoom4": "Right #saloni", "sushantsaklani_": "@redheadwayfarer though I am strongly in favor of making marital rape illegal..I am just curious to know what is people's take on the situation where the man is saying no to sex to his wife?? Since a man is predominantly presumed as a vulture, beast or an animal when it comes to sex and is believed that he would never say no to sex, instead would try to force is whenever he is restrained. Because as soon as a husband would say no to sex(just like a wife would with her free will), he would be labeled as impotent, unmanly or things like that straightaway.. won't he be? (Hope ppl where will adhere to normal discussion to my point rather than abusing) ✌️", "love_seeker47": "कुछ मौसम रंगीन है, उसपर आप हसीन हैं, तारीफ करूं या चुप रहूं जुर्म दोनों संगीन हैं.. So beautiful ❤️❤️😊😊👌👌👌", "aanchal_koul": "Martial Rape should not be legal.", "badalti_fizaa": "A no clearly means no👊", "charmingly10": "Of course it should illegal if a girl is married she has signed a document saying she wishes to spend her life with guy she has however not given any written that this person has a right to her body in any way he wishes. It will still abuse if she refuses her husband and he forces her to have sex cause her CONSENT her APPROVAL in the act is necessary. If not given it is illegal. Thinking that it's a matter between a wife and her husband behind closed doors is just a way of washing your hands away from the topic because 'jane de na unke Ghar ka matter' NO it's not just a Ghar ka matter'. People need to understand that if a girl is not feeling secure enough to say NO and being HEARD in her own household how is she suppose to feel safe out on the street. Talking about empowerment is easy, actually practicing it in your home is a challenge for husbands for some reason. I come back to this...she has given consent to spend a life with you not to have sex with you whenever you feel like it", "prarthana_pai": "Ofcurse maritial rape should b illegal.. just bcus a man weds a woman, he does not get right to touch her against her will!! Its such a shame that out society thinks that if a girl has sex bfre marriage its a shame! But hot raped after marriage.. 'how can dt b possible?' Excuse me! Y not.. is maritial rape different? Does d huaband treat her wife like goddess during maritial rape? Will any of you who supports maritial rape like if u got touched unwillingly after marriage, get abused, disrespected? Ok.. our Indian culture says itself that.. marriage should be a combination of love, trust, faith, compromise, committement, respect, and most important.. to keep each other safe and happy.. Getting touched everywhere against will shows respect? Or love? Wakeup guys its lust? N beyond all this... what about her feelings? A woman doesnt become a sex toy after she gets married! She leaves her home n come to ur place n live with u.. trust u! Atleast respect her n her trust!", "_pr3ttypriceless_": "Marriage isn't about only sex. It's about spending your life with a person you love (ideally). Why would you force someone that you love to do a thing that they don't want to do? Especially something as intimate as sex..... We need to stop considering marriage as a license to have unlimited sex. Marriage shouldn't take away someone's choice. Imagine being forced to do sexual acts by someone you're supposed to love for life, imagine feeling so violated!! This shouldn't happen. Marital rape should be illegal.", "renishvirani": "The t shirt says it all @redheadwayfarer lol", "aiyyoniki": "Hell no. As rightly said 'my Pussy my choice' it's my personal choice if I want to have sex with you that day. Just because the person wanting sex is my partner doesn't give him the green card to fuck Me whenever HE wants to. Sadly out society are highly unaware of the. It's okay for them if the husband fucks his wife without Concent. This should change. 'NO means NO' at whatever level of relationship is very very important. Guys and girls, y'all gotta fix this in your mind. Rant out :)", "leon_a3100": "I think the seed of martial rape come from the \"abstinence only\" sex education that most of us are taught from a very young age and that implies that once you get married you are entitled to have sex anytime you want", "amigo_gemini": "Marital rape is a thing ...many might disagree with this...but there should be a law for this...sex against a woman's/girl will is a rape...A rape is a rape...but it saddens me that in India if something like this comes up... they believe that it's kind of black dot to their Sanskriti..sad", "prashali26singhal": "According to my opinion as an advocate it should fall under the category of rape (Marital rape) whatever the age of suffering wives.", "makeoverbyshatabdi": "@redheadwayfarer Saloni, I just louvvvv your posts! ♥️", "__bornfire_0_o": "Yesas exctllyyy maritial rape is illegal no matter what is her status married or not its her choice. If she wants to have sex then she can but if not then u can't force them to do so ....Forcefull sex are only turn into rape.", "sunanda8723": "U r best...👏👏👏Luv Luv Luv❤❤to u", "govindsha": "No means no. Doesn’t matter for wat purpose the term is used for.", "jatinbisht_": "Nice tshirt", "soumya_sri_mutyala": "It is NOT okay.", "zeelshah488": "You are absolutely right martial rape is a crime. According to me people do think that husband has right on the wife which is a wrong mentality every individual has right to choice. @redheadwayfarer", "shree._.j1510_": "It is illegal but in some cases we look its forced marriage in that case its RAPE @redheadwayfarer", "_kim_manu_": "I think... It is a choice..... I believe she can still say no if she doesnt want it...also marriage is not only about physical support....it is also the emotional strenght that one must expect and also give to his/her better half...forcing her to have sex with you at any point of time (though in marriage) is RAPE!!", "_abhishek_o4": "Choices matters itz exist👍", "arora8718": "Xactly ! My pussy My choice @redheadwayfarer", "girritharan_shivaji": "Morally it is wrong to rape anyone..but making it a law could lead to lots of issue coz it will hard to prove.weather a rape actually happend or its a false allegation..Me personally i hate the idea of marriage why invole the system in your love life nd get married really??..marriage is nothing but a legal contract.", "nemo_.003": "No it is illegal ....in your story I accidentally rply \"no\"...sry 😶", "saanjh_gidwani": "I think a woman can still say NO!", "mrcasanova9": "Great message", "suk_anya": "💛", "king_kandir": "Sexxxy", "zreyuuu_23": "Rape is rape whether the girl is married or unmarried. One can't have a forcefully sex with anyone and if he does then it's undoubtedly a rape.there are cases where men beat their wives and have a hard and cruel sex in households. Now that is called a rape.", "ali_abram_saifi": "❤️😍❤️", "vidyut__biswas": "Ur T-shirt ✌✌", "anuj_bhadauria18": "Wow😍", "ambujanaik": "Regardless of any, and I mean ANY kind of situation and closeness between the two, if a woman says no, it means no. Similarly, if a guy someday says no, it means no. It's as simple as that. Whatever be their reason. NO MEANS NO. And if sex is forced upon them, it's rape. And rape can never be excused.", "khushisah_": "❤❤❤", "freefirefly_10": "Block", "sanjnabhalla": "In my opinion the point is not about considering marital rape as legal or illegal.. of course it should be illegal but before that women should know what's the meaning of marital rape because sometimes women themselves agree to this torture upon them thinking it's my man's right to ask for it whenever he needs.. so before making it illegal awareness should be created.. Women being emotional creatures thinking about their family and life which they think is dependent on men sometimes may not even file the case.. so what in that situation?.. so therefore they should be mobilised enough to understand what's right and what's wrong.. and of course law should be made for women who are ready to fight against this..", "amky_sjm": "The subject sociology explains “Marriage in different religion”. The explanation isn’t how different religions get married, it’s why they married. This issue is one of the main reasons.", "pdesai143": "@redheadwayfarer : this hair looks so better on U !!!", "mahir_parekh": "See ma’am the latest verdict does say that marital rape is now not legal in India but if you read the law properly, it clearly states that now even those marital rapes are considered as normal rapes and hence the punishments on the rapists(husband) are even harsher. According to me this is one of the best decisions by the judiciary of our country!!! Because those pervert husbands deserves to be tagged as proper rapists and hence be punished like them too! So in my opinion marital rape is not required to be legal in India according to the present laws! 😊", "a__li__sh__a_": "@redheadwayfarer tbh the society has such a narrow minded thinking they just don't want to understand what women goes through after a rape. It's not only men but also some women who think that a girl or women after marriage has given her whole self even to her husband. That '\"Pati parmeshwar\" things pops up, the link a person to God p. S That God Who Rapes, does domestic violence, torchers her Mentally and physically. I mean what..... The orthodox People think that Marriage is access to Unlimited sex. That's why In Villages and backward area pepl Marry Early... Cuz they can't stop their Hawasss. Women anywhere, everywhere are not safe. Be it home. Be it a temple. Anywhere.... Rape culture is something between a person and The Hawasss that he has.... A person goes so violent that he kills.... Like it's a tradition..... Kidnap, Rape for days..., and then Kill.. It sucks... And the Judiciary system just sits, watches the people doing candle marches and a nothing happens.... But yeah a law is passed that a woman can kill that person if she thinks he is going to rape her... Go India. I won't blame India for this.... But some pepl...", "mansi_09_manchanda": "Rape is rape and marriage certificate is not the license to rape a woman(wife).she should have the right to say no,her decision is equally important coz sex is a intimate thing u can't force it on ur partner if someone is doing so, that is a rape and any kind of rape should be illegal", "ankkyyy": "I agree to your point...the husband side thinks as if they have done favour marrying a lady and now after marriage ,she is a lottery ticket which they have won and can use it anywhere anytime...and this can be only stopped if the girl stands for it,she shouldn't be afraid of society and sasural...since \"Shaadi ki hai,koi favour ya social service Nahi!\"", "_shreya.kohli_": "Well", "prattickgurung": "Yes your choice", "diwakar_shivholic": "In section 375 of ipc exception 2 that says that sexual intercourse or sexual acts by a man with his own wife , the wife not being under fifteen years of age is not rape should be Amended", "vanshiaintasaint": "@redheadwayfarer obviously. Mentality is such a game you know. It changes according to the situation. And marital rape should be made illegal. After all a rape is always gonna be a rape. Marriage doesn’t give men rights to have sex and thus, no rape.", "sukrativerma": "No means always no... Whatever is rltn gf ir wife whatever...and if a partner can not respect her soulmate if he can't understand her feelings he started forcing then what is meaning of marriage its just unuseful.", "w_o_o_e_r": "Beautiful @the_perisher", "bonggirlmickey": "Acc to me forced act of sex aftr marriage is still an illegal issue", "unshut_ap": "Marriage is not just a ritual. It is much more than even sex. And idk how and from where this legacy passed on that you can fuck your wife anywhere and anytime without her mood, will or concern. She won't rebel probably as she has been tied to one man( willingly or unwillingly). But this is not how things between two people shall go.", "xyz_72882827": "Forced sex should be illegal nomatter what...💯", "vk1050552": "You are wrong your pussy isn't your choice", "sumedhasable": "@redheadwayfarer RAPE what we know about it is having sex without consent of a girl n to force her.... How does it matter its before marriage or after marriage just to fufil your lust you cant force your wife to have sex her permission or consent is very important she might not feel to not to have sex n that is ok u have to respect her society relatives they are never going to change there thoughts n this is the personal thing between husband n wife which i think all husbands should respect their wives.....", "mummas_ltl_boy07": "@redheadwayfarer yeah exctly ua pussy ua choice🤣🤣🤣🤣 evn i love cats 😍😍😍😜", "thepsychicgypsysoul": "@redheadwayfarer i wonder sometimes its a fight for women in this country to be tortured by the stupidity and control that man has tried to tame over years.and sure if sex in marriage or outside of marriage is forced.it sure is not okay.", "avi.abpsn": "Indeed Dear ☺️✌️", "i_am_dip": "We ,the people are so good at creating binaries across the centuries. And so this is social hegemony should also be simply put. Rape means sex without consent and if the woman does not want sex at that moment/let that be any moment,and even after that she has to had sex ,that is rape. \"Aakash vaani\" is a film that comes to mind while talking about maritial rape. And a country having 1.1 billion people,should have that social awareness,that sex without consent of the opposite gender is \"rape\",being married or not married does not change the definition of rape. @redheadwayfarer", "prakashsoniwal": "चल चरी", "nurul_diwan": "If we look at it from a different angle and the married couple get the freedom to make a choice, I think it'll keep the romance alive ...... The whole system of pleasing each other and making efforts will continue instead of just obligations.....", "ritu2564": "Beautiful.... N caption👌", "anmolanand028": "@eclectic_harsh", "shivanisharma7610": "Yes", "the_capricious_one": "Against consent is rape, come what may. @redheadwayfarer I read a comment here that says \"My dick, My choice\" so does it mean you go around sticking it every and any hole that you find? Well nice try for equalising rights where women here are suffering in most of the cases. The mentality that \"You are married, now start producing kids\" needs to change. A woman is not a sex-toy who has no say in a relationship and one uses it like and how they want. Doesn't the word \"rape\" alone make you cringe? Martial-rape is even worse. \"Little things\" is what they use in most of the marriages to describe martial-rape. \"Little things\" is what they use to cover the word rape. You go into a marriage either completely trusting", "shazia_bint_sattar": "I also think it's parents (both girl's n boy's) who have to change and upgrade their ideologies for this change you and I agree on to become a reality. @redheadwayfarer", "swami1984": "Well around 76% of Dowry Cases are false. If there is a law against martial rape almost 90% chances are there it will be misused", "surbhi_sagar": "uh r just amazing @redheadwayfarer Ma'am 😍😍 i respect ur thoughts nd agree for sm", "picturesbynivedita": "Marital rape is never fine. That quote you wear on your T-shirt is absolutely right. Its totally a girl's will or opposite even also boy's will to have it or not. Opposing oneself to other is already a offense. I don't understand why even we need to clarify this topic. Is marriage a signed ticket to rape? Half of us are dealing with this problem. And also women don't come up and stay strong and take there sides. They silently breathe everything in and smile gently to the world. Also you should be the one standing up for yourself. If it's not working walk away from this forced marriage. Our ultimate goal for living is not just find a life partner and settle down with him/her for rest of our lives, it is more to find ourself first. And also I don't understand, you married her because you love her, right? Then why you have to rape her to calm down your lust. I guess her presence is enough and opposing yourself to your partner should be considered a big matter.", "yashaswinii": "Rape is rape. A woman may be married to a man. But that doesn’t mean she loses her individuality. She’s still a person. She’s still got feelings and humanity in her. Her opinions and choices don’t fly out the window the minute she gets married. That’s not how a marriage is supposed to work. She can be head over heels in love with her husband and still say no to sex if she doesn’t feel it. Nothing ever gives a man the right to force his girlfriend/wife to have sex with him. No piece of certified paper. No bond in holy matrimony. Nothing. So yes. Marital rape should definitely be illegal. And I know we’re not talking about men here but it goes for men too. Men can get raped too.", "gurpreeetkaurr_": "I accidentally voted no on the poll... im a bit sleepy...but i dont think marriage is a free paas to have sex with the girl. She totally has the right to say no. . And if its forcefully happening so should stand up for it.", "swatikrish6306": "Marriage certificate doesn't have the statement called permission to sex whenever the man have mood .. 😒😒😒😒if u want sex you should ask for it. Forced sex will still be called as rape", "rohinirebellodsouza": "Rape is rape, no matter the time, place, person, status. You say NO, you mean NO!", "_stillfindingmypurpose_": "I really want to press the Yes button,but unfortunately I pressed No. In the story. Yes marital rape should be illegal because Physical relation should made from both concern or not from the one's side. Having a physical relation from one's side and that to be again and again will effect the mental health of the other concern.", "garnish_virdi": "This might be cliched or whatever but I firmly believe that whether ones married or not , if both are consenting adults and they agree then it’s all fine but if not then there is a serious problem. Being married or being in a relationship doesn’t mean that one has the right to take advantage. Our society and our thinking needs to evolve a lot or we will end shaming humanity again n again", "m.b.adil": "No words to say... But yrr....😮😮😮😮.....😍😍😍", "_benipalharman_": "I totally agree with you, NO means NO , forced sex clearly is rape in a marriage too, it’s just that you have to spend your life with that person but not that you have to let someone exploit you in any terms just because of the relationship.", "duranrosali": "Muy bien por ti en mi pais eso es ya un crimen ya sea tu esposa novia o amante mientras diga no es violacion pero pocas lo denuncia", "aadrashmehta": "This is india miss people here are literated but still a few put efforts to understand other's perspective. They just don't want to be wrong. Nevertheless a few are there who understands the issue you raised here . I don't know either the reason you are looking for. But i think if men respects there wife's choice i.e. what they want this issue will not be there. But i don't know how to make men respect the women's choices. I think its the thinking of the men we should change and the things will be better. Sorry if i have offended anyone. Its just what i think.", "aayushdubeyy": "Consent is key, married or not...rape is rape, the ones disguising it are assholes..also it is not a thing between couples, kal ko woh murder karke kahe ki it's a personal thing toh chalega kya?..we men, need to understand ki hum unhe khareed nhi rhe, woh koi object nhi hai..they are as human as we are, they have feelings, and when it doesn't feel right, the women should say NO and men should understand..FOR those who want to get a better context, I recommend them to watch MAN'S world, it's a web series available on YouTube...", "a_man_adhikari": "No of fake cases will increase", "pranay_vermaa": "Daym! People have much time to write these longass replies. I mean this is not a debate forum, regardless of the topic. 😄 @the.angad.panesar @cancer_1992", "thebakasur": "@redheadwayfarer I think marital rape should be made illegal. Just like right to life, a girl also has a right to decide if she wants to have sex with her husband or not. At the end of the day, it's her choice. The concept of men being superior to women and having a right on their wife should be squashed. Having said that, even Men should be equally covered by the rules, so that there should not be any abuse of the law.", "_arunchristian_": "🐈", "liberateyourminds": "When a women is married to a men. They consider themselves husband n wife with all the rituals, but at last when we get to know wife is only maintaining the rituals not husband. They do think, they got the whole license to do anything with their wife's without their permission, forcefully having sex , then by chance if she gets pregnant , abort the child without their permission. And this is probably happening in today's educated world. @redheadwayfarer i agree with you. Martial rape should be illegal. And women's those who are suffering should take an action against there husband's.", "distortingimbecile": "Rape is rape. Marriage doesn't means that someone lost all the rights of his /her own body. When there's a NO, then it's a NO. Marriage has nothing to do with it. It's more disturbing that how someone could be that ridiculous with the one who has promised to walk the whole life together for all the ups downs that will come across. Every rape is illegal, so is marital.", "shambhviverma9": "Definitely.. My pussy.. My choice.. And wtf.. Circumstances made you force your wife.. Its rape.", "vidyut98": "rape is rape . And martial should be illegal but mistakenly i took no in your last poll story", "pakshal_k": "Its true, the mentality of not recognising marital rape is bad. Just one Q How would u prove a marital rape in court of law? & if its illegal, it can become a nightmare for lot of men, the wrongdoer & the innocent.", "tanya110292": "I believe martial rape should be a point of concern but I also think that women will not be encouraged to go ahead and file an FIR. Then family courts will have the proceeding and there would be kind of Pterocarpus in relationship . So there should be a major understanding and should be proper consent and discussion for that .", "sagarjha9595": "If a man do this it means he has no love, respect and care for r her wife.... first they have to discuss about it .. and if he repeats it again.. woman should take action against him or leave him...I really admire your way of thinking and it opens the eyes of unmarried man too.", "shivam_software_artist": "See!! Rape means without permission & obviously it's a crime but when we talk about martial rape, I saw an article, which tells that there is no hard rules for martial rape, as it is very tough to prove it, govt and court both agreed on the same, but it is a guarantee that if we would find a way to prove maritial rape then most of Indian men will be behind the bars.", "animesh_ib": "@redheadwayfarer A no clearly means no... If wife doesn't want a husband can't force himself upon her.. Just think other way round.. If husband is not willing and wife forces herself upon him that also should be term as rape..", "itstartedwithahaircut_9964": "The biggest problem why India fails to recognise marital rape is because our dear politicians still have a narrow concept of sex, for them ,a female doesn't have sex for pleasure but only for the sake of bearing children and that has a sense of consent in it. I wonder how much consensus was ever formed to know what actually a woman feels. Marital rapes happen ,are as painful and sometimes worse than the other types because of no proper system of redressal. I wonder how would that lady feel who is caught in this web of mrg and is objectified by her own husband. This can only be improved if we ever try to overcome our idea of consent. I hope the day comes soon when women actually have consent in India. My answer is a big 'anti-forced dick ' yes !!", "williamalases": "I understood what you think and I agree to it totally!", "anuprikachu": "In many villages girls marry their rapists...and the women on this day too have no right to choose their partners...so yeah...the woman didn't chose to have sex with that man...so that's obvio rape! Plus why would a woman choose a life partner with that mentality (obvio if she's allowed to)", "mallik008": "Ppl sud understand each other mood.... ys u do daily bt i do make her mood..suddenshe jump on me....its a tips to make joyfull life", "priyankapachpande": "Rape of any kind should be illegal. There could be several thought patterns of people that could possibly lead to marital rape..one of them is talking about sex. It could be that because people are so suppressed about sexual urges that the solution to them often ends up at rape and marriage for many. I have heard 'humare yaha rape allowed hi nahi hai...galat hai rape...shaadi karlo agar itna hai toh!' Though this is utterly wrong in every way, one can see the tangled mess of where it comes from ...maybe what's required is an open discussion creating empathy on all levels of the society @redheadwayfarer ?", "melishcs": "Rape is, and will always be, rape. No matter the circumstances.", "doodlebum95": "Everybody has a choice. That's what I believe. You can't force someone to do anything against their will. Nothing and I mean nothing can justify one human forcing themselves on another. That is wrong. Marriage is not a free ticket. It's a commitment. You care for one another. It's about understanding. So if she says no then the husband should go okay she isn't feeling it today I'll just take a cold shower. If she says no everyday then why are you guys married. So what I'm trying to say is.. as a law student this constitutes rape as consent in important. In the absence of consent it is rape.", "swathiketha": "Marital rape should be illegal. No matter what the situation or circumstance, any human being reserves the right to say no. This goes for everyone. Men and women. I think there are a lot of people who bring up the point “but that goes for men also why aren’t people talking about that?” I find that along the same lines of “why is black lives matter a thing, don’t all lives matter?” The point is not that men don’t matter, the point is that there is a history of oppression when it comes to women (including trans women) especially when it comes to their bodies and people telling them what to do with them. A woman’s body is not a conduit for pleasure. A woman’s body is her own. She is an individual and not to be used. Anyone who thinks that the act of forcing a woman into having sex simply because the relationship is of legal marital status, fails to understand the simple concept of basic human rights.", "abbhinavsrivastava": "God bless u ... respect and u r awesome 🤘🏻🤘🏻🤘🏻🤘🏻", "prasadkelkar2805": "Rape is Rape. The person who even tries to rape a girl or a women should be punished brutally and the person rapes should be brutally punished and then be hanged till death. Marriage doesn't have to do anything with it.", "ved.1097": "All i think is NO means NO.. its doesnt matter if she is married or single.. If she is not comfortable with the guy /bf/husband ..she has a right to say NO.. Whn it comes about marital rape..yes..It is illegal.. @redheadwayfarer", "mannu__kapoor_": "Sex is different.... Making love is different.....if one of the person is not ready than other should understand, without any feelings...just to satisfy the hormones u cannot force the other.....and yes that'll be called Marital rape....if one is really desperate for sex he or she should masturbate and satisfy their hormones...", "not.so.old.monk": "Against the will = RAPE! There should be no ounce of dispute there", "nandittaaaa": "It is a woman’s right to say ‘No’ irrespective of the relationship status, married or in a live-in relationship or having a boyfriend. Marriage should not change the law. If a woman can file a rape complaint against her boyfriend/live-in partner for having forced sex, why not against her husband? Marital Rape should be illegal.", "sarfarx": "Well, of course marital rape SHOULD be illegal, but sadly isn't.The whole thought process stems from patriarchy, which is prevalent in the Society, especially in rural areas where my grandparents are from.Men are supposed to take all the major decisions in the family and women are supposed to cook, clean and take care of children.Some of these men don't even mind hitting and hurling abuses at their women in front of children.They say a child's mind absorbs things very quickly around them.Sadly, innocent kids grow up to be nasty men. If a women ever talks about being forced by her husband, she is told by her own parents that she has to 'learn to adjust and that it is 'normal' for a man to be like that.Men who aren't like that, their women are told that they are very lucky.Sex is not supposed to be discussed at all, and most women don't even realize that they are being raped.In the traditional panchayat, the sarpanch gives punishment to both the girl and the boy as both were 'involved'.lol.Why don't we blame someone who's been robbed, because hey, you were provocative to the robber and that's why you were robbed.Sadly, our 'bujurg' think that rape is a part of society and will continue to be.sigh.", "_jagriti_1999_": "It's always a personal choice , none stamps , such as of marriage , can take away the individuality and the decision . Getting married doesn't mean that you loose your identity as a female , it means that you hold hands with a person who you want to spend your 'life' with , not 'bed' ! Marital rape , where sex is being done without consent of female , must and should be made illegal . Marriage is not just to have sex but it means far and beyond sharing bed with someone .", "tjvshl": "👏👏", "shreyvats": "I think its depend on sitiuation one he/she is in , like if if you are in a relastionship/marriage and if you want to have sex or you are egaer do it you can consult but you can’t force it to someone. But at the end of the day if you want to be in the relastion/bonding those little things matters it make your relastion ship strong both phycially and emotionally. Nature prosper in this way 🤷🏻‍♂️", "shalini_tiwari2505": "👏👏 great yaar", "simmi457": "It must be illegal for sure.", "lx_00123": "Ok ok .....all the best for your future GIRLS", "manisha.sachdevv": "It WAS accidental NO ... can you post it again plz .. I feel horrible", "fatimamasud95": "Marriage is bigger than just sex. If he/she says no and the person moves ahead to have it forcefully. It’s rape. End of story.", "veebzbhargava": "@redheadwayfarer where can l get this shirt?? 😍", "raapchik_ruchi": "Of course its wrong.. Bt since marriage is not just marriage for us. Marriage is a religious affair for society which could not be questioned.. Bt since our society is in transition stage n we along with society are growing on path of modernity,this process should be reviewed.. Rape is rape and marriage or no marriage doesn't make any difference.. Mutual consent is must.. Respect ur partner then only expect it..", "dravika_trehan": "It must immediately be declared ILLEGAL. Women used to fear earlier to report cases against in laws, but domestic violence act made it possible and gave empowerment to them. THE REASON WHY IT IS ACCEPTED IS BECAUSE THE DAY A GIRL IS BORN, SHE IS TAUGHT, HER HUSBAND WILL BE HER OWNER. And women accepts forced sex as something she must accept. To term it illegal, a lot has to be done !", "its_kumas_planet": "#Feminism #women #equality", "swiet_pearl": "um so glad u think in d same way dat i evr thought of it and u r absolutely ri8 itz all about equality between the two partner that are married to each other so everything should be same..no means no whether she is married to u or not..and the other one should respect her decision because she is not a thing.", "beingaabdi": "Obv it should be illegal..Marital rape is as equal to rape.", "mehreen_bano": "I agree ur word", "shectal": "Is it not illegal in india? It is a crime in nepal (although how many get reported or taken seriously). Of course it should be illegal. Someone's body is always theirs and it's wrong to force someone when they are not willing. Forget law, how is coercion even good for mutual respect and happiness?", "priyalolololol": "Ofcourse illegal. I wish all men were born with brain that guts , and learn to listen. And maybe it’s not just these men, their parents must teach them to love, to be tender, to care. Their friends should teach them to feel guilty of the wrong things instead of praising them for. Men must understand respect, as understanding a woman is highly impossible.", "dhaval_parmar226": "Rape is illegal. No matter it is marital rape or whatsoever. There are so many Boys there think marriage is a free pass for sex. And I think if a girl disagrees and a guys still does it forcefully then it's rape. And it is illegal. :)", "ridhima_tripathi": "I completely agree with your words... In our society ppl use to think that after marriage they get the right to fuck the bride.. whether she wants or not.. m with ur words ma'am..", "pandewithoutay": "No marriage no friendship no relation is a free pass to a women's vagina. Until and unless a women consents to it nobody has the right to force themselves upon her,no matter how close you are . #mypussymychoice", "iamhoneybhambra": "Yes. Sry by mistake i select no😣 in your insta story.", "arshiya0__0": "Your whole context is based on assumption that only women gets raped... Can a woman take a no from her husband ?", "_.pramitii": "NOOO RAAAPE SHOULD BE LEGAL. MARITAL RAPE OR ANY ABCXY RAPE.", "therealeastwind18": "Marital sex should be illegal! All of us have the right to our own body , no one else does and hence forcing someone into the act just because ones married doesn’t make it right ! Rapes or marital rapes are according to me are synonymous. We don’t even know about all marital rape cases where the aggrieved women are made to believe that their husband has the right to their bodies because they aren’t made aware about the fact that it’s WRONG AND CRUEL !!, and no women deserves it and hence end ups being a victim to marital rape till death . Rape in any form isn’t HUMANE!", "rohanofficial__": "POINT", "alee_alina": "Bro❤❤ i love you mam🔥 u r just amazing just naman ho guruji", "sonika_jha_": "👌👌", "mr_veganstagrammer": "Your pussy. Your choice. End of topic. Period.", "j__kayyy": "Can't agree with you more!", "lostiswhereiam": "Ofcourse marital rape should be illegal. Women are not just flesh and bones. They are creators, they nurture too. And they have every right to decide what they want, and their consent should be of utmost importance to the guy, even if he is hus lawfully wedded husband. She should choose pleasure not compulsion. Her call at the end of the day. A rape is a rape, whether you're married or not doesn't matter.", "snook.san": "Ofcourse no. Its a big no. Martial rape is as equal as a rape.", "theunique_sim": "Some people feel getting a 'married label' gives them the right to demand for sex from their partners. And dont count it as rape. But it is. And marital rape should be illegal.", "dishanandwanii": "The thing is people need to understand that marriage isn't a free pass for sex. Marital rape is illegal and should be taken likewise. The system, the society, it's people need to understand that marital rape is a crime.", "vampire_vira_shree": "Lit #respect🙂😎 #caption👍", "aadilicious_": "Ur The best", "valiant_bitch": "Beautiful ♥️♥️", "phalgunidixit": "Marital rape is so traumatising..Getting forced by a person you love and have chosen to spend your life with! More than physical, it leaves the person mentally scarred", "shruti.pokhriyall": "YOU ARE SO INSPIRING TO ME! As an ardent feminist, I've dealt with it all. The taunts, the stupid jokes and abuses. But the way you handle everything truly inspires me, i wish i could be as strong as you. Coming to this cause, once again i completely support what you feel. Marriage is a decision two people take together, that principle doesn't just end after you've completed your rituals. The autonomy, the basic freedom to make our own choice is central to any institution and should be so with marriage too. It's not even the men's fault for believing that way, for believing that marriage is their key to unlimited anytime sex. Its the society that fills their head with all that crap. Teaching people to control their sexual feelings until they get married is more harmful than it seems.", "donesofkndone": "Half of the guys commenting on this picture don’t even understand the motive behind this message or the concerned view points. They just here equally as all the “so called” men who often just comments some bs and emojis. Lol. Sad. And yes definitely it’s got to be illegal. It goes without question. No explanation. No justification.", "rajatkhot1995": "😍😍😍😘😍", "vaishaliupadhyayayyy": "💕💕💕", "sugar.moon.drop_": "❤❤❤❤❤", "rohit_kute4141": "😙😙😙", "vaibhav_gupta_98": "Yes it should be illegal nd sm people didn't just by mistake voted No they meant it coz they are just some MCPs 😑😑", "_dhruvi.7_": "@redheadwayfarer di some idiot think that marriage is a invitation for them for sex but it's no if a girl/woman don't want to be then you can't force her ♥", "ponipixe_exoticmix": "Dope 🙏", "himanshu.14_97": "🤗🤗🤗🤗 i lyk your choice", "nivedikagupta": "Lit picture plus caption👌", "shilpa_dwivedi_": "Lit 🙏🏼 #respect"}