{"b.a.l.i.10": "Wow! Loved the caption👌❤", "heerrnaa": "hey! I don't know if you're reading this or not. But your post has really changed my opinion", "catsandouzo": "Omg my thoughts exactly. 😘 You go girl", "s.h.r.e.y.a.s.h.i": "One word for you - Mental 😂", "nehatahaliani": "❤", "britneyfrancis_": "I seriously don't get the point of this kind of feminism. You can support feminism or be a feminist even without showing your body on social media. If you're a social activist doesn't mean that you'll show your body to prove your point.", "all_time_stoned_v2": "I don’t wanna even comment what I really want to say, Coz u ll probably start shaming the males. I don’t know what u have gone through but I hope it gets figured out at the end.", "imdev11": "If you want to adopt a baby CARA will never allow the 'MENTAL' like you.", "mytrippingtoes": "It's like I am reading my minf through your words. I never wish to conceive a child of my own and when people get to know about it, they ask weird questions. Why wouldn't I want to ? Why adoption when I can conceive? It's sad to know that people think adoption is only an option for those who can't conceive a child of their own. ✌️", "yasnasehgal": "It's really like every word is mine @jatinchugh09", "shubhasheeshsharma": "aap kuch jyada hi feminist hai..mam.", "dharamveer1818": "💋💋💋", "mrinmayi_pund": "Bang on !! 👊🤘❣", "kalinga_lipu": "💗💗💗", "zoom_666_666": "Shame", "bs_barkha": "Same😊", "surabhi_tiwari21": "@shobha_2617 read caption!!", "ravalika_sajja": "Amazing! Very very well written!! Finally somebody said this loud and clear!", "darshan4insta": "Yeah that's fuckin' right women's body is not just a oven for buns to cook up in it u can do whatever you want I love ur free spirit n hope that all the females n males learn n understand what ur trying to say - just a big fan of ur work #salonichopra❤ #truefaminist", "karanjeet_41": "How does the photo and the caption relate?", "pi_day_pisces": "Dear @redheadwayfarer a lot of people on the road including labourers stare at we girls while walking on the road and eve tease.Should I show your angrezi gyaan to them?Do they know you?Will you come to rescue us?Can you come in the same attire like this pic n give them gyaan?If so you'll be true feminist.If not you're just an attention seeker damn celebrity model.", "aish7130": "Saloni Ma'am I wanna talk to you .. Please whenever you get some time.. if possible arrange some of that for me .. @redheadwayfarer", "upasanahanda": "#yescampaign", "namrata_s95": "I think both kinds of people, those who judge this choice, and those who keep having kids one after another need to understand this. Adoption, and the importance of it in a country like ours.", "the_biker_who_scribbles": "I’m sure not many girls will agree with you. You should be happy that you have this beautiful gift and power to make a new life! Ask people who can’t have a baby of their own for any reason. And you made it sound like it is some sort of a disgusting activity which is being forced upon you. Coming to adoption, you can always adopt while having your own child and not show it off to the world. Rest is your choice :) You just made a shitty post because of your feminist ego. And now i’m fully convinced that I’m unfollowing you.", "tllachenpa": "@redheadwayfarer mam i really like your spirit and as a young girl i look up to you as an inspiration and a role model, as a guru. But i have also read that birth pills and not having children have side effects and those women who take pills and don’t have children are at higher risk of breast cancer. Can you please let me know if this is true since you have vast knowledge of female rights, im sure you have also done thorough research on female biology and have based your choices about what to do with your body after fully researching and have made an informed choice and not mere choice", "tapasyaaa__": "@redheadwayfarer your words inspired all of us...but you could have done that without showing off your nipples. No offense but you know I'm right", "riyasharma104": "Anyone that says abortion is similar to killing their child has literally no biological knowledge. A legal abortion never hurts the foetus or the mother and is done before the foetus develops enough sense to function even minorly. The only lives that matter are individual lives of people. And at the stages of legal abortion, foetus is nothing but the part of a female both, not an individual. No one has the right to stop a legal abortion wanted by a lady and y'all can get hella salty about it but our laws agree as well.", "sillytangy": "Teri to shakal bhi shit hai isliye dikhayi nhi h tune😂😂😂 @goat_abyss", "coffeeandindulgence": "Very true.... having the same emotions. I wish some men think like this too", "oluwasegunrichard": "hello baby I want to fuck your pussy so ruffly and mercilessly with my big cock and suck your boobs", "illumishawtii": "Damn look at all these males saying women wanting abortion is bad. Like please educate yourself about abortion. It's not killing a child. So much hate, they're concerned about an unborn child but are abusing and threatening a real live woman. These people have to start to understand what our body our choice means. Unless you have a uterus you don't get a say in what the people having uteruses should be doing.", "world2713": "@fraisadnan haha I never said 'only Muslims oppress women' don't assume things, I said you are one of those people who think women should only wear burkha, first change your mentality, koi naked nhi ghumega itna Dimaag sab ke paas hai, and everyone's has a right to wear whatever they want. But you won't understand this, she is not naked, and koi bhi bikini me roam nhi krta road pe 😂 usne post kiya aur aapko itna problem ho rha, why? Tumhare jaise log Jo bas apne ghar me aurato Ko burkhe me dekhte rehte hai unko ye dekh ke Ajeeb lagta hai, but problem tum me hai, Sonali me nhi", "fraisadnan": "Wts the relationship btwn scare no mare nd almst naked pic... Feminism was appreciated... Womens opinions were appreciated... But this is vulgar.... Wt if i stand nude infrnt of girl ... They will put me in jail for my actions ...or i could get beaten by mob... Well u surely looks to loose ur mental stability... U lost ur path smewhr....", "aabhagupta_": "Hello ma'am! I am from Agra . First of all a salute and lot of respect ma'am. People like you make us realise that it is not wrong to share your opinion even if the whole \"so-called-society\" is against you provided you stand for a great cause.What you do , require lots and lots of guts and courage. Few days back I told some of my acquaintance about giving birth to a child or not is my choice. Some became angry while others mocked at me.That day I thought that maybe what I am thinking is wrong but after reading this post I realised that I was right and I have to fight for making people understand this. But your posts inspire me so much that I know I am ready to fight. Once again thank you and lots of love and respect.", "ajj_u321": "If you have decided to never have a baby from your body why can't u do some operation which never makes u pregnant and then enjoy as much as u want without taking pain of abortion process every time u fall pregnant.. as an old saying \"prevention is better than cure\". Why should we have to plant seeds when we have no intention to grow a plant.. Just change the soil if neither u want to use bin nor u want seed turn into plants..", "they_call_me_vivacious": "@lavishmotani you will love this", "shivigupta567": "@mrinal9721 this is like my views ❤ totally seems like she's written my thoughts..", "iamamanrana": "i wanna know y u keep uploading people's comment on yur status it does not make u cool i knw thy r wrong but by doing this u r nt getting right or wrong as well u knw i really use to respect u alot whn i use to watch u on t.v i really loved yur acting but i never expected u troll people's comment like this i mean u do it its yur choice i dnt knw wht u think but its jst kichad me pathar maroge toh kapde apke hi gnde honge let those people say wht thy wnt u cn block thm or jst leave thm kuch roz bhokenge fir shant ho jaenge no one cares wht those cheap people say abt u all we care abt u hope u didn't misunderstood anything n if i said anything bad thn accept my apologies", "lovesagar_singh": "I send ur posts to my girlfriend (a few of them) coz i want her to be as fearless as you are..", "potter_head09": "@rupama_roy what u just said itself is a joke! 😂 👍 keep it up lady. I cannot argue more with assholes like you oh sorry rapists* ( and for ur kind informating countries in the West too follow the number 0 which was invented by aryabhatta an Indian mathematician incase you aren't aware of) and the point I referred to was about the status of women in the Indian society! Okay? If u still don't get this in your head then leave it", "setusidu": "Respect your thoughts completely !! Just that thing \"abortion should not be illegal\" .. please think before you write :) #morepowertoyou 👍", "advaita_gk": "I agree with you. I'm just 17 and still too young to think about it but I actually agree with your thoughts. A lot of my family members and friends be like, 'having a kid is beautiful' and 'you'll know when you'll have your own kid'. 'have your own kid, don't adopt' but what they don't understand is, I have a choice to decide. And its not that I never want kids. But I really want to adopt one and I don't wanna bear children in my womb. Its my body and my choice. I appreciate your independent thoughts. I relate. And to every person who's talking shit out there, to hell with you! My body! My choice. Love ya' @redheadwayfarer", "witty_wild_hurricane_": "Such a gorgeous", "amalsutradhar14": "Yes you're posts are inspiring because there is both pain and reality in it. But being an inspiration to someone also comes with a responsibility to stand up for those that walk in your footsteps.", "ifrathencute": "For you discriminate if you love only what you produce. I just love this written piece! ❤", "makrkapa": "OK beautiful we got it don't kill us every day", "uknowmebetterthanany1": "M proud of u I wished I cld have an elder sister like u.. thanks for motivating us", "donato_biker": "Beautiful", "massimotornello": "Bravissima 😍", "godwitha_j": "Wow. So eloquently and powerfully stated. You are hella inspiring, keep using your voice and platform!", "ryleeann_k": "❤️❤️❤️", "aparanormalbeing": "Love u darling😘", "diabolus_shreyansh": "You just think child a burden🙃😦", "dudenitx": "So bful of a thought and respectable too .. u r truly a women , a queen and a warrior. ..", "salonidesai47": "Love u ! ❤️❤️❤️", "canonwaliladki": "Totally agreed with you @redheadwayfarer ❤️❤️❤️❤️", "the_ludo_player_": "😘😘😘😘😘", "sorryraghu31": "Wish u show ur nipple or ass", "shi_ban_gi": "Okay... adoption is good..I mean very good but that doesn't mean you have to abort your own child with whom you have a blood relation...and if adopting a child is t ur only moto..then you should be more careful before conceiving...cz the baby of yours who is developing inside your womb has also a equal right to come in this world..and if you are saying that the world is too cruel now a days..than it should be our,and especially your responsibility to make it harmless for your child as a mother... otherwise if we start to think that we won't give birth to our children as the world is not safe for them,then one day whole human being will be finished.. destroyed", "rashee_yadav": "Why are you promoting abortion just to support your views on adoption?", "rajkumar007kingmaker": "Temptingly stunning beauty", "payal__tiwari": "💯💕", "silvana_siddiqui": "This is not the way redheadwayfarer to grab attention.Don't teach us wrong stuffs which will put ourselves in danger.", "z_surinder_randhawa": "How much you free really", "rohityadav645": "@ashneet_kohli", "kevalk111": "Wow.. This deserves a million likes.. No doubt you made your heart so wonderful & so beautiful", "pallavnadiadwala": "👑🙏@redheadwayfarer", "pramodsin": "@redheadwayfarer 1st thing I respect your felling it’s your life so u r free to take do what ever u want to do. But just want to ask did your thanks your mother yesterday for not thinking in same way and bring you in this world 🌍???", "karan_verma7": "Beautiful message. Also very hot picture. Daammnn !", "insearchofanswers": "♥️♥️♥️", "anujb2910": "agree that society had no right to tell you what to do and what not to.", "roy_12.07.93": "Wow !!!!!!! 😍", "shail.raj": "All of the people are following u just because of ur nippels and ur body nobody is interested in ur damm femainism thinking just show ur boobs ur followers will get some masala", "prabhakar273950": "Kapde pahn lo madam aap", "ssbberry": "Kuch bhi bol deti hai yeh, isko sirf aur sirf attention chaiye logo ka ki Instagram kholte hi iski pic dikhe aur bada sa caption ke saat", "pritam_you": "So small", "palomalarrondo": "Girl, one day I want to meet you in person. I would really REALLY LOVE to talk about all of this. You re amazing, a wonderful human being. And may whatever god/gods/forces you believe in be with you. Thank you", "asifkabani.ak": "Bravo @redheadwayfarer", "exploring_priyanka": "Hey Saloni. I always appreciate whatever you write. I agree with all u say here except killing a fetus. Adopting a child and killing a fetus are two different matters. Please don't mix up these two. 😊 Keep writing n inspiring. @redheadwayfarer", "siddeshsv": "Nice Boobs 😘😘😍", "ade.line_lewis": "I ADMIRE AND RESPECT YOU SO MUCH! 💗💗💗💗", "farzana_ahmed03": "The thought of adopting child is a noble one and much needed in this world. Adopting instead giving birth can be one's point of view and very own decision. But abortion should not have any relation with any of these. Abortion could be an option for some real countable reasons. For instance mother's health issues. 'Legalization of abortion' doesn't relate to humanity. If you have a fetus in your womb, than you have to take responsibility of it too. You should know that whatever you're destroying is a living thing. And that should not pay the price ,because your birth control failed.", "swatisaini_": "The last line of this write up just stole my heart... It can't be more truer...", "cranky_cake": "Dear first lady love @redheadwayfarer there's no doubt in the fact that you merge and make alive do many buried thoughts in me as well as many of us. There's no doubt that each word of your's is somewhere deep rooted in some corner of a person. Thanking you wouldn't be enough but again that's the only way I or we can make you realise how inspirational you are. While reading your content, i felt like I was pouring those words out & it boosted my courage in a way that someone else is along with me. Therefore, thankyou.❤", "sanjay_sanjay_": "😎", "baigstagram17": "I see a lot of young women getting inspired by this shit. And I see the reason why people tell aajkal ladkiyan Sahi nahi hai.. please ladies feminism is a trap that has already spoiled a lot of relationships, marriages, homes and friendships. Please don fall for it.", "rishabh._.shukla": "You made a good decision. I pray that every couple like u... can think of their society also.", "vijay_dwd": "Don't mix up scared no more with bunch of lingerie pics.... Choose wisely how you put your idea in front of the world...", "himali14": "@anujb2910 read till the end okay?", "aniketprateek": "Having similar thoughts myself, I am scared to death about what we leave behind for this world @redheadwayfarer ! The problem here is that nobody understand the concept here ( you must read the comments that some of them admit to concur with your thoughts still tell you not to pose in bra. ) They simply don’t understand the meaning of ‘choice’ let alone respecting someone’s ! People here are so judgemental that every other rational is beyond them. And yes I am few of the bunch that totally understand and support adoption over conceiving. But ( here is an important aspect) conceiving is not only about your eyes and his ears. It’s also about your brain and your thoughts and your genes ! I am so sad that people who claim to support you and concur with your thoughts are also not able to appreciate and understand what you truly mean to say let alone haters which by the way are majority. I believe that world need a few more better genetic lines for evolution in true sense . Just trying to be suggestive . Bad at writing to apologies!", "unique_bhardwaj_6785": "nicyy", "tanixus": "U r a strong soul .", "_riitikaaa_": "RESPECT🙌", "_.santanusekhar._": "@redheadwayfarer so the father would have no say in this matter(abortion)?", "liannegrsham": "Yes", "msflsk": "Wow", "rheamakwana": "@pracads", "nronrinn__": "If you don't agree with someone's opinions, great. She did not dm it to you, she did not comment it on your pic. Live and let live. Let her do whatever she wants no? How is it bothering you? She didn't ask anyone to post pics in a bra but if she's going it then what's wrong with it? Also if she doesn't want to give birth then it's her decision. Being a woman, having a uterus doesn't mean every woman wants to give birth and/or become a mother. THAT IS HER CHOICE.", "stranger_on_the_move": "Respect! 🤘🏼", "salmannkhann": "Why yu show your body ? Nudity are not Feminism? @redheadwayfarer", "reshmi2902": "Hi. Your words voice the emotions in me in such a lucid manner. Thank you for being THE voice to many a silent ones around...i have taken this decision never to give birth and yes, some of my family members, some of my in laws have raised many a eyebrows...but in the end...it is ok. Yes the fight, the struggle was real...i will never be able to convince them...but its ok...i dont want a life inside of me...but I know it is ok...it is my choice. Thank you ma'am for this...", "rahul.rightnow": "Aur ye baat nangi ho kehne ki kya jarurat thi? We like ur thoughts, we like ur body, we like ur bra and panties too. But why Everytime u say all the things by showing ur body or undergarments. We know u have a great body, we like to watch it and we don't have any problem if u share ur half naked photos. But the problem is we don't like ur thoughts about feminism by showing ur body. U wanna write about feminism.. just do it, but whats the point of being naked. Be naked and show us more, we won't ever get enough of ur sexy body. But please don't associate nudity with feminism or any social topic or the thoughts which is nothing to with showing skin. @redheadwayfarer", "adonis_shreedhan_singh": "🙄😕👍", "hafsa171": "Why is she so tragically disturbed? Whatever happened with her ?", "petrol_head07": "Wow..are you adopted??", "_nancyy_31": "@niharika_goyal901 @harshita.periwal18 my thoughts exactly", "nickiehoro77": "@aprilmargopotter Hoping this helps", "nikks_naryn": "Just the best read I came across today🙂", "docsrivastava": "U r an amazing person.. u just spoke out loud what i have been feeling fr a long time! M glad to have known u..", "mrunal.shankar": "Same thoughts.. Literally same...", "rahulsweet947": "Kya yaar so sexy", "charmingly10": "I'm always moved by you and your strong voice and I can only imagine the amount of struggles and mental break downs you must have gone through to reach this part of your journey where you can speak your heart and know that people will talk shit but it will not break you down. Adoption or birth of a child is completely your own choice anyone telling me it isnt has never really understood the concept of a mother. A mother is not just connected to child by birth and if she can love an adopted just as much who is society to tell her that can't be called a real mother. What you do with your body is your choice and it should be labelled as \"pro-life\" and make the other ladies who decide to abort feel like murderers. When a girl decides to abort she takes into account so many factors and then make the choice. It's her body her choice so please do not make her feel like she owes it to you or anyone else to have that child", "46manoj": "Cute boobs", "itx.ritss": "my girl inspiration", "_kim_manu_": "@redheadwayfarer ...i dont know why....somehow when i read this....i didnt understand if u were rude or just different but yeah i accept the fact that there are n no of chidren dying everyday to live a while longer......#irespectyourchoices", "aayushi_990": "I can relate to this post so much. I never want to get pregnant or give birth to a child..but that doesn't mean i hate kids I love them the most.. I have my own reason to opt this and it should be respected", "surxbhi": "I FUCKING LOVE YOU AND YOUR CONFIDENCE AND SELF ESTEEM WOMAN OML ❤❤😍", "bugs_bunny190": "MUST READ....., 😊😊Listen.... Ma'am i m totally...disgree give a birth to a child is not just a process it is a explaination of endless love... You modern girls following western culture believes in only excitement.... AND enjoyment.... ASK TO ur mom.... How much sacrifice she had done to made ur life comfort....... BCOZ OF ur kind our indian culture is suppressed... And the INDIA IS THE ONLY PLACE WHERE MOMS AND CHILD RELATION IS POWER OF TRUE LOVE HAPPY MOTHERS DAY RESPECT MY WORD AND UNDERSTAND", "iam_ruuttuu": "Perfect decision 💯🌸", "harshasonkusare04": "@redheadwayfarer whatever you written over here.. your each and every word is just beautiful, right and perfect👍👌😊 Lots of people forget to do right things and when somebody's doing they start judging before knowing anything! I have same feelings like you have for kids.. ❤😍😘", "amodsakpal": "@redheadwayfarer I agree with ur point of view and I really appreciate the way u put forth so many issues . I have read so many replies and i feel many females relate to the issues and find happiness tht atleast there's somebody who is talking abt the injustice , stupid norms of the society ,etc etc . 👍.", "chahal_sky_": "Hey i just want to say thankyou @redheadwayfarer That my point everytimes ....i have decided this at age of 14 or may be before ...i love the way uh said this ..u r a person with Beautiful mind ,soul and body 💓💓👄 #scarenomore", "harmeet5523": "Best thing i have read on the internet in the past few days :)", "i_m_sams": "wait what? you think people shouldn't feel like murdering after abortions? why dnt they use condoms?", "raviteja_9": "👍", "illusion_fades_away": "Thankyou so much for this post. More powers to you.", "glam_attire": "I am not completely agree with this one .. i think its not only the girl decision ..both the parents have rights whether they want a child or not ...secondly , abortion is illegal in india to save girl child otherwise you knw it very well .. Indian mentality ..most of them want boys instead of girls", "pinklion26": "I was told the same things and I didn’t change my mind either. I too have never been tempted to have my own at all. I’m 40 now and happy with my decision. I haven’t adopted yet but would love to.", "melissasharonsaldanha": "You CANNOT promote Adoption by supporting Abortion.", "dr_riyabhat": "This is so important .", "coca_8368": "Amazing to see uh as a lady.....amazing to see ur decisions...uh hve the power #therealqueen 👑🙌", "sukrity_tandon": "That is why i love your thoughts. 😍😍 #Agreed", "theunfamouspoet": "I love you more after reading this. @redheadwayfarer", "mecjosh": "@_annannyaa . U r doing well work! Well keep it up. D same thing I too tried above. Bt there is no shortage of perverts here. People don't have shame like seriously!. Still lets keep working hard🙏", "anukshabharat": "👏👏👏", "___bhavana.____": "🙌🙌🙌🙌", "richaagrawalradhika": "Saloni di it's amazing m really so happy to read that..", "roesa_grg": "Your all posts are so amazing❤️you're so beautiful from inside n outside and your thoughts are really powerfull keep doing what you love @redheadwayfarer you're my inspiration women waiting for more posts 🤗💕", "iakshay3010": "Wow those nippies😍", "huzaifa_jetaji": "For this post you should feel shame😑 on yourself.", "heer_chhabria0711": "@poptiyavarsha", "ritikagurnani101": "i completely agree with you❤️", "ishanbisht97": "Not agreed on this one", "mr.manojdas": "🖐️🖐️👙👙💋💋💋💋", "samriddhi.neupane": "This is beautiful❤️❤️", "_beingevil_": "Nice", "rahul27811": "All power to you buddy", "trishasubba_": "You put my thoughts into words! 🌻", "_salonish": "👏", "pretikamenon": "Hear hear! ❤️👏", "vignettes_zahra": "❤️It was very heartwarming to read this and i’m glad you said it out loud. :) There are so many children out there who deserve as much love as any child gifted by parents. Your post brightened my day. More power to you. ❤️", "amitaggarwal8": "Pehle ye page surakshit krao....!", "tanushree0995": "Falling short of words to appreciate such a post...such thinking...and to such depth!! @redheadwayfarer Sad that people will definitely fail to realize the same", "siddiqueefoziya": "@trisha91sh @sajda.rahmani @ak_an_ks_ha read all her 6posts #scarednomore", "kaushi_ki": "Thought 👏👏", "tasmaira": "I LOVE YOU FOR SAYING THIS!! COULDN'T HAVE AGREED MORE!! I COULD NEVER BRING A LIFE IN THIS CRUEL WORLD AND SEE IT SUFFER!!", "_amandeep_keer": "Yha bhi whi comment....shame on u 😡", "beer_weed_whiskey": "Omg such a grt thought 👏👏👏 u r truly a grt inspiration 💛💛💛 @redheadwayfarer", "manjushreesamanta19": "Respect ur thoughts.i adopt a cat as my daughter.and she is my everything.", "rupama_roy": "Altime this bra nd some chaotic feminist reminiscent speeches..Just fed up by such nonsense..is these stuffs r part of ur conversation", "rahulllllll786": "Babyyy😎", "aamir_kerotagi_10": "chal nikal", "__vmoonchild__": "❤🙇 Respect ❤❤❤", "ujwala_poala": "I am literally tearing up rn, you know a week ago I was telling this to my friends and the kind of response I got was like seriously what are you a woman for???? Seriously these standard norms of being a women and bearing a child should change and people voicing out these opinions that matter should be made universal.... and many people are out there thinking what the fuck is wrong with them, when they this similar kind of mentality.... so glad that you’re writing this.... please keep inspiring people and you may or may not even read this comment... but still I am glad that I’m not the only one who ponders about these things in life.🙌🙌🙌", "___mk__77": "Nyc thought mem", "reality_bite": "🙏🙋", "beau_soul_": "@redheadwayfarer Exactly on the same footing... Respect ❤✌", "i_f.a.t.i.m.a": "Words of honor @redheadwayfarer", "themundanestoryteller": "Totally agreed to what you said.👍🏻💁🏻", "patel.kinjal94": "Sabit kya kr na cha te ho ap !! Yai sare bate ek photo ke bagair be Bol Sak te hai ek ladke nahe ap kr nipple or apne body bata kr @redheadwayfarer Acha hai open minded Hona har ek ladki ke leye but itna open kr apne pure body bata ne hai that’s really very much bad 😞 Eyyy upar wale is ladke ko daru or apne as pas ke public jo is hai utsa rahe hai yai sb kr nai ko us sai bacha or sahe rah pr chala 😓😩😢☹️", "vanessajenny": "Is this part 6 or you hv skipped part 6 🙈sorry just wondering @redheadwayfarer", "dhara2511": "This is something I've always been looking upto. I wish I can be as strong as you, for standing tall against all, in this matter, and all ❤.", "anvik4": "@redheadwayfarer I can't tell what this meant for me... Thank you for this words!!", "gurubaz_1712": "Killing fetus bcoz of ur mistake isnt right..", "mohit_devv": "Totally 👌", "singh__anay": "Your writings make me think of a world where everthing would be so great. I wish every one could adapt to this mindset, the world would have become been a much better place to live in.", "thelostmadwoman": "Exactly on the same page. People find it blasphemous. It's amusing and disturbing at the same time.", "rafikkhan_rk": "I love u", "saanskritii": "Your adoption thought....even I had this too I'll also do this....❤❤❤", "_jyotsna.__": "I feel the same", "nisha_faishon": "Lol 😂", "psy_acid_jazz": "Hhahw what ever u say .... Its good ......u Are scared no more ....Bt nw i m totally scared of u you......If i Evr are you I will run and hide hahahahaha u r dangerous women not normal women ......Fuckin feminist women .........Keep doing good work love your posts 😍😍😍 @redheadwayfarer", "rucha_de": "Amazing how ones choices are judged by the society without even looking at our surroundings. I second with your view completely!!", "swag_nik.aa_": "@redheadwayfarer same thinking 😊😊", "__namrata__98": "💕", "bluestocking_soul": "Your words are like power", "srinidhi_._._": "You are just so awesome!!❤", "dat_brown_gal": "Dis is how I always felt 🙌thanks fa being an another me , along me N support me ... go gal ☺️", "nitika_pareek": "You're an inspiration for a lot of people (including me) I admire you a lot💙 @redheadwayfarer", "saan_ii": "What kinda woman are you🤔?? Amazing thoughts ✌🏼", "_sneha_banerjee_544": "caption😍😍👌👌👌👌👍👍👍👍❤❤❤❤❤❤❤"}