{"dr.ramanmahal": "please dont associate feminism and nudity...there is a complete difference between the two..", "rofl17290": "🔥🔥😍❤️", "hamari_adhuri_kahani4726": "What is this I think it's not good For U.....", "om_ishaaa": "We find your missing small size and you partner /your desperate desire to be famous...thumbs down", "loneabrar": "Wow , So deep, Your words literally weigh! @redheadwayfarer", "daredevil0036": "BOOBS💋", "ag94akash": "after sometimes women will come out and say #freevagina and these dumb so called feminists will support them..", "my_food_tales": "Your REVERSE PSYCHOLOGY has been cracked.", "somyag98": "The entire point of this post was to bring attention to women empowerment and right now, here we see a clear example of how that is not the issue but the picture she is posting. Well done guys, you just proved how affected you can be by a woman's body so you wouldn't even read the caption properly", "singhsmanvi": "🔥", "who.is.pooja": "❤️", "dhriti_barik123": "😢😢😢😢 literally m sad...", "bhawnajain178": "You're on fire girl 🔥 favourite post ❤️", "___browsonfleek___": "No we ain’t desperate 👻", "sanjanarajj": "And you're not desperate to make missing pieces puzzle of your tits ?🤗", "cruzove_wagon": "The Thanos snap, 😂", "technicalsupradip": "Kiss boobs❤️", "weirdo_and_doodler": "this girl is like .. \" please give me attention!! ooh i need it to live my life\"", "dubifl": "Not so good editing", "imjaysingh": "What if ur naked, what if ur nipples are been seen I guess its not a bad thing Just a flesh ... if it was wrong would we have got this💥", "_aaiza_bhat_": "Aapko porn movie mai jaana chahye", "sandeepsinghalmeena": "Wa 😂one clap for modern rani laxmibai..", "i.m.aziz_mughal": "Shukr hai koi to larki ne feminism to sahi discribe kia feminism ka muda is liye uthays jata hai jo mard namard hai jo aurat pr hath uthata hai or un ko marta hai to un aurto ko hakook miln unk or wo aurten un namardon pr case kr skein or apni awaz utha skien na k aurtien kapre utar dein kapre utarne ko feminism nahi kehte", "kritikagotnochill": "Phir se udh chala", "i.aniruddh": "Not a misogynist.. but can't really fathom the point that u want to make here..", "dharamveer1818": "Wow sexy Bob's u💋💋💋", "ananyajha.aj": "@redheadwayfarer I wonder why you think posing with minimum clothes and tees stating about vagina etc., define feminism. Feminism does not stand only female empowerment. It means equal empowerment to both men and women. And rather than posting such things, I'd recommend you to work hard and become successful in your domain, which will be the true definition of feminism.", "dhruvjaitly": "mai apna opinion bta rha hun behas hi mat kr", "zarinhan__1": "Jee chahta hai joote se aapka mooh peet daalu 😡 @redheadwayfarer", "thedrugempress": "I'm really proud that I belong to a country where a woman like you was born. The humanly boundaries doesn't limit you. And does make you any less of a human. You go girl.", "ms_daenerys_bing": "Reported already. Showing skin doesn't mean empowering women. Go out and pay just one girl child's entire education fees and that is what you call woman empowerment ✋🏻", "yashrathore98": "thanos strike 😂", "mansha23": "@jaiveersinghbajwa", "shaikhhamzah8": "Yess its nipples .. and whats wrong in it all have men and women ...... feel free to show that .... mens feel very free to show all ther nipple than why not womens .......... its your body you have right to show what you want to ....... equality is must .... by bluring your nipples you make win for those who are against the equality @redheadwayfarer", "srijani_bera": "Just a simple question. Dear men who confuse between misandrist and feminist, have you ever felt uncomfortable if you roam about shirtless? Have you seen the women staring at your nipples? Just like that, if we talk about equal rights, then this is also it. We, women can stay comfortable in whatever dresses we like. And yeah \"NUDITY DOESN'T MEAN VULGARITY\". Fucking stop your voracious sight hovering through her body(including the women) and judge her. Thank You @redheadwayfarer for existing in India and hope to see more from you!", "_a_dee_tee_": "Why*", "sweety.sharmin": "Why ppl use dress. We should go back that era when ppl don't wear things. If it is thn boys ang girls should not wear pants also 😂", "i_m_daljeet": "Nipple visible 😉😂😂😂blur is not working", "rajkumar007kingmaker": "Tremendously tempting beauty with lots of charm and amazing gorgeousness", "anaa_lovebite": "Blur kyu ki nipples ko esehi daal deti waise b tmhare nipples koi chuna toh dur koi comment krne ka b nhi sochega . Feminism ka chutiyapa pel rhi ho toh khul k pelo chupana kya saloni di . Tb aagli baar feminism k naam pe vagina ka post kb daal rhi ho? Kya h na ki khud ko prepare krna prta h pehle se saloni di 😊", "harshee_": "OH MY GOD", "mmanoj411": "💝💞💝💞💝💞💝💞💝💞💝💞💞💝", "goutham2502": "Nice boobs", "shovandip_karan": "Wow! show them up 😝", "achalpatil7": "Mr Stark I don't feel soo good", "iamjaara": "Idiot you look lika a man🤥", "iamshahnawaz_yaligar": "Aise pics dalke yeh bolegi ki ye women empowerment", "umay_seng": "looking like slute", "itx_uoi_boii_xian": "Maal", "meee.yash": "blur kyu kia yr. Nude hojao fir free the nipple likhdo nice. iss hisab sai kapde phen ne hi nichahiye?", "asish_official__": "She is teaching girls that how to look like an uncivilized person", "the_art_dilettante": "I feel so depressed sometimes! I overthink alot, I feel anxious when I'm ignored by my close people. Because I feel they r all I have and I need enough attention from them throu", "vs31072014": "Dalchini", "gun_gunna": "I simply don't get how this empowers women? What if men start walking without underwears. They can simply say they feel uncomfortable in underwears. We don't live in a tribal society where men and women freely roam without clothes. We live in a civilized society where we have to follow certain norms of descency.", "emilymatthews0986": "Show your nipples", "kamal_sharma011": "well said....this ppl deserve a answer like this@thedrugempress", "kadambarisrivastavaa": "amazing!!!!! :) #freethenipple ..................................", "rajeshpatelu": "Why are you covering your nipple's... Even u have a small tit's u tried to show the world but y not your nipples ...??? Any Reason??", "waheeddudin": "Nice pictures", "man_tiegorras": "I don't know why I like the crazy sexy part of u ..won't lie .feminist?? Ok that is còol .. I respect women .. but your hotshot bombshell sexual romancing.. #lustorlove confused", "cororna_virus_wuhan_wale": "After watching this I guess thanos had a point", "_thosedamneyes_": "G.U.T.S!!❤❤", "rhaegartargeryan": "why do men have so much problem with womens bodies", "arjundutt88": "Omg Thanos is collecting his favourite gem", "najam_zaidi": "Attention seeker .. idiot", "karishmayadav313": "The picture is perfection. And the caption 😍😍", "reality_bite": "caption👌", "sourabh5160": "Your so beautiful 😘💐", "shubham___pawar": "Beautiful picture and the caption.......it leaves the thinkings for the comments", "alidcuz95": "nyc post keep posting such", "charmingly10": "#FreeTheNipple make it happen world please we need this", "prashanshaaa": "❤🌍💯", "riyasharma104": "For all you dum dums that don't get it. She doesn't need a motive to not cover up. This isn't a feminist movement. She shouldn't even have to address it. The reason it's fucking annoying seeing y'all butthurt is because it doesn't affect you and you still think you have a say. We need feminism not to walk around topless, but so that you understand that you don't have any authority, opinion or say in what I, her or any other lady does with her body.", "ayushrajrules": "I don't feel so good. #avengers_infinity_war 😂", "go_corona_gogogogo": "Go for totally nude brave girl..", "gladiator_fox": "Caption 🔥🔥", "sidharthwader": "If a guy posts dick pic and says the same he would be arrested 😂😂", "tanzeelshamsi": "@redheadwayfarer controversy ji ha, \"C H U T I Y A P A\" kya milta hai ye Sab karke.", "sexy_bolly_": "she is not more then a porn actress what the heel her boob is hanging out is she did not have any kind of shame i agree its her decision but showing your nep____ its over limit", "visen_amii": "This is not good", "abdulazeez382": "GOOD.nice", "bagsandeep": "U r osm", "dukeboy_390": "Oh damn u also became one of the victims when Thanos snapped his fingers", "vishnu_since_1996": "Finally thanos ne India mein ake chutki baja diya..... hopefully we will see you in next marvel avenger movie 😂😂😂", "braheja6": "#caption 😂😂", "sakeermanakulam": "Woww. Super", "nit2254": "Hlo", "___rahul.nair___": "It's very dissapointing tat most feminist think the only way to Express freedom is through nudity actually it's a suppression to human ryt", "tahirali_manj": "I don't English language but freedom ka ya hargiz matlab nahi", "parthiv_patel_gujarat": "Really admire your bravery, Saloni....keep it up!!!", "pr.asad596": "Nice boobs", "the___punisher_____": "😂😂😂😂.....pics art", "simrenn_kaur_": "U don hv any work to do instead of putting this shit!?🤨😏", "saeesh_shenvi__kakodkar": "i don agree to dis ....", "__faizan__khan__": "Gaand me dum ni hai kya nipple dikhane ka, or fr baat krti hai equality ki", "piyush.soni20": "Its blur but almost visible alora of nipple... 😂😂😂😂", "quoteoftheday_motivation": "For motivational quote please visit @quoteoftheday_motivation @redheadwayfarer", "i_am_soruv": "Yeah me too @swatyakideychowdh", "bangali_batman_": "Batman approves", "tiya_jani": "@redheadwayfarer yeah I get it you’re trying to spread somewhat awareness on walking on the street bra less/topless or something...you know i think you should raise some money by using your fans following and donate to breast cancer charity...that will help a lot of people and am sure people will love you for it. I don’t know what your actually trying to prove by posting topless pic? I guess you’re a biggest fan of Kim kardashian. Sorry I am just giving my honest opinion. No hard feelings x", "himansh1996": "Not working on me", "_.prashansa_15": "You always spread motivating and inspiring messages! I'm really proud of you! Thank you so much for spreading such awesome stuff! I really appreciate you! This picture is so pretty! Lots of love to you! 💞💞💞🌸🌸😘", "__manjuu": "#freethenipplemovement 🌹", "sorryraghu31": "Omg. U r awesome. U r nude but not. U r really bold so y u hide those nipples bcoz insta doesnt allow nudity. anyhow u r killing slowly us slowly like a poison", "kemparaju.r.79": "Black mail. Mailing me", "arjunjainn_": "Only if the world had more people like you, This world would have been such a beautiful place! ❤️ @redheadwayfarer People always talk about how well developed the western countries are and how different is the quality of life there as compared to India. They mostly blame the politicians or the government for that, but what they don’t understand is that it’s not only the government that develops the nation, the people and citizens are equally responsible for that development. And one of the major reasons why the west is more developed is because the people there are more open and accepting to different cultures and traditions.They are ready for change and accept and adapt to change as per the situation and time. Here in india the people are still holding on to thousand of years old traditions and norms. Now i’m not saying any tradition,norm religion or anything is bad. I respect all of the following things but i just think that some of the things in these traditions and norms have become obsolete are per the time. We are living in the 21st century and what may have been right thousands of years ago doesen’t mean that it is right in today’s world also and things like these all require change.  Only when we all will be more accepting to change and willing to change only then we’ll be able to bring a change and finally the nation will change for good!", "umme_e": "can we just for once appreciate how she loves who she is instead of calling her out for everything she does, every one who finds this wrong would never have the confidence to do what she’s doing, she makes a lot of girls feel empowered and that’s what we need more of in this society", "pooja_mohite": "Everyone just needs to have an option about what she should wear, say or post! #hatersbackoff", "arnabbiswas08": "Damn Thanos!! 😧😳", "radha_krishna_leela": "Wow so from today the bhakts of this personality will free the nipple and put an exciting caption.. and boom.. they will get empowered.. what an easy way to get freedom.. to acquire empowerment... Wow.. she must have been on drugs I guess.. she have forgotten the real problems of this world.. rather than dropping your own clothes give clothes to some organization who help the needy people or do some charity for the poor girls who have no money to study.. walking naked is not going to help any woman in this world.. if you are really want to do some good for the woman of this world.. then address there real problems..", "shravan_venkatesh": "Lol I just came here for the porn", "smaansi": "I have no idea when will people understand that its not about the nudity. Its abt the disabilities that we face because making this body a temple. Our time and effort goes into dressing appropriately, talking appropriately, behaving in a certain unrealistic but so called 'decent' manner not only to get societal acceptance but also to keep ourselves safe. Men dont have to do that. Men dont have that barrier. I consider this as sort of a disability. Unless this changes, how do u expect women to excel, if they're not above people pleasing and feel safe in their environment. Our to-do-list also has a 'dont get urself raped' on it and takes up a lot of our time and progressive thought space. Its not abt showing or showing your body. Its about your body being such a huge matter in the first place. And women, stand for each other and yourselves would you? I deserve to to be respected regardless of what or what I don't wear. Seriously!", "arushx06": "Like men's chest...🤣", "amitdubey.45": "Esse achha h kuch paheno mat..", "moti8558": "❤🌷👌👍", "iammaharnab": "Stupid Girl", "pkabrar": "Shame on u", "thefirstdaffodils": "@sufia.h", "yuvraj908": "Beautiful", "devlina_bajaj": "Butt faced egoistic men comments beginnnnn", "bechain.aatma": "Writes day n night about society being stupid of judging a women on the basis of nipple n yet hides her like everyone else's does.i don't know if m amble to put myself in right sentence but still this sucks #hippocrisy", "writika_manocha": "I just thought its a men standing with a nice body for a second", "komal0511": "Caption🙌🙌🙌🙌", "amitmohanty1": "Kyun aisa karti ho...i m fade off", "rahulvaid10": "Spreading nudity is nowhere sign of women empowerment in my opinion.", "d.sannaa": "Caption!♥️ You!♥️ Man!! I wanna meet you so soon and bless my life.💫", "s_o_u_r_a_v_d_e_y": "You think this is faminism and trying to prove independent of a woman,no dear,this is just shit", "nowall12345": "#thanos", "junupriya_": "WTF 😒😒", "___manzi___": "Loved it ❤️", "flawsome_242": "U r inspiration...😎😍😘", "elqakhan": "@eamaaanb", "bhavana_meghalim": "This is such an aesthetic pleasure to my eyes! Beautiful ♥", "dennis465403": "What a shame...everybody thinks this is the way to empower women...this is disgusting...Bunch of pointless stupid women", "misterrr_nobody": "23700+ likes & 600 comments.... aur kya chahiye....", "samanathwal": "Wt the fuck... It's totally visible u...... Use some common sense.... For god sake", "___________sagar_____________": "👅", "rsbgarg": "Damn, thanos made half of @redheadwayfarer to vanish haha", "aquariusnode": "Keep it up", "beautard_reet": "Stunning epic", "inglejikabetaa": "😍😍😍", "_raghavkhushboo_": "Omg when the FUCK will people actually get feminism. First of all it's about EQUAL rights so it means if a guy is doing it and if u put a nice body comment on his pic then you don't have any right to assassinate her character. And my dear fella ladies saying feminism Is not equal to nudity. Yes u are correct. Feminism is everyone has a right to be and live a life of their wish. She she is comfortable in shorts underwear and crop tops then it's okay no problem. If you are comfortable in kurta Pajama it okay. If you are comfortable in Burkha it's okay. It's okay to be and wear whatever you like. The thing that's not ok is you telling her what to wear. If you tell a girl to wear something she is not comfortable in that's wrong. And the thing is she is not trying to spread awareness by her nakedness. If your filthy mind that goes directly to her body. She is trying to spread awareness by her words and her writing. Why the FUCK does everyone sexualize a pic. And what's the problem in showing breasts. it's a body part just like your mouth eyes and nose. There is nothing to be ashamed of breasts. They nourish a child. And I know when someone says like this some random dude is gonna be like sab assi photo daalo. That's the thing just like every guy doesn't feel comfortable in a shirtless pic it's the same for women. If @redheadwayfarer is comfortable in her skin then why do you have a problem. And if u have a problem it's with your mind that is not able to understand her thoughts", "sukhvinersingh": "Every day i read ur story.u r very strong thought mind. I love ur post every day.specialy #teri aankha yo kajal video.....@redheadwayfarer 😘😘😘😘😘😘😘😘😘😘😘", "gupta.souhard": "Why u covered ur nipples...they r also body parts na...bullshit..if dis is feminism..den i must say to all young girls...stay away frm dis page...do something actually feminism...its only way to attract boys nd girls nd to increase followers....", "sunidhiguptah": "I'm so proud of you @redheadwayfarer ❤", "festive_gifts": "बस एक बार ये बता दो करना क्या चाहती हो।", "mishrasumitranandan": "😲😲😲😲😲🔥🔥🔥🔥🔥🔥🔥🔥👅👅👅👅👅👅👅👅👅👅👅👅👅💏💏💏💏💏💏😛😛😛😛😛😛😛😛", "steph.simon_": "I don't know why some people are getting offended. I just wanna say, I am so proud of this girl and I love her for what she does and is doing 😍❤ @redheadwayfarer I love you. #support_saloni_chopra #femalecrush #freethenipple #yougogirl #kuchtohlogkahenge 😉❤❤", "ishi_rawat_": "#respect❤", "abhinav_kenshi": "Proud of you @redheadwayfarer ma'am", "x.harries.x": "Stop this shit yaar", "chetnarayanyadav": "peace man peace ✌🏻", "itskamalsood": "So sexy!!", "wakenrise": "Mam you’re an inspiration ❤️", "killer_drama_": "You are a true icon", "sparkk_77": "Hadd ho gyi yrr.....", "thetravellingshrine": "How many men who are judging this artistic and beautiful photo (by a woman who is loved and free) are secretly watching porn on their computers and phones where women are being degraded and even treated violently? Check your own heart before you judge!", "viraaj___mishra": "Sexy n seductive figure specially curves boobs", "thehdose": "So beautiful and inspiring😍", "jyothisingh88": "What the heck u wanna prove n why u want to be top less n show ur skin Everytime to prove something....just stop this shit....while just proving something to this useless creatures who just wants to grab attention of u by posting filthy comments ur giving exact wat they want.....be ignorant u can't change their bloody mentality with posting ur nude pics instead it provoke them......just a piece of advice for u.... don't take it otherwise!!!!", "rsynerkars": "What is that stands proved?!", "yatinkumar1010": "Why I want to find out this I love your acting and writing and one thing nudity are not beautiful but clothes make u colour full beautiful and gorgeous 😍", "tanujmudgil": "@redheadwayfarer kudos to the level. Every new post of yours bring some more energetic woman in you. I Love you from the very deep of my heart n @rahulb90 bro love you too. You both are just amazing. @redheadwayfarer YOU GO GIRL 🤘🏻", "sanjeenamal": "Hot", "umair.s57": "Honey", "ria_spirit28": "🙌🏻🙌🏻", "musheer_hussain": "waoo suprb", "rathodkishor710": "Very beautiful", "abhi_3796": "Killer", "rashika_sachan": "@redheadwayfarer hey .. Hope u doing great... Dont be scared in the meanwhile journey.. I know each day u make ur parents , yr friends, urfans proud.. go#brownbarbies #freethenipplemovement Nd the day vl b der soon when \"my dear girls \"who are doubting in you will have the courage to stand for themseleves .. And one thing more \"they hate ambitious women with brains and beauty\"like you ..i mean cummon \"dear society she have got gender and she n v choose to be feminist 😀😁😁\"", "a_s_h_w_i_n123": "Sexy", "nicky091283": "Another wanabe in country...", "navjotsingh70613": "Aah Kudi hilgi ooyyyee", "abhayp5": "Take care, get well soon", "tani1524": "Bold! Yet not enough. As you say that moving around topless is not an issue... But here I couldn't see so... Though it's your choice... Anyways keep going.", "realsubham": "This was the last thing that was expected of you", "pragati_bhanage": "👌👌", "julietisfunny": "To everyone sexualizing this picture, that’s the fucking point. Free the nipple is important to help de-sexualize women’s bodies and help them take ownership of their own skin. And if you’re going to use the breasts are sexy argument, well men have breasts too. Some men have bigger breasts than most women I know. The part by itself is not sexual. It’s when it is attached to a specific gender that it is treated otherwise, that IS the problem. It’s just a person. Albeit a very beautiful and talented person, but just a person. Stop treating everything attached to a woman like a piece of meat.", "bansalsakshi07": "Showing ur naked body and then saying u r doing it in the name of freedom is not feminism...... Stop setting wrong examles for people.. Instead of posting ur naked pics, do something which will make even ur parents proud of u", "mr.jakke_911": "💛💛", "mnumuglana": "So hot..", "nirhav_": "😍😍😍", "smithaearl": "@redheadwayfarer 💓 I always go speechless when I see the kind of boldness u possess... I want and I will def get to being this bold sooner... Every post or every write up of yours is truly truly an inspiration... Every morning I make sure to tell myself FUCK this world... I'm beautiful the way I am... I don't need another person's view on me n my body... And that has definitely changed the way I look at things... As a kid I was very insecure and now I feel like I have wings through your posts and your words of enlightenment... ❤️ More n more power to us women who fail to realise that we are enuf to satisfy ourselves... Self love is the best... And women are definitely nothing less than any other gender... And ultimately you make people realize that we're humans first and anything else that we tag ourselves with is just made up! Love You saloni! ❤️ 😍 😘", "loveknotdreams": "How does one partially free nipple support feminism...Or is it just a fun photoshoot for instagram?", "anjali.sharma597": "Rubbish 💩💩", "kurangu_kuppan2.0": "Show nipples pls", "di_p_tiiii": "I don't feel so good......", "gauri3190": "Showing Boldness or being Open minded doesn't means vulgarity or nudity,", "iamsharmita": "More power to you 🙏", "irfan_400dx": "Looking hot", "protantagonist": "Beautiful caption ma'am 🙏", "adityagurjar9": "So hot", "m.plus.t": "kuch bhi post karna hai matlab. 😓 What has the world come to.... 😓", "subrat.raj9": "Nyc boobs", "harshvedi": "I will say we all invented clothing to feel safe and covered although without cloth we are like animal if you are really trying to change the mindset of the people how they look at this when a girl is walking it should come from within", "sujata_mandal__": "The spirit of feminist 😘😘😘😘 u look amazing", "imshahrukh_official": "freedom freedom bolti kya nipple nahi h tumhe me dila du freedom fir toh nipple bhi show kroge yeh bakwas tum bolti ho na women power ise women power nahi kehte #nude", "paushalli": "Love the caption. @redheadwayfarer You're amazing. 😘", "ashwinijoshi996": "@nungdibenla_echa the photo and the caption read along", "surabhi_haroon": "@redheadwayfarer people here are failing to understand that you are just trying to being the change and not forcing or implying it on anyone. Why are people like this? Gosh have mercy on their thinking", "mannan_parmar": "Better caption than thai doesn't exis--🔥🔥🔥🖤✌🏼", "ayeshayyyyyyyyyyyy": "I adore you but sometimes your definition of feminism seems strange to me,.why making men some standard? This isn't equality, this is just a competition,.Equality is Men's rights and women's rights, and we should fight for that,.", "headstrong.obstinate22": "So deep ... Blossoming into a badass woman with more faith than fear ❤", "knights_kings007": "Slayed it to perfection", "swatyakideychowdh": "I,am just here to enjoy the fight in comments", "aparna_priyadarsini": "In love with the caption ❤ @redheadwayfarer", "_shivennn": "Omgg😂😂 who tf wanted to find ur missing pieces and feeling desperate ..ther alot more better than urs 🙂😂", "shuvv_ghosh": "@redheadwayfarer did Thanos get you too..? 🙄😮😮😥", "saxena.anushree": "Wow wt our nation is.....when a guy is shirtless: oh wow he is so fit ill go gym and make abs too💪 ......when a gurl is shirtless:U SLUT! \"Madarchod\" WHORE...how much should i pay u to spend n8t with me ?", "sajanmallus": "salute for your boldness", "67_aarevi": "@redheadwayfarer Aap kitna bhi explain kar do statements de do,, inke samajh kuch nai aane wala!", "arifpaveiz": "Wooow", "kj_kaajal": "Which world are you living .. I have seen tax file done on woman’s name while the store is run by the man .. so it is anyhow benefiting men only.. and seat reservations is not a serious topic many times I have left the seat empty because I didn’t wanted to sit and HOWEVER the topic is about FREEDOM of choice NOT forced CHOICE. Do you even know under what circumstances this RULES of seat reservations and TAXES DEDUCTION came in our country for women? Have ever travelled in Rural bus? And small cities.. I guess no.. Because you feel whatever you saw in big cities is enough for whole country to DEMOLISH this rules.", "wounded_wolf9": "Glam doll", "thetrickypanda": "This pic. Is lit.. ❤❤", "p.a.l.a.k_._": "❤️❤️❤️❤️", "misss.surbhi": "Caption ✌️👌😂", "sahilpunyani": "Caption, savage!! 🔥", "sikder1370": "😱😱😘😘😘‍", "sameer_sk94": "If u are brave enough y do you blur that", "architkh": "Publicity ke liye saala kuch bhi karega", "single_pasanga__1": "U bitch", "dietrightclub": "Ha ha.. Nice way of getting attention. I was finding your mind but seems it's the missing piece of your body.", "amity.beats": "Great caption ✌🏻👍🏻", "monish_walkar": "👏👏👏👏👏👏👏👏👏", "munishdograofficial": "WTF you are disgusting uploading and poke everyone to figure out the thing", "abhivyakti_rawat_": "Caption..👍🙏 @redheadwayfarer", "parth_mehta9393": "keep going 👍", "somnath250783": "Meaning of this shit pic?", "vikram_s.saxena": "I alwys support u n ur views bt y this much?. Its fine if u r wearng a singl smlla cloth as ur bra. Bt nt like this. God bless you. N i am always wth uh. Love u tc.", "agnostic_roohit": "@swapniljhalki", "m_farha_naaz": "Be a women not a pornstar 😑", "nikki._.tripathy": "What can I say? You are a true inspiration for all the people of the society. Yes we have breasts and it's not like it is anything different from what men have. So what if we're females? That makes our nipples a sign of sexuality but no, such rules don't apply for a man. I am so proud that there are people like you in this world. ♥️", "shrija._.singh": "Beautiful! 💋 and bold @redheadwayfarer", "boss_lady________kim17": "Is feminism falling in a fight for a female body?", "darshian_disha": "This post didn't make my day, it made my LIFE!❤️❤️❤️", "__nikitamehta": "That caption ❤️❤️", "j_a_m_e_e_l_a_01": "Well said💯 @redheadwayfarer", "vaanii_26": "Caption 😻", "shalini_tiwari2505": "👏👏👏👏 you are the inspiration for todays world and for each and every girl and woman👏👏👏 hats of you ma'am", "rachel.almeida__": "❤❤❤", "_divya_jami_": "The caption 😍👌", "sanjana_vuppala": "People expose their body if they want to now, are you telling me you never saw anyone else do this? I don't understand why people are getting butthurt about it. What even is the right way to fight for feminism? Every person, different circumstances, different ways. For some it's fighting for basic rights because they don't have that, for others it might be about non sexualizing their body parts because that's what they face. That's their reality. One problem doesn't take more precedence over others. That's like comparing how many deaths an incident caused and basing your horror depending on that", "liki_lai_teo11": "Ok I really were rooting for you but eventually you will have to move from ‘ yes I will take my clothes off and it’s none of your business’. You have to realize there are young girls watching you who will think that’s enough.. this is empowerment.. I just have to take my top off and no one can tell me anything just because I’m a woman. Fair enough. But there’s SO much more we can do why only highlight this aspect. We can climb mountains, we can rule a kingdom, we can play sports that were previously barred for us, we can now have a passport without a marital status. See? There’s SO much more you can use your voice for than sit and prove trolls wrong and to gain attention this way. I got it the first few posts where you say you don’t care what mysogynistic views and you can do what you want. I was literally cheering through my screen. But girl c’mon now use your voice for other things. Highlight aspects in India that need change. This is one of them but as a feminist you and I both know this isn’t it and there’s a much bigger picture.", "isameeer_innocent": "Get Well Soon...", "ssbberry": "Yours is not in good shape, not interested in puzzle n all", "peacexoom4": "Jealous PPS always abuse", "anuragsing22": "Ab puri nangi hi hona baki rhe gya ha tera", "_.__avani__._": "“Rahul, I don’t feel so good”", "syed_mehdi_raza_": "Aree poora dikha do..💦💦", "realvijaymishra": "Lovely lovely caption that 😇🤘🏼", "anuragsharma_16": "It would have been great if everyone thought the way you do", "ameyuk": "👌🏽", "just_another_pisces_girl": "The words giving goosebumps. And I'm sure not a single (negative) gazer would have understood a bit of it. Lots of love. @redheadwayfarer", "kaushiki.srivastava_": "Captions and you❤️", "dirtycaffeinater": "To have the confidence and the inner fire to be yourself, that's good stuff. @redheadwayfarer", "geetanjali_chhabra": "you are fire😍😍😍", "rachana_04": "👏🏽👏🏽👏🏽", "i_m_h_a_r_sh": "So hot luks", "riyaa_mayekar": "You go girl💃🔥", "prasad6745": "Wowwww #inspiring everyone love u mam", "aditya_diljit": "Who is the photographer....just thinking 🙄", "amitkmargupta": "You don't have symmetrical boobs", "sibani_926": "Keh hai yr... aise body dekha kar pic post karna or caption likhna... matlab kya hai..? Yeh kya mtlb hua...👎👎👎👎", "oh.thatmandala__": "Caption! Damnit! It couldn't be betterr mayn!😍🔥Being a 15 year old girl..saloni di has beeen such a inspiration to me..i never used to read this kind of stuff..but i don't know why your posts make me feel so proud of being a women.. you've portrayed everything so perfect everytime! If there's ever been a time i felt low on a women problem..your posts have never failed to teach me and tell me what i got is the best and i shouldn't be afraid or ashamed of it❤thankyou so much di! Supports to you always! You're an inspiration for most of us girls these days! @redheadwayfarer ❤", "saumya_keshri": "Amazimgggggggg you are 😍😍😍 fantasticcccc women #respectable", "kevinalbertpat": "Snap!!!! (Thanos)", "navyasarowa": "You're a diamond. They can't break you. @redheadwayfarer love the way you present yourself.", "gargakash9999": "Perfect", "kritikasinghp": "That caption is pure gold!! Every piece u write can be compiled together to create one epic self help #howtobeabetterperson .", "shradha9604": "Is feminism all about showing your body?", "khankariina": "U are really crazy", "amil_zafar": "Fucking gorgeous", "sweekriti_sweekiborn": "#freethenipple why should girls worry about not wearing a bra when going outside their homes or( comfort zone). Nipples are a females body part , why worry if the shape of it shows ? #greateffortsalonichopra @redheadwayfarer", "rocket.pocket44": "You edited out the best part", "a.n.t.i.m.a_": "Caption is savage 💣💥", "rakshithraghav": "Kuchh to log kahenge logon ka kaam hai kehnaa Chhodo bekaar ki baaton mein kaheen beet na jaaye rainaa @redheadwayfarer", "yuvraj7914": "U r grt", "dp660": "I don't feel so good..", "saqshibehl": "@mayankjain_04 the picture and then the caption.", "_singh_aditya": "Nip: Miss Breast, I don't feel so good.", "neha_bachani": "❤❤❤ #respect❤", "addyondabeat_": "#freethenipple", "imprateekshukla": "✌️", "miss.lingerista": "You are such an inspiration 🙏", "hardikdedhia31": "@kashvigala Read Caption", "handiqueananya": "Tremendous 💙", "the.backup.brain": "Butt hurt Indian men commenting in 3...2...1..", "baba_yaga_mahadev": "Ek dam randipana ka sahi idea ho tm... Madharchod", "lickable6": "Why di u blur the nipples....??? You was trying to show something then why to hide that one ..... One side u talk like equality then you prove urslf pervert..... Nipples are nipples", "_gopika_gokul_": "I admire you.but i dont get it..if you are so open and confident in showing your breasts as a part of the point you are trying to show.. why are you covering your nipples?why does it have to be hidden,even it is a part of your body right?", "abhiroop_bhatta": "Hate the triangle on the nose, otherwise what a nice portrait.", "facts_much11111": "@redheadwayfarer i just dont get it smtms ...ur so fucking open to show ur body ...which is fine cuz u send accross a message . Bt y do u hide ur nipples whats the point of hiding less than half od ur brest just expose it and be frank like u show nd write", "billiehunk9t9": "Sexy😍", "mohsin._kureshi": "Hot sexy looking beby", "salonidesai47": "❤️❤️", "ritesh_241": "Looking so.. hot😙", "shaaayra__sayyed2001": "Your friend is so lucky", "foodwithfats": "Caption 🔥❤️", "ayuchauhan3": "Aa AAA......hot", "epic_passion_raktim": "🔥🔥🔥🔥🔥🔥", "macc887": "Respect that.... 👏👏", "rishi_jazz05": "You are an inspiration to all the women out there. Much respect to you😊 #bethechange #freethenipple @redheadwayfarer", "nehathakurrrr": "You go girl 😍😍😍😍", "touslehaired": "I wait for the day when a strong post of yours such as this one will no longer make atleast one gentleman appeal to your inner morality to cover up while another makes lewd comments in the guise of encouragement....sigh!", "geetikaraleh": "Loved loved loved the caption, @redheadwayfarer . All hearts to you💙💙💙💙", "bakedodyssey": "Mr. Stark, I don't feel so good....", "musafir_huyaro1": "Once again you nailed it @redheadwayfarer . I loved the Caption and the frame. The way its potrayed is beautiful with a powerful message all the way. Once again hats off lady and best wishes", "suryaghuman": "I dont feel so good thanos", "vandita_m06": "Strong words and strong picture! Love you Woman! 💟", "imnishadesai": "@mehek776 amazing!", "stubborn_yadav": "Very gud aese h post daala kro women power yaar 👌🏻👌🏻", "kingsush": "People having a content for wag😂", "babaa._.yaga": "Mr Stark, I don't feel so good...", "pooj0a": "🙏🙏", "xritikaax": "@redheadwayfarer This picture and caption is too good! Don't let the haters down here put you down. You're a role model, an inspiration for the young girls out there, a pure fucking goddess ; don't let anyone tell you any different! Lots of love♥️♥️", "_pranali_ajmeraaa_": "the caption is lit🔥", "tushardhoble_": "Good going One day she will post total nude pic in the name feminism. P.s- I support women improvement equality but according to her showing ur body part is feminism", "shwetaaadas": "I love you girl!!", "swayamprava__das": "I guess that is the exact thing it is all about \"Introspection without judging anything or anyone\".. A mater of critical thinking of actually realizing wat message is trying to be conveyed rather than just superficially seeing the photo and commenting on it. That is wat it is about, Stop judging people until their motive is something pure and deep upbringing of a social cause.", "ankita._pandey": "🙌", "ekbhuliguftugu": "That's a beautifully bold & powerful capture @rahulb90 , I love her posture and everything in the frame! Specially going with that beautiful caption . I can totally imagine it being a poster cover for the #freethenipplemovement @redheadwayfarer way to go guys! 😘🤗🌸✨👍💛 #awesometwosome", "arbaz_0011": "Hot men", "muskaaaannnn": "@rahulb90 @redheadwayfarer can you be a little less adorable ? I can feel the butterflies in my stomach cause of you guys.❤️❤️", "gracy.bella": "Ktb😂😂😂hdd h bc", "demi______goddess": "we always loves you mam 😘😘😘😘😘", "kanvitha_reddy": "❤❤❤❤❤❤❤", "_aka_.sakshi_": "#respect 🌼", "er_rakesh_parmar49": "Wow.. Stunning Look", "manpreet3120": "@redheadwayfarer O my god amazing", "praveen_rana_": "Wtf 😂", "funkyrao": "loveee the concept 💕", "cattyy20": "Really inspired 🤗🤗", "isimransethi": "Inspiration 🔥♥️", "heels_nd_combatboots": "Very true it shows d perspective how we see", "sumit_kirankumar_raut": "👍", "mayur.jain.bbm_53342330": "I can c ur scratch", "meghnanegi19": "@redheadwayfarer you took my soul away with that 😍😍 #bossbabe 😎", "theaklavya": "Amazing", "thefatwizard": "Caption!! ❤️", "arshiya.chauhan": "Oh wow! 🌸", "desiwearsprada": "I have no hard feelings but I'm still trying to figure out if you want to free the nipple.. What you will achieve. The times are changing, females are now been acknowledged for their works but not for looks.. There are n number of examples. Posting a pic topless to crate awareness is just not solving the purpose. What you try to imply is to stop wearing clothes be at male or female. I think I would appreciate your post more focusing on changind the male mindset with your power to communicate to many ppl as you are known figure. And not all are blessed with such gratitude. I still follow you for your thoughts and comments..", "vikaspeswanihere": "Caption was opening the doors of the mind❤ @redheadwayfarer", "neharamneekkapoor": "You’re awesome 👏", "designer_payel_samajdar": "Perfect lines❤❤ u r an #inspiration ma'am ❤❤ @redheadwayfarer", "awestruckbabe": "I really appreciate your thoughts and they way you're encouraging us but belong to small town and middle class girl I don't think this will help any of us. We girls need to cover our body parts and we can't post such things on internet. Anyone can Photoshop any picture. You're a celeb but being a common girl and a femenist as AF. I really don't understand the need to post such pictures. We can do whatever we want to do but showing skins don't prove or give equal rights to us. We need to work for it and peoples need to change their mindsets. Don't be get me wrong but being a feminist is not necessary to pose or post pictures as boys do. We are way to si", "rob11116": "are you afraid of something??", "neetlobana": "Wooww..whata caption", "hossain.robin62": "So beautiful baby so sexi ❤❤❤🔥", "prerna_ajwani": "Strong words❤️", "saharbilqees77": "I wonder if men start saying I’ll flash my dick in your face and I bet my harmless dick will call for all your toxic women misogyny in one place below is MY DICK .. there is a decorum dear Saloni @redheadwayfarer pretending to be a feminist doesn’t give you a pass to run nudity in the face of peope !", "tazzzmemon": "Extremely bold and a strong women👌🏻👏🏻", "trevor_tanu": "You are terrific! 🔥", "sauban_israili": "Overloded", "sakshibaidd": "😍😍😍", "___black__beauty__": "😋🤗🤗🤗😘 owsm", "yourshivuthakkar_2512": "Is this only thing can prove uh right ? I m totally on ur side I love d way uh present yourself but I don't find this time dat was it d only thing uh proved?", "prerna.jindal": "Omgggggg .. that caption ... It story behind the picture ... N yess it really true ... Well said 🙌🙌🙌🙌🤗😐😐", "zaaria06": "Love love love 😍😍😍❤️❤️🙌🏻🙌🏻🙌🏻", "gauravshanuroy": "Good time to post this.. no India Pakistan match...no Muslim girl rape case.. btw I always love ur captions 😊😊", "mallikaathakur": "empowering", "amritananddhruw": "Nice angle but looking very untamed", "jaskiratsingh_91": "😁 never knew that thanos could effect the real world", "gandharvagrover": "You look different in your side profile ... @redheadwayfarer ...", "siddoku": "YESSZZS MOMMMMMMM", "sanskaari_joker": "The caption ...💥💣", "aamin_kothiwala": "Fierce and Fragile , at the same time . ❤️ @redheadwayfarer AMAZED 💕", "vasundhara_patade97": "Woah women ❤🌻", "ermaddymanish": "Thanos snap....???", "shruti_damgir": "Caption 😍😍u killing it bro", "_pr3ttypriceless_": "Amazing caption👌👌 it indeed is their reflection", "anurag_alaria": "U r such a psycho 😕", "beingnuomaangojwari": "👍", "arshadfarooqi": "@redheadwayfarer @rahulb90 that's why Thor should have went for the head. (For those who didn't get it: Thanos')", "_ienehanceit._": "On point 🔥🔥🔥🔥", "king_king_king_khan_khan": "Love you", "pavintheran3795": "So sx ey", "no.ah1607": "I can easily locate the juicy missing part", "mohitrbadre": "Best Caption! :))", "queen_of_monsters_nidhi": "Beautiful person alive 🦋✨♥️ @redheadwayfarer", "saylii_2908": "Proud of you .slay my queen❤️", "__hippy.sunshine__": "I've emailed u and even dm'ed u pictures abt domestic violence @redheadwayfarer", "physio_simar": "With all due respect pls blur the pic more , u have freedom to post anything but it's always your inner call, baki as u feel like ..", "meharanunculus": "The caption is just WOW", "aayushi_syahi": "Oh my gosh!! I love that caption wohooo👏👏😭😭😍 how was this magic weaved oh shit m loosing my mind!", "jjamwaal": "Khool Da Kashi or bobs", "waiada_garod": "The women ❤️", "uktijoshi": "The caption 🙌", "masroor_aalam_qureshi": "Saloni May tmse kuch kahena chahata hoo...plzzz", "s1ddharth_official": "Y r u soooooo beautiful ♥️ @redheadwayfarer", "figuramoda\nVerified": "Verified", "sailleee": "Perfect♥️", "pooja_bhattacharya": "Wow. Just amazing ❤️❤️❤️", "rahulb90": "@redheadwayfarer i’m proud of you. also you put the triangles the other way 😍 #ihelped", "aarav_dass_": "Kya h ye plz explain", "ducccckkyyy": "Mr. Stark, I don't feel so good."}