{"pratik.dindorkar": "You cannot blatantly put it as men being the root cause of all of it.. though i do agree for it as a major chunk... But then Google too, by default puts on a safe search to avoid nudity in results.. now who made that ( please.dont tell me google jz employs men).. 21st century people are brought up with a mannerism towards nudity as a shamefull thing .. and not only in my country India but in many regions of the US (oh yes..on the contrary to their boasting of a progressed nation) .. what would you call that.. ... And if this post is all equality and about free the tits cause then i suppose it should have been the frontal pic.. cz its all biological stuff we have it in there as i have studied in school ... .. No offense to any gender.. cheers.", "samadooooooooo": "The guy has given himself a weggie", "navvya._": "I love your thinking thoughts 🔥", "parisinghh1103": "I love ur thinking", "hornymemes3": "😂", "aleenamunawar": "lo", "ramesh4444444": "Nice", "rasam_chaadam": "@pallavi_biswas434", "happieness_within": "Well said❣️", "surya4097": "Taran around", "sethiradhika12": "What the literal fuck dude", "choco_pie4u": "🔥", "charuaaaaa": "@shivam.nainwal @oxy_.moron._ Competition.", "this_slytherin_girl": "@priyam._.gupta", "prayagsingh_": "Darn it, Words.❤️", "nude_yogagirl\nVerified": "Verified", "dimpllii_agarwal": "All the people taking this post in totally a wrong way. I must say @redheadwayfarer you are doing the work right but in different way, she is posting such pics to make you all realise that how badly you feel when it comes to female nudity because you are afraid of the fact that one nice day your sisters will also support this and then you will thought agr meri behen aisa kregi toh rape hoga or rape krega kon ldke obvious because I cant understand how can you just rape a girl with your eyes or aaj kal toh ldke janwaro ko bhi nhi chord rhe . They even start raping goat or dogs . Agar itni hi hawas hai to red area jao na", "okeuf_tqr": "So they let their inner feelings out on independence day... Sorry night! Had sex and posted this for the public to read and clap for her thoughts.. Nice!!!", "maringpou": "Feel comfortable in your own skin fuck that cotton shit", "mubashir_sareer": "Fuddu", "deviiil__": "Chutiyaapa bc", "chandu9938": "Nice hot pic", "itssss_panda": "Wtf?", "ajayswamiji21": "LOVE MARRIAGE GET True Love Back....नाम और उम्र बताकर जिंदगी सवारे सिफ॔ एक फोन पर समस्या कैसी भी हो घर बैठे ें 100% समाधान जैसे : लव मेंरीज,प्रेम प्यार,वशीकरण ,किया कराया,ग्रह क्लेश,संतान सुख,कारोबार,नोकरी,लाटरी नंबर,वीजा प्रॉब्लम ,कालसर्प पुजा,मंगलीक दोष,पति पत्नि अनबन,.्रेम-विवाह ,.मनचाहा प्यार.,संतान हीनता., पति-पत्नि अनबन.,प्यार में असफल,.सौतन दुश्मन छुटकारा,.तरक्कीमें रुकावट.,नोकरी या तबादले की परेशानी..,घर में क्लेश ,धन की कमी.,.संतान की चिंता.,पढ़ाई लिखाई में परेशानी.,.किया कराया,जादूटोना.,लिखाई और पत्नी मे अनबन.,.जाएजाद का झगडा..,काल शार्प दोष.मांगलिक दोष ,,.करिअर की चिंता.,रूठो को मनाना मेरा वादा आपका विश्वास टूटने नहीं दूंगा सम्पर्क करेनोट:एक बार सेवा का मोका अवश्य दे +91-7014870351ne Call Change YourLife.t Your Future Bright With The Help of Pandit Ajay swami ji whatsapp namber {{+91-7014870351", "poh.the.panda": "You have got the nail on its head 👌👌 Totally agree. Leave it upto the woman how much she wants to cover and show as long as she is comfortable in her skin. If men can flaunt their 6 8 pack muscled bodies fully topless without any censorship, then why apply it on women? Zillion dollar question", "sakshi__mishra_": "❤️❤️", "sonaldahariya": "This made me cry i love you", "_im_ayushman_sin786": "Thuuu😈", "ssaurabh9": "This Independence Day- a smutty nude photo, Shame on you!!!", "__simlicious___": "Dude feminism is not about nudity...it is definitely not.....the reason I un-follow u are ur vulgar nude posts...u can't describe feminism in this way....feminism is not about showing off ur body parts publicly....u are miss-leading many people mam....", "___ritzy___": "This is seriously nuts!if by nudity you are supporting feminism then plz we dont need such a thing!iys really sad to see ppl following her and thinking that shes such a saint! Truth is shes just a dumb bitch who wants fame in the name of feminism and gets nude to attract more and more ppl ! Its a shame have some self respect and atleast dont go against our indian culture!!", "chaits0921": "Nobody gives a rat's ass about your breasts. Feminism doesn't equal not wearing clothes and please stop being delusional.", "pammy_chowdary": "This women is full of fake emotions... She just need attention. Shit head!!!", "avvngrs_": "Love it 👏👏", "kajal_nagrale": "Brave af..lots of love 😍..", "amit__jaiswal_9": "Amazingly sexy", "badass__lawyer17": "Aree bs kr behan", "astute_anarchist": "No ma'am that's wrong . Rich spoilt brat", "_.drish": "I love this ❤❤.....but the best part of posts like these is that we get to see all the pseudo feminists in the comments section. Keep going. Proud of you!", "spdprp": "Yaaaassssss ohhhh fuck yeh dude I support feminism ! Whatever you say I support that but please for the sake of almighty turn around 🌿🌿♥️♥️", "monu_theretohelpyou": "I strongly support your thoughts..Women have the freedom to wear what they feel like...They should'nt be ashamed of their tits.", "neeraj_rockzz": "Girls r even more successful nowadays dan boys.. n dey have earned it through their hardwork that every other guy also does for being acknowledged..Actlly girls just need to voice out for al d right things, ya itz a struggle in alot of places bt nt d whole country . Girls already rocking everywhere n ya d society norms r also adapting likewisse .. u al just need to b confident n gud at wat u do n u r ready to steal away d jobs from alot of us guys...haha..bt just stop calling all these posts n talks as feminism n those deepika padukones idiotic \"my choice \" video which just talked about clothes ,sex, etc...datz nt freedom....plz have better role models who go for good works n good words too....v have lot of great women around us also,to get inspired....ye kapde, sex, partying, hookups n ll...band karo...jo karne hai karo...public platform pe chillana band karo....there r better things for girls in this society for creating equality....n al those who support this post ask ur parents if they support each n every thing written over here...these posts mislead alot of girls who follow them...", "isumeetk": "I guess you wanted to say KALPANA CHAWLA. So please correct that spelling.", "kunalprem_": "What a load of liberal crap. I'm no right winger but this makes me cringe so hard. It's so stupid i don't even want to argue over it and i hope young women don't look upto such people as inspiration.", "sanket_wankhede11": "@mohini_2907 just what I included in my blog ...the point that Equality under feminism is not going beyond \"freedom for fashion\" ! For some women , feminism is just restricted to this !", "vinu_shree": "#Thisisnotfeminism .You are probably making your own meaning out of that word.", "asish_official__": "Why do women want to free their breast so much? I don't understand what makes them so much better to open their breast in front of everyone.", "kashyap.sneha4": "I know will don't like this pic.. Then y #selenagomez #rihanna gets so many likes in their pics.. Its normal for them Nd u too", "mr_boblee7": "Cool", "__priaaa": "@bhargavi.saikia", "vivek.latwal": "U can wear anything. Be nude whatever. But , also be ready to accept the consequences #thisisnotfeminism", "sakshi_bindra": "What nonsense ! Go infront ur father and brother like this and ur cousins n family ! Cheap nonsense that’s all !", "ankitachhabra": "Pic❤️❤️", "foodiesoul1999": "@alisha__jennifer follow her.😊", "iamowaisbhat": "I think there are more important things to fight for than normalising nudity. Fight for women education, domestic violence, equal representation in jobs.", "manyaaaa___": "These inspiring captions of yours make me overwhelmed. A true fan of yours.💙", "cororna_virus_wuhan_wale": "Plzzz post any kind of pics you want but don't give them a social cause", "rashika_sachan": "Hey... Again i read almost every comment .. Dear , it's takes a lot of courage to be you... Same it takes a lot courage for your mother , brother , nanichopra, rahul to support and to be there for you.... And lot of love to them that they support you to be the way you are dear... And about people connecting this to feminism i must say to you all... She in every post try to tell you that self choice is important ... It's her choice to be the same or to tell you that if a man can post then she can do the same... More power to you girl ... #freethenipplemovement #gogirl #be you", "suparnaghosh16": "Hottie", "sumedha_cook": "Love", "__cropsun__": "🙌🔥", "_gopika_gokul_": "Feels like you are trying too much ..there are other feminists around the world who are doing their job brilliantly without having the need to always pose nude for a picture", "_7nvincible": "What a way to wish independence day .... If you are fight for women's rights and control of women's body then what I think is you don't need to semi nude in every post... And if you support nudity in public then you should start from your end first ... Living naked infront of own father and own brother then starts go to any function and society as a naked girl .... this is the only way to change the society...", "pi_day_pisces": "And on the other hand there are people like @ipoonampandey who's profile is filled with nude n semi nude pics..any male who comments \"👅Nice juicy b**bs\" is welcomed by her \"Thank you😚\"....I respect the efforts of @redheadwayfarer but Iam totally confused between Miss Saloni who is normalizing female body and all the pornstars sexualising female body!", "baee_rozgaarr": "I dont understand how double standarded ppl r now a days. If this was any male artist in place of her, no one wld hav said a word. But just bcz that's a girl doing what a boy is free to do, ppl get chances to speak utter shit. U go girl!!🙌🏻 @redheadwayfarer", "ishaan5566": "Saala dimaag to h nhi", "larajustin56": "I dont know too much about feminism but does it mean being naked😋😂👏👏", "ayushahujaa": "And posting topless pictures of yours would get you freedom? Smh", "romeobond_chasemeifucan": "Talking bout India.. Wanting a change.. But Still posting pics of foreigners..", "surendranjegatheesvaran": "well indian culture pre-victorian british rule had no taboo against male or female nudity [people used to practice yoga and even tantric sex in temples nude]......the problem is india has adopted orthodox christian legal system and culture but pass it off as 'sanskari'.....this is the reason the daily regular clothes people wore never constricted the flow of energy in the body specially the generative region and the chest", "the_blessiing": "My dick is the biggest impediment to me achieving. It would be much better if dicks are normalised so that I can be a normal man. A man is supposed to have a 7 figure salary, be tall, have a house and a car and most of all size of dick matters most. This is unfair and unreal expectations. Till I have freedom to roam around with my Dick Out there is no freedom for me.", "lpurty126": "U go girl !! 🔥🔥🔥💪Haters gonna hate 😂", "dhaliwalgoloo": "So nice", "kharayatjagdish": "Looking so sexy", "mohit.invincible": "👌👌👌👌👌👌👌👌👌👌👌", "blakebakshi": "How come they still face the opposite side :/", "salonisharma07": "How is being undressed equal to being independent? A man undressed is addressed like an undressed man and an undressed woman is also addressed like a undressed woman in any country. There is a right place and time for everything. You won't be like that in front of your family and shout that this is being independant then why here ? Go to a beach if you wanna do this or stay in.", "gourihari_uh": "You always supports backward section of women for their basic needs nd rights. .that's a good one I appreciate it .. nd personally I really like you ..but post a nude pic on this independence day doesn't make you sensible. . Nd freedom, equality. ..etc for this all. . You r fighting by posting this all..but post this type of pictures will never support this nd if it is called feminism or equality .. then I will never support it .. man or woman! We should cover our body parts ..it's a decency. . Nd it doesn't make you outdated or culture less. ..", "madhurima_k": "Wat i dont understand is .. half of the human race + fat men have breasts .. still it is a big deal..! 🤣", "ankita.aru": "Your guy has a nice butt.. enjoy your days my love..🤗", "thesnehaekka": "@nishajenn 😭", "_bhaisonu_": "Any time खुजली🤓", "sandeep.9t2": "Wow", "wonder__view": "Sorry but if this is called feminism or equality then I don't support it ! Personally i like your post but such type or post ! I can't support it ! 😊😊😊😊", "greeshma_naidu_": "@redheadwayfarer Rah has an amazing butt I must say 😂👌🤭", "iblameronnie": "iss sey zyada aur kitni freedom chahiye? Do you want to dance naked at public places, please do it. Hail freedom of Expression.", "shrinkhla_sharma": "@redheadwayfarer The message you want to give is absolutely right. But there is no need to compare this with women like kalpana chawla or women who achieved their first something. Do you even have an iota of idea how much struggle they face to achieve it? Do you know much they would have resisted against society, and all the patriarchal forces? At least they are achieving something. Because of them we can at least dream of becoming something. And majority of society still don't want kalpana chawla or indra nooyi etc. If that would have been the case, each and every educated woman would be doing some job but still number of ambitious and working women are less. Feminists need to set their priorities first.", "nehabarman77": "true", "jhilmil_vashistha": "The boldest couple❤️🤙🏻", "navin_pujara": "Best role model for every women out there ❤️", "_learning_patience": "Go brave woman much 😍 love", "rupama_roy": "Saloni Chopra says free the nipples..okay..then girl why u r showing backless.. show us how to go topless nt backless..we the 21st century girls are interested in your posts..we want to be like u,nt like Kalpana Chawla or Sunita Williams.", "jaaaanv_k": "💯 word", "debanjanab": "❤❤❤❤❤❤❤", "tarot_rooooop": "How u manage to be different n take the criticism?", "electrikuki": "This is the hottest Instagram picture I have ever seen in my entire life. My feed is never going to be the same again. What hot means to me is never going to be the same again.", "wahidarya6": "Your thoughts are just like my thoughts...love you...", "_ethereal_soul_": "👏👏👏blown", "harshi_jain__": "Inspiration ❤️❤️", "nishhhhanonmous": "✨", "aashi_1711": "U r lit... Just awesome...", "elaverma": "Wow that ass", "x.harries.x": "No gender deffer in you n your bf", "debrahgomes": "He has a cute butt!! :p", "sheetalgarg_": "👏👏👏👏", "glowup_with_aasheejain": "Well said❤", "_nandana_nair": "U r an inspiration ma'am", "kukreti_shivani": "You go girl💕", "ashmitadey_": "Happy independence day 😍", "ankit.singh999": "😍😍😘😘😛😍", "bany_thetomato": "That was so true. Thankyou for such inspiring words, being an Indian and going through this everyday is quiet too much where we cannot walk without wearing bra underneath. I think people bother too much to see what are we hiding so we should just stop hiding it cause it's the same what every girl h, every girl-friend has, every sister has and every mother of the so called \"aroused men\" have. Yet happy independent day.", "sehrawat1519": "Love u mam😙😙", "amitbhatt369": "Nice", "amity.beats": "Nice 😊🤗", "karma_believer__": "So there were these people over the comments like “aage se b dikha do” and “pura hi khol deti” like why are you here for ? Did you people even read the full caption which she wrote? Probably not ! But you all can do one thing and that is to satisfy your ego by commenting on her posts! Isn’t it? Like why are you guys even following her if you don’t find her worth enough? Did she asked you to follow her or comment such creepy stuffs on her pictures . Not only this the time i saw the comment of fellow girls i was stupefied by them as well i mean on her earlier post you were the one who comment on them and addressed her as goddess, inspiration, supergirl and then all of a sudden when saw her like this you completely went out? Hell why? What’s makes you do this ? Dude i still get goosebumps just my reading her posts then what all makes you do like this? What made to comment like this ? @redheadwayfarer the world need more humans like you !", "insiya99": "God created us as women and men agar alag paida kiya he to diffrences to honge its your wish to cover it or to show it but when you reveal something which is called private in any term words pictures.. Secrets.. Life.. That will harm you.. Being a feminist is realy way more deeper concept.. Bhagwaan ne hi alag banaya he to kuch to alag honga hi.... No offense but your thoughts are narrow because the world is huge...", "varun_gurung11": "Hottie", "sadiqwalji": "Indians are hypocrites and so are you! Don’t talk about shit that happens in India as nothing will change them! Move out and go to a place that makes you happy instead of all this drama.", "pradeep.dhanik": "Dm me", "libra.amit2012": "U don't have 2 b naked 4 our independence...get cloth kid", "sayma_firdous": "You’re going great ma’am!💯💯💯💯I support you & appreciate your efforts for bringing up such posts. And By the way, ignore the negativity. Tbh, Some people will remain shit, & so will there thoughts. YOU GO GIRL!!!💯❤️👍🏻", "anshika_awasthi11": "Hye! Heard that you see your comment section and read almost everyone's comment if that's possible. First of all I admire you, just like so many people. I admire that you've guts to. Do. Whatever you feel, whatever you want and in whichever way you want. Rarest of the girls do that. You're an inspiration to Me. Because yes, you taught us to say what you feel. Is right and you must always come forward to not just your own freedom, but for the freedom of so many women who are shamed for being black, tall, short, or anything. I love it that you empower us. But my limited point is or you can say my question is, is that just we want to walk. Naked on roads, is that what a women desires, to walk on road without clothes or without bra, to feel free or independent? Is it that limited? So that means; tomorrow the males will come forward too and will say, the only day I'll feel free is when I don't have to wear underwear and walk with my penis uncovered? I'm just waiting for your reply. Because I admire you and I take you seriously, so I really wished to know that! Thankyou @redheadwayfarer 😊", "nushykagram": "Kitna gyaan baategi bas kar", "hardikprajapat": "I think u need help as.u disguising freakin Nudity with Feminism😂....Looks like ..u are so depressed ...and desperate to change the society all at once........evrything needs tym to improve on their flaws........so please get ur concepts clear frst!!😬😥😥", "boshonter_kulfi": "But this article made my day. I wish the society was like you. You are a true inspiration. People should learn where to raise their voice and they should stop taking advantage of their freedom.", "__.l.u.n.a.t.i.c.__": "Really awesome u are...pls keep going and I support u with all my heart!!!!@redheadwayfarer", "rajneesh37": "@dharmeshchaubey read this , too...the weight of the 'marginalised burden'", "syed_mehdi_raza_": "Aree poora boobs dikha do..itna mat sharmao..", "23ritika88": "Every single time. How do you manage to do it with your pictures with your words. I adore you.", "im_amf_starboy": "I love you for this man seriously!", "shantanuspeak": "Legend", "rupesh8071_": "have you out of my why you are showing your body now you are you have no nice body🙈🙈🙈🙈🤛🤛🤛🤛", "inglejikabetaa": "😍😍💝", "__.blisss__": "❤🔥🌹 speechless 🌹🔥❤", "sushantsaklani_": "Oh dear lord! How shallow is your understanding of success. I wish other girls read your amazing preaching and would've just shed their clothes, they would hv found an easy way to become a doctor, engineer, runner or a scientist. All of these greats you are naming or the professions you are mentioning, achieved it not by focusing on what they want to become and improving their skills by studying or practicing every day. If they had dedicated their lives to cry about what part of their body they can show in public, they wouldn't have reached anywhere! In short, success isn't inversely proportional to the size of our clothes, mostly at least.", "vanity_femme_liberte": "Gorgeous!", "anu_pande": "Your post is really irrelevant.. Today it's Independence Day of our country n not Women's Day.. N I don't know why everyone is so obsessed with nudity these days.. India has given lot of freedom to women as compared to other countries which gave women right to vote recently.. So stop telling that we don't have freedom.. We have lot of freedom.. If ur perception of freedom is all abt nudity then you are absolutely wrong n yeah you could have posted our Indian flag's pic today..This would have made a lot of sense..", "dpritze": "Best post till date 💕💕💕💕💕👏👏👏👏👏👏👏👏👏👏I love you @redheadwayfarer 💗", "pandeykefunday": "Feminism isn't Nudity.", "nitu_nithin": "kuch khas nhi isse acha bikini e hai", "ehteshamghouuri": "Girl!! Let me interupt. Sory to say but totally against your thoughts.!! First of all showing your body is not a choice of freedom whether if it comes to a man too... in old ages Man/woman have no clothes , they still coverd there body with leaves--> back to decades!! Now the society grows!! There is a difference b/w animals and humans: Either man or woman: both have a right to live but shaming body is not consider as a act of moderization , liberal , feminism , masclunism etc so on.. I never appreciate a man to walk on a street with open dick. nor i will prefer a woman without underwears... Both are a respectful creatures!! 😏", "charuu_jain": "India needs more bold girls like you♥ U r such a great inspiration @redheadwayfarer ♥", "garimaaa._27": "🙌", "__minion__95": "You go girl!! More power to you! ❤❤❤", "mickyjesjeswani": "At today no one post like this pic showing there back body all Indians show there love for country ur taking about ur b**** t bla bla show some respect about ur country s***e on *", "_jasneet_gill": "💯💯💯💯", "suparnok": "Kali kang dakshinag dibyang munda mala bivushitam", "avani.k9": "@garvit.vij read the caption!", "iprasoonchauhan": "Bagawat 😜", "nishadas055562": "You r always so right and inspirational...💖💖💖", "amit3005": "Love you", "super_suprajit": "Bhul bhal sob meye no words to describe but what kind of boyfriend is this allowing her to do so fuck man...", "itsmeovi": "All u can think of is nudity - while education, female infanticide, marital sex, violence, rape etc are the biggest problems impacting women around the world..", "nikki._.tripathy": "This is so fucking inspiring. Every human should try to become less affected by boobs because it's just flesh attached to a woman's chest. It's nothing to sexualize with. And if we don't sexualize it in case of men, why not with women too? The funniest part is reading comments of some serious assholes trying to be prove themselves right. But seriously proud of you. ♥️♥️♥️", "ayushidixit_97": "This is a gem. ❤", "rohit__rj18": "@redheadwayfarer I respect ✊", "ap808368": "Who is the lucky guy, who click this pic 🙈🙉🙊", "bunnyyyy08": "Why are you all just focusing that she is standing naked and talking about breasts? She just wants to convey one simple msg that a women should be comfortable in her own skin that's all.. and being naked or not that's one's own choice.. it's not just about breasts! This post is something more than that.. it tells us to do whatever we feel comfortable in! @redheadwayfarer you go girl! You are an inspiration ❤️", "jiana_999": "@redheadwayfarer You will make a great difference to this world...all this criticism that you're facing right now..it won't last long...all these people hating on you for no good reason will soon understand it all..you really are an inspiration..not only to me but soo many people out there...and because of you many people's mindset has been changed into a better one...do not stop because of what others say..bec your motive is amazing and if you have hater's then you also have people to support you..so as you always do, keep on inspiring people and just focus on the good ❤️", "harshal_shah": "Love your posts. Keep 'em coming! xx", "10.rohit": "Very well said!", "shikha_verma27": "You guys are goals.. more love n power to you..🤘#bigfan..#loadsoflove❤", "naman_bachhawat": "Never read such stuff. Speechless. Appreciated ❤ hope your words get a path.", "theshreyaaaa": "Goals💥💕", "amritanayak_7": "Inspiration❤🔥", "nikitall": "Please check you dm", "shinynandrekar": "You are awesome and so is Rahul🤗", "raghv_89": "Humans exists with certain hormone. There is thing called civilized it's not only for woman but also for men ... Don't just fight for equality of woman but also question the limits and boundaries of man.. freedom doesn't mean breaking the norms of being civilized even a wolf clan or family lioness has certain rule which are being obeyed by family members ...I don't support your post neither oppose . .but dear nudity is neither good for woman nor man ..any form of nudity because humans exists with hormone and civilization device a rule to tame the monster of hormones .....fight for why men are nude spam those post oppose such post instead getting yourself into it...My words are offending but try to think from my side ...😅", "___manzi___": "I love her 😇⚡️", "aman_kaushal5299": "independence 😂😂", "a_hipster_soul": "OMG this is so good @kanikamahajan7 @rinjhinjn", "akankshamane4": "The best post....inspiration..", "swati.rani7": "❤❤", "aranjveer": "Looking beautiful", "ma_ansi": "The best words i have heard in my entire life ... Always and forever going to bd with you .. #breakingstereotypes", "seepagrawal": "Louder for people at the back! So much more power to you! 🌼", "kripesh_nair": "So basically you are telling women are not successful in this nation bcoz they can't show their tits.... Well that's brilliant observation.", "ankitabhi1.201o": "Wow", "saund_1500": "Love this.😍💯 You summed up everything in that caption!", "the_real_kunal": "Nonsense", "ten_2694": "I love the oxymoron ,keep up the good work we need more bold women like you who are not afraid of the norms society has set for us .", "divya_singhi": "@apeksha.12 read this", "gypsy.soul.tee": "You speak for so many of us! More power to you 🤘", "tehzeeb_qutub": "💙👏", "_infintesoul____": "Rahul has got nice round butt 👅🔥🙊", "babynihaan": "A true inspiration ❤️ @redheadwayfarer", "_apoorvajain_": "Your posts are so inspiring. 😄🌹", "shobhit_saxena3991": "👏👏👏👏😍😍😍😍", "laveena__kuril": "Feminism doesn't mean you should run around naked! Breast and feminism are not at all related! Why to spread a wrong message in the name of feminism?", "karishma.sahni": "Awesome. More love to u ❤", "anusharaina18": "@kaktanya @dhar.shreya this is by far the best one. So articulate and so on point always. The swipe right bit cracked me up. So nicely done. Love them ❤️", "mohit_so_cool": "Ohh! Censored? Perhaps you should have posted your pic front side ..right? 😁😁😁😁", "1ekshmi": "@arun_v_senan", "aryana_sharma._": "Equality in photos girl. Even colour of shorts is same. Kudos for breaking stereotypes. You are awesome. #freethenipple indeed.", "vaibhavi_sawant": "Love this!! 💜", "chaithanya_peethambaran": "Wow!! when this lady talks about some serious double standards ,I wonder how *some people thinks that she is dying to show her boobs. (And still those *some people feel okay to watch porns in private) contradictions!", "riyaaryaa": "@chirag_sharma25 @nishtharawtani wowowowowoowwwwwww", "_aayyyuu_": "HERO❤", "sakshirawat22": "You are such an inspiration...the voice of so many women all across the world....i just wish maximum people read this and truly understand...", "rialovesinsta": "You have just stolen my heart girl ❤", "lavi.kirti": "@lavish21187 😘", "_ishasingh_": "Proud ♥️", "urvashi.joshii": "Omg girl you fucking slay! And your words you’re so good at saying what others cannot and we love you for that!! India needs more women like you.. you’re truly an inspiration..Happy Independence day❤️ @redheadwayfarer", "swapna128": "Oh My god!! This is the best post I have ever seen. And those pictures, You guys are our hope. I wish women all the freedom to speak, act, react, and to be themselves. The pictures are so fucking this awesome. If this can not convince the people about leaving double standards, I doubt if amything else can.", "sugarboxoxo": "Nudity is these days being disguised as feminism..wish you had the eyes to see the actual meaning of the world independence and feminism, it’s not about the right of being nude it’s about female education, women empowerment, women supporting women for a good cause and enabling each other to climb up. I hate male chauvinism as much as I hate pseudo feminist who feel that the right to being nude is liberating, it’s your body you have full right to keep it nude or covered however I wish you could see thing from a wider angle and had bigger objectives goals and vision in life instead of imposing your self proclaimed pseudo feminist thoughts through such pics PS you have all the rights to present your body the way you want to but grow up girl life is much beyond fighting for acceptance of nudity in society.", "swapnil.gulavni": "Fuck off", "officialnafy": "And yes this lady speaks the truth which is bitter but real. Let them say what they say, let them bark who bark. You keep it up. I love you @redheadwayfarer", "nikitadonde": "I totally respect you and your thoughts .. I have always been watching your posts .. but if this is what you call freedom then I'm.not supporting this nuisance. Because this is nothing but rubbish. I think you are mature enough to understand what and how freedom is.", "swati_bharmal": "Very beautifully written.", "lazy_crocodile": "I appreciate so much♥️much love for both of ya", "whinebeforewine": "this is independence! inspiration! ❤️💛♥️", "kamakshi_bhan": "❤️❤️❤️", "shalini_sasha_": "such inspiration you're ❤👌", "kakdeakansha25": "Caption🙌💯❤️", "minalmittal": "This is amazing ♥️", "duhita_c": "I’m the only one who finds the caption defamatory to our country?! I don’t think we have it that bad over here.", "imadeez": "You want society to change and adapt to your norms then start from your house, roam around naked infront of your family, your father, your mother and your brother and make them comfortable with this and if they say anything but what you desire tell them to shut up. Then attend family functions with no clothes on and then attend someone’s funeral too the same way. Make your nude self normal while you talk to your father or brother then start throwing the dirt on all other men. #thisisnotfeminism this is not equality and yes if you want your family to support you with your venture then convince them to nude up too.", "suryavanshikamakhya": "❤❤❤❤", "priyanka_kintsugi": "I have never seen someone sm empowering and such a deep thinking woman. You just raise the bars to be more and more better woman. I just love you sm...and your partner..he is sm supportive ..a great salute to him too.. in sucha a patriarchy ...you two are just such a inpiration . My heart is just so in aww with you too. Blessings..🤗", "the_staceman": "I really really love your posts, you fierce woman! 🤗", "arshdeep._.pretty": "@redheadwayfarer I'm so overwhelmed. I am proud of being an independent woman! @taniqsha_kapoor read this one bub.", "nikita262001": "Caption 😍😍😍each Nd every word are impactful ❤️", "tushardhoble_": "Pyar insan ko kutta bana deta hai suna tha par nanga bhi kar deta hai ye aj dekha 😂😂😂😁", "_sheeba._": "U both are goals😍😍", "sonic_boom98": "But seriously you are the one with double standards..... Everyone follows instagrams community guidelines.... You are no special.... So kindly stop your crap and spreading hatred..... You are just a self declared feminists but you are just a pseudo feminists....... Who is spreading hatred in the name of Feminism. #FakeFeminists 😎", "xnoushkxx": "You guys are goals💗", "isimransethi": "Slayying 🔥", "ahpmakeovers": "❤️", "nasihanazma": "WOW💯👌🏻", "pragyaaa__": "@phalguni__", "medhavi17": "Came across the best independence day post 💕💕💕 @shefali_gurung the caption... Made my day", "ishikagera": "Amazing ❤️", "mrinalinimahato": "I won't fight and debate w the other people in the whole comment box who are going to judge as always , today I'm just gonna say this @redheadwayfarer I freaking love you this post just made my day and you made me speechless I'm just gonna read this post like a hundred times and be happy that you did it ..", "_.irresponsible_adult._": "Your thoughts are so deep . I hope from today at least few get motivated. They will bring a lot change to future generations.", "salute_star": "Happy independence day guys @redheadwayfarer and @rahulb90", "ashi_ad": "♥", "ashwinlovesgym": "😋", "yashikabedii": "You're such a strong women 💖 I really appreciate whatever you do and everyone should be like your boyfriend he is really supportive bless you both and keep going like this", "madhura.1796": "❤️❤️❤️❤️", "hey.itsmeleena": "⭐️⭐️⭐️⭐️⭐️", "_user._name_not_.found_": "nice ass @rahulb90 :P (im an admirer) :P.... girl..... u are love❤❤❤❤", "abhijeet_mahat0": "Same here ... It's now the 72nd independence day but yet it's a shame that 90% of women are still not free ... But we will still not give up hope ... I know there are still many out there who want the change to happen 🙌👏👏 @redheadwayfarer", "almostfammous": "🇮🇳🇮🇳🇮🇳🇮🇳", "sorryraghu31": "Hott", "_jaaanvi__": "The best post on Instagram 💯", "shankhabela_mukherjee": "Beautifully put", "khushi_280": "You write everything that we feel. I love you Saloni.", "bliss_feeder": "This is love❤❤❤", "saloni_sancheti": "@leavesanchitaalone_", "___.gudiya.___": "Jst love uh mam ❤", "priynka.psd": "More power to you", "jhajagriti98": "True af really love your way of putting this issues across in the world..@redheadwayfarer just reply once", "thecrazywomansays": "You are the best!! 😍♥️", "beck_dunk": "had sex ?", "simran_sharma13": "👌🏻👌🏻👏🙌🤟you go girl!", "shubhamvichare_": "@redheadwayfarer appreciated best post", "a_creator_of_possibility": "You both are awesome!!!!", "theperfectlyconfused": "This is amazing @redheadwayfarer Even I’ve been thinking how people have double standards seeing your post. No one gives a flying fuck about a shirtless guy but when a woman goes around and do just that “haye haye...you are ruining our bloody culture”. And thanks to you we have something more important to think about on this independence day. And honestly I’ll skip this one too. Patriarchal patriotism is not what we need right now.", "quirky__quail": "You both are goals, truely. ❤ Getting such a supporting man is blessing. All hearts <3", "subrat.raj9": "You should remove d pant....also for complete independence", "madnessinthenormal": "❤️❤️❤️", "_chayanikadas_": "@rahulb90 thanks man... I wish some other men would learn from u", "cryptic_vantagold": "@yash_221100 exactly your thoughts ❤️ I m soo blessed to have you❤️", "bhumika_sharma1997": "Great thoughts u hv🤗 proud of u alwys", "advaita_gk": "I absolutely love this post! Always loved your posts but this one just made my day. I've seen so many independence day quotes and posts but this just topped the list and made my day. More power to you ❤", "suuu_it.is": "The only thing i could say is wow 😍❤️", "vaishnavi2377": "This is soooo good ❤🙏😍😊", "itis.akanksha": "😍😍", "simranpatel2001": "Caption on point🖤 every single word is so true❤ u r fucking gorgeous both from inside as well as outside 😍 and ur thoughts are so pure and accurate✔✔🖤", "deepali_y": "You are an amazing amazing woman. You inspire me a lot and your words! My God! I have never enjoyed reading someone's thoughts as much as I do yours. You look really amazing btw and so does Rahul.", "gautamikawale": "❤️🌠", "meghachauhann": "The best @redheadwayfarer 💙💙", "prabhakar273950": "Karna kya chahte h bc samjh ni aata", "gaurivyalekar9": "You are inspiration for girls #respect", "p_r_i_y_a__n_k_a_": "Each time u write something I just go numb 4 sometimes & it gets me thinking, I relate so much with ur words..! Thanks a ton @redheadwayfarer for giving shape 2 the jumbled words of my heart.. ❤ We need more ppl like u..😘 Big hug...❤", "saiujwalavalluri": "Loads of love to you 💞💞", "kanshellfire": "@redheadwayfarer @rahulb90 you guys are true inspiration of this sanskari world....nd one more thing this is what we call #couplegoals❤️", "amour_rihu": "Best post i saw today 😊😊@sheetalkarki339 @suman.sharma @deepanshigaur @deepaliahuja13_ @meghali_mk @akanksha5946 😊😊🤗", "jaajaaabor": "This write up ❤️", "moon__maker__": "❤️❤️❤️❤️❤️", "_mansi_raja_": "Okay new goal is been made!!! I wanna be like youu❤️❤️❤️!!!! This is everything a girl or anyone should be!! Independent 🙌🏻🙌🏻 Thank you soo much @redheadwayfarer for this!! Thank youu!! And a picture like this is a must!! I loved the way you portraited the meaning of independence 🙌🏻😘😘", "rajvi_desai": "I'm proud of you. Burn that patriarchy with all of your voices! 👏❤", "dawww_shun": "You slay . ❤❤. Your guts leaves me impressed ❤💕.@redheadwayfarer", "som.woah": "The caption has my heart❤️", "_.sonalibhardwaj._": "The best post i have seen today. You are a true inspiration. I don't read long captions but yours are worth reading. You make me feel proud of what i am and what i can do. @redheadwayfarer Thank you for being truly motivating ❤️", "therealreyanahmad": "Gand me khujli hori h iski khujao tum", "_.prashansa_15": "Woah!! You both are amazing!! You are such a inspiring person", "mehaktyagi__": "@kartik_attri caption pado 😍", "m.b.adil": "Ye statements kabhi aadivasi bolte hue achche lagte the...😂😂😂😂 #NoOffence", "ray_barshana5678": "Let there be freedom to express the way I feel. let there be freedom to feel what I feel.Let their freedom to express my ways in and out whatever there is beneath", "just_being_sid": "damn that's DEEEEEP", "sweetynotay": "❤lots of love Di", "manisha_lohia": "@aasthadhasmana @maansichaudhary @_your_foto_bakwass_bt_i_still_ 🙌🏻 read it ❤️", "memiss__eye": "Beautiful❤", "shreyyaaaaaaaaaa": "Go Girl👍🏼", "anjali.sharma597": "Rubbish", "aryan4404": "@smrithyy", "poetess_on_the_road": "Lol. I love your comments. I find them so ridiculous and funny. I ll reserve my comments on social media. But do meet me girl & I ll show you the real world. Where women like me proudly live the way we like too. Every fucking day.", "naveenrajput__": "I agree🇮🇳", "akshimaaanarangg": "@priyankaamarwaha she is ♥️", "mansijain3334": "Damn girl you and your words❤❤❤❤", "lost_boy_journe": "@redheadwayfarer ye kuch zyda hogya freedom of clothes kisi country me nhi h anyway thts ur life ur choice can't much say on that", "ra9dhawa_manni": "U fab.....always.👌👍", "shrutidash1995": "❤", "_hassana2013": "maje hai yaar rahul ke...", "snigdha__": "“1st woman to have done something thousands of men already have done” hit me so hard @_srishtiiiiiiiii", "navneetksethi": "👏for the post but Kalpana* Chawla😑", "rachelwiththefingers": "You said it.", "pallavi_poojary": "Strong nd bold as always😍💕inspiration for a reason love love loveeeeee you♥️♥️", "supriyamunda196": "Wow", "devil_kt_1177": "Love u mam 🖤", "shashni_____priyanka": "U r inspiration...😘😘😘", "smitassgosavi": "❤👏 words are sword. Love u lady❤💎", "p.reet.y": "actually you both are soo good❤", "khushi_khandelwal_22": "Goals❤", "a_bookish_wanderer": "You have just stolen my thoughts..that line.. \"you can be engineers, doctors...until you keep your breast covered\". Even if you become like Kalpana Chawla or any other 1st woman, your breasts are the main concern over anything for the society! You are truly an inspiration..i am glad that you said this words on this day. Respect for you @redheadwayfarer and we need more hopes like @rahulb90", "_salonishah1511": "Amazing. I love you for the confidence you carry and make us achieve just by your posts", "socialindian": "Why not you should upload your video of doing sex it's also a part of love.", "abirami.uma.ramesh": "@rrohiniiyer read this.", "harsharaisinghaney": "♥️", "disquistivesoul": "Your guts and words. I just love them 👍🏼🖤 @redheadwayfarer", "dive_deep_into": "Much love to you ya!❤️ I love youuuuuuu more @rahulb90 You are great!❤️", "dirtycaffeinater": "You guys ❤", "zahra_attry": "You inspire me ❤️", "thenameiskgr": "I totally Agree! Female breasts should not be considered as sex organs and should not be censored.", "siddoku": "AHHHH SO GLAD U SKIPPED THIS INDEPENDENCE DAY JUST LIKE I SKIPPED PAKISTAN'S YESTERDAY FOR E.X.A.C.T.L.Y. THE SAME REASON. THANK YOU", "raiabhinav1234": "One of the bravest girl i've seen in my entire life...more power to u girl... #respect 👍", "ms.tribbianii": "Love u more woman, you make me proud 👏👏", "aayuushii_": "@p4pragati @rakshatndn @autumn_1905 read the caption", "aree.zz": "More power to youuu!!! ❤✨", "archith_s_kamath": "🙏👌👌👌", "sonika_jha_": "🙌🏻 #inspiring", "anshitis": "Thank you for speaking my mind everytime. I get up and and \"be me\" everyday, and you've made me learn to appreciate it. In love with you forever, @redheadwayfarer. Happy Independence Day.", "allthoseflaws_": "You guys reside in my prayers. @rahulb90 @redheadwayfarer tons of love. ❤", "_.ishitaaa": "WORDS♥", "nidhabhi": "You are truly an inspiration.", "drishti_dhameja": "The best post . Thank you for inspiring other women to speak out . 💖💖", "vai_22.2": "Very true saloni u r an inspiration for us truely❤ lots of love", "_._shruti_": "Whoa! 👑🖤", "heyitsbulbul.___": "Moree love to uhh u insipire us a bit more with each new post of urs😚@redheadwayfarer", "bazzpun": "@neelu08 @_me_deshmukh__ @sonu_anakal", "brascodony": "Pure perfection 👌👍😍", "sourabh_biyani": "🙌🙌", "_flawless_soul_": "I'm feeling so good that I was really waiting for ur post ..I was waiting for u to write today on Independence day ..This is giving me courage u r great", "sanjula.gupta": "Love this! We recently had to debate on the topic about whether nudity is empowering or not in our college. I spoke in favour of it and used your example as an activist who voices her opinion about this and how it is wrong for society to put these social constructs around us, especially women. More power to you♥️", "just_my_lil_wonder_wall": "The best thing I have read till date.. You are truly an inspiration..💜", "saxenaakansha30": "@priya.anand05", "_praptishende17": "The world needs more women like you . Happy independence day 😊❤", "krishnaa_manoj": "More love to u!!!!...... u inspire us a bit more with each new post of urs!!!!!!!♥️♥️♥️♥️♥️", "panchal.re": "♥️", "shubhiagarwal05": "SO POWERFUL. WOW. 🌸♥️", "tani1524": "Loved the pictures 😍😍😍 keep going lady.", "charmingly10": "The kind of voice that shakes you up!", "docdevanshi": "@redheadwayfarer Dude you are an Actual Hope🖖🏻,if anything, we have in this “We-Have-It-All” claiming shrewd society Wch infact lives in a constant fear of women taking control or power!! I just wish and hope that people especially women try and understand the actual meaning of freedom and start doing something about it!!✌🏻 Your posts give a positive sense of being a woman and Own the damn fact that you are!! #bethechangeyouwanttosee", "nehaiyerofficial\nVerified": "Verified", "roza_sinha": "Wow thats the best u hv done", "kajal_vatsa": "He is pretty much what we all need! What INDIA needs as a Nation right now!", "ameek_mahal": "YOU GO GURL👯‍♀️💕", "arora__muskan": "❤️❤️❤️", "iiiiiishaniiiiii": "I just love your posts ... Respect!", "that.gypsy.wonderer": "This❤️", "___.soumya__": "❣💫", "sakshi_abrol": "Wow. Makes so much sense.", "ashwini_8811": "Bold and fierce.... I always look up to you ❤️ lots of love from Kerala", "priyanshipatel_359": "Uh r an inspiration😘", "abh.ay_": "Dayyyumm Rahul looks hawt!", "__joycejestin": "Nobody could have done it better than you my love. Many of us are even censored for our words in yhe society. But i pray it remains endless for you and your words make a change for the people who disrespect the breasts and vagina they drank and were born out of. Much much love❤", "mayur.jain.bbm_53342330": "👅👅👅", "himanshii.n": "Respect @redheadwayfarer ❤😭Love You favourite women", "ankkitaaa": "Woah !! ♥️", "prakritti": "💌💌💌", "chharry2": "osm", "anushka_budhiraja": "Loved this. 🙌", "___stonehearted___": "👍INSPIRATION ❤", "nitinchhabrra": "I love you bro @rahulb90... You're so supportive 💕 lucky you @redheadwayfarer 😍🙌✨", "jhankar_309": "Happy independence day ❤️ you have a truly beautiful mind amazing💕", "karishmayadav313": "You are an inspiration. And coincidentally or not I don't know, the surrounding is tricolor. We love you Saloni. Fuck the haters 😘 and Happy Independence Day 🇮🇳", "neha_vadhwani": "so inspirational❤", "_imeghana_naidu": "I loved this @redheadwayfarer", "_nimbalkar_": "Ma'am u have been a great inspiration for me ❤️", "prettyoatsgirl": "Read the caption @theravikantt", "jaldip1234_": "Bold and fierce that's a real independence ❤️❤️", "surabhi.jha": "The best post I saw today. Thank you for what you do. You speak the minds of many people including me who want to bring a change but aren’t probably this bold to take a stand. All the power of the universe to you, Ma’am! Happy independence day❤️.", "srk.aakriti": "Superb! Amazing ♥️", "nancy_272": "Why do you always have to be so impressive ? <3 _ <3", "simrannmayekar": "Word!", "ravishingtwinkle": "❤❤", "thatmolekid": "👏👏🙌💯", "uthara_____": "❤", "farahkhan_toot": "May we all get a partner like yours who understands what we speak our and struggle for instead of criticizing and putting us down ❤ You are blessed Saloni .. 😊🌟", "savithriram_": "A man like @rahulb90 is worth finding and I’ve to say this, You guys are goals.. ❤️❤️ Tons of love!!", "merry_water": "Happy Independence day you beautiful mind ❤💓💓💓✍💓💓✍", "blue_october92": "❤️❤️❤️", "himanshimisri": "❤", "ipaintmyrosesblue": "Y'all...❤", "chandniranaut": "😊❤"}