{"rk__1717": "What a retard! 👏", "_._.ron._._": "Feminism lekar log politics karte ha ajkal, although feminism actually means equality.", "s_m_1_9_9_9": "@abhijit.biswas_ ❤❤", "itsyuvii_": "👌👌👌", "vrushaaaa": "🔥", "sourabh.kumawat.102": "✌🏻", "tulasi_bolisetty": "Wow🙌", "iamayanjain": "🙏💕", "chaya_18": "Feminism is not revolve around \"naked body,sex desire,\".Real feminist are those who are real victims and survived fight for herself making hope and way for other girls, women to fight for their equality. There are acid victims who survived with all pain and decided to stand up for herself and live her dream.(was it so easy for her!!?)just an example!!!", "srinivasrockstone": "@grigytt", "sherowali_ki_fan": "So india me mat raho agar unsafe he to jaha tumhe safe rahe wahi raho jake or bahan jamana inna age badh gya he 21 centuary me hoke tu aadimanav wali jindgi jeena sikha rahi he ki nange hoke ghumo tu hi ghum.", "the_bohomonk": "Thanks a lot for this .. @redheadwayfarer ♥️", "i_am__rebel": "🔥", "santa_murray_gurl": "Agreed.", "miss_sadani315": "Awesome this isss I read it alll I totally agreee with you 💕", "monisha_shankhar": "👏👏👏❤️", "stardust_alley_": "💞", "madhurima_32": "❤️❤️👌👌👌true words", "im.asutosh": "@samantharuthprabhuoffl @chinmayisripaada plz share this", "sssqr12_": "Boys too have to cover their dick and balls infront of their family or friends or outside .... Yaar ab to log v samjh v samjh rhe h ki bra panty boobs vagina free the nipple - feminism Ni hai ..... Jake kabhi gaon me dekho waha ki females Ko feminism kya hota pata Ni ..wo log av v struggle kr rhe ...jo av v ghumghat k neeche reh rhi h ....they can't even raise their voice...so please unke aar me aap hero mat Bano ......", "_wordsaddict": "@disha.f also read the comments", "anukoiraladhakal": "you are an inspiration ❤", "nainasahney": "What a girl you are 😍.. I love you for your thoughts 💕", "archanasingh09": "❤️ well said", "aparna_sundararajan": "This is so well.put!! Kudos!!", "rmdeepika60": "Awesome...... Every girl will relate to dis. 😍😍😍😘😘@redheadwayfarer", "_._raghuvanshi_._": "Outsiders are lucky 🍑", "nikitamishra3469": "❤️", "we_are_the_real_aliens": "Rape is wrong.. let's first put that aside.. now is men wrong for looking at women?? Aren't they biologically programmed to do that?? Why should anyone cover our sexual organs? Well it's an agreement on which we created a society or we would all still be animals.. its for the same reason we have traffic rules... If everyone is nude then arousal at everyplace anytime becomes a norm which is not comfortable for everyone so we as a society created a few rules so that we all can feel comfortable.. if u feel these rules are not for you then sure plz leave this society and move to a nudist land.. but stop blaming men for something they are biologically programmed to do.. again repeating before someone say that i am justifying rape.. rape is wrong.. but blaming men for looking at boobs when it's visible is purely wrong at many levels", "aayush_mishra_": "👏👏👏👏👏👏👏", "_subha.shree_": "Amazing !!♥️", "harshii_pandey": "I don't know what according to feminism is! But if we are talking about the struggles women face then let me tell you something..there are many women in India who loses there husbands on early age and then they have to go to fields to work to feed there family and sometimes they are judged also but still it doesn't matters to them as all they want is to have there childrens stomach full of food:that courage is feminism! There are many girls who have been attacked with acid and have lost there face and most of body parts but still they are living in this world hoping for situations to get better and fighting for other girls: that hope is feminism! There are girls who are not allowed to have education because parents can afford the education of just son still those girls never loose there confidence and still always stand by there family: that sacrifice is feminism!! Trust me mam there are many issues which needs to be focused rn in this country and the pain to cover our boobs is the least of them! We certainly won't feel happy if men start roaming around with there dicks uncovered on roads.. wearing clothes or not wearing clothes is the matter of choice.dont connect it with feminism!", "009luna": "You got no brain. Just being naked is what you call empowerment. Even a video has been uploaded on YouTube on your topic or else I. Wouldn't have known who is this 'Saloni' 😂😂😂", "apoorva_.22": "Just love your thoughts ❤❤", "anushkaa_dubey": "🤘❤", "ramurocky6": "Cute ❤️", "amalamukh": "Well said..the words are direct from the scars we have!", "m_kounain": "Feminism isn't just about dressing...less clothes =freedom ? Seriously......how about equal rights in marriage... education...??!!does this make more sense....? Be more public about these...not just.....half naked clothes....", "the_____animal": "Wtf !! Prostitution and pornography for men ? As if girls don't watch porn ...and prostitutes don't earn... U urself seem so double standard !! @why.so.illogical @why.so.illogical.2 Bhai apni raay de yaha pe", "ritika11lohani": "Kya hogya h duniya ko😑", "why.so.illogical": "Seems you deleted my purely logical and opposing comment. Hmm, what else can I expect from a modern 'Feminist'. Just wanted to add something. Of course you have to cover up your sexual organs. Why? Cause they are sexual organs. Nothing to do with patriarchy or Feminism. Would you feel comfortable with men roaming the streets with their erect penises hanging out?", "janakbarmera": "Good words.", "subhankarpaul0464": "❤️❤️❤️❤️❤️", "sonamsoni90": "Appreciated🙌", "shelby_sparsh": "I am not against what you wrote but that is not what feminism means 🙄", "basit216": "I mean nobody should have an issue with how you present yourself but please don’t call yourself a feminist for god sake😂", "ezinnor": "And that's why nobody takes feminism seriously, you really think rape happens because women cover their boobs and not because some individual people are sick in mind which you could find in any country. Getting nude isn't empowering or feminism.", "city_wizard": "Well said girl. My favorite lines are \"I refuse to be scared every day & worry about someone else’s sexual desires while my own desires make me a whore.\" I agree 100%", "navya_vvj": "I love you so much. ❤", "saldon_gyatso": "@namitnz", "nils_mehta": "@redheadwayfarer if u think india is most unsafe country than go away from here... U ppl mke name mke career mke money from india n tell its very unsafe... Than go away from my country....india also not need ppl lyk ..just go away......", "shaista_haydari": "I love you girl ❤️❤️❤️🤛🏻", "shettyamit2": "Even my wife and parents sometime scold me for roaming in boxers, what can we call that...justathought", "amit.p.ami": "💪🏻👍🏻", "_bhakti_18": "You are a super star !! I loved your thoughts you expressed !!! I was like , this is the strongest woman in this country to show upon this much courage to be braless in the 'socail world' , Where every girl , ever woman is judged so badly after her clothes and dressing style and all the shits !!", "the_knight_oo7": "Wow .... Salute 👏👏💪🔥🔥", "firdous_imran": "Wat r u trying to explain wid ur cheap stuff...", "ankitanayakx._": "💞", "swati711_": "What you write is commendable and true . But it would be better if you not just spoke about India . But instead the whole world . Cuz even the girls or women in U.S( the country we think is super safe) go through all of this", "pearl.what.is.this.behaviour": "@chief_surya01 ...ain't it is a appreciation post", "nish.insta.gram": "😘", "__ruutuujaa__": "This is soooo rubbish and full of shit just came across this post in my search. Feminism for her is a different direction completely.", "sanjaykumawats": "Salute 👍 keep the wave going @redheadwayfarer", "rohan_922": "Calling your own country “one of the most unsafe” countries makes you look even more of an ass than you already look. Educate yourself, moron. The most developed countries are much more dangerous than India in terms of “rape” reports. But in western countries these reports dont spread like wildfire because people dont protest there. In our country such news spreads like wildfire because we protest, which shows we take rape cases seriously and respect women more than those western countries. Anyway, you are a moron and will remain a moron, probably getting promoted to a higher level moronism with each passing day. And if u really feel india is so “unsafe”, then please do not come back. Stay the fuck where you are. Enjoy your “safety” there. 🖕🏻", "kashish.parchani": "@sid_._ @5.rishab", "siddharth_peepra": "@sejal_mohare 😘🔥😍", "ritz_waaow": "Soo true 🙌", "tanu_rajora": "@leopayal", "swarnshri": "You are just a dumb feminist with no brains. Who only thinks that feminism is wearing short clothes and roaming naked.", "justwaitmytime": "Same", "rupesh8071_": "aap log kya Pagal Ho Apna personal life why are you saying in Instagram think🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈?????????????", "vinjamoori_shiva": "Nice information but some facts are hidden", "mom_bae": "💯✨", "shirsha_kundu": "@ashim.187 @paa_rulebhatia I am ready to do such a photoshoot for you guys ❤️", "avvngrs_": "👏👏👏❤", "priyanshi_daswal090": "The Boy has More curves 🧐", "skiracedad": "Ahead of the #MeTooIndia wave 🙌🏼", "prajjwaldixit17": "Who said to them to wear, we never did", "potterhead_p_08": "@sherebanu.saifuddin read this. And the picture is so perfect . And caption on point 💟", "kindasavage__": "Loved your caption man!!!! WHY DON'T THESE FUCKIN SOCIETY GET THIS?", "simpatheja": "Beautifully penned,,, 👍", "ts09085": "babe please workout", "misscrackhead": "@__fumble read this", "house_in_india": "Read her post before you get offended.", "poetryandpoetess": "You inspire me!! 🙌💯", "snehasjn": "I don't get how ppl come n comment here saying feminism is not about walking naked n whatever. Don't you see children without boobs are also raped. She isn't talking about if men n take off their shirts why can't women, get the shit out of your head n think what she is implying here.", "pradheeparaju": "@ramyatamilselvam", "tarabista": "@breeruby", "jyoti.bhan": "@ishaquerazvi hw beautiful she has written😍", "sahibabedi27": "@shes_chaotic_mess @vaanniiiee @upinderbhamra", "meghaaathakur": "Well said🔥🔥", "dr.niti_sharma29": "Is feminism just abt ur dress?", "nehaishere": "@niyadav read the caption", "niyadav": "@nishi6658 @snehamlh1989 @bhawna.s08", "deehmish": "This had to be said. 👏", "awinterof_97": "@madhuja96 read", "sumit_nagar_007": "👏👏👏", "sagarika12sharma": "👍", "sanjibdasofficial": "Pata nahi kya saabit karna chahti hai aap yeh sab karke?", "lil_kimiii": "Why don't you educate the young girls how to feel beautiful without being nude? ..your feminism is more of a nudism. I appreciate the right to do whatever you want but there are many positive things to do other than this.", "azizquraishi69": "@purvvs", "nirbhika_": "@redheadwayfarer you go gurl. More power to you ❤", "_mohi_dadlani": "I love what you write", "rajput_poooooojaaaa": "Heads off to you 👍👍👍👍 people need to understand this", "deb_neekita2405": "India the most unsafe place for women? Girl you seriously need to read some journals & watch international news. Tryin act cool by stating wrong facts even if it's about her own country. Shame.", "sshashank.1203": "Enough internet for today", "sammybouy_22": "Who is the third wheel in this", "iam_twinkyvkarma": "😂", "thewayshelives__": "What else are you doing as a feminist?? Women need equal rights in many other things too.. Enough of your equal rights in dressing", "m_sharma__": "👍☝👏👏", "ruchiitomar": "@siddharthbhat read the caption!", "avinash.singh.3388": "Who is third one... The Photographer I mean", "_varinda_goyal_": "👏👏👌", "acerbic_for_you": "I abhor you", "piansh_world": "💝", "sinner_._af": "The caption gave me goosebumps ... So strong and up to the point 🙌 I hope people get message what you wanna show ❤ I adore you .. #highrespect 🙏🙆", "ssaurabh9": "Shame on you claiming India most unsafe country of the world!", "er.lokeshsankhla": "👌👌👍", "sandrac.iad": "I like you.... 🙌🙌🙌🙌🙌🙏🙏🙏", "__anissh": "Am I the only one thinking ki Photo kisne khichi!!!??? 🤔🤔😂", "nikitasharm111": "Wow wrote💙", "utkarsh_chaturvedi": "Dont ever come to India.", "hemalkumardave": "👏", "spif.fy": "🔥", "_poetically_correct": "so sad when you realise half the people didn't even understand the entire point of what you were trying to say", "moulakinnal": "💙", "goyanka_": "Hi", "aurya__11": "feminism says that \" a range of political movements, ideologies, and social movements that share a common goal: to define, establish, and achieve political, economic, personal, and social equality of sexes. This includes seeking to establish educational and professional opportunities for women that are equal to those for men. \" and what she say does not include in feminism .... it is up to you how you want to represent yourself in front of others .! if anyone wants to rome around naked then it is their own will but you live in a society and you will be judged / trolled and appreciated for everything even if you don't want to .", "rachu_10": "💜💜", "senjuti_007": "Awesome", "s.w.e.t.u": "@_roshni.d.c_ Read the caption 💣", "sanaboxer": "👏", "subhanwasif": "Very well said..#RESPECT", "ankitajain112": "@prachu143", "rupak_3_": "I absolutely adore you", "_aamir_hoda_": "Woah, this article was pretty interesting! I hope people do find the time to read this completely!! 😊", "priyank_sinha88": "gelchodi nangi", "_monu1322": "Who clicked the pic then ? 😅", "itshriiiiiiiiii_": "Hatss off🤗 Thanks for existin Saloni u taught us a lot...🙏🏻🔥", "manasi06": "❤️❤️❤️❤️💯😻❤️", "_rajashree87_": "By reading all these comments which are not at all relatable to her caption can be of two reasons. Either you didn't understood her irony or you all are dumbhead. Ofcourse we all know FEMINISM is not all about bra and penty but this post are for those who don't know. We live in a society where we can't walk around without bra and panty because out breast will be all over, awaken men for sextual feeling and finally responsible for rape. So the point is male is not responsible for their bulgur eyesight but we are for not keeping our boobs inpropotion. So instead of thinking about for comfort level we should first think about men, how we are portraying our breast to them.", "cosmicvibes_girl": "@_o_shruti_o_ 😊", "ashish_little": "Aacha ham gaao ke aadmi ki soch choti hai itni badi hai tumhari soch waah..", "mainkitaanu": "👌👌👌", "ashpavoor26": "What are your contributions to this world as a feminine ? Except for these lengthy essays on vagina boobs panties bras? I guess 0 contribution .. ladies like saina Nehwal, Sushma Swaraj ji etc etc and their contributions has set examples for many these are the real role models of feminism.. you stand nowhere lady.. Don’t restrict your definition of feminism to just boobs panties vagina etc . There’s a broader definition to feminism which I don’t think so you have learnt.. You are a model not a role model.. There’s a difference", "kaushik.parth": "I just come here to look at the comment section lol..always leave Amused😂", "shivani007007": "❤️🔥", "lilredhill": "This is incredible ❤️", "manishachelani": "So proud.", "peecee333": "India has a better brighter side which sadly u won't ever come across. Dont mix feminism with clothes. With women like you around I sometimes pity the cry for feminism.Go away, you dont deserve to stay in such a beautiful country.", "anishkarsharma": "@harshita2980", "_aka_.sakshi_": "Hats off!!!!😇", "huntrrr__": "Did you guys had sex ?", "hnenejeiw": "Thankyouuu for existing gurl❤️", "arifkhanak.133": "Ye kya h maderchod Jo dusre ko sikha rhi h", "arnieroysjourney": "This is absolutely not in support of feminism, there are so many other ways for women to excel and show that they are equally capable achievers as men, I don't understand what repeating the some thing again & again will achieve, as with all gyaans, this too is gathering moss now @redheadwayfarer !!", "__aishwarya245__": "@jyotigoge", "sujata_das_suju_": "Woah....so bold n put into words perfectly 😍", "salmakhan.sk": "Feminism has nothing to do with this picture though i blv in feminism", "milimartin07": "I adore you guys !! 💞", "agirlthatknows": "I look up to you not for the way you put feminism out there but for the fact that even if I don't agree with you, you would still support the thoughts of another woman. I wear a bra because I am comfortable in it not because I am supposed to wear it and I know she supports it. So when I say I don't want to wear a bra it doesn't mean I am asking for it. The simple truth is she speaks things that are way too hard to understand for your mind. This is woman empowerment, she isn't asking anyone to roam around naked she is stating that we always have a choice, our body our rights. Men like this are the reason woman can hope the world can be a better place. We need more Rahul's and more Saloni's. #feminist", "itxsaumya": "All I want to say it's just how u look at a person as a sex object or a human being", "avnikaps": "@redheadwayfarer please watch @priyankachopra interview where she mentioned feminism is not about burning or taking out your shirts but it's more than that. Feminism stands for equality, inspiring women to choose their careers and become role models for girls especially in rural area. I don't know how you inspire small, young girls by posting these pics. I know people gonna say, i shouldn4 follow you if i don't like your opinions....🙄 But I'll speak and comment on your post as so many young girls are following you and miss @redheadwayfarer their is life beyond Mumbai and I don't want young girls of India look at you as their role model instead of other inspiring women such as: Saina Nehwal, Sania Miss, Kalpana Chawla and many more.... Please stop creating delusional lifestyle in young minds and start living in reality", "paradoxer_": "*Rape means the penetration, no matter how slight, of the vagina or anus with any body part or object, or oral penetration by a sex organ of another person, without the consent of the victim. Also men get raped too. So let's not make rape about women and feminism about roaming nude. We would be equally disgusted by seeing a guy's dick out of his pants in public just like we would be seeing a girl's nipples. So these notions should be broadened a bit ✌", "geeta_patra": "👍👍", "rishabhdogra_": "Loved your caption🤩", "aranjveer": "Looking gorgeous", "classyfreak_": "Amazing Thoughts!❤️", "afacebehindthecamera": "Absolutely correct", "want_change_want_equality": "@ashish_little bha bhaakk bdk. .ab jb teri fatane lgi to shadhu sant bn rha h...u know what people like are the main cause of backwardness n illiteracy. U might be scholar bt u r dumb,bt u scholar v ni lgta. Tere jaise log ki wajah se hi na aj jb ldkiya ghr se bahar nikalati h to khud to cover krke ke nikalati h,due to people like u she is busy in covering n hiding herself instead focusing on her gaols. But u don't worry ab tu aisa na soch ki tu jaisa soch rha h sb waisa hi h. Ab tere jaiso ki marne ke liye ldkiya bht kafee h. Ab ye mt soch ki tu kch v bol ke nikal lega. Ab tu kch v bolne se pahale hazar br sochega BC", "mahimaa.thakur": "💯💯💯", "parnikawattal": "♥️♥️♥️♥️♥️", "s_embelish": "@cyranosis_me", "_.prashansa_15": "You are so inspiring @redheadwayfarer!!!! We truly need people like you!! I truly appreciate and love your thoughts!!!", "qalder_pie": "Ummm, they don't rape cause you have breasts or vagina, it's not culture, education, none of that, it's as simple as MOST MEN IN OUR COUNTRY DON'T GET LAID. They rape cause they can and get away with it. A human in India isn't known for his morality, it's \"jaanta hai mera baap kaun hai?\", \"Benz hai bulbul, uske Dio mein kya kar Rahi hai?\"(most of the time it actually works, just look around the people you surround yourself with, you like to feel important just as everybody else) A man's mind is fucked up when it comes to sex, so much, that the guy doing errands for you is actually doing it in the hopes of getting into that panty, that's just how it is. The guy sitting next to you right now is actually thinking about sex. I feel it's mostly de-sensitising the sex part. It comes down Society and it's norms, Sex paap hai sikhaoge toh beta asal mein rape karke paap karega, pakka.", "khyatishah01": "@redheadwayfafer 1ST CHECK MENTALLY ARE YOU FIT OR NOT..?? DO YOU CHECK UP....", "dileepjangid7": "You are having a great time 😍👌🏼👌🏼👌🏻👌🏻", "vs31072014": "Only outside India there something", "bollywood_hot_photo321098": "to pussy or boob real mai dikha do", "thelostsoullllll": "More Power to you ❤🌸", "prajaktabagull": "@vineha04", "armaanmalhotra2": "@rahullb90 Buddy you are so luck that on the daily basis you get opportunity to see,touch and love the amazing tits of her @redheadwayfarer love them", "putts1986": "I feel horrible about the rape cases in our country and yes bout proud of it. But just have a look at the countries like syria, they are so worse.. it's literally hell. We need to fight against it, together!!", "the_fitdoctor_16": "Nice Words..💪", "doople_space": "Sorry, but the thing you are trying to focus on is not feminism by any chance. I like that you are open minded and warming to enjoy everything, but dont caption your \"enjoyment\" to \"feminism\". Firstly try to understand its meaning. All you do and post is what you feel like and its your total freedom.No issues to that. There are other womens that have rose and are a excellent example for feminism .I hope one day you will be too but with right approach and total understanding.", "___mukku__": "I don't know how to thank you enough for this caption... You put all my thoughts into words so beautifully and effortlessly ....", "matea.buqele": "Awesome post!!! Sadly how true it is", "kimohs_b": "I don't understand why there are so many feminist rather there should only be humanist.... Equality is only a myth ... It's the thrive for equality makes the society to function better and that's it.... U are talking about Equality but I have never seen any Feminist to fight against the reservations which Females get ....let's start talking about that", "__coruscate": "Hats off to your thoughts❤️", "whoananyaswain": "Thanks for taking initiative and talking about the things that really need attention @redheadwayfarer", "grg_anisha": "Awesome", "geetanshiarora": "Oh my my!!", "aloneatthezenith": "Do walking around with your tits out help in decreasing rapes?", "swapnasamartha": "caption ✌🏼❤️", "aravinth_jp_official": "Great!", "__kanishkaa1229": "Mam♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "muditshrimali": "Great.❤❤❤👍👍👍👍", "rangolimitra16": "@old.kb", "miss_peecee": "Slay girl!", "_bookish.wonders_": "Thank you brave girl for putting your thoughts out in such a brilliant way❤ love you for that💕", "ollie0011": "why feminism always start and ends up in the same topic of boobs and vagin???? fed up of these kinds of ladies who always post thr nude pictures on social media with big caption crying for same issues. Why so jealous of boys??? bcoz boys rapes? are u angry bcoz u have a breasts or u r not a boy???? what do u want ? do u wnt to rome naked??? did we boys rome naked??? or u dont want to be raped?? first thing real men dont rape...and second thing real girls dont rome naked like u....and then cry of feminism...over rated topic for publicity gainer and to spoil other girls also", "apuraws": "👍", "himank27": "@amita.b7", "humera_123truly": "Shame on u u guys are disgusting @redheadwayfarer", "cororna_virus_wuhan_wale": "If it's not about bra and panty them take them off and roam around the world", "tanyasharma3": "💙💙💙", "jayshreekalani": "Loved the Caption ✌", "srishti_sharma_": "Every bit of this is so relatable. Mostly we as women get so comfortable with this routine that we almost forget that its not us but them who need to change. Well I do owe a thank you for reminding us that ITS NOT OK. Thank You!", "topaz2676": "@words_painter", "miss_albeli": "👏👏👏👏👏👏👏👏👏 very well said @redheadwayfarer 💕💕", "imsleepingeatingwanderingolwzz": "@niranjan7144", "sonotnulll": "@ssid2 @sharmati_sneha @tarinipancholi @vinita57 one out of you kindly school this woman on feminism and let her know that breasts or genitals aren’t the sole causes for rapes. I have no energy to deal with this ‘fifth’ wave of skewed feminism.", "e.q.u.a.l.i.t.yforall": "Thankyou for explaining this in such a way I never could! ❤️❤️", "0812tanupriya": "🖤🖤🖤", "captain_lobotomy": "It's cause of motherfuckers like you women don't feel safe in this country. Shove your retarded logic where the sun don't shit you dubious piece of trash.", "khoji_gilgamesh": "Thank you for this post👌👍", "amit_singha___07": "U look more masculine then him from back", "vivek.latwal": "A boy also cannot go wearing only pajama and shirt in morning. I.e without under wear. U know what i mean. But it is what it is. U can go without bra anywhere no one will harm you. If u don't care bout embarrassment", "jyotika_taneja": "@redheadwayfarer long long way to go 🌈♥️.", "mr.photowala_ad": "Ata hech ek uralela 😂😂😂", "_bossy_babe_": "@_db.11", "_shivennn": "Sarangeul hettda uriga manna 😙", "gui.ahuja": "salute!", "diksha.kansal": "@shourya.agrawal20", "piyush_ng": "U have put your thoughts Very aptly ...kudos", "aryamanc524": "Thoughts about this post ? @what.on_earth @poetic_chaos_ I personally feel this post, caption included, is such a celebration of the meaning of feminism.", "joy_boruah": "God bless u both love birds amen!!!", "shreesoni_0": "Truly amazing", "pallavi.bahuguna": "I can feel that too!! We are supposed to cover ourself to get out of 4 walls and perhaps we are safe in those 4 walls? Being hostler I'm asked to be dressed properly a many times infact I have paid fine for not wearing the ideological clothes they want me to see in. The problem is they want the shorts to be long and I don't get one thing that is if they are known as shorts they must be short and and not long right? It makes no sense on judging anyone around wearing whatever clothes they want. It's ridiculous for asking anyone to get into some sort of uncomfortable they don't want to get in. Try to stop staring others and mind your business, try not to judge someone on the basis of their dressing, try to be human and be normal or at least act normal!!", "rooh_e_khwabida_": "@hariavruddhi @asmitabansode @peaceful_monk__", "chandakushal": "Please post when ur pooping together like seriously staying in Europe being naked dsnt help feminism at all talking about feminism .. u belongs to India nd in our country we have bigger issues for girls rather dn being naked all the time its ur choice being naked its nothing to do with feminism .. m tell u openly cancel ur trip nd join me on our project where we will visiting poor village families nd explain them dnt marry their girl before 18 .. do whatever u wants to do but showoff u care about girls .. do u think ur being naked going to help those poor street needy girls .. who are getting raped every day for food .. ur nothing but wasted being naked nd talk about feminism ..", "anukshabharat": "You✨✨✨✨✨✨✨✨ more power to you💪💪", "dhw.ani": "Ily :')", "vipu.la": "True true true.. sick men with sick thoughts on the street.", "kashishhmadan": "You go Girl!", "nabilaabid7": "Damn.You inspire me every single day.I love you @redheadwayfarer ❤😩", "hiritikkumar": "I don't think this is the correct way of expressing your thoughts.. Maybe you are right on your place..", "amisha_singh_rathor": "Had hai", "miraculously_amazing_": "❤❤❤❤", "immsalimm": "Why just talk about free the nipple may be lets talk about whole body and why cant girls exposed their whole body kind of from showing their nipples to their vaginas and we all knew that girls have got those and boys have got big dicks so I dont get anything extraordinary in that and may be this gonna help to stop rapes and would set up a much peaceful society and by the way you talking about free the nipples but why have hidden yours .", "sanj_ukta.__": "@bong_badasss i read this in ur stry tht day", "padlayanaresh": "Both auch key tune bete", "dalisha.sll": "Rahul can turn around and click a photo. Why did not you guys do that? Dont get me wrong but if @redheadwayfarer is really standing for equality i think she is just among the insignificant people who fights continuously but progress is slow af,i prefer women who battles silently yet can make the world go woah in awe of their strength instead of making rahul as well turn at the back. Saloni has a lot to learn.", "foxy662": "IF YOU REALLY WANT TO SUPPORT FEMINISM JUST PLEASE POST A PIC OF THE WOMENS WHO ARE REALLY SUFFERING FROM INEQUALITY AND NEEDS HELP INSTEAD OF A NUDE PIC..you need a mental treatment for your sick drama!! Dont use feminism to post a nude pic...how can someone be so dumb that their definition of feminism just roams around female organs! How irrelevant!JUST STOP CRYING AND BRAINWASHING OTHERS TOO!! #thisisnotfeminism", "minudhanraj": "Wow..that is on someother level ...❤u...de guts u showed to put this up ..even though u expected negative criticism...hats off yaar...dis is wat girls should learn from...u inspire a hell lot of people...plzz plzz dnt stop...😍😍", "saxena.anushree": "@redheadwayfarer u not less then mother teressa ...at tge age of 15 i can proudly say i m feminist only bcz of ur daring to open up ur feelings as an indian gurl ...u inspire so many people in my schl nd bcz of u my upbringin thoughts nd stereotypes are also gettin clear i m not insecure anymore ily❤u r an inspiration to me...nd the pepole who ties to bring u down they dont hv a life ..try to break down but u jst don't care u still post nd proud of ur curves nd folds u r Amazing I WANT U 2 KNOW 💕❤❤❤❤❤❤#feminism4life", "snaily.lon": "Wen is this message gonna be really effective !!! So much of objections we go through everyday! Each day for us is a fight we are basically warriors not women! We slay!!", "kritikabedwal": "Much respect ❤❤❤", "flipping_memories": "So true ❤️🔥", "tanishaprasanna_": "This is sooo deep and true", "_solo_traveler_93": "Great thought n very inspirational ✌️", "what_to_do_with_this_life": "👏👏👏🙌", "kaustubhowmick": "Truly powerful lines ✌", "chharry2": "xx", "juhi_sharmaaa": "Go girl❤", "jyotsna__97": "Wow", "rirav": "@vanshu19", "bhaadmeinjayejantaa": "@anotherdoughnut @basundharajana Read this na dude!! 😶😶😶", "_7nvincible": "Wowww.... We are living in such a society where nudity is taken as a inspiration 😂😂😂", "_ishraddhashetty_": "You are best Ma’am❤️", "shivani_2k": "Ppl in the comments section be like \" this is not the kinda feminism I support.\" Toh Mat krna.", "zayncupcake": "Sala har dhandhaaa ho rha h yha pr spcly girls ka evry girl showing us her private part (Boobs mostly)just becuase of fucking likes", "mritikaat17": "Rightly said!!", "anshitakoul": "What does a woman want - To buy bread ( and eggs) without having to wear a fucking bra!! The problem with some of the comments like, \"I support your cause when you talk about this, this and this but how can you say that, that and that?!\" This is the double standard most people live with in for their entire life and then die. People who have the issue with nudity, naked women bodies are part of the problems. \"Saloni, you are free to express your thoughts but why do you have to be naked?!\" Wearing 'proper clothes' is not the norm of homo sapiens you dumb asses. For most of the human history, we have been foragers and invented clothes only to prevent ourselves from the cold temperatures. What you perceive as normal is not technically normal, it's an ideology that has been fed to you which you use to discriminate against people especially women. I am so proud of you @redheadwayfarer for having the courage to speak your mind, love your body, and not let these judgmental, hypocritical, ignorant eyes that use the conjunctions must, can, should for others without putting a thought, bring you down. More power to you girl. You give me hope ♥️🌠", "adarshpunjabi": "I am laughing at these guys comments .. of a husband committing suicide every 9 mins.. n what's the reason .. woman atrocities .?? 😂😂 .. saloni @redheadwayfarer .. but sex and women gender related issue is a very deep rooted problem in our country .. when sex is no longer taboo(particularly for women) in this country then only respect n broader understanding will occur.", "sudhir_shad_mastfakeer": "What to say......??? No comments... God bless you guys...", "happy_soul_000": "So basically you want to roam naked ...", "that_constellation": "I can't love you enough for this ❤", "parikhanuj75": "Who took the photograph?", "soumya_sarita_dubey": "What would you say about men who are being raped? They even do not have breast and vagina..and i will not agree on that India is not safe yes there are some part of India where these incidents happens but there are safe places too and not all men are same there are many good men too like your husband, my father, or many more. I work late night i roam on street at 3-4am i was my self molested but still i never thought India is not safe. I follow you because i like the kind of women you are but i won't agree this time.", "callista_2909": "👏👏👏 proud follower", "_shazarkhan": "are you trying to make india naked🙈", "radhaaboruah": "@shahjadi_rahman @_da.wor_ ♥️", "subu740": "You writes awesome Mam.. 🙌", "manyaaaa___": "A great fan indeed I am. And truly support your words.💙", "_nehakalonia": "❤️🌸", "abhay_koul1": "After this post I think that they should introduce haha reacts to instagram as well. 😍", "sumaiya__islam": "👏👏", "pranit_2899": "👍👍👍👍 totally agree @redheadwayfarer", "aarushi_p": "You are an inspiration 🌹🌹🌹", "pranab_babu": "Feminism for me stands for equality and standing for the liberties and rights for the women. I totally agree that men,not only in India but from across the globe perceive women as their own property. Patriarch was and is still evident in societies of many countries. What needs to be done is every gender whether its male or female should educate their wards and children on how they should treat women,how they should be respected and worshipped because its one of the beautiful creature that God has conceived.", "sancha_sancha": "💛💛💛", "sonali.08": "truth", "amil_zafar": "U should be join gym kuchh zada moti ho", "jhilmil_vashistha": "I wish everyone has this kind of mentality❤️💯 you are blessed🤟🏻", "yashfreddie": "Feminism ke aag me apni roti mat seko @redheadwayfarer", "deabassan": "@rubayat.gill I thought u would like this after all you’re a feminist ❤️", "wounded_wolf9": "Luckky boy", "basumatary111poppy": "The best thing I like about is.... being so very unapologetic about yourself.... half of the time when we go out... we are worried about whether the skirt is too transparent... any bra strap showing..... men looking at your bosom...... all the time.... women's body... what an enigma....", "qwe21rt23": "Please be practical,as she says we should be free to walk toplsess, image a guy in walking with his pant zip open how will you react,? This is not feminism, real feminism is showing your strength in doing something productive and good to society, so before falling in to the false preaching kindly use your brain, imagine if a teacher walks in naked to the class in a school?! According to her it will be why not? It's my choice!!! Nature has certain rules, nothing will be implemented simply,so please don't promote freedom and feminism in the name of nuditidy!!@trolls_official @mtvindia @tv9_gujarati @indians this is effecting teen girls 😐😐😐", "avantigawali": "@redheadwayfarer Your words are so real....And I actually wanted to ask our nation....that are we really independent...I mean we are still depend on what will people think...people say....I know its been our culture...Men oriented...But guys...Its 2018...It really a high time to change... I mean women are raped...but why the f**k is only the women responsible....rape needs 2 people...why only one is responsible...Why girls have to suffer as if they had invited that person to rape... I mean seriously....Are we really Independent?", "khushijulka.poetry": "I.couldn't agree anymore 🙏🙏🙌🙌🙌", "hindianguy": "@qwe21rt23 blah blah blah. The irony that there is a guy dressed up exactly same next to her, went unnoticed by you. If nature meant for us to wear clothes, we would have been born with a three piece suit", "vinniiitttaaa": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "____harshal____": "Btw who clicked this 🤔?", "md_shamsher_alam1987": "This is not feminism", "shreya_1693": "This is wow", "its_san_j": "Well said @redheadwayfarer 👏", "clueless_queen_19": "I respect what she says on her post yes from 6month baby toh 60 yrs old women no one is save we all know but @archanamottoo you dont have any right to say \"shitty\" to anyone actually no one becoz were we live is Democratic country from what we think to what we wear it all about our choice yeah uh might can give ur opinion but the way ur giving it.. it shows how much disciplined ur n we are indians we surely wants change n it will surely takes tym too we growing day by day India is also @archanamottoo ur Indian or not I don't know but shitty pplz doesn't exist here we also know everything about women's protection n freedom which we do support but uh know India main rituals believes faith and pride jaisi cheezan bhi manni jaati jisse India as India jaana jatay apart from this rape growth so plz don't blame India alone India k barre main jab log sune toh unhe fakr ho na ki darr yaha kisi ne rape ki khoj nai ki thi so don't mention like that be initiative to change it not to spoil it...", "saltybuttercup": "This is just perfectly summed up 👏 *respect*", "therehanansari": "sach keh gaye ❤️", "jacksparrow.persia": "Shameless", "sapiosexual_96": "@raj_esh__", "spicy_poison69": "😍😍😍👌👌👌👏👏👏👏", "lickable6": "Apni maa chuda behn ki lodi.... Nangi ghumne lag ja kisi ko koi fark nahi padta .. India agar unsafe hai to mat reh India me ..... 2 kodi ki aukat nhi hai tum logo ki bahar ki countries me.... Kitni bhi unki tarah banne ki koshish kar lo lekin tum jaise rahenge gandi nali ke keede hi.", "voguechurn": "Take a sip everytime a person foolishly decides to miss the point and searches for something wrong in it only to go off topic just to judge her own freaking personal choices again.", "karuna_sharma_": "😂😂😂", "doc_onwheels": "I always find the conservatives lacking in intellect. True in every country out there.", "riyasxngh": "More power to you beautiful 💕", "sandeep.9t2": "Awesome", "sanjana_020596": "Wooowwwwwwww...... Well said ma'am.... M a big fan of Ur writings , thoughts ... U r an inspiration... @redheadwayfarer ❤❤", "_singh_aditya": "Funnily enough, it's the girls who are taking an offence and the guys simply enjoying the view. 😂", "kashyap.sneha4": "I don't think so.. Cos her followers are increasing day by day..", "smile_risorius": "💯", "koffeecrazymommy": "@redheadwayfarer I totally admire what you are doing! Continue what you are doing unabated sans fears of being judged or misunderstood! Lots of jobless people in cyberspace to judge and put you in a virtual box! Do what you think sets you free...And yes, I love your travelogues. Do continue writing.", "aparnna_vp": "💕", "archiesjoshi": "@redheadwayfarer plzz start from yourself don't wear anything n go to shop to buy whatever u want.. So that ppl will learn something from you.. Y tomorrow y not today or right now.. You just do it.. Don't post just let's start from you... To change something need to come on road .. Social media is just nothing only your followers will knows..", "aayushi_saxena": "Beautiful picture ❤️", "youandmeoncycle_0726": "What to say you desrve lot of respect sorry you are worth of and still some fucking animals will comment upon this some bullshit because they may be feeling the same after seeing this pic but di really women who is underconfident in herself wil be much motivated only by seeing your posts really hats off to you and i really idolise you❤❤❤", "kratikamazde": "Couldn't have been more precise!👍", "babul4059": "Puri dunia dekho ghumo phiro phir aaram se baith ke India Ko criticism karo bahut badiya", "saxenaakshay": "Respect 👌👍 It can't be more precise 😊", "sana_salim_": "Preach!", "pi_day_pisces": "@redheadwayfarer there are people like @ipoonampandey who objectify their body and hundreds of men comment with lust and she enjoys it.Feminism isn't just 'educating the men'..It's 'educating the women' not to encourage lust and objectify their own body.", "ashbhatt0508": "Awesome You’re. Love it and You Are right we fill it what man can’t understand.", "_an_alexithymia_": "amazing 🙏🙏🙏🙏🙌🙌🙌", "amit_ahlawat_9": "👍", "masoommanjrot": "It’s you and your life. You are free to do any fucking thing. If you feel like going topless then just go, if you want to wear burkha ( it covers whole body) then go for it. Nobody should give a fuck about your wish but you know what, they do give fucks about you and especially about what you wear. As I have seen, it’s difficult for girls to accept their wishes that they can do anything. They are scared about society. Society doesn’t have a face so please stop navigating it. There are so many things to speak but it’s not always possible to make people understand because no matter what they are going to do the best when it comes to opposing. @redheadwayfarer I LOVE YOU. I wish I could meet you. Thank you for this.", "supertramp_baba": "@sona20811", "subrat.raj9": "👏👏👏👏", "the_fit_maratha": "Another one and an. Amazing one", "sandhya.shrma": "👏👏👏👏", "iam_rahul_rv": "Kaash Tere Maa Baap Uss din jaldi so jate.... To aaj ye feminism ki brand ambassador na bani firti.... Baat hi krni ho to womens ki kayi problems h, Unke solution k bare me baat kro na... Lekin tum to feminist ho, kisi ki baat kya sunogi😑", "_dikshanaik": "🙌🙌🙌", "the_august_buoy": "Jinko undergarments pehnna h woh pehnei,Aur jinko nhin woh na pehnei.. #what_is_the_big_deal 😁 ... Ainwayy sblog jhgra kr rhei ho... @redheadwayfarer", "psyche_wolf": "Again....who will explain old generation about thisssss😩😩", "yasnasehgal": "Has no one here heard of putting up a timer to take a picture? And why does everyone think that she is putting down our country? How can you guys judge one person based on just ONE POST.", "dr_with_a_good_handwriting": "Accurate.", "heart_speakes": "Love you @redheadwayfarer", "vaishakh_chandekar_photography": "True!!👍", "simy.mariyam": "@redheadwayfarer you're the best ma'am❤", "muskan_sengar_13": "Totally agreed....#feminism", "diva063": "May I ask what she has done for woman empowerment except posting photos and videos?", "parmitachoudary": "👏🏼👏🏼", "victori.ah": "@sonali.d 🙌🏼", "j.bamrah": "if whole world start wearing no clothes on body, then everyone getting used to .nobodies stare at anyone, no need a money to buy clothes.", "sabu.bb": "Well said🙏🙏🤚🤚", "la.loba.herbalism": "Yesss preach sister xx", "roby_786": "This couple want to expose themselves so they are justifying their act by giving such a ridiculous big fake social message... One thing which differentiate us as humans from animals are clothes... Feminism does not mean only about bra and panty like u have made with ur every posts which u literally shove inside every decent girls mind out there & brainwash them... Girls wear bra not coz of any ridiculous reason which u have given.. They wear bra coz it makes breasts firm & it avoids going saggy & it's medically proven... FYI all men ogle at woman's breasts not coz they are lecherous or want to rape... A woman's breasts are sexual arousal for men like six pack abs or built up muscles are for women... Even u & ur boyfriend are not exceptions.. He also might stare at a passingby woman with good breasts or u might stare a muscular shirtless man... That does not make u a rapist... And if u are not proud of being an Indian then u should probably leave this country and settle in a safest country... We men don't always look down on women.. Even woman look down on another woman... A Woman always Slut shame another woman when she does not get enough attention from men like the other woman.. Don't gender bias on this issue... @redheadwayfarer", "bhanu1731": "This caption is so perfect", "samprity99": "Love ur thoughts.. #inspiration💙", "dsa_roch": "Awesome👏 @redheadwayfarer killed it", "pavintheran3795": "So sxey", "divya_dhiman18": "I still don't understand why those who disagree with her, waste time commenting on the posts, just live your life the way you want to, let her be. ✌️", "nimishanayak_23": "❤❤❤❤❤", "sonali.d": "@victori.ah", "guhanishtha24": "Caption! 💖", "dhanyakuzhuvelil": "I just love you......hope this words changes the mentality of atleast 1.", "kshumit_malla": "Bc, Google kar aur dekh ki India se bhi bohat unsafe country hai duniya main, Lekin Tum ko beijjati sirf India ki hee karni hoti hai, Tumeh toh khud ko Indian bolne Main bhi sharam aati hai.. Kyunki Tum khud ko firangi samajhti ho.. Bc Beach Main nanga ghumna ya sadko Main nanga ghumna kya yahi feminism hai.. Agar haan.. toh Tum India se bahar hee raho.. Tum jaiso ke liye India sach main safe nahi.. Aur haan mera Bharat mahan n i Proud to be An Indian..", "thbalb": "Love you", "raghav_dhanvinder": "🙌👏👏👏👏 awesome write", "annu21014": "That did make sense ! Guyz read it ! Dont judge her on the basis of the picture !", "sana.kochar": "So glad to have read this but then saw few comments from people who still don't get what being free is all about 🙄 what's a level below dummies?", "ishoiab7": "Agree", "soumyacs13": "If ppl start thinking like you, it's a great n will b big change in India... I truly appreciate ur opinion. One more thing is even if that change comes, ppl r not ready to be that way coz we r used to cultures, of being that way. It will take time and more than focusing on these, we r used to listening to others, we are still the same, even if we don't want to care about others, we WILL care abt wat others r thinking abt us.(Positive or negative) We may b free, wearing a dress with or without a bra outside our country, outside our city but not in the place where we know ppl around us. As I said, we do care abt others opinions. We are scared of their harsh judgments. We r raised that way in this country. If something changes for good, it will be GREAT!👍 @redheadwayfarer", "_soutrik18_": "@redheadwayfarer Really am impressed by reading Ur this post", "aastha_prakash197": "This is on point. We need more people like you ❤", "drunkandspill": "You are amazing man, every god damn time you blow the minds of people with every single word of yours. And i love your words so much and so in love with everything 😍😍", "pran_zo": "#Nustarespect🙏🏼😊", "hajrazaf": "So I had surgery recently and before leaving the hospital I had to change out of the hospital clothes and into my own shirt and pants . I felt so weak and barely had the energy to put on clothes , but you know what I was worried about ? If I don’t wear a tanktop under the his shirt maybe it’ll be too transparent. If I don’t wear a bra under it maybe I’ll look to indecent . I guy would just put on a t shirt ( or not) and leave . I have to worry abt my ‘already covered body ‘ and decide if it’s ‘covered enough ‘ how many more layers do I need to add before I am certain that any slight unexposed part of my body might turn someone on and make me look ‘ indecent ‘ . This is an everyday struggle for all women . Thanks for sharing your thoughts so clearly and unapologetically. And what an amazing man you have by your side who understands and supports you.", "thetravellingshrine": "Rape is about a power imbalance. Rape is about control. If women and girls were truely respected and equal, rape would rarely happen. We all must work for a better world. Women should be able to walk down the street without fearing rape, like most men do. We need men to use their privilege to speak up for the rights of women, not to shame them more when something happens.", "pawar_anisha": "mam I truly support u", "iamsoumikdas": "I agree with each and every point u said, but 1 illogical thing u said is that- Porn is only for men, and looked down upon by men. I guess Porn is watched by both men and women. Correct me if I am wrong.", "cumen_sequer": "To all such feminists..... Suck my cock!", "siddharth.roy": "In ur opinion feminism means staying in a hotel...having sex wth partner...next morning posting it on insta wth a bunch of shitty writings.....as expected frm u", "ab_shooter": "Saloni.... I have been supportive of your cause when you spoke fearlessly about women safety, choices they make, their aspirations, their ideology and much more. Okay, it is nobody’s business to decide what to wear and what not? But the only thing that is getting in plethora is this unwanted nudity. No, seriously, I mean why do you have to exaggerate everything with yourself posing microscopic outfits each time. Now, you will say it’s your choice, but dear, we are humans and not any other creatures. If you don’t follow basic things like wearing something proper (I don’t mean encased), it wont really help either to convey what you really want.", "_high.voltage": "❤️", "trinz.xo": "/bow goddess.. apt thots and words... best portrayal of the reality..", "prashanshaaa": "❤💯", "sun96d": "On fleek 💕💐", "_ang_el_ica_2309": "Appreciated ❤", "sunny___5280.insta": "👍👍👍👍👍", "s_a_m_i_rrr": "High on weed 😁", "joyhimanshu": "Kuch kahenge aap @gajodharsinghcool", "sorryraghu31": "Wish u turn this side and pose", "_geek_o_trek._": "Sadly , our society starts at home & they won't be listening !!!! Getting me??", "na.e.mo": "@paradoxical__mess", "kumamaneesh": "Well., you are free to wear whatever you like. But the long lecture shows ur insecurities", "thesarahdoughty": "Hells yes.", "swari_verma": "More power to you girl❤️", "dudenitx": "My God that was gross but true. .... and yes India is unsafe thanks to the social boundaries. . An open minded society is need of hour so that men there are not that in dire need of ... laws need be tightened to make women safe on streets. .. laws need to change", "abhisheknana": "Is that hotel waiter clicked that pic 🤣🤣🤣🤣", "vs.writes": "This comment thread is so ridiculous. \"Free the nipple\" in no way depicts \"Go topless and walk naked along the street\" It's only to clarify the misconception that people have made in the back of their minds that \"rape\"/\"sexual assault\" happens because of woman wearing less clothes- if a hint of her cleavage is visible, if her thighs are visible. NO. It happens despite everything and hence woman empowerment and feminism is necessary. Try to comprehend that instead of telling someone what they should wear and how they should wear what they choose to wear, women and men both need to accept this mere fact that it's THEIR CHOICE and you should respect it.", "discovering_artofliving": "@redheadwayfarer you're are an inspiration❤", "the_erratic": "Couldnt hv been potrayed better. 👍", "peachu_x8x": "@dey_kingle read this😁", "basabee59": "@emma.wooods.01", "rushika_gajway": "❤️❤️✨", "rojabaiju": "You are a true inspiration. Woah that was something it just hit my head so hard. We need more ppls like you. Hats off!", "rahulllllll786": "Exactly you⬇️❤️😎", "rashmi_singh_kuntia": "I just love what you write...🤗", "lamataj": "This is fire🔥🔥🔥🔥🔥🔥🔥", "ms.hazarika": "this is not feminism, this is shit.", "debanjanab": "Damn! those words ❤!! You are ❤", "okerinagogoi": "Srry ..it's my personal opinion ..faminism doesn't stand for this @redheadwayfarer", "rupama_roy": "Ohhhh God...save me..Why altime this BRA & PANTY post..there remains nothing left to discuss?? Do u think, Nudity & some fucking sentences would work for feminism?? Holidaying with boyfriend & showing bra panty,cozy pics,is that what we will learn her voice for see so called feminism??", "daisytales_": "its so beautiful that even a woman cannot resist looking at her and praising her for that matter. its not because of what you are wearing that rape occurs and you know it. you've said it yourself that its because we have a vagina and a pair of nice breasts.", "a.n.a.n.y.a.07": "❤💫", "theunreadshelfies": "God. I can't believe that I have to actually fucking ask for my rights when they should be mine! You go girl @redheadwayfarer", "love_stuff__": "Well said", "rishabh_philosophy": "Y click kaun kiya...?😂", "purusharshva": "@panwarpvt @shreyae_ @roshnii_sharmaa", "mohit.verma.3914": "I can see two men's 😄", "jagdambasonii": "@jahnavi_3101 caption .", "natkhat.neeharika": "@bagalpreeti This post is so ❤... i refuse to be scared everyday and worrg about someone else s sexual desire! Out of all those moments whe i got senti and cried and smiled these days.. this is by far the most emotional moment.. i dont know if saloni would read it.. but i feel i should still comment here.. for how strong and inspiring her words are and what she is doing is just great!😊❤", "manognaa.s": "Good lord. The world needs more like you ❤️❤️❤️❤️", "rociaferns": "By definition it means equality. No individual here gets to modify what this equality must be in terms of. It must be equality in everything. For anyone who chooses to look at equality too in a biased fashion, they don't deserve a seconds attention as they contradict the very essence of the word equality. Thank you @redheadwayfarer for breaking it down for lesser minds who chose to be bias while even grasping the concept of Feminism.", "mausambaruah": "You look more stronger than your bae..👍👍👍", "ishi.grover": "Exquisite ❤", "youonlylove__4": "Respect👏 with your thoughts", "sanjay.harsora": "Lol showing back 🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂 And talk about gender equality. 👍", "sayakisgaming": "what you wrote is really great. magar yaar ek baat batao... aapko itne sahi time pe photo kheechne waale kaha milte hai.", "aamit_ig": "Ghapa ghap!!", "_pallabi_saikia_": "This post is just lit😍, I love you yr @redheadwayfarer ! You keep inspiring & teaching me important lessons everyday♥. I really really respect you from the core of my heart & seriously wish all girl were like you- kind hearted & someone who speaks her heart out & is not at all afraid of anyone or anything. Girl you got my heart😘😘😘", "radha_bagi": "Look at this @pallavi_malagar @its_soniya_r", "akankshashettyy": "Woah well said @redheadwayfarer", "motwanimeghna21": "India is the most 'unsafe' country for Women. And I feel ashamed. Well Instead It should be 'Indian mentality' that is the most unsafe for women. Oh and Of course Happy Independence Day ! Well truly we'll be Independent when We r not asked to hide our bodies because there is a risk of being raped!", "c.u.p.i.d": "Who clicked this pic?🙄🤔", "ashmita_singh19": "The caption hit me hard❤", "ayushi_3feb": "Inspiration she is 🌸", "theimperfectmisfit": "I love you! Don't let these haters get you down! You are a breath of fresh air😍 Keep this up, you are an inspiration for many 😍", "sonic_boom98": "Rape happens in a nation like USA too..... Don't just blame our country for some of those Bloody fukn rapists...... and stop this Feminism crap for now.....", "itme_mola": "This is by far the most logical explanation I have ever heard. @redheadwayfarer Thanks a tonne for this one. Honestly :)", "nakulsshout": "@archanamattoo FYI US is at no 1 spot and following that comes Sweden and South Africa so please refrain using Indians.", "iamlonewolff": "😂😂", "hafsa_hameed1999": "Acording to u kpre na phnnne se lrki feminsim hta ha bht ajeeb soch h...mam vulgarity or feminism m frk hta h.... Jis tra k ap y pic upload kr rhi hain hain its loking so shamefull girls should stand for their rights not for equality to boys.....u thinking about feminism is so shit today i realized this..i never sad anything bad about u but it dsnt mean ur thinking is true....u r totly wrong at this point....apki tw wo soch h k lrki kisi k samne naked b chli jaye tw phr b mardo ko kha jaye k ankh ku utha kr dkha phle apna tw dkhoo...qudrat s nai lr skti ap qudrt n mard ko aik qadam agy rkha h lkn iska mtlb y nhi aurt ko uske haq n diye jayen sb haq milen aurto ko mgr y brabri k chkr m aj kl k so called modern idiot log vulgarity moral values shrm lehaz m frk bhul chuke hain..itni lmbi captions dne s apki thinking shi ni ho jti..this te totaly disagree like bht ghtiya soch lg rhi😐", "rohitverma1993": "Your definition of Rape is sooooo wrong. Hope your definition of feminism was exactly what it is- Equality", "prajesh_bhushan": "And the pic is relevant to the \"caption lecture\" how ? A \"living life\" \"feeling loved\" would've sufficed 😂😂😂😂 .. you're not an activist my friend . Quit trying too hard .", "kshitij_wizardiam73": "Jo chaho jese chaho pehno apki marzi apko comfortable hons chahye bs", "ruhamita.banerjee": "@kartikeya.mittal.km", "devlanikajal": "The special treatment given to women's body is a problem . It's not about all women should go topless , it's about her choice and if someone doesn't like it then ignore it. We don't keep correcting every thing we dislike because we know everyone has the right to live their life they want. And if a women wants to wear something or not to wear it's her right. And no one should try to take that away from her.", "priyam_ponkhi": "Why do you always raise these important topics making body the only vehicle for your thoughts? Who says feminism is about bras and panties? @redheadwayfarer", "kavyasinghhhhhh": "@redheadwayfarer Women like you have made feminism all about nudity. From demanding equal rights to roaming all nude while buying eggs on the streets? That escalated quickly.", "dhakne_palak": "Thoughts 😍🙌👏🔥", "prakharsharma._": "Yes. nice question..😁😁 threesome", "shruti_badjatya": "Insane post....", "shindemanvi_13": "Lovely", "ankitaagnihotrilove": "Bitter truth 🙌", "mitalsojitra14": "👍🏻👍🏻👍🏻👍🏻", "fovea_of_the_whole_world": "Yesssss 👏🏽👏🏽👏🏽🙏🙏🙏🙏", "tordbleach_": "🙏🏻🙏🏻👏🙌", "tejaswani_singh": "What a lovely post 💖 kuddos to your thoughts 👏", "hema.p.gupta": "Well said, hope every couple should be like you both.. we girls want safety in our country. You inspire us ♥️", "hoax_slayer": "Some Facts As per the Rape statics India is 4th in terms of rape After US, South Africa, Sweden 🙄 Some so called influencers are hell bent on spreading wrong information about their own country. SAD", "alka____yadav": "❤❤❤", "hima_khunt": "👍👍😐😐", "deeksha_singh24": "@rituparikh Read this!", "sudanvish27": "You just have one topic and i cudnt understand the connection of your picture with your message..message cud have been said with some other decent pic..rest ur life ur wish..cheers!!", "123drmgirl": "@redheadwayfarer nice what ever uh write ..... uh think....n u want to tell all guz... but i thought about it.. u r educated n know english very well.. but not everyone catch it.. so yuh should try to spreads ur thoghts or any thing in hindi if uh know... becz uneducated not undrstnd ur point but they only focus on your pictur not wht uh want to say.... nd also mently illritrd pepl around world...", "_pinku_11": "Feelz !", "ajju2": "I think this might be her only post i agree 100% with _/\\_", "naman__suthar": "Well said 👏👏👏", "_akantaaaaa___": "Trueeeee!! Much love to you both ♥♥🤗", "m.plus.t": "@redheadwayfarer is not a feminist, she is an attention seeker. Want to know the difference between a feminist and an attention seeking blogger. Check this account @malalafund @malala this is what feminism is about. Empowering women through education, sports etc.", "snehithjain": "@redheadwayfarer I wonder how much could a person type for a post when he/she is on a holiday !!", "nishaupdates": "Very well said", "im_marcydearaujo": "♥♥ nice one", "charmingly10": "I need this on a book", "i_am_wani005": "bohot bakwas ho gyi india is unsafe india is unsafe !!!!aap kuch cases ke chakkar me india ko unsafe bolne lag jaate ho.", "dimpledalal19": "Wow! U wonderfully put into words what girls go through on a daily basis!!", "pradnyanikam204": "Great....i love this message mam.", "tani1524": "Wonderfully expressed. Lady!", "nishhhhanonmous": "🌈", "salmankhan2494": "Bhaauut bar bol chuki ho bhenji bas karo ..aur kapde pehnlo", "shobhit_srivastava24": "Appreciable!! Respect!!", "akankshamane4": "@redheadwayfarer inspiration .. I agree for what you wrote. But I personally don't lyk India part ..I don't think India is 10th most dangerous country for women's..@shreyabagde19", "_s_why": "@geetanjali_kalta @vidushi.chhabra @mansi.1311 @pranati_97 @shriyaa09 Objectification.", "kramamo2_krish": "Lovely true I like this note..", "__aditi__92": "🙌👏i luv this women so much❤@redheadwayfarer", "ashish_sajetiya": "Jo log..... Aapke vichaaro k khilaaf soch rakhte hainaa.... Unhe shayd itni english bhi nhi aati aur shayad aapko follow bhi nhi krte....... Aur ho sktaa jinko. .. t-shirt k andar bra chahiye wo insta bhi naa chlaaate ho...., Toh aapka toh sab bekaar gayaa ye sab..... 😐😐😐 Feminism achhi baat hai.... Lekin dikhaavaa madam ji kaafi galat hai......", "swapnilppatil": "Wow. Time to unfollow", "urv9i": "@__felixculpa__ THAT FREAKING CAPTION!", "irahull": "The only Indian woman encouraging this trend 🙌🏻🙌🏻🙏🏻. #respect #gofearless", "hardikprajapat": "I think u should stop being in a bad. company @redheadwayfarer ....because...its goos u are apreasding awareness and...serving it good.but even on the Day , Independence Day instead of ...praising the major .good..deeds which marked the freedom ...for all....i.e. the bravery , the sacrifices of our soldiers..., u just moaning about the defects..our Country have.. I mean not even u are totally flawless. Then how could u expect from a nation to be...it wll take tym...to be prfct ......And...lastly..if u dont like My nation.., then dont disrespect it either!😕😑😐", "nushykagram": "Abe kabhi to kapde pehen lia kar", "sheetalgarg_": "U r an inspiration mam 🙆🙆", "connectonnet15": "I guess.. U right out ur thoughts perfectly. N ur msg also delivers its purpose correctly.", "mirza_baig_": "@viquar.ahmed16", "anshika.15": "🔥🔥loved the way you wrote it...applauded 👏🏻👏🏻👏🏻", "aggarwal.14": "@redheadwayfarer well said 😊", "therealashishtripathy": "Aeia dekhibaku bakithila @rk.rahulkaran @spandan_kumar_das 🤣🤣", "sonalv3": "Hats off saloni. This is by far the most sought out answer to what actually the isse is and not what we create!", "sshrutiisharma": "@redheadwayfarer you're an inspiration. Happy independence day 🎈", "sanjhim": "@shashank_gargg", "raina.not.petkoff": "This should be made into a book. ❤", "prerna_ajwani": "Thank you @redheadwayfarer for saying out loud what a lot of girls want Them to know. Sadly, most wont even know it’s meant for them.", "panchhi_perspective": "Damn. THIS. ❤❤❤❤❤", "vichitranaaari": "This lighted up my day @redheadwayfarer . Thank you so much!😭😍😍", "er_rakesh_parmar49": "Wow.. Stunning Look", "_ethereal_soul_": "This made me cry ... You took my heart girl @redheadwayfarer success comes after you choose to live comfortably in your own skin rather than being eyed in \"whatever\" you wear be it kurta or bikini. Applause for this👏", "sugarboxoxo": "@redheadwayfarer I really wanna question you that how on earth do you think that your insta feed is making any difference towards what issues you have listed.. I feel you have defeated the very purpose of raising a voice.. you need to retrospect your ideas and believes before you put them out so blatantly since you carry the tag and responsibility of social media influencer, don't misguide the youth considering you are lost yourself", "bechain.aatma": "U write so much on freethenipples why don't u just free Ur nipples and set example for all who follow u.much love n more power to u.", "pinkman.15": "@redheadwayfarer Porn only for men? I guess many of your girl followers won't follow you on that..", "_baarishh_": "@redheadwayfarer you never fail to inspire me. Iloveyou ❤❤", "harshita_adinath": "Hats off to the strongest woman I know...🇮🇳 Jai hindi 😊 lots of love to you 🤗 ❤😘", "_hermessylife_": "Love ,support and respect ♥️", "vikrammehta934": "Boom boom", "meera__chauhan": "✨♥️♥️♥️♥️🙂😌", "zain.rabi.39": "cute pic og 2 shirtless guys on balcony", "ishitachakmaai": "💖❤️❤️", "meesha_hasan": "More power to u👍", "dambatra": "Thank you so much for existing! True inspiration for all the ladies! Sadly, many will take it the other way round, but THANK YOU for putting this out there still! From women all around!❤️Slayer forever! You go girl! Love you so much 💋@redheadwayfarer", "distortingimbecile": "👏👏👏 Salute!", "prrrriyyyuu.123": "You are my fav. Girl♥.", "namankhatri_": "The biggest sex business of porn & prostitution, both for men? 😂 Even women watch porn and use escort services. 😂", "suryadeepkhungar": "Trust me I'm lazy af. But every time you post something, i go on to read the entire caption no matter how long it is. Why? Because every single time you inspire me and several others. The fight is hard ik, but keep up the good work.💜", "billi_aankhon_wali": "Yaaassss girll!!🙌🙌👏👏👏👏", "beingprad_human": "Wooww!! 🤗🤗🤗", "____stormborn___": "Love @redheadwayfarer 💟", "mr.vakil": "Agreed. But when u talk about rape happens only bcs of vagina, vast sex transgender lefts out, not only that lots of children who have been sexually abused left out even male, and that Goat (Which was raped by 8 men) left out. Feminism is deeper that bra and panty. And It's more than men and women.", "twisha_1210": "🙌🏻😻", "k_v_aravind": "You would have written a literature or a book on this post", "imnishadesai": "You're standing up for everything thankss you're brave", "jazzshemurr": "Dude...you are Awesome 🤗😘", "___bhavana.____": "Caption hit hard...", "ayushahujaa": "The people who are applauding her would be the same people to curse her the day she posts a completely naked picture of herself. 😂", "the_wounded_lioness": "More power to uh girl..u r amazing..u r an true inspiration 😘😘😘", "_jaaanvi__": "Best thing one could ever read 💯", "hetu5656": "Perfect written", "__miss_shreya_": "Just luvd the caption 😍😘", "saiiichavan": "♥️", "udit._.dahima": "@haritdagar do read the caption 🔥", "arshia_gill": "You are amazing....I love what you write and stand for ...... inspires me every time I read your posts", "ichembilath": "More power to you! 💓", "lifeinmesssssss": "@thetaurean_devil", "theblueumbrellagirl": "I wonder who clicked this...", "sensual_swoon": "👏👏👏👏👏👏👏", "unapologeticallytete": "Saloni di, I don't know whether you will read this or not. But I want you to know that I am so thankful that you exist. I am thankful for the way you live your life, clothed or naked. You are beautiful, body, mind, and soul. And I am thankful that you voice your opinions and charge into every challenge fiercely. Everyone wants to talk about the problem and how to fix it. No one talks about the root of the problem. It's the root that has to be destroyed and that is what you talk about. You about things that matter. You aren't afraid to share your happiness with the world, neither those little things that make you uncomfortable. I know it's the cruelty that always stands out amidst all the love. But I hope none of the hate you get ever breaks you out because I'm pretty sure you are saving lives with these words that let several women know that they aren't alone. You are my one true Indian role model. Much love! ❤️❤️❤️", "pdutta1978": "may the invisible force that we call \"God\" bless you... why when men can roam topless everywhere women can't? just because they are \"made\" to feed..to entertain? well it's my damn body.. I'll do what i wish", "yuvi_mewara13": "Pehle jaao apne maa baap bhai K samne kapde utaro agr unko acha lage To hum bhi kar denge lol", "ankkitaaa": "*POURING ALL OF MY LOVE HERE* ♥️", "shivanidhasmana": "You rock", "sapna_tiwarii": "And this is savage!!!", "madhumita.chaudhary": "To the point", "spandannshukla": "Wow!", "gossips_and_giggles": "Beautiful! ❤", "atifgardazi": "You are promoting rape culture actually.", "nehakarnatak21": "Your captions are actually good. But I don't understand why you take feminism to any other way!? I mean showing your body, your boobs, your nipples is not a solution. Your questions are at a point. But the way you describe your solution. I am sorry. It doesn't make any sense!! You are taking the word feminism to other way! Many of my friends had stopped following you. And the reason is. Your defination about a strong woman is very different! Walking without clothes, showing vagina, nipple, or what you want as a solution? What if a boy walks around holding his penis? Wouldn't you look at him? And that look doesn't mean you want to rape him! I literally have even stopped reading your long captions which are taking a definition of a WOMAN, SOCIETY and yes SOLUTION to a different direction! I don't want to go outside without clothes. Because it's my choice! And i even think no one wants to go like this.! What about a small baby girl. They don't have any grown nipples or breast! Then why they are raped? Please first of all you need to change your defination about rapes and yes need to change these solutions too!", "perks.of.being.tisha": "Doing such a great job....you're an inspiration for all i love u so much 🖤🖤🖤", "shataakshiii": "@topno_ami", "lavi.kirti": "@lavish21187 i wish we could do this", "nishthaaa02": "Besharam 😂", "varshavatsal": "@shubham.sharma1031", "____faith________": "@misbahsirajuddin", "_alwayzbeyou": "Itta lamba chaura post and ppl are still concerned about only 'her' being naked.. Why not making a fuss about the guy who is also in only an underwear ???", "the_stellar16": "👌🔥", "shravan_venkatesh": "Fuck the feminism I'm jus here for the porn 😂😂", "1ekshmi": "@arun_v_senan", "tanisha_sharma47": "Everybody show there mentality here", "rakshahaha_": "Caption❤", "_flawless_soul_": "@mackroise read this na", "khushxxi": "You're doing a great job @redheadwayfarer 🤗🤗🤗🤗", "amity.beats": "Lovely ❤️💞", "aishwaryachauhan": "What you wrote is just 👌🏻👌🏻 feeling short of words", "___thatsunshinegirl___": "Ultimately we need more people to think and be like you 👏 kudos ❤", "p.anisha1108": "Feminism, because we still have to explain this!", "priyaudoshi22": "Damn your Caption 💯", "ankit.singh999": "back so sweet 😍😋😋😋", "ankitabanik__": "Nailed it.", "itsrenikagosain": "Mam im big fan of ur ❤ seriously love u . Apki har pic bhot achii hai. Respectful h . U are doing right thing mam ... but my question is from these post n caption how u change the world how u can stop discrimination between boys n girls . Yes we are living in 21st century still sbki soch choti h . Go to rajasthan n stop child marriage . Go n visit our small village in our india . Where girls are not able to educate . Feminist af .seriously u r living ur confertable life , u r geting equality from ur parents ur brother but think about those girls who are not able to get these things which u have so fight for girls not with ur post coz in sb se kuch nhi mam . Change ur india by your own decisions not post . Ty ❤ btw happy journey come india soon ❤🌸", "snazztastic": "That booty tho", "aditikakkarrrrrr": "👍👌👌 you are inspiration", "nisha_onnly": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "mohd_nasirrrr": "🙈🙈", "prernajagetiya": "Well said ❤❤❤", "nishitaa._x": "This is incredible ❤️", "___saloni___": "You're making world a better place Saloni! Oceans of strength to you!", "yruchi__": "❤️❤️❤️", "guneetmonga\nVerified": "Verified", "malikkkkzehnaa": "watever u say but u have to wear a bra whatsoever otherwise ur boobs are going to act like jumping jacks atleast for ur own comfrt u have to wear it🤷🏻‍♀️🤷🏻‍♀️", "moheeeni": "Woah dis is beyond words!!u just shut d fucking mouths of d peoples who say feminism is shit....hell ya v need feminism or feminist lyk u very badly especially in a country like india....nd also dis pic is adorable❤", "elixir13__": "💝😻😻♥️♥️ I'm so so so so proud of you because you inspire me so much", "vanditasaluja": "Amazing!💯💯💯💯💯💯", "reyrohan_97": "You are aaamazing ❤", "whatanjaligottado": "Woahh👏👏👏👏", "apurva1001": "Oh my god. I haven't heard anything more apt than this. Love and Respect☺", "aditi_harde": "🙏🏻😭", "the_sassy_box": "\"While my own desires make me a whore\"...such a strong and meaningful sentence, this one sentence says the whole story💎More power to you women.", "_.childish__bae._": "Really ma'am 💞 you are a inspiration to all the girls 💞", "shantanuspeak": "The legends", "itsporus4content": "So well said! Am sharing this! Love the way you freely express your thoughts, and call a spade, a spade.", "parikhriya99": "❤️❤️", "rawat.sahab": "👏👏", "nischayyyy": "Wow!", "rr.__.t": "Sigh. I am from South Africa and we have higher rape rate than India and trust me women don’t walk around in modest clothes here, neither do they in the US which is no.1 with regards to rape. So, yes, free the nipple for equality but don’t mix clothes with rape because men rape women in burkha just as often as they rape in women in bikinis and even babies in diapers. Studies show that men usually rape because they’ve a subconscious sense of entitlement when it comes to women, not because of what women wear but because they are brought up to think women are lesser than them. Hence, when we talk about feminism, we talk about equality on a cerebral level. Equality in the workplace, discrimination against pregnant women in the workplace, depravity of education to girls in rural places, limiting women only to the kitchen, etc - these are other aspects of feminism and I never see you talk about. It’s always about wearing the same things as men, but maybe if women were educated more and were exposed to just as better job opportunities, men would then finally consider us equals and not something below them that they can simply force their dicks in.", "nada_nada_yada": "@redheadwayfarer you're words are echoing in my ears right now, just what I wanted to hear today. Thank you 😘", "ank_ana_": "Happy Independence Day to us", "barelyswati": "You deserve a round of applause for this 🖤", "thisisdharana": "Y E S SO T R U E Y E S.", "dhwaneeprithiani": "I fucking love this caption ❤️!! Thankyou so much for bringing this out so beautifully!! You deserve a lot more ! This is such a beautiful concept. I’m really really proud of you! ❤️ Love you so much ❤️", "chitrasinghgaharwar": "Caption❤", "stutygupta": "Hats off to your content and your thoughts woman..We need many such ladies in our country. Thank you for being you❤️", "reet_mallhi": "What u have written is ryt.but i dnt think so apni body show off k4na jroori hai hr baat pe ..", "cranky_cake": "What a savage reply, honey🌼 I love your thoughts madly but something more i love about you is your thisness. I mean so wonderfully you prioritize \"yourself\" before any other fucking thing whether it be raising your opinion. You remind me of the poem where the lady was brutally compiled to roam about naked & grew an inspiration for me as the way she celebrated her nakedness (physically & abstractly) is unimaginable. I so love you💕hoping to get reply someday🙈", "joyita_13": "Well written ❤️", "vikram_s.saxena": "Dream of a couple", "sakeofovi": "Its just awesome... 💞", "bhagya_namal": "Wowww....Im speechless 💓🙊@redheadwayfarer", "karmicsphere": "Well said @redheadwayfarer ....but seriously I'm tired af proving and fighting for feminsm ,it iritates me coz yar come on ....these are my basic right and i think this topic should be banned ,if you dont consider me equal its your fault .", "itsmehakmuskanhere": "Applause", "____miss.mathew": "Very well said ma'am 💛", "_shashankk_": "@hatschek_ that survey was conducted by 550 people.....Let me correct your knowledge in usa 1 of every 3 get raped. How can just 550 people tell about a country??? My suggestion to you Read Read and Read", "sehajkmaini": "Attagirl!", "sayeed_akhtar1": "How come only men looked down to porn have you asked any women or you consider yourself as the ambassador of the whole women.. you're sick please go to a psychiatrist!!", "artlove_97": "@salazar_slytherin_24 she puts it out there.. 🙌", "miss_basundhara": "यत्र नार्यस्तु पूज्यन्ते रमन्ते तत्र देवताः । यत्रैतास्तु न पूज्यन्ते सर्वास्तत्राफलाः क्रियाः ॥ (The divine are extremely happy where women are respected ; where they are not, all actions (projects) are fruitless.) Ladki ko swatantra ke sath jine do. Ek ladki sirf ek ladki nehi wo kisika maa, kisika behen, kisika patni, kisika bacchi hay. Use respect karna sikho 'Ladki- EK Social Ignorance' finally released in youtube. please watch it and share it with your friends for changing the Link: https://www.youtube.com/watch?v=QTOsdGg3L9A Proud to be an INDIAN.", "shobhit_saxena3991": "😍😍😍😍😍", "raipallavi1712": "U r an inspiration, thanks for being so bold and speak the truth which actually scares spineless people. Thank you for being what you are ❤", "a.mild.attack": "Caption 💯", "thenameiskgr": "If nudity of a woman causes rapes I would really want to know how many women get raped in tribal regions of Africa and Amazonian Forest.", "meghachauhann": "Forever inspiration💙💙", "beradebasis": "A big salute !! mam 👍👍👍👍", "iamarjitiwari": "Bhai sab theek h lekin photo kaun lera hai..😂", "palattinder": "The world needs strong womens like you who will lift and build others😊", "_k_oma_l_": "I think we should report the people who cannot understand it .. giving opinion is one thing but this is ridiculous .. # your boyfriend is a blessing girl # lucky. @redheadwayfarer", "nupur.upadhyaya": "So welll written 😘😘😘", "miss_munnchy": "All i want to say is i love you 😄", "ahanadutta24": "Y Saloni hiding... Her body language seems Lyk she too is ashamed to peek out of balcony confidently...", "asifk092": "Correct !!!", "megh_0692": "Hats off Madame 🙌", "amitaggarwal8": "Bhencho... Haddd ho gyi India is most unsafe country 👎👎 ese to Barcelona Brazil jese country bhi unsafe h. India hi nhi har country m rape hote , victims hai.infact India m rape law ka galat use hota h", "ahskepa_2104_": "Mam 🙌🙌❤️❤️", "rajneesh37": "@dharmeshchaubey read this!", "world_backpacker_love": "WHATZ CONNECTION BETWEEN THS PIC & RAPE??????? OHHHH GOD", "advaita_gk": "I love you. I love you for just saying everything that was in my heart. For the words that couldn't come out of my mouth because I couldn't even put them in words. We NEED people like you in India. You are our future. India needs people like you. And I'm gonna be a part of it.", "obliviousnomore": "Oh woman! You're simply amazing. And the fact that so many men and women are commenting against this post proves your point perfectly. Sense is the way ahead . It's not us.. It's their stupid thinking and behavior that makes us feel uncomfortable in our own country.. Amongst so called \"our own people\". Feminism is the way ahead. Talking about issues is the way ahead. Kudos to both of you guys @redheadwayfarer and @rahulb90 for doing your bit. More power to you.! This is the best thing on Internet today. Happy first step towards Independence.", "ankulsharma_": "👌👌", "anita_baraj": "@aneri_kotadia this is the coolest picture I've seen in a meanwhile. How different yet satisfying it looks? How free from all the standards. Never seen such a picture from India! It seems like atleast a single girl from India is living her life the way she wished. So so odd and yet so true with the strongest caption ever. @redheadwayfarer Thank you for giving us hopes about free and safe India.", "malavikasharma19": "Wow", "yakob_vijay": "Baby i think you can write some books in the name of Fuck....... What they think.....", "kanshellfire": "Being confident about your own body makes you beautiful 😍@redheadwayfarer 🙌", "__angira_": "Why is feminism about being naked??", "ehteshamghouuri": "Totally senseless !! you think every educated woman needs to reveal her nipples 1st? just to show her liberism? or a man to consider him as a Open mind person or educated whatever!! by moving on streets without clothes? Girl!! Let me interupt. Sory to say but totally against your thoughts.!! First of all showing your body is not a choice of freedom whether if it comes to a man too... in old ages Man/woman have no clothes , they still coverd there body with leaves--> back to decades!! Now the society grows!! There is a difference b/w animals and humans: Either man or woman: both have a right to live but shaming body is not consider as a act of moderization , liberal , feminism , masclunism etc so on.. I never appreciate a man to walk on a street with open dick. nor i will prefer a woman without underwears... Both are a respectful creatures!!", "supriya_k_s": "This is what everyone needs to understand. This is what individual freedom is. To be the way you are comfortable to be. I really wish there was smtg called \"Saloni-flu\" that spreads around India like malaria and flu.! Coz \"Saloni-flu\" definitely contains the cure to the Indian mindset that needs to be changed for India to be a better place to live in!", "pankajbrahmann": "#respect", "sanjanavk11": "🙌", "saumyamittal18": "You force people to have a different perspective and kudos to you for that💕", "charuu_jain": "Caption couldn't have been more prefect than this♥ @redheadwayfarer", "madangirikar_sailee": "This is by far the most straightforward and 'in the face' post you have written!! Thank you. Thanks a ton for this.", "__vartika__malhotra__": "appriciated", "__.l.u.n.a.t.i.c.__": "U are an inspiration .A true feminist and even am trying my best to create an positive impact on the poor mindsets...pls keep going...u inspire me a lot...and also am a true fan😘😘", "_lost_momo_": "Yes this will be the true independence 😍", "m.praveen10": "BC!!! Abhi tk to tere view dekh ke yr smjh rha tha ki tu kuch naya soch Rhi hai.. Par aaj tune kar hi di gande khoon wali baat... India unsafe place hai to wha chali jaa na jha tu nangi ghumegi aur na hi tera rape hoga aur na hi tujhe koi kuch bolega... Tu pure stree jaati par kalank hai...", "ritikjain0007": "Thn cut yr breast bae and no one will rape you, roaming around in spain and talking about feminism is bullshit, to say bad things about yr country with a glass of wine is easy bae, but if seriously u want 1 do something about feminism thn go in the small villages of india and educate women about thr rights, showing yr fucked up body is not feminism. So go to hell and don't show off🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "suman_nath_yogi": "😘❤❤🤗", "god____07": "No Feminism Is Not About Bra And Panties Madam.... Idiots Like You Keep Dragging Them Into The Topic .... You Are Simply Diverting The Topic.... Teach Them How To Chase Financial Freedom... How To Grow Strong... Strength Respects Strength ... And That's How The World Works.... When Women Is Strong No Body Dares To Mess With Her.... Stop Fucking Innocent People's Mind With These Stupid Ideas.... I Am A Man And I Want Women To Uplift... But Idiots Like You Keep Diverting Their Minds", "bhanita144": "You are simply the best, BEST!", "91.sneha": "Not only in india but it happened in every other countries", "charmizaveri": "https://www.google.co.in/amp/s/amp.theguardian.com/global-development/2018/jun/28/poll-ranks-india-most-dangerous-country-for-women", "msimperfecto": "You inspire 🙌🙌🙌🙌", "mukul.mair": "Breaking all rules and i love it", "upashya_rb": "I wish people here would read more than what they watch. Or see.", "abdullahalmasum94": "U r right.So Let's show ur boobs. It's not a problem. Because u r independent.", "krishnaa_manoj": "Ive strongly supported equal opportunities, i have respect for both genders and i have always strongly felt the need to stop thinking about \"log kya kahenge?\". But, today i am 10× more confident that100× more frank about it and 1000× more supportive..... and all of this, is because of your posts, the kind of inspiration they give, the kinda sass n savagery in it. You don't hold back, u say what u believe is right and u respect each one of us, out here. And now, I'm getting there, too. Ofc i don't make an impact half as great as the one u make, but i am doing it in my own little way and im proud of my beliefs (even when my parents arent quite sure im right or worse, when they are against me on some topic) and i derive that energy and confidence from you..... LOVE U, Saloni.... but more than that, i respect u, i admire u and im in awe of u......", "dr.aishwaryanaik": "Perf !", "mickyjesjeswani": "U r Indian person not a not a anthore country person so plz respect India & his culture", "chiragprince": "True love u mam", "arielisanalien": "@khwaaahish ik the ception is v long but read it once... it’s v relatable", "_pr3ttypriceless_": "Perfectly said! We have to stop sexualizing women's bodies. Yes WE, all of us. Womanhood/character/respect is not at all limited to breasts, butts, thighs and vagina. Women do not exist to be sexualized.", "localheroin": "Please go skinny dipping now", "little_meow_girl": "True af @shalini_indora @laveena_soni @nehalbhati4 @shwetasharma75975 @jazzzyy.x", "rheasachdeva_19": "You both are goals af❤❤", "shamsheerbains": "This is truly inspiring. I love this post!! ❤ I really wish every woman, and even man, had this mentality and courage. 💕 You're awesome. Lots of love!💞", "madhuri_balla": "@kritipandey7 @anusha__naidu", "priyapinky96": "Well said", "_aayyyuu_": "I hope everyone reads this and gets awared", "preeti.24": "🌟💯💯💯", "smita.john": "❤️", "sakkumyself": "Iloveyou both so much 💕", "followingmoira": "#feminism 💞", "__april.born__": "I just love Ur thoughts .... It's make me very brave .... Ur an inspiration .... Hope to meet u one day ....🙂🙂 Thanks a lot for Ur words", "_preetiii.__": "Love you and your spirit... Keep going on man.... U are an inspiration.. 👏💋", "bunnmaska": "🙌 Hands down . @redheadwayfarer You are the voice of women ! I really admire what you write and your posts are just so amazing & inspiring ❤", "namgyalgabby": "Word❤", "shivani.khanduri": "The caption .....omg 👌👌🔥🔥", "dev__gru": "@redheadwayfarer i guess you already anticipated the kind of comments you will receive after posting this. You are doing your best but jo log abhi bhi hindu-muslim karte hai, those who will lynch you if you get caught in possession of beef or even they have slight doubt about it, jo jeans pehenna ban karte hai won't get your words. It will take two more generations to overcome their patriarchal and primitive mentality. So all we can do is hope and wait.", "kaurjhutty12": "Commadalbe courage you carry .... You're the beginning of new mind set..#respect #iagree #behindyou", "ishaa_kesariii": "Love you for this. Greater power to you.", "_kanzee": "Everything you write needs so much guts...Hats off to you...May all girls like us be brave enough to feel like you about ourself and make other girls around us also empower...Love you loads❤❤", "samakshvevo": "💓💓", "iamsiddhinaik": "\"My girl on top!\"❤", "sonamraut_96": "@devil_mate04 @saniasehgal01 read the caption", "menakapawar": "U r such an inspiration to every women out there.....😊hats off....srsly...", "divnoor_kaur": "Thank you so much 💕💋", "mr.jakke_911": "Cute", "_shrutigaur_": "@_karuna_gaur feminsim is this 😪", "m.spiritbee": "This is epic! We desperately need more women like you in this world @redheadwayfarer #independenceday 🌸🙏🙌", "akshay091190": "Girls and guys should just be empowered to walk around around naked... This will stop rape and most of the other world's problems.......I hope more women fight for equal opportunities in education , equality in the work place etc everyone will support these causes.... It's sad to see such first world feminists hijacking true feminism 😢 😢 😢", "aishnand_96": "Beautifully said Saloni .", "harshi_tha.ca": "@roja_hr @kavana_22 read this caption , its so beautiful 💟", "_divya_jami_": "You go girl ! This is thr feminism we need😍👏👏", "the_curious_cat_": "Can I say I love you? Sorry. I already did. ❤", "badalti_fizaa": "This is something so nice.. 💕💘 you r a inspiration for all the girls .don't let trollers get to u ever .. keep going. More love and power to you💕xoxo😘😘 @redheadwayfarer", "jasrah_moin": "❤️❤️❤️", "shankhabela_mukherjee": "You have a gift for articulating reality so well.", "mahak_shukla26": "Now i have more respect for you. Thn i had.. that u did this. I truly believe that it's not only coz of men bt the system politics and all other things. Which supports this kind of stuff illegally... M also a men..i always thought to save my female friends from my other class mate. Lots of love..", "_yuthika_speaks_": "I love you😙😙👏👏", "_mahima.verma_": "❤❤...Proud follower", "animesh_ib": "Just thinking who is clicking those pics.. Is it a timer...", "alappat_akeena": "@par_vathy", "_angel_0898": "You left me speechless", "jagumurpani1": "Amazingggggggg 💖 hat's off...🍃😘💯💯💯💯", "drish.noniwal": "Well said lady 👏👏👏👏", "highon.3am": "I refuse to be scared everyday and worry bout someone else's sexual desires while my own desires make me a whore. 💕💯💯💯", "muskansultana": "This is amazing ❤", "_vamshi98_": "♥️", "bindhu_purushothaman": "❤️❤️", "_dpka_m": "Love and too much respect for ya ❤️❤️", "priyanka._.cp": "Respect❤", "ajaygoyal1": "True", "tavleen_words": "Thank you. Thank you for standing up for the injustices done to us.", "nitu_nithin": "achese pata hai followers kaise badana hai", "_kashyap05": "Girl I go gaga over ua post and the way u convey ua messages 💯💯💯💯💯💯 @redheadwayfarer", "nav_bansal_": "You are true inspiration...........", "madhulika_joshi": "Speechless mam!!!!! Love ur thoughts.... Hats off ❤️🖤❤️", "divya_singhi": "@apeksha.12 read it man", "ayuuuu0211": "@chikanshi750", "hypn0sic": "I'm someone like you glad you exists", "jhankar_309": "Inspiration mam! So perfect ❤️💕🔥", "a_n_j_aaa_n": "❤", "vaishalithakur_": "So so so true and relatable 💯💯💯", "harshitarathod_": "❤️❤️❤️", "siiddduuuu": "Sorry, in the beginning but it's just my thoughts as urs nd just writing it i need a simple answer? 1: Why you wants to get naked is weather is too hot or what? 2: Nature differentiate men & women while thinking out something they have given you boobs , vagaina, beauty so that men would attracts towards it & they had given us penis, beard, moustache & muscular body so that female will attracts towards us so it's vry obvious thing if you would keep ur sexual parts open male will attracts towards it. 3: Would u ever see we males wearing small underwear, showing out a little portion of our butt or penis.", "nameeta_nautiyal": "Thoughts 👍 applause 👏", "shubham_khulbe11": "Baaki toh sab thk hai lekin yeh batao yeh picture click krne wala Kon tha?🤔", "_mohitzzy_": "Well said mam", "kartiki.bhatnagar": "Dude, what are you even trying to get across typing a bunch of normal things people say everyday with no flow whatsoever?", "nomadographer": "This is such a beautiful and powerful picture. More power to you, girl. 👏♥️", "bratmouse": "By the way who click the picture 🤔🤔🤔🤔🤔🤔", "shinjinii": "The comments on this post are disturbing.", "sahilratheesan": "@redheadwayfarer actually it's not about breast, it is just about vagina! Even girls below 10 are also being raped. So basically it's not about body or being horny. Rape is an act of masculine violence.", "kondekar_abhishek": "Love❤️😘", "priyanka_bodkhe": "🙌", "sukhanya_sundaram": "@anjana_hari14", "mahithi": "@harshitmaloo92", "sagarbarthunia": "Well said....", "_justasexypotato": "@snigdha__ After every line I’m like “yes. That’s fucking true.”", "blackwidow975": "the words are soooo strong n powerful..... proud of you lady", "rohann.___": "💯This is so Perfect!", "tannistha_chakraborty": "I love you.💕 A BIG THANK YOU.💕", "ravispanchal": "Agreee for what you wrote there but if you feel India is unsafe, you should not come back to india", "swarinasoni": "I. LOVE. YOU.", "saurabh_bhosle": "Very well said!", "rakzx252": "Kudos to you and your bravery👏🏼👏🏼👏🏼👌♥️", "_.ishitaaa": "This needs to be published on a large scale.", "pratishtha.rao": "🙌🏼🙌🏼", "a_creator_of_possibility": "It makes so much of sense!!!! ❤", "vanity_femme_liberte": "The most amazing thing I have read in a long long time! Beautiful! And you two look awesome! Rockstars!", "maheck_": "💯✅", "deena_mary": "Wow 🔥❤", "archith_s_kamath": "So well written 🔥🔥🔥🔥", "sachin8460": "Kitana lucky hai tera boyfriend yaar kash mein hota", "boris_707": "@redheadwayfarer Men who think from their dicks will continue to do so. No point explaining them on Feminism. What we should do is, We need to correct the root cause - that is, proper education and gender sensitisation at tender ages. And bdw, very well written agree with you on the point you tried you make.", "diksha_menon": "Damn !! It was really important to put those words out there in this world💜 Thank you so much for being the person you are ,you motivate and inspire a lot of us every single day with every word you say 💜thank you @redheadwayfarer @rahulb90 and thanks to you to show us the kind of men we should all look up to 💜lots of love to both of you", "nilofurayubkhan": "@an_soulographer @hrishikeshgawali", "im_siddharthyadav": "I always appreciate your thinking. Uh are always look awesome. Nd your though too.", "isanashayk": "@redheadwayfarer you go, we follow. We need more of you and u encourage and inspire so many of us. ⭐️", "aasminfarhana": "Soch itni age hai pic bhi age se dal do.. I hate u jst... And your thought r so much........................", "singh_yukti": "salute u girl...@redheadwayfarer", "tripti_lalwani": "@the_yellowlife just go through her caption. 💖", "nimisha_negiii": "My my my! What a person u r!! ❤️❤️❤️❤️❤️", "aditya.khapre": "You wrote all that for one topless couple's photograph??!!", "angkita_lumina_deka": "You go girl!❤️❤️", "seems21_9": "That's one adorable click ❤️", "krupamamlani": "❤️❤️❤️❤️❤️❤️", "karan_verma7": "Photo kisne li?", "iyoushe_20": "Wow. ❤", "paushalli": "You inspire me. 💕💕", "_manpreet_14": "Caption🔥🍂", "roshni1418": "You be the bestest out of the best❤️❤️love love❤️😘", "chawanprash__": "I love you for this, I can still see some useless comments on this post but above all, the words here are something we were living with, from years thank you for this, and I love you, mean it❤", "shahina_sakkeer": "Wow ❤", "surabhi_dadheechi": "Love each and every post of yours👍", "swati_rawat2": "This is something so perfect❤👍", "kawaii_myra": "Awesome girl! You are the inspiration to the million girls out there. There will be loads of abusive comments now from chutiya guys. Just ignore. We love you❤️", "_chayholic______": "🔥🔥🔥🔥", "suprabharay": "😐worrd", "__mansi.bhati__": "U r just an inspiration 😍", "aayuuuuuuushi": "🙏🙌", "devika_mohan_": "Perfectly said✌..i m falling in love with your posts", "sejalmhaskar": "🙌🏼❤️", "karishmasahu105": "👏👏👏👏👏hatsoff to u girl ..", "d.chakki": ".", "shilpa_dwivedi_": "U r inspiration 🙏🇮🇳💓", "twiin.kle": "This is the best thing what I read today..we all really love you aloot..hats off to u🖤❤️💙💚💜", "nofukenway": "So your solution to all of this is for a girl to be able to go buy eggs or milk in the morning without wearing anything on top. Let me remind you that even if a guy walks on the street bare chested, it's shameful and disgusting. The point is not about dictating what girls should or shouldn't wear. It's about this false, deluded notion that if a girl doesn't wear anything in public it's somehow empowering and makes her feel emancipated. Most girls don't like to expose their private parts even if they had the option to.", "hardikvasani10": "👏🏻⚡️", "aafreennehvi": "@sanna_nisar Read the caption", "ayesha_panchi": "👏👏", "p.k.don": "Ye sala itana lamba likhati hai pura padh nahi pata re baba 🤗🤗...re baba... public kaise itani jaldli padh ke comments karte hai🤔🤔🤔🤔", "chryzal001": "@13_pri I love the caption! Read it, you'll love it too.", "manvisinghrathore": "Bang on"}