{"krunalbhalja": "@parulbhardwaj20 read the whole thing", "parulbhardwaj20": "@krunalbhalja93 read it ! ..Much needed awareness !", "blessedcurse27": "😍😘", "nehara_palengada": "I so truly agree wd u ... drs a lot tat parents and our society has to accept and also teach to d girl community... I personally feel tat .. if wat u wear is a problem for someone then it's their problem and not yours... all that a girl need is to kno her body and confidence ... as it is said .. beauty is in d eyes of beholder.. its all about hw they look at a girl which should not at all b d concern for a girl .. you give examples of great achievers to your daughter and at a same tym make her feel less than a man doesn't make sense anyway.", "abhijeet_jain": "Your writes are just fab ❤👌", "salonichopraofficial\nVerified": "Verified", "vaishnavi_sometimes": "Read this a long time ago @nalin_misra . I preach this woman!", "nj_baisa_": "@i_bhumiie hahhahahahah", "theinferiorishan": "@mylifeisabeautifuldisaster2019 yeah but you put it on a universal basis which made it a bit weird. This post is perfect👌", "rohilgosh": "Damn I love this post. It brings out such a strong message. @mylifeisabeautifuldisaster2019", "priya.pj36shan": "Love u saloni n love ur thoughts 😘😘😘😘😘😘😘", "sweetyganekar": "@purviiiiii_18 @rhutu5 @ravinakoli", "nehaagarwal2606": "It's such a Comforting thing that I read.... Suddenly feeling to love myself more, to be loved by none other than but myself. Loving not to impress anyone or to make it look louder but to be just comfortable in my own skin and smile from all my heart enjoying the feeling..... Love@ redheadwayfarer", "skumar_dev": "Ya this should happen ... I mean equality nd restriction of gals in front should be there but some restriction boys also deserves in front of Gals. @redheadwayfarer", "ruby__dubey": "Wat a thought ❤", "chutiyokikaminahi": "🙏🙏🙏🙏🙏respect", "image_of_ink": "@richapasricha", "upside_me": "@image_of_ink this is the best thing I've read today.", "sachihihihihi": "@sanjana.chawla99 @_.expecto___patronum._ i m in love with this woman", "iamsk44": "Such a strong strong message ! @redheadwayfarer", "the.mess.maker": "I wish i had a mother like her.", "just_keep_breathin___": "Gooddd pointtt yaarrrr😇😇😇😇😇", "_a.n.u.s.h.k.a_04": "@redheadwayfarer ...koi fayda nh mam..bas thodi der Tak fark parta h..uske baad..sab change...", "liberal_enthusiast_": "👏👏 Finally found a perfect reply for those dumbass who keep on asking 'why women these days are struggling to roam naked in the land that holds legacy of Nangeli who shove her breast against the taxing, some centuries back, for covering the breast by Feudal 'high-caste lords in Kerala'...👏👏👏👏", "perry_arora": "@jyotirmoybasu ..a scared man !", "bithi__roy": "I see there is a big debate here. In my opinion its surely not promotion of being naked but it is actually about fighting equality. But fighting for equality can be done in many more better ways. Why by hashtaging free the nipple? The title itself involved a human body part. And coming to a man's nipple and woman's nipple.. they are complete different and beautiful in their own way. So why the hell are you putting up a comparison and shouting 'equality'? Equality is when both the genders are treated as humans with equal rights. Equality involves fighting to get the equal and just rights and uplifting the narrow mentality of the society that women are inferior. It doesn't at all mean that we will hashtag free the nipple as a man and woman's nipple are the same. What kind of way is it to fight for equality man? i feel a body part has nothing to relate with equality.. body has nothing to do with women's rights. We all are human beings and we deserve equal rights. That doesn't mean our bodies will become equal to a man! Then where is the uniqueness of being a woman or a man? I don't know whether i am being diplomatic but these are things that did strike me.", "killer_ali786": "And @winx.823 woww girl !! You are ready to do anything for your comfort .. Maybe you are living in a country where a sex is a common thing and having more then one relation is also common but i am living in a country where i have to stay in my limits bcs there are laws for girls protection and i am not a kinda modern who can do anything for her comfort .. my religion doesnt allow me to go for my comfort like this and i cant talk about my private parts so openly .. Okay and i think it is not allowed in any religion .. And yeah in every religion womens are mostly respected ..", "vanisha29": "@__cheekyangel__ you have to read this!", "ashima_walia": "@girdhar_boy resist 😒", "nitin_girdharr": "Some of its points.... @ashima_walia .....", "angshu_mita": "#equality in thoughts... @redheadwayfarer loved the caption!!", "ganga2094": "Tumse na ho payega😅 @aishakhan1109", "kay_eeeee": "Everyone should seriously start thinking this way !... there's still sooo much of gender policing", "suman5143": "Awesome. U won my respect. The exact reason y I don't want to be with an Indian:)", "_xkinkajou": "@singhakasha438 @shwetanegi924", "officialdeepshikha31": "By ur*", "psychologicalterrorist": "Thats very well written.. ☺️ @redheadwayfarer write more ! Express this out more.. people should know !", "bloggerpct": "Diseased mentality also contaminating others @redheadwayfarer", "_brownpedha_": "Dude you are inspiring and amazing.❤", "dankloola": "Because those will make guys horny lol, don't be stupid gurls! Still watch out of everything :*", "harshitaaa27": "@cavya_", "rainrimi": "I am amazed at all the ignorance. I am not even going to bother to explain what the movement is about. This just shows how people's mind is dirty and not the body. And people lets be honest. It's not like you don't know a girl has boobs and vagina. Covering it doesn't mean that 'poof... problem solved. Boobs and vagina gone'. Why is accepting something that's a natural part of our body such a huge issue? Smh", "diiyalamba": "Finally someone said it 🙋🏻🙌🏻👌🏻 you've earned a lot of respect babe 🤗 keep up the good work 👌🏻🤗❤️", "ishuvishwas": "@aishakhan1109 why don't you go and have some rest. 👍 Or just unfollow her as u don't agree. This place isn't for you dear.", "ar.ushi": "@parthian.firefly.ananya as i said before,free the.nipple is not.roaming.around naked -it's about creating a society which accepts the.women body.in.all its glory instead of.hiding it", "rio_thehuman": "@perry_arora shi Hai Bosss", "swati_shishodia": "I started hating you guys now @iam_bunty @krish_ziess", "_mohitshinde_": "@redheadwayfarer well said👍👍", "itsmugdha": "I could not agree more @gnair94", "ojasvi.bhardwaj": "@redheadwayfarer well said", "shreya_navlakha": "@__nids_ @harshitajain.23", "geetika.verma": "#I loved it @nancy_chadha", "sabreena_mabood": "@hanafarook", "bhavendra_pratap_singh": "I respect your view and I agree with you but you can explain me one think our country accept this and ready for this type of mind set it's not possible to our country because here 2 to 5 year old baby girl has also faced rape problem shame of who do this type of things first we controls our population and equal to sex ratio and educate all the ppl first after that do this type of think.", "_dishe._": "😢😢caption 😭😖😖", "rekha___sharma": "Read this @kritikawadhwa74 @kaajalg.kgaria", "gnair94": "@ahdgum", "natashaaajwani": "We need a community inspiring its daughters, grand daughters & niece to refuse to please others by pretending to be less than men & instead encourage them to be just themselves, to love their body, to make them realize that they are god gifted! She doesn't need to be saved she need to be loved & respected!", "itx_nagx": "@itxzill_qureshi", "mishitargupta": "@jivyaant", "srijana__das": "@redheadwayfarer each and evryword u wrote was relatable! With the situations we face evryday!", "sourabh_vyas_": "@akshit.joshi_aksh 😂🤔", "rashmisingh__": "On the point! ❤", "prakharprabhat": "Would you like to post a topless PIC of yours on Instagram if you're so comfortable with your body?", "gurmehar08": "Omg you just know the right things to say. This is just prefect ❤❤❤❤", "_krithikzz_": "👌👌👌😘", "niharika_ratan": "Yes.... exactly.... everytime...I've faced the same kind of situation of not being comfortable with my own body... the caption that u have given... is damn amazing...it's just splendid@redheadwayfarer ....many of them didn't get your views... and they are just talking about \"nudity\"...and fighting... as someone above said \"ki agar hum nange ghumne lage to humare me aur street dogs me kya fark reh jayega\".... actually she didn't get the point...that this fight is not to be naked...but fight for equality....where men show their masculinity in front of each.... on the other hand...we women are taught to become conservative! Feel like...my body is not my body..... that only make us feel unsafe from the beginning", "reyanalamansary": "This is just the post for this era! Perfect! 👌", "asted_dsilva": "@dylangkz 😂😂😂", "afreenzubair": "I belong to a muslim family my parents have given me equal rights as they given to my other siblings. Equality of rights and going to be naked is two really different things.", "jinal.mange": "@shreya_navlakha @nidhisampat23 @caramelkinn @mansi_savla1221", "mansiii_tandon": "👏👏👏👏 @perry_arora I must appreciate you. In my point of view you have already won. Those explanations are NEEDLESS.", "insoumynia": "@perry_arora Am glad someone understands!", "im_marcydearaujo": "N forget about spreading legs sittl n stuff ppl make a mountain out of a small mole if our skirts pants dresses r an inch higher ..qualified ppl!! 😂😂😂", "_theskyispink__": "@sakshisrk_ read the caption👍what a grt thinking!😑👏", "lightofbeacon": "this is all godamn true when i see my sister can't go long in anything like studies,sports,career etc.. i always think the same way but it's hard to make people understand all this i keep trying and keep getting trapped in a argument with insane non supporting persons.. appreciate ur efforts @redheadwayfarer keep going 👼", "shubham_thuglife": "😁😁😂", "tanisha097": "@aaina_bhalla 😂😂", "nancy_chadha": "@shwetabansal1994 @ankitaaggarwal0112 @nidhi_samanotra @geetika.verma @nitishachhajer", "bhavikaa_10": "@anushka545 read the caption..", "garg.nancy": "Respect men...for how hard you tried to explain everyone what this post is essentially abt...i really appreciate your dedication😊 @perry_arora", "geoiry": "No lie y'all want to be treated equal but don't want to sign up for the selective service 😴 women walk into a male restroom it's a \"mistake \" but when a male does it he is a pervert.", "aayush_vora": "👏👏👏 @prer3", "hani_inah96": "The more she is covered the more she is protected..", "gflash14": "@perry_arora Respect bro...for how hard you tried to explain everyone what this post is essentially about (I read all those comments). But we are looking at a huge bunch of people who have never asked a single question their whole lives. They've simply accepted every shitty belief they have been fed, silently, by \"the society\"- one that never exists in the reality but always is at the back of their minds. Killing them at every decision that they (girls or boys/ women or men) want to make for a better life. Even if it has never been a part of their story, they subconsciously want \"the society\" to read it, judge it and criticize it.", "bhavyakumawat17": "😘😘@_dj_143", "shruti_1503": "@tanvikagulyani this is beautiful, read this", "jain.ayesha": "You know what you were going really well putting forth your opinions but in the end you have gave up.You could have made some more efforts#Changeisdifficultnotimpossible @redheadwayfarer @aishakhan1109 @perry_arora", "satish.meghwal": "@perry_arora", "thefoodies_souls": "@harinder.21 read the words so true and amazing. I'm sick of Indian optimist mentality . Why can't girl do anything they want. Thank god I don't give a damn to anyone related my outfit,life or anything", "saharsh.2804": "@i_am_saquib @i.am.soni", "xunayana": "@shreyansh4594 read it. It's very powerful", "prer3": "✊🏽👏🏻 \"well said\" @_ambika11_ @meoww_2912 @alisha_chavan_29 @lawrance.watson @aayush_vora @doofenshmirtz.inc", "rituajwani": "Well said🙌👏👏👏 really this is the main problem of our society! I think it has to be change! And you are the girl who has a power to change it.. Really world is changing and I think their thoughts too! But this problem is not changed yet! Hope one day it will also change! Really can't thank you for these inspiring posts! 😘 keep posting❤ so proud of you😘", "nandiniichoudhuryy": "Word.", "mrunalunde": "Caption ! 👍👌 but I wonder if people really think upon this? Cause most of the times they just tend to read and leave and don't really implement it !", "brijesh.bangera": "Read this shit 😂 @the_jacked_sailor", "jhalli_nalli": "@emotions_and_words @midnightwanderer_95", "vaibhav_gupta_98": "I don't get one 1 thing who are we (boys) to cmnt upon what a girl should wear or not It's upto girls and they should decide as most of the girls have a positive response towards this which means there is SmThing which we all need to understand from their point of view!!! @redheadwayfarer i read some of ur posts and all are really gud! #girls_on_top", "_divaa__": "Read this ok @bhavyakumawat17", "sakshiichadha": "@divyarandhawa9 already seen its up to the mark!", "ibombets": "Dear @aishakhan1109, The world is changing and so are the people with it. Sexual choices are up to individuals for both male and females. No one has or should have the right to pass judgment on it. Accidents happen and can be taken care of very easily nowadays. It's easy to call someone names. Women have started working and are not confined to just being \"homemakers\" anymore. They can multi task. This is not the 1950s. We have to change with time. Everyone has a right to their own opinion. But being subjected to old school of thoughts and living like that is a disease. Don't spread it around. If the world was left up to you, women would still be confined to their homes, fully covered with no opinions to voice whatsoever. So stop. Think instead. Try. It won't come naturally to you with so many years of conditioning that you probably have. But give it a shot. Don't choose the easy way out. Freedom is our birth right. What we choose to do with it, depends on us and us only. Don't fault parents who are evolved enough to trust their kids. There is no such thing as \"faltu freedom\". If anything, it's good upbringing. Trust. Give someone that. And the world would be a better place. -21st century.", "misty_moles_a": "Totally ...loved it....change has started...😊", "eatwithnabz": "Absolutely rightly said @redheadwayfarer", "rohiikhann": "Hey all!!!..can this not b about bringing in even more fabriacted petty things that doesnt require to b in comments below to just push each other down on what views one strongly hold..I actually am not into too much info of what or what not goes on this page..", "divyarandhawa9": "@sakshichadha29", "shrushti_216": "Wowowww!!! Saloniiiiii💙 you're truly an inspiration. I'm reading all of your thoughts and captions. And you inspire me in every way!💘🎀 thankssss alot! 💋 You're very sweeet.💜 @redheadwayfarer", "amit_kr7": "i got ur point... but let me take a point : suppose girls got their right of being naked anywhere, don't u think that there would be no difference between boys & girls? can u show ur wife or sister in public ? if yes then how would u feel ? if u feel nothing then u don't have any Sanskars & feelings or shame! if it would become normal what u r saying then u it would ruin the feelings that we get being with a girl .....the girl who is really good in something then she'll do! clothes r not at all coming in between okk .....so let India be india.... don't make it a Hollywood centre.....i m proud", "devilnme": "@indunups", "jangrashivani": "Saliii😀😀😀😂😂", "_theycallme_suppi_": "Bewediiii 😂😂😂😂🙈🙈🙈", "muskantikoo": "@ipsitadivedi", "iamchitra_": "@__queenoflove__ @patilharshu21", "ruh_maaa": "@redheadwayfarer the way you describe all the typical things are truly awesome 👌👌.. It just powers me up 😇", "udhlaniyash": "Totally nailed it .... still long way to go ...", "_priya.pande_": "It's the best thing I read today !", "k_kriti_": "@redheadwayfarer u are fighting for the right cause but its a very long fight because for this mentality of people needs to be canged which is the toughest thing to do , all d best to u and don't get affected by criticism and negativity , u are right and best", "kajolgoyal": "@devgansujata @ankitayadav.1012 @27nishathakur @jangrashivani", "neha_gummadvelli": "Best thing ever @tishaej15", "sancha_sancha": "love this", "riddhishah_": "Totally on pointttt👍😊", "the_lazzygirl_": "I support dis❤", "the_blissfulsoul": "@_singhpurnima_", "aj_angelic": "@farahsahirhashmi ye dekho qayamat ke asrat... lahawl wala quwwat😥", "manjiyani._shagufta": "Each n every caption are fact...n really really inspiring....@redheadwayfarer n encourages me to speakup...n take stand for such fricked up situations", "balaji_thegrt": "@i_m_deve5h", "chanish_15": "@perry_arora why cant we get naked and get accepted", "bisma.shoeb": "bang on dude ......😯😄@_miss._bombshell_", "cringcer": "https://youtu.be/XnUUUFXmuEE", "whoannyyy": "SaLuTeee🙋🙋🙋🙋hatsoFf👌👌👌👌✌✌👏👏", "_amruuta": "Some people here need to realise that this is Saloni's personal account and not a hit and run spot for their BS. Sorry but the last time I checked @redheadwayfarer 's account it didn't look like a shit house or a toilet where anyone could come and shit out their disgusting thoughts and attack her for her view which by the way, she is not compelling anyone to agree to. 😒", "jyotirmoybasu": "read it, you fool", "thecurl_gurll": "👏🏻👏🏻👏🏻👏🏻", "ritu.raj.shrivastava": "@priyamadaan_02 man jst hv a luk at her posts.. Wt she is doing is the need of d hr... ✌", "manavchhabraa": "@vansheyka_17", "a.lost.introvert": "@diva_rits 😕😓", "kash1117": "@aishakhan1109 even if u fukin wear full dress... dere r chances of u getin raped .. so please dont even try to argue. And education has nothin much to do with all dis.. wat uk about who i support or not... malala helpd educatin gals.. goood... but dats still not much relevant to dis topic... it is but not much", "nusrat.adhira": "It's so inspiring and fucking true.When a boy do all this it is absolutely normal but when a girl do it's not.I don't understand why the girls should cover their selves when these shitty boys rape them."}