{"thatweirddgirl": "There’s only three types of people in the comments section. Either women (and fewww men) empowering her for embracing herself, men objectifying her, men commenting derogatory words to put her down. Seems to be the trend for most of the posts. Although ofc some women seem to enjoy taking part in the negativity as well. Equality har jagah honi chahiye na🙂", "ankitavishnoi97": "caption💯💯💯💯 more power to you girl💗", "nik180194": "Nice booty", "hiteshikumar14": "@palakgandhi297", "dhriti_barik123": "Her post seriously........ I don't know what to say being a girl mujhe ye sub nahi acha lagta I don't know why but hum ladkio ki bhi Koi izzat hai sometimes I feel k ladkio ko privacy rakhna chahie...... Who so ever he or she rich or poor", "aajay001tyy": "Chuttad dikha ke women ko empower karna Koi iss nautanki se sikhe..", "anya__solanki": "What should we learn from seeing your bum? I mean put the picture up but not with that comment cause it’s irrelevant. Nothing to learn. Maybe in some parallel universe where you stay a bum photo is feminism af 😂", "bitterbloodveins": "Hey I love how you didn't turn off the comments because of all the people who criticise you for making your choices! Good going", "sristy455": "Jio", "kumar_sruthy": "Girl you are a hero❤️", "ektaah": "God!! You have written so accurate❤️", "nagendra_knv": "మరి పువ్వు మోక్షం ఎప్పుడు ?", "distortingimbecile": "Recently I posted a picture in Instagram and my guy asked me that why I want to show off my body and that I should be naked at once so that he could get calm down. His question's \"why\" made me think this answer only, that I'm purely dedicated to him but I don't feel guilt in posting something I feel myself sexy. Not for him, not for anyone to show off... I do it for my own happiness. I didn't had proper words to answer that 'why', but now I have. Thank you once more @redheadwayfarer for being my strength and savior. I love you", "ka.ran77901": "Ye beach pe jakar Gand aur boobs ka pradarshan karna jaruri hai Kya ?", "ganeshsonawane652": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "munnabach": "BeautifuuuuuuuuuuuuuuuuuuuuuuuL", "sampy_105": "Your words are really so inspiring❤️❤️", "nageshprashanth": "Cute bum crack", "i_am_lone_warrior": "😂😂😂kam se kam tatti dho toh leti 😂😂😂", "lewsvegan98": "😍", "bushra1521": "I am here to read comments....😂", "mazharsahibole": "@affyy2.0", "__tashiiii_": "@tista1884", "vibhutitomar": "@shreya_katyayini", "mansie__": "@anfisa.__", "arnabsaha33": "All that blabbering and u are still fat as fuck.", "kmaazid": "Fuck", "arnavrathore_": "ewwww gross", "ahanadutta24": "Behind every long long captions there is a grossy butts of Saloni 😂", "basiclife_0129": "❤️Love it😊@redheadwayfarer", "tusharkukreti": "🤮🤮🤮🤮", "rifavarunkarim": "na 😠", "fenomeno_rono_": "I love your butt😘😘😘", "yousuf1791": "Lovely ass.", "rahulsingh143341": "Lovely dear love one really beautiful", "vickyrajput3987": "👄", "abhishek_bhatt2442000": "🔥🔥love it ,I like your crazy dezire ,I appreciate.", "cororna_virus_wuhan_wale": "@redheadwayfarer = Chaman Chutiya", "jigisha___": "U just awesome no one can beat ur thinking levels. U are very lucky u have a man (@rahulb90 )as god .", "ragas.studio": "Loved this one.. what a sexy thought.. turn on for me ❤️", "angbyaangishah": "Ahhhh you're so raw and real with the things that actually matter and we as girls ourselves are so oblivious to the concept of sexy ! You're not just getting guys educated you're teaching women how to feel about themselves. Youre getting women out of the guilt which never should've been felt. Thank you for being you Saloni 💕", "forevercello": "You should go ahead and pen down a book... Your thoughts n writing shouts out loud every girls wishes !", "100hil_shaikh21": "So hot and I like your pussy", "ashibajpai": "Wow... You connect with us and how... 😍", "gitashree": "🙌", "i_m_abhijeetavi": "😘😘😘😘", "lapetitemort18": "Putting your caption as my story. So relatable!", "freakoutakki": "@mishrapreety77", "miss_____sneha____": "😘", "rahul.thorve": "💋💋💋", "sweeet_poizzzon": "You are amazing 💓", "joel_ferns": "Fefe, I didn't read it, but that seemed deep af", "navya_vvj": "@sanyam_vvj you should check her profile. Hats off to this gal🔥", "bala_murali_maran": "Now tell me... What the heck is so special about your bum that you have made a post on this ?!", "yashfreddie": "Ulti aa gai pic dekhke", "suban3520": "Plz Saloni mam post with your face I don't like soory mam I like you I don't like ass pas @redheadwayfarer", "tan_.vi": "I don't comment on anyone's pictures whom I don't know personally, but you, woman ! You're the only person who can put my thoughts into words. Honestly, the day I started following your account, a lot of self confidence emerged since then. Not like it wasn't there before, but it was like an unburnt flame which needed to be kindled. And the day you replied to my comment on one of your posts, I was more than happy. Not because it was a mere fan moment. But because your reply made me feel like home. You're so genuine in whatever you do- from maintaining your professional life by being an effortlessly amazing actress on screen to being raw and your real self, here on your instagram. And above all, you're an inspiration. I don't know if you'll read this or not, but if I ever meet you, I'll only have one thing to say \"thankyou, for being\". Just being, that's it.", "itishiralp": "Very nicely potraited each and every post!!! Proud to have a girl who is trying hard to improve the society !!! If men are ashamed and post unwanted comments, then they should be ashamed of themselves not you @redheadwayfarer. Many men think Aurat is per ki jooti, then why do every men run behind that jooti, why they get flat behind that jooti. And why men pay to sleep with that jooti!!!! Saloni you are a real inspiration to the society!! Proud to have you🥰😍", "som_chebolu": "Sexy!", "madhulikamukherjee": "@iamishanroy", "kabeer115566": "Beautifulbumps", "sibani_926": "Haga lgi ase nki..", "aish_warya15": "Woooo hoooo! Love this woman. Now I can get back to being the diva that I am without feeling guilty about anything. Motivation for Monday ✔️", "megha_jain8941": "🙌🙌🙌🙌🙌👌😘", "abhishek_verma23": "Writing so much in every post., doesn't that bore you up?", "edufied1": "Inspiring as always 😊", "janushka1803": "😍♥️🔥HATS OFF to u♥️😍🔥", "kavyagoel": "😭Simply wow❤️", "shivyasaklanii": "❤️❤️❤️❤️❤️❤️❤️❤️", "mrunalparkhi8": "I feel women are in general conscious about their looks whilst going in public that they can't get out of the house in their 'messed up without any makeup state'. For me personally - it's fine if I don't look at the mirror in a hurry to catch bus.(Every fucking day). But there are some people who can say \"Didn't you look at yourself while leaving? You look horrible today\".Yes it's a joke between friends who understand you but deep inside you know that you can't help but feel as if each and every person looking at you is judging you because you don't look apt. I feel that if you want to groom yourself, then you should do it because YOU like it. Not because of other's opinion of how your pimples and acne look ridiculous because you didn't apply makeup today. Bottom line is - You are beautiful inside out girl.", "shere_alii": "💙", "emilymatthews0986": "May I wipe it off??🍌💦", "bhanukhetharpal": "Totally relatable. Thankyou for voicing these thoughts. Loads of love to you @redheadwayfarer ❤❤❤❤❤", "_.priyanshisingh._": "🙌🙌🙌", "deehmish": "Damn girl this is the shit our society needs to hear. it needs to be shoved down their throats to make them understand that a woman's body is her own, first. If you've never been in a woman's world or a woman's body you don't have the right to say shit about her, and if you're a you're bringing a girl down then please keep your opinions to yourself.", "theesskaysee": "Chiii", "anukshabharat": "Girl!!!🙌🙌🙌🙌🙌🙌🙌🙌🙌", "read_me_a_novel": "I don't know, I always get pissed of those harsh comments to your posts. But whatever you write is what we suffer and are made to feel about our own selves in this lame society. It always takes a strong heart and a good mind to accept certain facts which are your contents eventually. ILY💕", "itssagar_world": "🔥🔥🔥🔥🔥🔥", "khanabadoshiii": "❤️", "dr_with_a_good_handwriting": "Wow I have felt this guilt too.. but wont from now onwards 😁😍", "reality_bite": "🙏🙏", "nisarshaikh1": "😘👍👍👍 words.....", "aishwarya_knights": "❤❤❤", "ap808368": "Nice pic 😉😉", "nitu_nithin": "koi kaam nhi hai kya gandhi gandhi pic daalthi ho yr sab kaun dekhna chahega", "_.im_the_wolf._": "Ass🔥🔥", "afaanfuzail": "#metoo", "ikaminey": "Feminism k naam pe chod mt failao madam👏👏👏👏👏👏", "electronherder": "@redheadwayfarer thanks a lot for this. This helps me understand women and their issues better and it helps me improve as a human. 😊", "amit_the_limitless_": "Upon reading few specific responses I had these two questions that I wish to ask to everyone reading this. What is VULGARITY? And, second question is, if A Soldier on the border is relaxing and enjoying himself in the other times, when there is no possible threat to the security of course, would it be okay for anyone to ACCUSE HIM of digressing from the main duty that he was SUPPOSED to be doing BECAUSE he is A SOLDIER? (this second question is in response to a comment where someone said that she, that is Saloni Chopra, is digressing from the purpose or cause which she stood up for by posting such pictures)", "lakshmydas": "Devika", "shreyapawarrr": "@_tanyakaushik_ read this, you need it rn", "stfu.charull": "Lovely writing 😭♥️ truth of the world 🙃", "saxena.anushree": "1 awsm feminist i know🔥🔥🔥aag!lga dii u rocks", "dreaming_about_luna": "Lots of love Saloni 💖 proud of you!", "rsankhat": "🔥🔥", "s.ioum": "🙏🏽🙏🏽🙏🏽", "aditi_1797": "🌹❤❤", "shivam.kumar.rai": "This post made my day. You gave the perfect essence of hiw insecure our society is and our men are!! @redheadwayfarer you should write a book soon 😊", "shwe_osha": "❤️", "pallavnadiadwala": "👑", "prixyanshe": "it is so relatable,like i am foced to wear shorts under my swimming skirts so that even a part of my butt is not visible when i swim or when i'? on the beach.Also if i wear tights around my town,people will stare as if i am not wearing anything,just because the butts are higlighted.If i wear a chiffon kind of shirt with a bra inside,it is vulgar,it is compulsory to wear a tank top under it.Thank you so much🌺🌺 @redheadwayfarer", "beck_dunk": "Bewadi Kuch Bhi Post Karti He", "filmyfile": "Ye kya dikh gya chhi 😂", "meeku2315": "Mam u inspire me. ..thanku. .", "sushantgond": "Ohh wow your bums 😘", "listentothewaterfall": "WHAT A BREAK FROM THE FAKE INJECTED KARDASHIAN BUMS", "bleh_please": "This post is so damn relatable.", "mememama24": "Chiiiii", "mayur.jain.bbm_53342330": "👅👅👅👅👙👙👙🍌🍌🍌", "mannaa99": "💯🙌👏", "parth__7598": "❤️nyc @redheadwayfarer sister", "_singh_tarushi": "You have no clue how much I love you right now. ❤️ It's like you have spoken my soul, my words ❤️ These all things come to my mind always ❤️ thanks for portraying everything so well ❤️", "ishatistic": "Woah ! :\") ♥", "pshubham6": "Each word is true.... Your state of mind is relatable to many women, honestly as a guy even I will think the same which you have written but it is because may be we are grown up in a society like this , but i am not proud to think like that.. I know from within that it's not correct. But things will change gradually . Its inspiring of you to take a step ahead against this stereotype. I wish that i will be able to support the women around me to break this stereotypical approach and make them confident like you.", "sanj_ana": "Love Captions that make sense 💛", "aryan1_o_1": "Ok feminism is a thing but indulging feminism in every context is wrong.", "vaidehitshah": "Thats a butterfly design made of sand.. u fly girl.. @redheadwayfarer", "dnoella": "❤️", "gaurav_mavi77": "Great", "vishakha_katekhaye": "Girl you rock in every pose😘...you are amazing 😘 Hope you notice this comment", "ajvashistha": "I really love the way u are fighting I m big fan since girls on top.... And u R always on top.... Love the way u put ur words out", "imtribal": "@rahulb90 🌼 Lucky you ! You have got everything in just one woman... stay blessed! 🌿", "ramanromi_": "👏", "shradha_anand_": "🙌♥❤purely said.", "dilshad_ali_7777": "again ,?", "urmi_ganguly": "Your posts are so relatable sometimes. Well said.❤️", "alastair_crowley99": "You butt fares better than Kim Kardashian’s by an order of magnitude", "srs_harshita": "Hands down mam🙏", "mr_generouso": "Haaakkkk🤢🤢🤢", "timtimri": "Brilliant! ❤️ You said it so well.", "aditi_subhadarshini": "Respect🎉", "manvii26": "I love wt uh write its jst like the female vibe and experience or sometng I've faced and when uh read such content with the right questioning to society..it boost me within i am jst soo feminist now and I love that ..ah girls are the superheroes in this world full of typical mens", "dt_6_": "💛", "_ishasingh_": "💯", "rushika_gajway": "You are a role model ♥️🔥", "prashantjangra07": "respected @redheadwayfarer these are the thoughts of almost every second woman but in India we do what ever we like what ever the girl wants to wear she has to think of it 100 times as people will not only judge you but may even disturb you by touching you in public,calling her slut asking her for sex. After these things the girl gets mentally disturbed and may get depressed. Soo yes what society thinks doesnt matter but their dirty actions do make a difference for girls.", "theyusraahmed": "The caption shook me to the CORE.", "mamata_mathkar": "Rightly said 🙏🙏", "uttara9": "Fuck yeah.. 💚", "nishhhivasnik": "Wonderful words", "sanjeenamal": "Sexy", "vrinda_goel24": "Dayyymmmmm yourrr captionnn... You poured out all the feelings of my heart n soul in your caption girl 👅😭👅😭❤️", "kalpanasavalam": "BTW there are hate comments saying that your butt is ugly...or why you posting half naked pic....just ignore them...I know you do...but I too know that......no matter how much you ignore it feels bad somewhere.....I just don't get it..... Why people have problems with girls wearing shorts or bikini or revealing clothes....never mind....you're doing a great job by posting such a wonderful caption.....and lovely photos of you....keep doing that for me and other peoples who love your post and your words💕", "venghatdilshad": "It's new way of feminism...#middlefingersupport", "mr_optmistic": "Every girl should learn from u to be the voice for themselves... @redheadwayfarer", "cosmicvibes_girl": "@_o_shruti_o_", "priyalbhakta": "You answer a lot of my questions or just find me the way to my answer. ♥️", "hotchocolateandcroissant": "@pshubham6 Something to ponder upon. Read the whole thing.", "nikhilsachdeva7866": "Nice ass babe", "anushhkaa_18": "Loved this!👏💯", "ajdent": "@redheadwayfarer if you ask me Miss Saloni I don't think you can look any other way except hot or sexy even if u try looking non hot/sexy etc. You are blessed with good... No great looks. That's what I think...and I don't think I'm wrong. Check out your pics.", "bhagirathyjpanth": "#reshared every woman alive needs to know this. 🌹♥️", "10.rohit": "All time bum and boobs ho Gaya feminism🤣🤣", "_momo.jomo.hehe_": "😍😍😍", "thesonalithakur": "u girl😍", "adnan_alikhan_": "😂😂😂😂", "shub_he": "piece of shit #reasontounfollow #wrongwayfeminism", "rachelwiththefingers": "You said it.", "neiuu": "U really hv a talent...not everyone is blessed with the power to pen down exactly and so accurately what they feel. i really appreciate ur work n respect for u ...!! Really...!! 😊", "thehippiegentleman": "❤️❤️", "chaudharyhardik4308": "🥴🤢🤢🤮🤮", "_maitri_ghose_": "❤️❤️🔥🔥🔥on point", "little_yoddha": "Loved each and every word you wrote in this post ! ❤️❤️", "artnerd__": "Woman! I could relate to this honest piece of yours. Thank you.. so much for putting it out there so blatantly. I feel a bit less guilty now for wanting to look sexy because that's just something \" I \" want and not any one else. Thank you for the strength Saloni♥️", "bhumi.shah28": "Why so good? You write exactly what are thoughts every woman has! Way to go girl!❤️", "rheasachdeva_19": "You are a fucking pseudo-feminist.", "charmingly10": "🙌🏼 hands up cause Everytime I wear a deep neck in a stall while shopping a mall I feel sexy and comfortable in my body but the minute I step out I think about wearing a cardigan or a slip to hide the deep. Why is our social conditioning so deeply rooted in us that women can feel comfortable wearing clothes that make her feel strong and these clothes can have deep necklines and cuts and show our curves the way we want them to. Why is that the minute we dress up we our told to scrutinize ourselves to point where the outfit changes dramatically and becomes something that is comfortable but you're just not feeling that today. Why is clothing categorized for us in SEXY or COMFORTABLE why can't I decide that yes it's sexy and comfortable and I'm wearing to stare at my reflection when I walk through a glass shop and not for men to ogle at me and think oh she might not have a guy that's why she is wearing to pull attention. \"Honey if I wanted your attention my clothes would be the last thing I would use\"", "jiana_999": "What place it this btw?", "itrickyster": "\"Silly desire\" 😂😂", "sonali.08": "true true true", "kattankappee": "Yes! Yes! Yes!", "ramandeepkhurmi": "So well written piece ❤️❤️", "anusha_2711": "YOU ARE AMAZINGG!!❣️💯", "amar_jeet_8791": "It...looks....Like...u have constipation.....(don't mine ..my words... just trying to be funny) @redheadwayfarer", "vivek23742": "ass 😍😍", "rishxp": "To the ones who are watching this right now, if you find any hateful comment kindly hold on to the comment by pressing it for a minute and then click on the ⚠️kinda icon on the top right corner of your Smartphone and report it under 'Hate symbol or speech' and that's it!! VOLAAS YOU ERASED HATE :)❤️have a wonderful day and to the ones hating on her, Hindi Mei he bolna padega \"Apni nunni ko ja Kar hilate raho ouri Zindagi matherchot log\" #saynotohate #reporthate #erasehate", "vishalvirtuoso": "Caption 💯💯", "anushaanushaaa": "yesss. Thank you for saying thisss. 👏👏👏👏", "vivek1325": "Nice one", "_wild__cat__": "Could you please explain me what is 'love at first site' i mean everyone says ki looks does not matter in love so how they fall in love just by seenig someone....Do you believe in love at first site..?????@redheadwayfarer", "srishti_infinity": "Yes 👏 I can totally relate to these words. I often feel guilty if I'm dressing up around men as if it's just to get their attention. So I try to dress down so I don't give out any \"wrong signals\". Ugh!! It's exhausting really. I mean It is all in my head 🙁 I wish to be free 💔", "aishwarya3107": "However busy I am, but I always take a pause to read your writings. And 'why' is not even a question. You are such an inspiration to me and I am damn sure plenty of girls out there feel the same. Your writings make a great impact on not only girls but also alot of others. Me and alot more girls, we look up to you. Thank you for making us feel beautiful each and every day. Thank you for making it realize. Love you!", "veggy.eats": "❣️❣️", "sugarcoatedhatred": "You are amazing ,I love you. Thanks a ton for boosting our spirits 🖤🖤🖤🖤", "samarth_00": "💜💜💜💜💜💜", "sparsh._.arora": "Erhehe", "unnatural__entity": "I used to follow her a lot earlier but nowadays her posts have just gotten to be the centre of weird half naked photos and the captions which conveys feminism in a wrong way. No doubt you should love your body but there is no point writing a whole long ass caption for that badly taken half naked picture.", "an.and7465": "😍", "_abe.bi": "You are everything 💓 I can't believe how you can be so true about the things 💥 you are so inspiring", "shubhasheesh_sharma": "ganda...", "kibokimum": "You said it. I guess we girls just tend to feel guilty. Somewhere we still think that any negative or critical comment on our post is our fault. Guess no one really told us that our bodies are truly ours. And somewhere we still are unsatisfied with how we look. We still crave for that positive reinforcement from others. Like beauty is in the eye of beholder and that beholder is always another person. Never us ourselves.", "simpsonmyers_": "Yess 💯💪🏼💪🏼💪🏼", "avengers7777": "Hot ass... plz wearing hot panty", "rupak_3_": "DAMN THIS IS EXACTLY WHAT I NEEDED TO HEAR 🌈🌈🌈🌸✨✨🔥🔥🔥🔥@redheadwayfarer", "koustav89": "Curvy ass😗😗😗😗😗", "purplerhapsody": "@ektakamra read this. And be as sexy as u want to be.", "abh.ay_": "Bum, funny word", "sorryraghu31": "Hot ass. Plz post more", "racsy92": "i don't know what your caption read but i would have used this caption \"dirty ass\" 😂", "shrill_sorvi": "Oh girl❤️❤️❤️❤️", "divyamaben": "🙌🏼🙌🏼🙌🏼", "neelima_nair": "❤️", "yusra_rafique139": "You're unbelievable❤️", "hetan_ashar": "Sand shape's like a butterfly....another piece of art...🤪😁", "temi_x0x0": "Such an inspiration ♥️", "iamjohn_baron": "Why are you showing us old ass", "_nalini_singh__": "Please take a bow ❤️😭🙌", "naynesh_7070": "Nice", "vanisubramaniam": "Thank you for this post 😍 more power to you", "roza_sinha": "Awesome❤️❤️❤️❤️❤️", "gunjanbara": "Aptly said..and for the very same reason young kids or people of any age group mistake being attractive/looking presentable as garnering attention..right from the childhood,we are told not to wear makeup,shorts or anything revealing..if we looked good ..the compliments would come right away added with \"who are you doing this for\"??..had it been taught that personal grooming is for you own sake this would not have been the case", "vikram_vashisth": "Silly desire with no real reason ? 🙄 Hmmmm .. by the way, social media is a good mirror 🔲 .. appreciate your courage 🖖..", "aniketacharjee": "Awwww!! Sweet ass!! Wish i were in thong", "sweety_gautam_": "Ap log kya sochkr y pic post kr dete ho. 😡😡 ... Kitna b achha bolo eske liy aap but.. Y glt h. 😡😡😡😡", "puchku.thecat": "You go girl!! 😘", "itsaestheticbarbie": "Caption on fleek 🔥... So much power to you 💚", "gursheeenn": "You have no clue how much I love you right now! Reading this brings back so many memories, mostly bad and Hats off to you lady for bringing this up like this♥️", "rishab____singhh": "Ewwwwwwwwwwwwwww😥 ruined my day.", "iamstutisharma": "How many times this thought has haunted me!! Thank you for voicing it @redheadwayfarer !! It's so silly to assume that a woman wants to look good only for someone else. Why can she not want to be her perfect self for her own self. I didn't dress up for your eyes, I like to see a good reflection of myself when I pass glass doors. If you call that being 'self-obsessed' so be it, I'm learning to love this flawed body because well, it is home to my soul. And I can decorate my home any way I like. You do not have a say in it.", "guptanilanjana123": "😂", "poetry_weavers1": "Love you loads. .❤️ seriously you are best ❤️", "_sam_._sung_": "Absolute stunning caption👏", "mom_bae": "Your caption @redheadwayfarer 🔥", "mommyontoes": "😘", "meghan_ghivari": "💯💯💯💯", "iamnihalbali": "Sexoooo", "irishabsinghh": "Oh fuck ...kya dikha Dia bc 😂😂 mood ki ma behen ek hogyi👎👎", "keshhhhh__": "Lit always captions ❤️❤️🔥🔥", "vikrammehta934": "Beautiful ass"}