{"cobra0077": "Cheap", "rahull_2733": "Over acting for the camera. Get some life girl.", "indecisive_libran": "So much drama", "alankriti.aishwaryam_": "U r woww😍😂😂", "oneanah": "@manishamitra0 @oshin.roy @pratishtha29 @shubhi27 @antara.26 yaar mne esa drama aj tk upload ni kia vlog k lie.. I missed it man 😛", "akshitzameendar8581": "Hahahah loved it", "namraislam": "Run", "hyper.fine.poet": "@nehathureja", "nandini.0": "This is super awesome! @rutuja_gangale @anisha._.singh @redheadwayfarer", "pavani_nagpal": "@saloni_29 be like her", "saloni_29": "Hahahahah so cool 😂 @pavani_nagpal", "_kritika_singhhh": "Love this😉😉😄😄😂", "giriknarain": "So you think Shaming him on social media would help? Wow you are one of a kind hypocrite. It would have been better without you posting a video and embarrassing him.", "prerna_88": "Rude. He seems embarassed and the woman got a trophy for shaming him. So lame", "abhijeet_mahat0": "Great job ! Di .... it was really funny ... who keeps tampons with bleach ... hahahaha :) :D #keepinspiringus #loveyoudi #bethechange @redheadwayfarer", "mykomehra": "Women products like tampon should not be considerd taboo and you tought him where they should be put. Which is right. But dont you think, that even if it is not your intention but unlikly making a video of him when he is embarassed totally. Consider it Di some people are not at that stage and forcing our opinions on them will only make it worse. I like what you do for women freedom and i do support it but this is not right what you did here", "unschooledartist": "@_ru_ba_ru", "ishani_deshpande": "@swapnilbokil", "pandyamaggi": "😂😂😂😂😂😂😂", "___manuyadav": "@babyangel_priya", "stars_vhf": "Lots of love❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤", "shynaa1234": "Omg😂😂😂😂 I love you Mann!!!😂😂😂❤️❤️❤️", "moupoka": "😂😂😂😂", "sanjeevni_kapoor": "👌🏻👌🏻👌🏻👌🏻 @srishti_.jaiswal", "priyankasinghania67": "Damn this is crazy @srishti_.jaiswal", "that_hungry_stoner": "Hahahahahah, this had me in splits!!!", "sonali____p": "👌👌👌👌", "jaishree.bhardwaj": "@tanmay_singh_v", "shaikh_imran29": "Lol it was easily visible where it was b4 rather where u kept 😂😝", "prachiigodbole": "@vishaal1990", "lady_j_obsessed": "A big ❤ to u @redheadwayfarer ...day by day I'm learning something good from u", "ronika__sharmaa": "And I like the way you explained him :D", "vishal_biswas22": "@avneet1107 tbh this girl blames men for every other reason just check her posts n when I post a comment she n her girl group will literally bully you so it's so hard for guys to say even anything against her bt I think wat she is doing is so wrong,bt as she has a bit of followers she gets away with everything.", "nabangshu11": "@arijeetbhattacharjee", "suvasiyaanil": "&start using Tampons.", "gutavantika": "It's pharmacy and not chemist @bindiia you should have paid attention to her education and studies , ma'am.", "amitaggarwal8": "Jj @iamannil", "srishti_.jaiswal": "😂😂 @sanjeevni_kapoor @simran4178 @priyankasinghania67 @simran_jaiswal @v.aishn.avi", "jhalli_nalli": "@emotions_and_words", "veeee14": "@swarnima17 I love her", "swarnimaaaaa": "@95vaishnavi she's amazing man", "sanjana_mortha": "@praveena_sirigireddy", "simran4178": "Ohhhh gawdd😂😂 @srishti_.jaiswal", "purba_das": "You're a true inspiration. @redheadwayfarer", "raj_patel_1993": "Hey u speak to hindi 🤔🤔", "ree__.__": "Wow... @_.the._.troublemaker._ check this out.", "afshaanverse": "I can't believe people are actually talking about hurting the sensitivity of people who aren't doing their jobs...rather than talk about how stupid it is that women don't have open access to tampons and are given Detol instead ...", "dipsu_02": "Nonsense", "subhan2stoner": "Pharmacy* @redheadwayfarer ☝🏻", "shutterbuggore": "Absolutely fucking pushing it", "__namrata__98": "@aitreye I love her. ❤", "rituajwani": "Oh damn😂😂😂😂 this is unbelievable🙈🙈 by the way I loved the way of your teaching! You are super cute😘", "ahanamisra": "@rashi499 @pragatisharma097 @dhvani_tanna @sinjinigupta", "go_run_shetty": "👍🏻👍🏻 the guy was listening patiently .. Superb explanation!", "narenbhalla": "@anoukshasingh ou", "two_words_and_a_finger": "Thats true.....", "cristiano_da_kunal_dos_santos": "😂😂dukandaar Ka samne se itna beautiful ladki ko dekhkar boti he bandh ho Gaya that😂", "roopanshixsaxena": "@manvillous @zikra_siddiqui @vanshika710", "aeshy": "This is Hilarious!! Well done🖒", "abhimanyurakesh": "Me:look.. He's put Tampons on wrong shelf because he's not educated enough... Let's educate him || Also me:let's get the camera and humiliate the shit out of him😂@white_silhouette_", "nishchay312": "@taanishkadhaawan i think u speak like her😜", "garamgulaabjamun": "@avneet1107 she told him what the right thing was. Finished. What was the need to publicize the whole event? Isn't she like actually encourage spoon feeding. Girls need to stand for themselves because they can. Not because Saloni Chopra wishes.", "xxchiggixx": "Hahahahahahahah harass ? Likh rahe jab ki hua to lol hai.😂😂😂 @redheadwayfarer", "kritikakushwaha_": "Omg same story! I asked the for tampons and got a blank face from all three people in the chemist store. And right before I was leaving, I happened to see them from the corner of my eye, lying on a shelf with cosmetics! I then had to educate the men and had the tampons displayed at the correct place along with the other sanitary napkins.", "shravnibhave": "Why do even people follow you and your nonsense?", "sohipvt": "Check dm for once please.", "_fatlips": "@shizziya_zh yeah they definitely should, but I'm just saying it's not his fault if he couldn't get an education. It's easy for us to be mean to him about not knowing these things but I don't think we're taking into account our privilege. It's unfair to blame him (or people like him).", "nuttyzarry": "It's sad these chemists don't have basic information about tampons!😐", "pragati764": "You are awesome.", "evil221195": "😂😂😂", "mukti_mahajan": "Lame n useless post ..", "__muskaann____": "Doing a good job is not always about impressive innovation. Sometimes it is only about doing something plain dedication. Well done.💞", "gouravtalreja": "I following you for all your bravery posts and I highly appreciate what messages you convey, those are really impactful and infact it changes our vision that how actually we boys should treat or behave. But I don't know this guy must have enjoyed but publishing his face just for all giggles and mass support for feminism? Post doesn't allow me to comment if I am offended? I would not say that I am offended but that guy is publically insulted and you are the one behind that post. You're a 🌟 lady but it's really depressing. I am Not against you but I never thought your post will get biased one day.", "calmadil.sultan": "@gouravtalreja i agree bro", "shweta.ghosh_": "Yeah it is all cool and great that she wants to make our country better.. But she has no right to speak to someone in that tone (irrespective of the gender) I mean he is not your servant.. He is a God damn grown up man who works for himself and his family just like any other person does..just because you promote feminism that doesn't mean you have the right to mock innocent men like that..(yeah I said innocent because he is a chemist and he didn't try to insult her or harass her by putting tampons with bleach) Feminism should be purely about equality and not women superiority, right?", "parth_mehta9393": "😁😁👍", "_is.nobody_": "This is kinda... Best possible education...that someone can give in about 46 sec..❤😂😂😂 loved it... 🙌👌", "nootnootfool": "@tanaaya_kudalkar_13", "______starstruck": "😂😂😂😂😂😂😂", "mavericklupino": "Speak out 🙌🏼👌🏼👍🏼😇👏🏼🤗", "__mewmew_": "@redheadwayfarer Thanx for this video ...😘😘😘😘 .....people generally don't know about tampon ....and its really important everyone should know it....they should don't feel shameful to talk about this.....", "psygalaxxy": "@aurora.whorealis 👍🏻👍🏻🤣", "blue_jayyyyyy": "I like saloni a lot bt that wsn't needed actually. He ws embarrased n is mocked at by all ur fans fr smthing he didn't know.. @redheadwayfarer. Lv uh otherwise :)", "perry_arora": "@mynamespat well.. I don't think that this video will pull him down , and it's not about hateness for male community. and bhai saloni ne us ladke ko bade pyaar se samjhaya and he smiled. Isme hateness kaha se aayi? Or VERY WESTERN CULTURE? How?", "shinjinii": "I really don't think tampons are available in India.", "_.shrutznair._": "My god dat guy's face ! LMAO", "anyasuslove": "It was actually so shocking for me when I moved to India and couldn't find tampons in a store. Also when I asked for condoms they made huge googly eyes", "kunwar89": "😂😂😂😂😂", "_shristi_singh_": "@redheadwayfarer Bht sahi di 👏🏻", "aparna_halder": "@_saurabh_baunthiyal_ sorry saurabh i really feel sorry for you... I know where its coming from.. Tumhari pdhne ki age hai nd u r using insta... Education is not bad for ur health.. Padhai ki hoti toh aisa comment dalne ka socha nhi hota.. My dear child educate yourself.. May god have mercy on your soul... 😌😌", "sana30may": "@aparna_halder aise So called bacho k school jane s School ki insult hogi..Inhe Education ki koi jarurt nhi hai ...aur ye bacha hai bacha?? ..No way..I am feeling bad for his parents", "bindiia": "😘😘the guy is so so so cute and kuddos to his supportiveness 👍 he just smiled all the way through ... ha ha .. and saloni your hair looked awesome yaar ... you little pig 🐷 you don't spare anyone ... ha ha ha .. love you beta", "salonichopraofficial\nVerified": "Verified", "ritu2564": "Hahahah... Love dis video 😀😀😀😀😀😀", "aurora.whorealis": "@vishal_biswas21 tampons have nothing to do with sex. I suggest you take a basic biology lesson, there's a big difference between having a period and having sex and it actually makes you look like a real idiot when you say such uneducated things on social media.", "yangzomtenzin": "@yaaja_sangmo @tenzinyangkyijampel", "dishaa__12": "@_saurabh_baunthiyal...... apni bakwass band kro ok.... go get a life. ... and yess don't disturb her (@redheadwayfarer ) time ..... coz tumhare jaise logo ka kuch nii ho sakta.... your head is full of shit.......😑", "taelicious____": "@eeshamisra 😂😂", "maham.khaan": "😂😂😂😂", "misbah.azam": "😂😂😂😂😂😂insane", "mjsuniverse": "ur voice ❤️ keep it up 👍🏻 keep promoting women empowerment 🤘🏾", "_vishram_": "Kyu Mar rahi Hai bichare ki", "_saurabh_46_": "Chuud mote hoge", "feeoze.in": "Feel sorry for that guy 🙁🙁🙁", "naam_rahul": "@manisha.2303 this is so true, he is just not aware of things and I know he should be but still one can modestly tell him about where to do the positioning of product lines. She is just bashing him and captioning blaming the system , why? Just cuz of some likes. Hate this virtual lingering of self portrait by this lady .", "could_be_a_cheesy_username": "@mukul_negi95 Desh ki tarraki dekh lo", "happy_soul____________________": "😂😂", "boris_707": "Loved the way you spoke. 😍😁", "tanvi.jainn": "One of my friend's said that i am not a virgin anymore because i use tampons...and the other one thought that i used it have orgasms!!! Like really!!! Grow up boys🤔🤔 @redheadwayfarer", "danieledemetriadess": "Hahahahaha😂😂😂😂", "kari_malv": "Speak up! Speak up!", "arshia.jain": "@leeshanayyarrr Omg we need girls and bhaiyas like this", "jhha008": "Love ur bra", "surbhi2107": "@apekshadass @vanshika.pawar97", "0_louie_0": "@priyankasamtani", "manisha.2303": "I don't understand why you had to humiliate that chemist! Feminism going too far! Had this been done by a male customer to a female chemist for the search of condom, the scene would have been different.", "writer_neerajsk": "That was a really interesting video...", "richika_chauhan": "@capsbestgirlz she..", "husain6699": "Good job", "my_storybuk": "😂👍 well done", "im_apoorvsharma": "If a peeson is not having enough knowledge what it is, why to humiliate him on camera...", "itskoko0810": "He doesn't even care he knows nothing", "aslam3455": "😃😃😃😃😃", "diyanarag03": "@niyamat.narang", "ba_foodie": "Hahaha nice one but i guess posting it here is a bit humiliating for a human being", "raahulpandey18": "Love saloni", "niyamat.narang": "@diyanarag03 haha this is amazing.", "lenstag_official": "😁👌", "eeesssaaaaa": "@_samiksha__", "sugandhh": "I know main iske saare posts padhti Hu.. Faad hote Hai 😂😂 @jaanvi_17", "eshadhiiman": "@pagal_ldki_ this girl❤", "_rashit_thakur": "hahahah cute! ❤", "kj_kaajal": "U go girl.. 👌 @redheadwayfarer", "___mp31___": "😂😂😂😂right", "imbigeye90": "Hehehe u r awesome", "erasruti": "You are awesome 👏🏻😘😘😘 @redheadwayfarer", "snigdha_malhotra": "@jhanvi_anand looove this", "iwearmyself": "@redheadwayfarer Went through the same situation. Chemist had kept it with bandages. I told him what it is and where it needs to be placed ☺", "monks_01": "@mohitmakhaik 😁😊", "kris_go_cool": "His face though 😂", "priyansh_jain16": "Pharmacist is the word you're looking for and calling him a chemist makes him a little overqualified. @redheadwayfarer #gammarnazi Yes! we are everywhere.", "subhedarankur": "@winsome_vartika .. hehehe... I also said da same", "shubham0718": "Gud job 👍👍👏👏", "suranika": "Omg hahahahahaha made my day", "i.vanshikamittal": "I love this video 😍", "_parthpathak": "Damn...aren't you a savage!", "ayushisingh01": "Damn😂😂totally epic", "shrutikylie": "Oh god his face thoooo😂😂😂😂", "pia15rajput": "this girl😆😆😆😆😆 every time I see her n I fall for her acts😍😍", "crazy_curly_barefoot": "This was epic", "savio_ryan_noronha": "O God... U need to check pharmacist in Goa..@redheadwayfarer", "kaushik95v": "Male and sensitivity bc!!! Yeh kya hai😂😂 equal rghts shld be given to grls dey shld enjoy evry thng!!!!😂😂😂😂", "sheffaaaaali": "@ishita_sachdeva i love herrr!! See her posts!!!", "riyapandey_____": "😂😂", "visshu_20": "😂😂", "purohit_manmohan001": "Kya chutiyaapa hai ye ... 👎👎👎", "shaileenp": "@saumya_vora", "hazzziam": "\"Go check the fridge, I don't think we have it\" 😂😂😂😂", "avniii._": "😂😂 true tho!!@lymarinaferns", "vaiiiid": "💓💓💓💓💓💓", "alwaz_hongry": "#respect .. 🤘", "_sonal_d": "@nikkygryffindorr", "heena_dodeja": "@kiran_wadhwani", "jassleen3333": "❤❤", "richaarawat": "😂😂", "durbzi": "@redheadwayfarer FYI, tampons don't have bleach to promote fairness, it's there to make the cotton white. It's how all non organic tampons are made! 🙂", "_sanober.shaikh_": "Hahhahahahahah.....That was epic", "vartikashuklaa": "@redheadwayfarer dude its's not chemist it's pharmacist!! Understand the difference between the two", "22_walking_paradox": "Hahahahahah😂😂😂💯", "__li__sa23": "@roopal_behera", "planet_indrani": "Ultimate @redheadwayfarer", "udita_basotia": "👍👍👍", "iishiitaaaa": "@gunjannegi80 what if we go to a chemist and like this?😂😂 They'll surely kick us out and call our parents.😂😂 Anyways it's a superb video, don't ya think?😍😍😊", "jaanvi_17": "@sugandhh faad hai yaar yehh 😂😂", "anasua.chowdhury": "This one's crazy 😂😂 seriously what the hell but?! Tampons with bleach 🤔😰", "gunjannegi80": "@ishita.a.a yes🌸👏👏", "__hemapuri__": "😘😘😘😘😘", "anurag_saxena1": "U r so cute 😍😍😍😍😍 @redheadwayfarer and an amazing being 🙈😍😍😍😍😍", "zair.al.bahr": "@aditi2698 @rhea_jain1o didi , watch this", "pritisingrodia": "Epic 👍", "helly_1011": "Hahahahah!@ozapruthvi", "__ranny_09": "@muskan_choubey22 😂", "ordinary_meee": "Proud of ya, girl! @redheadwayfarer Most girls won't even say the tampons out loud to a guy in shop. Let alone telling him what it is for. Don't blame 'em either, that's how girls are brought up in India. Taboo is to be blamed. It is the one to be fought with.😞", "the.confused.soul": "@redheadwayfarer Oh my goddd!!!! I love this and this is so true. You rule man and this should be talked about. It is about time that people stop treating sanitary napkins and tampons like some cursed objects. You are one of the most amazing people I've ever seen and you never fail to inspire me.", "meet7301": "🙌🙌🙌🙌", "yashi_2106": "Aapki himmat ko main salute karti hoon", "drashtivadhel": "♥️ @_samritha_", "bhuyasi27": "Mad", "vaiishnaveee": "😂😂😂epic... girl u r the best", "divyataaaaaa": "@khushboohemantchanglani @divi.saxena.23 @diya__ahuja_1210 😛", "ashminotasmi": "I wish I could meet you", "shreya_gupta111": "Hahahhah😂😂😂 @mallika_29", "aquib9018": "Damn good video", "thatawkwardextrovert": "Hahahaha damn good", "saransh_sj007": "Itna toh literate hona hi chahiye! I mean, dukaan kharid liya par dimag nai h uff. Itna education is must dude. @bh.avy.a", "goldy_matta": "U are an amazing brave girl 😍😍@redheadwayfarer", "bds_manu": "Hahahahahaha", "aquarianwallflower": "You killed it this time... 🙌 @redheadwayfarer", "jeniston_22": "Cool girl! Love this video spreading awareness good work👍 and your hair color 👌", "punam.vaja": "😂👌🏽", "varnika_pb": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "pshredder": "Hahahahahaha this fiery one is at her best... I don't know why do I follow you but I'm glad I do.", "alohahahax": "Epic ❤", "snap_attack": "@redheadwayfarer sometimes the product is kept away because the other brand pays to keep their products upfront. Not always the shop keepers mistake.", "ahelimitra": "Hahaha this 1 is hillarious", "himani_saxenaa": "Expression of the shopkeeper...hahhhahhaaa to funny. ..love it", "kia_2512": "😂😂😂😂😂😂", "thedishabasu": "GUYS GUYS GUYS! The whole point of recording all this and posting it was to remind you guys that a whole lot of people don't know these things. Yes, @redheadwayfarer could have stopped after teaching him, BUT she posted it. Because she wants you all to also do that. How will she educate the whole nation single-handed? WE have to also teach people. Keeping tampons along with facial bleach? Damn no! Shopkeepers need to know the difference, and who would make them know? We! So please don't say she shouldn't have humiliated him by uploading this!", "tiyashakrishnatrey": "Honestly I didn't even know tampons were available in India 🙊", "political.junkie": "U nailed it...Love u fr this!😘😘😘", "juneja_vinny5": "P. S. @redheadwayfarer u go girl.. i adore u to the core.. loads and loads of love and respect to u.. 😀", "mehra.clicks": "😂😂😂😂this is best of the day", "kiin_iss": "🙄🙄🙄", "govirago": "I love u @redheadwayfarer .......seriously u are awesome😘😘😘😘😘😘", "__advaitha__": "@redheadwayfarer I love love love this. So truee. It should be talked about. And I love how you never fail to inspire me :)", "mallika_29": "@shivangibhat @shreya_gupta111 @rupashi_wazir This😂😂😂", "siddhant_mahant": "Salute you mam 😅👌", "arthascloud": "😂", "dakshgupta": "Go girl go, these are the things which india need to learn, One should be ready to change and open the horizons of mind, At least you today changed someones perspective! lots of love😘☺☺ @redheadwayfarer Each person counts!!", "pratibhaberister": "Really salute you. @redheadwayfarer saloni. The guts u carry are just phenomenon. And look at the guy. 😂😁 he is just confused abt what's actually happening here.. 👍👍😘😘", "satyajit_purkayastha": "@redheadwayfarer uska mu dekhne layak tha...😂😂 he was like...pehli baar dekh ra hu ye sab..aaj tak iska use nhi pta tha 😂😂", "___dishaaaaaa": "Solute you @redheadwayfarer nd pharmacy should be sensible", "shibani_gupta": "Yoo Baby she nails it each and every time @im_bb31", "ananya_mohanty_": "why to uplord this think .... u can say him if he had done a mistake .... so why to do this funny story 😤😈😡", "swaamialmeer": "Ha ha .. true.. the look on his face🙊", "prawat19": "Bravo 👍", "mandyarijit": "now this is epic 😂😂😂😂😂", "xarunimax": "It is so depressing to hear that tax is imposed on this basic sanitary necessity. Dafaq ,I don't know what sort of tax is associated with this stuff, service tax or what ? this is sick. Hope , this unnecessary tax is soon lifted from this fucking basic requirement.", "debakhikhikhi": "🙊😆", "anujjoshi21": "😂😂😂😂😂", "vanshikawithoutsurname": "@__nikku_saroha 😂", "aakanksha1512": "@redheadwayfarer my my my!!! I really love the way you write about thoughts. This is seriously the best things I have ever seen on any social media sites.", "shub._d": "😂😂", "manoj.hj": "Nice job👏👏👏", "yyashasvii": "You are amazing @redheadwayfarer ☺☺☺😘😘😘😘🙌🏻🙌🏻🙌🏻", "natashaaajwani": "Damn!!! This is one of the best thing I have ever seen on social media!! Lol. Those expressions of the chemist. Kuddos! Yes I agree people need to be educated & awared of these things!! Only theoretical knowledge can not make a person intelligent.. Practical & actual knowledge & awareness is as much important.. Thank you @redheadwayfarer You are doing the Best for this world. Your little little steps will definitely make this world a better place! Much love & respect Inspiration🌟", "twiin.kle": "Wohh..gr8", "harshalagrawal01": "Aaisa baap re @redheadwayfarer", "wear_urstyle": "This is amazing .", "varshikaaaaa": "Hats off to you😂👏👏", "_aafu_08": "@uzii_25 @sana_gigani @srishtii_rao @arshi.shaikh.73 @saamiya_qur @neha__12 @niyatiiii._", "disket_akke": "Doesn't mean to post a vedio n making fun of him..i used to be proud of ur work but please not at ths point..u can let him understand normally..others who r happy wd her the post thn u all r dam silly", "quarantined_man": "@dish.direction 😅😅", "hackhm": "Dra diya use to", "glamorbysharry": "nice good", "mayank_no_where_is_now_here": "#tajmahal", "ozapruthvi": "@fortune_1011", "anvitamudbidri": "@damitamenezes hahah she's the best!", "narsim206": "Check d fridge?? 😂😂 Rofl", "priya_24_30": "Ua amazing", "the_flying_pushpa": "Nailed it ... When ever i ask for differnt differnt sanitary napkins insted of just picking one and moving straight to my house ...the shopkeeper stares me like i hv done some sin", "_mansi_lohia_": "The main idea behind this video was to motivate people about sex education . I don't understand why instead of seeing that people are talking uselessly about the guy . Inspired by political parties ?", "ibombets": "Epic", "kuldeep_sirana": "Just look at his face😅 and he didn't even had any idea what was happening with him😕😅.. \"Raziya Gundo Mein Fass Gyi\"😅🙉 Saloni you Rockkk !!! As always😏", "sritama_saha": "@redheadwayfarer you nailed it again girl 😂😂😋", "meshilpa2708": "😄😄😄😄😄 u rocked babes", "_aarshin": "Hahaha! Love the postscript!", "suninmysmile": "I was in India earlier this year and although only there for a month my period came twice! I'd brought enough pads from home for one cycle then had to buy more for the second. All I could find were scented ones! Not my preference but that's all I could find in the supermarket. The message seems to be \"your menstrual blood stinks\".", "_little_sparrow_o.o": "His face...lol😂😂😂", "ishaanegii": "@redheadwayfarer well said...", "saumyaswasti": "@iamzaryab read the caption bro, he was a friend and helped her shoot the video.", "sus_dutta": "😂😂😂😂😂😂😂😂😂", "dishab01": "👏👏", "zazencandles": "@redheadwayfarer The cloud story 👌wow! Is that DIY or bought as it is? I Sooo want!!!!! X", "pankajcr7": "Hahahaha ure so funny😘", "spicycustard": "@redheadwayfarer ...you are too cool!!", "muskan_saluja__": "@nayantharabalagopal", "_ag8st_": "@redheadwayfarer I swear uss shopkeeper ne pack ka size dekhke rakha hoga tampons bleach ke sath 😂😂😂 aur \"tampons\" ye usne pehli baar suna hoga for sure. I showed this video to some of my frndz & the reaction they gave was \"bhai ye tampons kya hai?\" Then I explained them everything about tampons. I WAS SHOCKED\" 17-18 ke logo ko bhi nahi pata that what are \"tampons\" sex education is a must in our society. Agar halat aaise hi rahe to our India is way too far from the title of \"developed country\"", "mynamespat": "Ohh come on.. have u seen the expressions on a lady chemist when u ask for a condom.. get over this hating the male community.. maybe ur very western and thats very good but stop the hate and finger pointing.. u portray as if only males are short sighted.. if you want to create awareness, put up some videos when females are behaving awkwardly too.. that will project the true society we live in..!!!", "ritsdamedhar": "Omg😆😆U r d only 1 piece in dis world... No one challenge u koi b chij m😅😅 outstanding job... Lv u always", "burhan_mushtaq": "So damn rad! 😂", "poojavishwash": "Lol😂😂😂 You are so damn good. @redheadwayfarer His face😂😂😂", "pallavilodhu": "Did you really expect him to ha", "poojasharma6077": "To funny", "dhritishmitaa": "I love you @redheadwayfarer ❤😘", "poojasingh__9": "Hey there Saloni ,u are the best 😍and I love ur writings 🙃", "ritujit_vrushan": "Love this video 😂😂 @redheadwayfarer", "manishibist": "Hahaha omg u rock😂❤❤", "jigztatsme": "Btw to become your friend do i have open a Pharmacy now 😊", "sugandha.mehta": "I love you for what you do!! I am your fan @redheadwayfarer", "imperfectfairy": "🙌🙌🙌🙌🙌", "roma_shetty_": "Superb 😁😉", "thenextchaos": "Poor guy 😂😂", "sonupriyas": "Plus at times I feel you are a hypocrite. Oh by the way aren't we all? And you are no exception.", "im_bb31": "@shibani_gupta 😂😂 she . Nailed it ❤❤❤ mch luv saloni @redheadwayfarer ... n m so so moved by ur each post baby luv watchng tht how.. ur so concern bout d basics eductn tht's needed in our country n how people of hre r ignornt n avoid sch baiscs .. necessity in daily lyf luv u baby 😘😘😘❤❤", "kash1117": "Idk why people are crying over it when she clearly rote dat he is her chemist BUDDY n HE ENJOYED SHOOTING wid her 😑😑 !! Wen dat chemist guy aint havin problem wats bugging u ppl 😂😂😂", "sancha_sancha": "you need to run india full stop 💥", "rishab12_12": "Nice scene created by u guys to make it look so real so the people watching this video will think its the mistake of the chemist,nice acting too done by u guys😂😂try more better next time", "laxita": "Did you have any right to go mortify that poor guy? Ofc. Educate India but don't be a dick about it with superiority complex", "prachi_parwal": "@areebaalvi_ ...Just listen to it..!!Soo true...Why can't boys understand this...", "anikate_monish": "Looking pretty", "blue_moon_8": "NOT make u fair..... LOL 😂😂 @redheadwayfarer you are LOVE😍😘", "muskyaaawn": "Sheesh😂😂 @hammer1399", "divaamahajan": "Amazing...", "zeezeeazezzu": "🤣🤣🤣", "ainytaloh": "Hahaha amazing @redheadwayfarer", "mukherjeeankit8\nVerified": "Verified", "appsfizz": "If we talk about period Infront of strangers they will start behaving awkwardly , sometimes it feels like we did a crime , I already told my younger brother that it's a natural process and atleast he won't behave like this , he will respect every girl @redheadwayfarer", "shreya.margale": "💯💯💯💯💯💯", "ishapratap8999": "@simplysia that poor guy 😂😂", "vividharaghav": "@rahulsharma6391 agreed 👍", "mugdhagupta18": "😂😂😂😂😂 bleach and tampons.... REALLY!!!!!!!! 😹😹😹", "veggieshaaaa": "Ikr. This is so fkng good. @catwomanwithbooks", "_thatlemonade__": "@disha_basu23 I totally agree with what u said because ppl like her is needed to be appreciated and looked upon I hope she goes on inspiratig us .. why will she insult that guy she was just spreading what she saw and she said nothing wrong in it . She just wanted to change ppls thinking about sanitary napkins ...", "asmita__saha": "I loved the way you explained it to him! Really cool! ❤", "pallavi___singh_": "Bichare ki band baja di😬", "mo_hit_5": "😂😂too good 👍👍", "davidashishmanchala": "That is where you cross a line", "danya_guna": "@d_doll_j 😬", "divyaa_divaa": "Lol😂😂😂😂 u jz rock it saloni😘😘😘😘😘😘😘", "nights_of_lights": "😂😂😂", "catwomanwithbooks": "@satans_blessing I CRIED out loud this is so good", "shibayanm": "Yeah well I'm sure if he was that educated then he would have known where to put what. And on that note if he really were educated enough then he could have easily filed a report against you for including him in a video which I'm sure is taken without his consent. If you wanna #bethechange , I'd rather you educated him instead of humiliating him on social media. How bout that?", "_s0niaaa": "Seriously!!! hat's off to their education 🙄", "sanjnabhalla": "Amazing.. He looks fucking zoned out... I loved it yaar... 😂😂", "rahulsharma6391": "Right so post a video mocking the guy rather than educating him.. Agreed theres a issue while buying tampons but how right was it to record it n post.", "shipra._chaturvedi": "U are so rude @redheadwayfarer 😠", "aayushinathani": "😂😂😂😂hahaha..good work though🙈", "dawa_drema12": "Ua sooo cool 😃😃😃@redheadwayfarer"}