{"sh3rry666": "👌🔥🤘", "shruti.aisha": "😂😂😂😂😂 oh dear", "niralpatel.com2019": "I want to the the opposite side", "mdnaushad268": "Sexy ass❤️❤️", "the_hungry_dude": "Feminism Feminism Boliye,,, Kapde apne Kholiye....🙏", "__anujprajapati": "😍😍beautiful lady", "kapoorkaran950": "If followers gain karna hai had a face #fakefeminism😂", "saurabhdahale": "Good 1", "rishi.jha.777": "Nice to think about self👏", "jayantsharmasvp123": "👍", "dubifl": "No one", "ryan__007_": "🤮🤮🤮🤮", "ravirohatgi1986": "Nice pic", "akshatchaudhary28": "Beautiful!", "rajjat0410": "Frant please", "rk__md_kamran": "💋💋💋💋💋🏃‍♂️🏃‍♂️🏃‍♂️🏃‍♂️❤️❤️❤️", "mumbai_king007": "Enjoy laro beauty ko . Kaahe ko comments me ulti karne kaa", "ait_lhint_19": "Sexy🔥🔥", "rohhhrr": "They are only hater ,,don't mind them you are doing good of your ,,great artist 😊😋", "chicken.steam.plz": "Raaj kaha chala gaya ??😂😂😂 Raaj bhag gaya...", "abdulnaser525": "Beauty doesn't seen by body its glow by a sweet and kind heart😊😊😊", "ssreetama24": "Though I respect you a lot but sorry dear according to me, equality doesn't mean being topless and posing infront of the world just because actors do the same. You have a huge fan following, which includes a large number of teenager, and I think some of them follow you blindly. I don't think this posts of yours will create a good impact on their morals.", "sumadh_singh": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "parulsaroha": "💛😍 looking hot 🌼 I appreciate your efforts n u r getting hate comments as well it is a war Bebe because we female have to put our efforts in the women freedom the empowerment we will win the things one day our contribution will work one day , we r facing issues but our next generation will be proud of their surroundings", "street_styleindia07": "It's just a way to increasd her likes Nd following... Fuck her!", "its_deepesh_737": "Agr tum bhi uss raj ko dhundke gali dene aaye ho to bhai bhot acche insan ho tum @redheadwayfarer", "ikingshoaib": "🔥🔥🔥🔥🔥", "namyy_2909": "She is such an inspiration....girls love you", "thunder_stormxx": "Woooow came here after that #randihogiteri post you guys really made afuss here she looks fine in her picture", "_._nishuu_._": "Caption 😍😍", "sharon_justace": "😍♥️", "time_traveller_50": "Who is John Galt?", "the.east.wind666": "I thought you posted this bcoz u wanted to be free. But you're getting naked just to look who comes to stop you. Wow women are really working hard.", "meraki_jo": "Every women should love themselves....like the way u do......aside their insecurities", "11_abhijeetdas": "You go girl!!😌", "themanisingh": "Its your feed. Your life and your body, express yourself the way you want.. ❤️😇 hater will hate, gaandu saale.", "ultimate_tigerholics": "Oye m to us kmine k cmnt padhne Ayi mil hi ni raha", "meet_a_mou": "I never expected so many women putting out hate comments.Woman doing this to a woman..shameful..", "mebrahmin": "💚", "meeepednekar": "Like every guy evey girl has own space and self opinion to behave in this world..she can post anything she want and i support you dear..stay brave as you are because its just a matter of perspectives they will called whore to every girl even if she fully dressed with saree or something...", "ge.orgina543": "A girl has the right to do anything she prefers It's her choice.So don't judge", "div_daryani": "Caption and youuuuuu !!!!❤️ more power to you gorgeous ! ❤️🔥", "doni_rath_": "Umm it's her body - she gets to whatever she wants? This is not the 1800's anymore", "goan_boy_prashal": "Raaj kaha gaya.. 😂", "ravi07shanu": "Where is that @raj11119911 comment ?? .... I even searched his ID... Mere ko to uski ID bhi nhi mili.... Jitna confidence usne comment me dikhaya tha utna confident wo nikla nahi.... Yaha to bhai ne maidan hi chhor di.... Chutiya saala", "anshul_mishra24": "The best thing about this picture is....she won't gonna allow her daughter to do the same......just like my dad Smoked Cigarettes but when he stopped smoking....he asked me with the promise to never do the same thing...!!", "amitbhatt369": "Absolutely fab", "better_than_earlier_": "I m not against feeling flawless into your skin...but objectifying a women is wrong.", "dollorroyal": "💋💋💋💋💋", "parsatee._.99": "You have quite an intriguing spine.", "injila_hussain": "You're a sweetheart. ❤️", "shadab_mirza__": "😍", "_kavya_kamath_": "Equality is not about being like man, equality means giving a opportunity to a woman in a world where it is thought that 'she cannot do it'. Being topless doesn't show that you are equal to man", "_swatijha_": "Kahan gye raj..Saari simran tumhe hi dhundh rhi hai", "gurjeetkaur._": "Bold and Beaut ✨", "x.charchika__": "@_anisha.saha_ @taaake.a.nap @adrija_haldar oh God look at these misogynists getting all worked up and offended by this post. Dumbfucks lmao.", "urvashi.saraswat": "You are gorgeous❤️", "sorriraghu31": "hot front pose plz", "twishhaa_": "You look sexyy as hell❤❤ fuck people who can't mind their own business!", "vardha_rajput0707": "euuuuuuuuuu", "capricongirl_18": "I don't know what the world says but girl you look damn good.. I mean there are many girls like me who wanna try out and experiment with an attire.. And you can pull it off.. Thanks a lot for retrieving my and many more girls confidence you rock ♥️", "janv_mua": "Lol. I don’t see anything wrong with this post.", "tanvi.mhapankar": "@vaishnavigosavi_11 caption", "heart.on._ice_": "u r strong we all are with u and that raj just avoid him there are millions who loves you and support you", "prince_enchanter_": "To all those who are either butthurt or trying to conceal there Intiatives in terms of an abuse to an another person. First of all you are all idiots she won't give you any Oscar. So why not Change a guy in your circle who beats up a woman, abuse her better go and check him out and try to put this in his brain that freedom isn't a clause it's an expression her expression is in her relentless soul, flamboyant nature. Can't help it she's cute and adorable. That's all kiripiya soch badlen chaddhi nhi :D 😂 @redheadwayfarer Greetings from a traveller and another landhood neighbor.", "the__evolutionist": "Exposing your body isn't the way of accepting yourself @redheadwayfarer", "divyayayay": "More power to you ❣️", "anveshhiteshwar": "😭", "parijatrajpoot7619": "Kaha hai raj..? kaha milega hai raj...?", "nitish6862": "@redheadwayfarer ..now plz dont say ...\"FREEDOM\".....freedom is another thing....", "khushboo_shaikh23": "Guys its her life ..its her decision who r we to judge nyone yaa...no one.. so stop judging anyone just luking at deir outer appearance.. uh doing a great job dear uh continue..we dnt knw wats going in her life nd we like an idiot we have mouth soo we keeep on speaking bullshit...grow up guys", "cyndy_0819": "You really define the real meaning of self love and womenhood. It's just so satisfying to see woman like you. You're such an inspiration sweetheart. Your boldness and ethics are the ones that a woman should posses and wear stepping over all the negativity the society tends to dump on you. I've never wrote someone something that directly comes from my heart. You made me do that! Your essence made my morals of being a woman stronger. Thank you. More power to you!", "_unknown_artist_7654": "@sa.nakhan873 Woman is like a treasure and his man like a treasurer,treasures should be kept well protected and covered safely coz its just for the treasurer,my dear i can't explain other people round here about our thoughts and our religion coz they gonna understand nothing,so plz 1st a fall don't comment bad statements 2nd if ur brain forces u to do so stop bringing our beautiful religion in between ur bad statement talks,and we are humans we do mistakes if bymstkly u did both the things so atleast try to explain the people commenting on ur post that what islam actually is❤️.", "amit.routhan": "Ahhh beautifull like to draw your name on🌹", "pulkit_shanishchara": "Love the nudity of your soul🖤", "sweet_poisoon": "Want to see more pictures of this series", "wildfiresax": "Why are you not wearing any clothes and posting such vulgar pictures? @sharma.hardik15", "imnikunjsoni": "Gorgeous ❤️", "vanyaajoshi": "Weird fuck", "anya.gupta": "Lovelyyyy 🍋 ♥️", "sleelil": "Question is, HAVE you read Ayn Rand? Hahaha", "sonakshi1215": "@vishwesh254 yours looks like this", "lipsseduction": "I don't want to comment on any hate things by men but yes I would like to say all those girls and women who putting all their hate on her account are just frustrated by their lives... And i think seeing @redheadwayfarer enjoying her life, her body and her real personality makes them jealous. They thing putting their frustration on her posts will make them feel better but let me tell you she is brave enough to be what she is. She is not ashamed about her body, about her life that's why she is really happy. You girls can't support a human being about being herself then i am sorry to say you guys are just losers. 🙏", "abhishek__pandey1234": "I have read all the comments and suggestions here, everyone has spoken about her life style and her pic. But i Dont understand tht, why do we judge anybody , and she know what is good and what is bad for her 🙏", "windowseat222": "Follow for sky porn 😍", "mohd.faraz7": "💩💩😂😂", "nitesh.singh.16121471": "❤️", "iam_xaidshirazi": "Woh raj milra ni🤷🏻‍♂️", "ahanadutta24": "Either she shows her butts or back....ye sab dekha K she wants log bole Wah Saloni kya pic Dali h... Frame kr K ghar pe sajane ka Mann kr ra h... Such immature kids I tell u 😂", "kartikey_garg13": "Aphrodite ❤️", "sahastrabahu": "🔥", "kaava19": "I came here to find that message. So fucking glad his id has been reported. Way to go girl🔥", "alok2209": "👌", "shiva.nagare.946": "Wow killer look queen🌹😘💘👌", "shivam.rajk99": "For the first time when I saw you on the set of #got at #sjstudio I saw you guys are so hard working and so dedicated for your work. I wish I could work with you saloni Definitely whenever I will become something I would contact you for my project😜 Just kidding You already have so many things , you would have as well God bless you 👍 Never change yourself 😇 Really like you the way are 😇", "jhanvis123": "U r an idiot.. equality doesn't mean that a girl has to be top less like man. God created to be different and balance each other. Girls these days just want to be like guys. Grow up", "irfanshekh121": "Sexy🔥", "smita.kanodia": "This image is everything!❤️ Swimsuit is soo damn cute🤩 I want now", "adiscreethandle": "I love the environment and therefore, I love the plants in this photo 📸. I love women who are comfortable in their skin because I know how tough it is to reach that mental state after years of conditioning, therefore, I want you to know how much I love 😍 this post. I love 😍 spreading love and making people realise the beauty within them, therefore, I will comment on all of your posts positively now on to reduce the ratio of the negative ones. Hope you look at only the positive comments! 😊. 🙏", "saloni_solanki_meow": "❤️❤️", "chelna_daga": "Caption 💯 ❤️", "211sk": "I honestly love this quote and this book. So much power to you @redheadwayfarer", "suzanneree": "Ayn Rand was an awful human. She believed in classism. She is the hero to all the corrupt, evil oligarchs in my government (USA). She and her followers worship money and power. I have a great deal of respect for you and your stand as a woman and I cheer you on; but I have zero respect for the likes of Ayn Rand.", "niloufar_zaie": "❤️❤️❤️❤️❤️❤️😍😍😍", "ruchira25ia": "Woah!🔥❤️", "tute_huye_dilon_ki_daastaan": "Isha Jaisingh how would Sahil And UC felt after watching this???😢", "handeemyyyy": "you r just a fucking bitchh🖕", "yoke__the__joker": "What should i comment so that i'll be in ur next post??😂", "_shecomesincolours_": "@redheadwayfarer just here to say you that I have, I still do and always will love you from all my heart ❤️ more power to you 🤗 sending you lots of hugs and kisses. #strongestgirliknow 😘😘😘", "sarabjit.sanhotra": "Awesome post,some butt hurt male chauvinist, Need maturity filter for some kids here on Instagram.", "sunnygupta5909": "U r real beauty 😊", "hasan_umair": "Parallel", "vikrant_official_143": "Tb fir bine kpde ke hi rho n... Ky frk pdta h?", "priyanka.lamboria": "God blessed all fucking abusing males 👏 @redheadwayfarer u are the part of nature and I love nature ♥ I enjoying every pic of yours nice job keep it up😘😘", "anuj_bhadauria18": "Raj ko dhoond rahe ho?", "yogita023": "@redheadwayfarer you are amazing beautiful 🌹 btw I really like your lemon pantie🍋👙", "muskan_chhabra05": "😍😍😍😍", "sindhuja.gattu": "..", "moon_light_243": "Whom you are searching in the comment section?? Raj. 😂", "niveadas.me": "M not able to register myself your course. Please help @redheadwayfarer ☺️", "natashaaajwani": "Unstoppable! You beautiful soul❤️❤️", "suhas_naik": "\"Heere ko jitna chupake rakho utna hi woh chamakta hai.\" - @i_khush_boo 😂😹", "chetalikataria": "💋 more power to you, more shame to jerks💯", "ooty_sethu": "This is for all the girls who get inspiration from @redheadwayfarer...can you pls explain what is the inspiration you got from this post???", "akshatshisodiya": "@redheadwayfarer Jo bolte tuje randi hai Soch unki putthi hai ,unki jindagi ki kamayi izzat utni nhi jitni tri ek din ki hai", "rupama_roy": "Big underwear...with ripe 🍋 lemons ha ha ha😀", "sejal_mohare07": "You go girl ! I m with you ! You are my inspiration! I wanna be jus like you ♥️ @redheadwayfarer 🌸", "shambhavi.tiwari.5": "❤️", "archanatiwari321": "🔥🔥🔥", "dahre_rachna": "😂 wo chutiya Raj kaha hai. Mujhe uska comment nahi mila. Mujhe bhi use gaali deni hain😂😂", "talesofthatpashminagirl": "Well said❤", "sahil_thakurr": "Who else are here to njoy comments?", "fizaas011": "Wanna be like you..", "poohxilicious_": "Damn girl 😫👌🏼", "ruchismita.sahu": "💝💝💝💝💝", "tiwari_rohit_94": "Inke Yaha souchalay Nahi pahucha h Jo mn Aaya yahi pe Kar diye", "__________kay_________": "You go girl! You are beautiful 😍", "taranjeet1805": "You are beautiful❤️", "preeyarc": "I can't believe so many people are being offended at a harmless post like this one.. @redheadwayfarer great caption and photo..you inspire to embrace ourselves with all our flaws... Thanks and much ❤️", "whoprayag": "Is post m agr tum chutiye raj ko dhudh k gali dene aaye ho to , bhiyaa aap bhi legend ho", "akanksha_611": "Love ayn rand and love this picture! 🤗", "mrigasanjeevsharma": "❤️❤️❤️❤️❤️❤️❤️", "_asmiiiiiii__": "You are the most beautiful person i have seen .. you are my idol mam @redheadwayfarer 💕💕💕💕💕", "ayeza.salman": "cool", "___aiiiishaneeee___": "I mean who raised these people? I feel so bad for these jerks. Can't you peep just stay out man? Lol, why don't ya even follow her? Follow bhi karna hai aur uske sath you're gonna write absolute shits in the comment box? Lol you guys. Nice job. Go get a life you morons. And yes @redheadwayfarer you're a true inspiration for all the girls outta here ma'am. ❤️", "_isha99__": "These fucking jerks commenting shits everywhere lmao. Didn't even know how to construct a proper sentence, aur idhar aa jate hai comment karne.", "giggggleeee__": "@redheadwayfarer you are love❤️", "sharvaniitamaskar": "💖💖💖💖💖💖", "apoorva_mishra_04": "Keep inspiring girl 🙌😘 the more post uh put the more strong we become 😁😘", "_pixiedust_and_fairylights_": "L", "swapna_menon_10": "You go, Kween. More power to you! @redheadwayfarer 💓", "thakurnikhilchauhan": "Sexo", "oh_boy_charlie": "As they say \"...all you get in life is lemons\"", "hansoloandsoami": "😍", "jhanwikhurana": "OMG dude I’m just reading Ayn Rand’s book, ‘the fountain head’ and it’s fucking amazing. @riyasaini1997 also fucking great usage of words as this caption ya @redheadwayfarer", "rameshratan91": "Awesome", "harindersingh1090": "It's should be small in size...😘😘😘😘😘😘😘😘😘😘😘😘", "jgeegeej": "Fountainhead?", "rajugowda.r": "WO super", "rana_chand_": "🔥", "bluntqueen9317": "Woahhhh", "thelifelover_anil": "It's all in A mind , kisi Ko kuch farak nahi padta. It's just a matter of 2-3 sec , scroll karo pic dekho , acchi lagay to like it , nahi to aagay badi , nd ya if bohoot acchi lagay to add 15 sec nd comment . So specially girls who are saying about people expect women to look perfect and all, so I must tell them , we are no one to judge u or any . So be u , and instead of seeing yourself with world eyes , start seeing yourself with your eyes nd let world see u happyly nd strong.", "safi2273": "So sexy sweetheart", "amananand7587": "Beauty😋👌", "monochrromi": "i don't even know how to react there are so many butthurts out here in the comments section UFF, forget them, more power to you girl 💕", "asifnawab225": "None Brutus, none 🤣", "anupr1": "🔥", "chilihotfrenchfries": "You👏 Go👏 Girl👏 🌞❤", "k.l.u.b.n.i.c.a": "Niceeeeee!", "namesake9gag": "The answer will be pretty long dude", "daredevil0036": "Beautyful Back👍", "joblessjack5": "👌😍♥️💕🔥🤩♨️❤️", "ghanitigerr": "😎🔥 GOOD 😎🔥", "mkl25jsl": "M", "rashikashish": "😍😍😍😍", "food_lover_bala": "Sexy 👌", "fitguy.india": ". J", "herculesfelix_": "😻😻", "qudrat.shirzad": "@redheadwayfarer The weather is so hot but u more 😁😗😗😍😍❤️", "sanju_ca": "Got ur back 😁🌷", "shutterartlk": "😍😍", "that.boho.girl_": "Woo😍 gorgeous ❤️", "gauravvermaofficiall": "Nobody, this is your life and you can live on your terms @redheadwayfarer 🔥💝👌", "social__guru_": "DM to become Famous and check our page", "vbhae": "@redheadwayfarer beautiful click and beautiful words", "pradeep_devasani": "😍😘😍😍😘", "tannumakeovers": "🌹🌹🌹🌹", "emily.evolved": "Saloni, you’re absolutely amazing ❤️", "ssssonya5866": "Beautiful picture as well as your caption💯", "yadnesh.gosavi": "🤢💩💩🤢🤧kiitna gaanda h", "ashwini.gcae": "You are great..💯", "callista_2909": "Caption❤️", "koliflower.25": "U are love.. Saloni", "ashish3403": "Wow!! What a sexy view", "angi_gahlawat": "❤️😍", "eliza_dias23": "I love you 💓", "shreyashekhar7_": "caption❤️", "megh_meghnadas": "Lovely picture and caption😊💗🌸👍", "wendymariieee": "Love this so much ! ♡", "ayeshallthinkaboutit": "Looks like the shower curtain of a 5 yr old", "excuseme.123": "Fruits?🤣👍", "varunshegal": "❤️", "bhardwaj_rishu_rishi": "💖💖💖", "manasirsy": "Looking more", "farhanali7028": "God gift", "the.drolling_elixir.sameer": "Nobody...babes", "snjymudgl": "इंडोनेशिया की धरती पर आपका नया लुक देखने लायक है Beautiful", "hot_and_sexy_model.1": "New post up guys show some love comment your reviews in comment box 💓 @model_of_kota_rj20 #model_of_kota_rj20", "sakshi_joshi_03": "Caption is lit❤️", "knights_kings007": "Sexy back💘💘", "ranveen123": "Shameless", "karankadam4": "Lovely back luk👙 nice figure💗💕👌", "toshita043": "Look at all those butthurt men in the comments", "sanyayyyy": "💓", "divvyaaaa___": "I loved your caption.", "naveed_nawaab_2": "Beautiful😘😘👍", "gawde.1peg": "I can never get enough of you, Saloni. ❤️", "pencoffee11": "Hello some butthurt 'Men' and even ' women'. Just a quick question, why don't you question about inspiration to Salman khan, or John Abraham who have no problem in showing their, perfect six even eight pack abs. Saloni is just trying to tell people, that its okay to have flaws and to embrace flaws. And honestly speaking, she is doing a damn good job. If you dont like her posting contents which are not relevant to your standards of posts, its a request to leave the page, instead of spreading toxicity with your thinking.", "rahul_45_45": "Sexie", "amruta1904": "Fountainhead❤❤❤", "naseerahmad.dar.961": "Oops not bad back side dear", "arshiya_sharmaa_": "💜💜💜💜", "rutztan": "I loveeee your hair!! Please share your hair care routine", "shalini_tiwari2505": "👌🔥", "charmingly10": "Caption🙌🏼", "tiyashachaudhury": "Sexy😍💕", "sushantgond": "🍑", "play_boy_2121": "I wanna fuck you", "king.enen": "In a fake social media world, where people expect women to look perfect all the time, @redheadwayfarer inspires us to stay happy with our own imperfect skin. More power to you! 😌❤️", "__poojatale__": "want to see you red head back soon😩", "beck_dunk": "Bra Kidhar He?", "abduljabbar7234._saude": "Osm", "hamza__rajput_hz": "Fab ♥", "drawat38": "Stunning 💯🔥", "_amritaaa_": "Woah the caption 🔥🔥🔥", "sanjeenamal": "Sexy", "sukhmamii.x": "WE LOVE A STRONG WOMAN ❤️❤️", "riya.junejaa": "Such an inspiration ❤️", "saini_himansh": "@redheadwayfarer do u smoke weed??", "priti_uniyal": "😍wow", "vidushiisushiii": "That captionnn🔥🔥🔥🔥", "little.impaired": "Ayn Rand is not really a great example of anything!", "pavintheran3795": "😍😍", "marc_deo": "@redheadwayfarer looking hot🔥🔥", "hathiparinda": "Love this picture🌻", "writing_it_right": "That caption is so good 🔥", "naive_n_candid": "🔥🔥@redheadwayfarer", "muuskanagrawaal": "Love you alot🔥❤️", "bthehumming_avdhi_singh": "Beautiful", "jhanvi_sagar2918": "love u mam", "stylesavitri": "Love the caption and capture both❤️"}