{"sagarika_sengupta": "Causw you're different and beautiful and also strong.", "totallypixied": "You give expression to my thoughts ❤️", "ajooniiii": "Free soul!!!🌪", "bhaaa_vana": "Because I fell that you are not just a girl but a woman.. A true woman.. Strong Independent and not scared of anyone", "smyll.ss": "You provide me a source to clear my thoughts about feminism. ❤️", "u_can_cal_me_max": "Q re amit kaha hai re 😆", "vanilladadoo": "You're interesting. Way too bold. You can't be put in a box.", "kalyanivatsala": "I follow you because you inspire me the most in the entire world saloni! I really really really adore you. And I adored isha just as much. I’ve been following you ever since I watched girls on top. While you were in Maldives last year, a very close friend of mine was also there and I kept on pinging him to tell you how much I love you if he found you there although I knew you were on a very different island. The words you wrote are what I want to say but I never had the courage to express them. But looking at you do it I am just mesmerized. You mean so so so so much to me. I know you probably don’t even know I exit but if I get to meet you and talk to you I know it will make me a very better version of myself. Because of you I have gained confidence in myself. I’m not scared of guys trying to hit on me on the roads I know if somebody approaches me I’ll just kick him in the balls. I walk with my head high. It’s all because of you. There is so much I could write to you but words will never be enough! I love you very very much! ❤️", "rishxp": "Bobs and vegana pikss 0_____'", "payalshrivastava1998": "Because you are a true definition of, how a woman should be not like the way conventional morals of a patriarchal notion in the society decide us(woman) to be. You are simply amazing and carry your fab and flaws together proudly. 💓", "livephotographyhacks": "Counter questioning you.. why would I not follow you 🤔🤔 ¿¿¿¿¿¿¿¿¿¿¿¿", "charmingly10": "To remind my self I'm allowed to love me", "fashin_girliyapa": "Pani ka colour Hota hai blue..... OMG Saloni fuck you", "vini_srivastav": "Because you're you and you inspire me and all of us to do the same, to be just us. 💕", "themoonstonegirl": "Because each of your posts hold the real RAW definition of beauty, simplicity and elegance all in one! The way you carry yourself with such confidence boosts mine every day! Having a troublesome health in the last years had completely bogged me down emotionally and mentally, but you, are one of those wonderful reasons I'm holding up each day! 💕 Embracing myself seemed like a hard thing until I found your page ❤", "_______shams_______": "Because you are free, and I want to be.", "billu_oh_lala": "Simply because I like you the way u r .........", "ritikaroy321": "I love you alot 😍", "__architaa___": "Your thoughts are inspiring and liberating in each way possible", "now.is.the.living": "Breathtaking spirit. Beautiful face. Powerful voice.", "dolly.ranjan": "Bcoz u r out of context wht we've been taught since our childhood!!!", "ritu_raj_rj": "My Genuine answer - Just to see new place untill i go there...", "bhatt.nutan_": "Because of the amazing human being that you are! I always had questions in my head and being 21 years old and being just curious about everything and having no one to answer them is really difficult and I think you gave me my answers! You're awesome and I want to thank you for everything ❤❤", "awesima": "Because I learn from you how to not be afraid", "yasmin_aviva_": "I followed you because i likes your thaught and way of seeing", "divya_the.goddess": "Shine bright like a diamond 💎.. Shine bright like a diamond 💎 in the skyyyyy. 🔥💛", "arushikhanduja": "Because we both believe in motivating women. To all the women and men out there be kind to eachother 🙌🏻 #spreadlove 💕", "imon_deb": "your spirit !", "__anjali.rai__": "A word inspiration", "parnomita682": "Thats because i enjoy viewing you , your thoughts , your freedom ♥ Its inspires me and many more....you are your own creator ! Thats what makes you a deserving candidate to be followed by me 😘", "zaina92": "Because of your ‘dont give a shit’ attitude 🤷🏽‍♀️", "neha_talwelkar": "Because i loved ur mtv show girls on top and when i found you on insta loved your content really bold and feminist and a lot to learn", "senjuti_007": "I like ur posts alot...u are an amazing person..... But u know some people really dont get this idea of feminism....nd all... So they say horrible things which are just meaningless nd vulgar ...u are really brave and bold ....", "anuja_arvind": "Because u r inspiration 😊😊", "anavii._": "i follow you because you give a bold voice to the taboos these days and you empower people and inspire me to speak what's actually in my head.", "rasagnya_choppa": "Because you are absolutely stunning (inside out).#GOT🧡❤️💜", "vaish_ransubhe": "I follow you because: I saw one of your posts in my search feed, you were wearing a top which was just about to reveal your nipples. Your photo caught my attention, opened the post, read the caption. Boom! Love happened, respect happened, adoration happened. That single post gave me confidence to wear shorts out in the public. You are an inspiration woman! I look up to you, just like so many other women (young and old) do. And you ask why we follow you...", "niharikawhat": "Because your caption speaks every woman's inner voice❤️", "shahrukhkhan.111": "I want to fuck u hard", "thelazywolves": "❤️ @redheadwayfarer", "_itsybetsy_": "Because everyone needs a little ray of hope... A little motivation... A little push... Reassurance... to keep going. And that's you. You inspire me saloni. @redheadwayfarer 💕", "nehaishere": "You’re amazing just the way you are..!! Well, you do have immense knowledge and a always different perspective to analyse things in a different scenario. You’re philanthropic in your own way. And most favourite is that you stand for women...for us! I don’t need to attend my classes to study feminism from my syllabus what I need to do is just follow your Instagram account only!", "akshaynayik": "Cause you empower others to be themselves and be comfortable with their own bodies.", "swatilekha_roy": "You inspire me..", "miss_cupcakecats": "You fight for us and you make sure that we fight too. That is why", "anti__sapiens": "You make us believe our imperfections are batches of glory.❤", "edwin.jose": "Because you are free spirited soul who does what she has to do! And also , how much ever people try to bring you down, you always bounce back with more vigor , which for me is kinda liberating ! Your posts are always a \"learn\" worthy! Oh wait ,is that a word? :P Anyway, Keep inspiring! #SuperGrateful", "zindagi.gulzaar.hai": "Because you are REAL. In a world progressing on fear and fakes, you are the most original person on am online platform.", "sidtanalpha": "You’re real. As real as it gets. 🙌🏼", "fmwdotcom": "Mindblowing", "wahidarya6": "I do not know", "febroniafernandes": "A question answered long ago in your dms😌", "komalwho": "Because you have a very meaningful account, you are inspiring, and reading what you write, makes me love myself, which I find very very hard! You know the true meaning of feminism, you are real and you are simply amazing!! 💓", "its_dollycious": "Because you yes you are the answer to so many questions we ladies have in this particular nation 😊 ... Your words and your thinking towards every little thing that goes on our minds make us believe that yes why not such why not this or that ... We need possibilities towards every restriction we are facing and you give us strength so following you is loving ourselves and believing you is gaining strength and courage towards positivity ❣️ thank you 🙂 next 🤭", "yashchugh28": "Redheadwayfarer ka arth samajhne... #AapRealHo?", "shradha_sharma__": "It feels nice and bloomy", "_eshassy": "Coz I am inspired form you very much in my life... I've learned so much from you.. to live.. to enjoy..and to represent myself.. my actually side.. You taught me that I look more pretty even with my flaws.. I don't need to hide them.. I love reading captions you write. Your captions makes me more self-confident , fearless, strong from inside... You are most perfect lady.. And I always try to copy you.. You are so amazing person. @redheadwayfarer", "musicosaur": "YOU INSPIRE ME , YOU ARE REAL , YOU ARE MAJESTIC, YOU ARE STRONG, YOU ARE CONFIDENT AND BEAUTIFUL 😘", "tejalmohite": "Coz you blow my mind!!..and give me courage to be my own woman everyday", "cutenoob525615": "I waana knw who u are !!!!!!!!!!!!!!!!!!!!!!!!!!!! besides your profession.", "diksha_menon": "Because you remind me everyday to be my true self unapologetically .Also I love you and Rahul together 💜", "basic.basanti": "Because you make me accept me. I want to tell you so much but let's keep it short.I love you.", "anisakaur": "Because u make me feel beautiful n brave 🤗", "_aashish_1211": "Because you have some kind of ego problem.", "arijit_rc": "I like your free spirit", "garusha_chhabra": "Because you are inspirational 💕", "_.jesssie._": "You're brave, bold, inspiring!! 😍👏", "roza_sinha": "Your one post with certain words and kills all my insecurities I didn't even know I have", "_preksha_joshi_": "@redheadwayfarer fearless and calm , showing the reality and also trying to change things.❤️🌍 I love you so much . You push me to do better and more", "_._aarushiiii_._": "You're.my.insipiration.", "feminist_express": "Because i see my reflection in you.", "unnikrishna_bob": "Nice 😍", "marvinabox": "Yaaaaaaaas", "_sanyasethi": "Coz you are a reminder to keep going ahead in spite of all the nasty comments that cling onto a woman at all times! A true fighter💪🏻", "l0rd0fj0int": "Try modeling", "srishti_infinity": "I'm here for the unfiltered, honest, vulnerable yet strong energy. It gives me hope that I can be all of those things myself 💙", "shilpa7494": "Because you are honest who speaks reality ❤....", "vishal_rathore_007": "So beautiful💋❤️💋", "priyanka.mohan": "U make me feel confident about myself, by being unapologetically yourself all the time❤️ such a beautiful soul u r @redheadwayfarer 💗", "mukku_tanwani": "for feminism ❤️ big fan .. I like ur romance with rahulb ... 😍 god bless uh both.... ... My love.... Also love you more then me... Sometimes i jeolous from you..", "nishaliniperiii": "You inspire me", "farhahasan21": "F.R.E.E.D.O.M", "harshitaa_sethi": "Because you are an inspiration and I feel proud of you every time I read a post of yours. I feel like, okay there are people who think ths way and I am not on the wrong track probably. It's just gives me pleasure to remain updated about you and your doings. I also feel like doing more.. takin a step everyday. That's what I said, you are an inspiration.", "pandit_arjun_shastri_ji_01": "★.समस्याओ_से_परेशान_तुरंत_कुछ_घंटों_में_समाधान★_.....🔱 Acharya Siddharth 🔱 Call & WhatsApp-+91-850-484-9222 🚩.I will do 100% solution with in 24 🚩 hour.Love marriage, vashikaran, lost love back, husband wife dispute, home problem abroad problem.Kamdev MAntra for love ,,online black magic to get love back specialist baba ji,, .Lost love spells Voodoo love spells,,, .Husband Wife Love Problem Solution Baba Ji,,★!! Call & WhatsApp-+91-850-484-9222 ★!! Your privacy is our policy,!! ★", "shradha_anand_": "Because you're beautiful from inside. 🙌", "dechen__dolma": "U inspire me. ❣️AND most importantly, When i look at you, i feel like if you live like this, without worrying about what people will say, then WHY CAN'T I?", "foolpakhru": "I follow you because everyday I get to learn new things, broaden my perspective, unlearn incorrect thoughts and eventually become a better person.I would take this opportunity to tell you that today I was complimented about how I was comfortable in my own skin and you share the credit along with @natashanoel001 @regajha @blogilates @mostlysane", "ananya6023": "I saw u on MTV girls on top , and I fell in love with the cast . But at that time I 2as unaware how wonderful u are , And I follow u because ur words do make a lot of sense and it also brings a person to think . @redheadwayfarer ❤️", "ksyzoomin": "Person who can't go agra but searches taj mahal in his phone. Following u is also the same kind of thing...", "that._brown._girl": "Because you are an inspiration.. Because you always speak the reality the truths.. Because you make me feel empower.. Because you are the woman I want to be.. Because you're beautiful inside and out and I love you immensely ♥️", "pr_iya5611": "Because your each and every post gives us a story to read which I till now didnot find in any other profile .Your words carry a certain power .You let us understand how much its important to love ourself and also how to come out of the norms which are valueless .Yoi also let us understand how important it is for us not to think what people think about us but to do things which make us feel happy .Lastly you dont fake anything .You are what in real you post that way only in your profile .Lots of love dear ❤Keep inspiring #morepowertoyou", "shamelesslyselfsatisfied": "you are a huge source of gratification for me 😍", "_a.lazy.unicorn_": "In the world full of people posts & pics which might create a feeling of inferiority in us n your posts are like the beam of light in the darkness ❤️ Your captions teach me to love myself more, make myself the priority number 1, you teach us to be fearless in our opinions & thoughts 💫😚 You are an inspiration 🔥🔥🔥❤ @redheadwayfarer", "sassy_sanskari_": "Bcz your every post shout in My ears,that Rajan love your body the way it is, modify it, carve when you feel so not when someone else feel so, the captions makes my day, like Morning boosters, self-love", "theskymiles": "Because you are funny.. You more funny than cartoons", "bluewordhead": "Because you inspire me to be a better human, you make the scars on my body look beautiful, you taught me to love the body I live in and to be myself no matter what, I live around people who only live with their mouths whispering \"log kya kahenge\" but you are the reason I and so many other women started doing everything they love and wear anything they want and are living their lives to the fullest, thank you so much for being you @redheadwayfarer lots of love my superwoman ♥️♥️♥️", "namratashah17": "Because you spread positivity and love. You give us the strength and confidence to bust the stereotypes. You’re brutally honest which makes everything even more true than it already is. Because it lets us know that we’re not alone in this stereotypical world and we definitely can stand our way through with head held high.", "archana_vmr": "You r inspiring...💖💖", "not_mediocre_": "You fucking inspire me and educate me and open my eyes to a vast world and you taught me to be in love with my loudness( which I'm trying). 🙏❤️", "lumi_pumi": "You're living out your inner goddess as every woman should. You're my inspiration to be unapologetically myself👾💕", "minal_kadope": "I followed you after reading your posts through some fb link on feminism (in dat messed up bridal look), they affected me so much... after dat i fell in love with you❤i want ur life nd guts literally.u r so you...such an inspiration. Second reason i Liked following you aftrwrds is bcz u seem to be doppelganger of 2-3 bollywood actresses 😄 i knw its so lame, may b, but yeah... I like you anyways!! No more redhead but- go go redhead wayfarer", "abduljabbar7234._saude": "😘", "sushmi_ra": "Because sometimes I need people like you to tell myself it's all completely fine and I'm perfect the way I am. ❤️", "sann_deep": "To see all the cool places you travel too!!", "rishab_raina": "I don’t 😂", "dj_i_m": "Are you Indian?", "shreyydee_insta": "Because you are so natural", "_nav.reet_": "Coz you are cute and wild", "amateur_escritor": "I follow you honestly because of your amazing posts about women empowerment and self confidence. When I was struggling to love my own body your posts helped me a lot to be comfortable in my own skin. It made me realize am not alone. You inspire me so much in so many ways!!!! You are one amazing woman @redheadwayfarer I love you ❤❤❤❤❤", "the_papertown_": "Maybe because I want to have the courage and guts and strength you have. To accept myself like you do, one day.", "shalini.sejwal": "Because things whch shld hv been taught by ma parents are being told by you..as in you gave me more confidence as a woman and how should i look to other women and life is not that difficult ..all these i hv learnt frm ur posts and captions🤗❤️ love always @redheadwayfarer 😘", "khwamakhwaa": "No reason. Just stalking a pretty girl 🤓", "im.karishmaa": "Cuz uh beautiful soul❤️", "saranyas_story_in_pics": "Because you are real", "mishaida": "Because if freedom was a person you could follow on insta. Wouldn't you ?", "vineet_kargeti": "You r just a piece of shit..u call Ur self a feminist ..at least show some condolence towards the martyrs. U just post crap", "sanchyaaggarwal": "Because you’re one brave woman who doesn’t give a fuck about “log kya kahengey?” 😌❤️", "srishtisharma091": "Because ur thought inspire me and u r sooo dan beautiful and sexy....", "_prachiii_101": "Because you inspire every fucking day and make me be the best person and moreover I m feminist af 🤙🖐 @redheadwayfarer Much love to you 💖", "shreshthaxx": "Honestly??? Cause you're beautiful. Please obvio and !!!! You are so fucking honest. Like !!! Fuck this shit!!! And your boyfriend Rahul is like so cute and he loves you and you too and your love story is Beautiful and I hope you have kids as crazy as you guys are !! So ya I love you both and I love you more Saloni for the fucking fearless bitch you are. Muaaaaahhhh xx ❤️😘🥰", "medhaashankar": "Because you're a feminist and I love how you use your platform to address feminism", "a_waywego": "Because your bold and inspiring😄", "justin_model__killer_": "Super", "maniktalwar": "You're real - period.", "deepanshu000052": "Madam Ek post desh k shahido k liye bhi dal do", "mohammadshaikh156": "Is she dead ?", "sahithya_yamarapu": "You're inspiring ❤️😍", "zain.hebs": "Your captions...", "anindya.chowdhury": "Because my girlfriend asked me to, and after that even I started liking you. You are cute 🙂 @redheadwayfarer", "komi_kaurr": "Cause you are an inspiration 💕💫", "rakshana__": "Coz you are you . How fearlessly beautiful your thoughts are . You inspire girls to be watever they are n be proud of it ✨. @redheadwayfarer ❤️ You inspire me . ✨", "dattavii": "because my friends tell me that I look like you", "chaudharyannu425": "You are raw.", "looking_through_key_hole": "Because you are a badass feminist and a awesome human being. ❤️", "_siddharthteggi": "Because ur great combination of beauty, humanity and positive affirmation", "_.nayanparabat._": "Because you make me believe that there are women who love themselves the way they are, are ready to break the stereotypes and don't give a fuck about what the world thinks.", "baba_yaga_mahadev": "Nothing to see, but there something always good to learn from u.. Keep it going🙌", "bhardwaj_rishu_rishi": "You talk about real things. You don't create an illusion of your image. You be yourself, that inspires everyone to be themselves. You've taught me love myself. Any amount of thanks is less. THANK YOU 💖", "chauhanmuskan": "Because you remind me everyday to own it. Just unapologetically own the badass, smart mouth woman that I am. ❤️😘", "othergandhi": "You serve as a mirror to where my own thinking stands.", "iamsabiii": "Beacause I love reading your captions , they're really insipiring @redheadwayfarer , don't want to miss such good content 😉 🌹", "saree_nari": "You bring joy", "roshni._._": "You're the definition of strength and boldness. @redheadwayfarer", "suhanigandhii": "We follow you because of the person YOU are❤", "serendipity2118": "When i first saw your account, i felt a connection to your thoughts n your opinions. I feel liberated seeing your posts, yes i really do! I cant explain things too well... But i guess this is the main reason of following you.. And i really respect you Saloni 💛", "soni__sakshi": "You are Power lady 💘 much love 💕@redheadwayfarer @bindiia", "suga_pie_honey_bun_": "Because I love the way u are...❤❤❤", "dewlahansda": "I won't say cheesy things like how you are 'how a woman should be' or anything because there is no such 'way'. You are vocal. And you are absolutely fearless. ❤", "phalguni_khandka": "Because you are BOLD and BEAUTIFUL ♥", "anshitaaa_singh": "You make me perfect and your captions take me deep down into the depths of thinking and make me grateful towards my life and more importantly that I am a girl and I can own the world. U make me believe in my capabilities and I love your relationship with @rahulb90 coz you are not the typical lovers type you are the type that I thought I would be for someone one day..... You are insanely bold and that makes me more crazy towards you! I loved you since the day I watched the first episode of #girlsontop! And these are not even the few of the reasons why I followed you! Keep posting keep blessing our feeds ❤✨", "jigztatsme": "Do u really wanna know!!", "misbah29": "I find ur posts liberating. Thats why...", "bunnyy__22": "The way I see life has completely changed since I've started following you. It's been more than a year now. You inspire me to be who I am and not cover myself behind societal standards. I discovered you when you had posted something about body hair. You know what till date I remember that and it's more like I look at my body hair and I absolutely love it. I am like it's just a part of me. And that has all happened because of you. I can go on and on honestly. You inspire me so freaking much ❤️", "yashpreeeet1313": "Because you inspire, everytime whenever i check your post there is always a msg given which is lovely and push us to look on both good and bad💕💕💕🌼🌼🌼LADY you are amazing💖💖💖💖💖💖💖💖💖", "anjaliinairr": "Because", "sneha7215": "Cuz u r really different...gutzz👏👏", "vedika.pandey": "Because you make me think. Your thoughts are so different from the people I know and I know that you’ve changed the way I think in many aspects. And I look forward to more of that.", "something8880": "Because my friend asked me to", "palakkataria": "Coz u r one inspiring confident bad ass woman who is breaking the stereotypes with grace! @redheadwayfarer u r lit🔥😍", "rishabhjainies": "Ghapa ghap", "rythum_": "Cause your words, are the feelings I and alot of other women weren’t able to express. Your words are what we all women wants to shout out loud in front of this world. Your words encourage me. ☘️ #agirlfromrapecapital", "chanda_23": "Because you make bare look beautiful ♥️ it’s really hard to put yourself out there in your rawest form but you do that with atmost grace and ease! You make it easy for all of us to be ourselves 🌻", "ravishingtwinkle": "One who has a voice and uses it is one in a million. 👌👌. You have that.", "gewoonheena": "Honestly I don't know. I agree sometimes. Sometimes I don't. It's good to see things from different perspective I guess. Isn't it the way we grow?", "kopal_sethi": "because the way you stand for all women is just amazing and inspires me a lot. you give me courage .The way you face criticisms is next level. You are a true motivation ❤❤", "meghs_777": "You do so many crazy things.... It kinda inspires me to do some crazy things also and kn that its OK😘", "ram1232345": "Umhaaa😍😍😍", "p_a_nda_": "Because becoming a person that you are today in this patriarchal society takes lots of guts. So ya if I can be half of as bold as you and makes even a slight change in the society I will be proud of myself. Moreover, You are a beautiful woman.♥️ @redheadwayfarer", "h.e.e.r.a_": "Free the nipple!", "aditisinha4": "You are one amazing girl❤️❤️", "causeimlilkiddo": "Hey Saloni! I'm a 14 y/o girl from India. Your posts give me the inspiration to be the kind of woman I want to be. They give me the confidence to wear what I want, and flaunt who I am. The beautiful and elegant way in which you express yourself is highly motivating and inspirational. Your belief in us (women) gives me hope! You play a significant role in my grooming. Thank you so much for doing what you do and inspiring thousands of females across the globe! Lots of love!❤️🌍", "paapkojalakerakhkardunga": "Because I love you. You changed my perceptions and made me face the truth. I love your courage. I hope one day even i stop giving a fuck and be the most of what I truly am", "varshachoudhary19": "U are inspiring", "prathamsatalkar": "Because you speak up about the topics most of us tend to ignore or brush them under the carpet. I find your posts confronting and thought provoking. You speak up your mind and stand for your beliefs. You are making efforts to change thought process of people one person at a time. Last but not the least I find you inspiring and teaching me to be a better man than I am already.", "kawishjohn": "Because you are daring and courageous who are defining herself against the petty conventions of society. You are simply an inspiration for not letting anything bind you in crutches. More power to you!", "gupta.priyank5": "This one is BEAUTIFUL 😍", "sejal_dhumavat": "Because you are the ideal women all of would want to be. You brave , strong and independent . You show us that we don't need a man for us to protect ourselves and most importantly that we need to fight for ourselves and for what is right no matter how conflicting it is.❤", "ananyas524": "Because I love the way you express yourselves!💗", "__precious._.camedhian__": "Cuz people like you are very rare and deserve all the attention and love possible❤️", "divya.dbs": "Because you are inspiring and more than that, you are making the world a better place and me, a better human. 😘", "immsalimm": "You are not a typical person or a typical girl like we often get to see on the streets", "sprihaaaa_": "Because you're a positive energy filled with confidence and gives a fuck what the society has to offer. Because you give me confidence to be whoever I want to be. That being perfect lies in the eyes of the beholder. And you preach self love. You go girl. Love yaaa. 💕 @redheadwayfarer", "prettyoatsgirl": "Because Women need women, more inspiring, rebellious, fire-y women. Women who teach other women. You're one of them and I need to be one too.", "vasundharaaa._": "Hey, @redheadwayfarer please check a text I sent you!", "anushkafying": "Because you're a powerful woman and you rock ❤️", "the_overdramatic_lashes": "Because you’re a good writer", "oliverqueen6722": "Lol cuz am too horny", "c.r.a.z.y_g.i.r.l_": "'Coz I wanna be like you, \"Confident!\"", "shreya.lifecoach": "Cause you are you. Totally, unapologetically", "dereck_idukki": "Stay Lit 🔥", "khushichawlaa": "Bc you're inspirational af💕", "_sandhyanagarajan_": "Because your journey is like an glorious spark that outshines everyone else in their own way", "yaku786": "Because you are the most amazing woman i have ever seen and you are an inspiration to all of us which makes us more strong to be like you❤️❤️", "shreyaaaa17": "Because ur one of the best feminists I know! And I really really wanna learn something from u cuz I’m a young feminist!", "anukanksha_": "Because you are one of those veryyyy few who genuinely wants to inspire others 💙", "borgaonkardivyesh": "Kyu ki neem ka patta kadwa hai Pakistan.......", "sadaashaa": "YOUR POSTS ARE THE HIGHLIGHT OF MY DAY♥️ YOU MADE ME REALISE THAT I GOT TO LOVE MYSELF NO MATTER WHAT AND STILL STRIVE TO GROW AND BECOME BETTER.", "_praptishende17": "Because it was your posts that made me realize the double standards of the society and the fact that the so called\"social norms\" come from an extremely sexist place. You inspire me to speak my heart out and be myself, unapologetically. Love you❤", "sarika0_0": "Coz no one in this world is like you ..plus you are the only one who inspire girls to love themselves ...and a true feminist. I'm following you since last 2 years ...I don't comment much to your post but I love you for what you are and trying to be as strong as you are. Thanx for share your thoughts with as .", "aleee_na21": "You remind me the glory of a woman❤️", "ecstatic_soulhere": "Because you are so fuckin beautiful inside and out and i fell in love with your voice when you did girls on top 😍😍😘😘😘", "thegirlwithflaws": "Because you're the voice which every girl Want to speak ♥️", "qudrat.shirzad": "Got on 🔥", "anixzh": "Hi", "i.shaona_": "Because i want to be like u someday! To break all barriers and be unapolegitically myself! I dont want to be restrained by societal pressures! and u make me believe that its possible! More power to u woman @redheadwayfarer !🔥🔥💓💓💯💯", "abhiroop_bhatta": "Feminist concepts. Gender neutrality concepts.", "rutuja_shinde12": "Because you are an amazing person and who inspires me to be a better version of myself. Who helps me to be proud of what I have and most importantly love myself. And thank you for that @redheadwayfarer", "aishwarylakhlanii": "Because You are cute and and and and I don't wear bra everyday and I feel absalutely comfortable and that is because of you 💖🌷✨", "anjaliklskr": "I like your captions", "zion_drek_xd": "Is that bubble wrap??🔥🔥", "the_whimsical_snowflake": "Because you are what you are. Original! Not faking anything like every one else out there ✌️Your words strengthen me everytime🙏", "itscheekygurl": "B'cuz uh are truely an inspiration for each girl out there 😍 ur captions are really lit af 🔥", "nidhibhasin": "Because you inspire me. Motivate me. Validate me. Some times even reassure me that everything is ok, and if not, it will be. Because you are amazing. Because you make me feel like I am not alone, or insufficient in any physical/mental aspect. Because you empower me, your words lift me up. And the fact that people like you exist, keeps my hope for a better future alive", "anjuyadav___": "Because you are such a fearless women who inspire and motivate me in every possible way. You say the words i was afraid to say or even read. And also because i love watching pictures of you and rahul :)", "loydpinto": "Because I like the way you write about life and things around us.", "nidamir04": "Cause you make me love myself more each time you post♥️", "lakshmiiiiyer": "'cause I get an equal, daily reminder of self-love as well as the love I truly deserve and not something I just settle for?", "tveshasippy": "You inspire me to be more of me. There's no school for life, but with every post of yours I learn so much. Whether its to love yourself or love someone you love or love something youre passionate about. Thank you.", "sliceofmylyfe": "You bring a different perspective and that is interesting", "electronherder": "For your captions. Some of them are good! 😁", "whatever9582": "Because you make me rethink my self doubts ❤️ @redheadwayfarer", "hetvi_alina": "Because I love you 💓you are my inspiration 💪🏻💪🏻 I also want to meet you😘", "doperisetv": "Dreams", "____kimmmm____": "Because you are a non conformist, you believe in what you do. And that inspires me.", "milli_jhalli": "Because reading to your posts has helped me gain a lot of self confidence and i do not have the fear of not being liked by anyone. I do not try to likeable and hence enjoy being free spirited. You are my motivation mam. Thankyou so much ❤️", "thesrishtidhiman": "Because you not only stand for women but also for men too and that's what equality is all about. Many people don't get this. 😊❤️", "ashraff__shafiq": "You beauty💕💕", "sona_3": "You remind me how powerful a woman can be and how important it is to be unapologetically you in a world that says otherwise", "21_naksitimbadia": "Cause Didi you have taught me many things. I got inspired by you and became a 15 year old feminist while being criticized by my classmates,called me a male hater,you gave me confidence,I want to meet you and tie you a rakhi.also my name is naksi💜💜💜@redheadwayfarer", "usribee": "I find solidarity in your courage. ❤️✨", "_m_u_s_s_u": "Because you are an inspiration.🌸 Also because I adore you and @rahulb90 alot❤️", "meeta_9": "Very simple the only word that can do justice to your persona is that YOU ARE REAL in this complicated digital world!", "bitchwithfeelings__": "Cause I find myself in you, things I wanna do but scared , things I wanna say but afraid and things that share but can't. Not because I am uncomfortable but because as soon as I start doing any of this,the whole society start getting uncomfortable.", "khushibediii": "Because you’re too inspiring for me and an ideal for me. I adore you @redheadwayfarer ❤️❤️❤️", "bed_patato": "Because u challenge my thinking in a very logical and factual way!!!", "hdrainusa": "You visit cool 😎 destinations. You are unconventional. You do not give two hoots about what people think or say. We are similar but for the fact I am not as cool to find a sponsor to visit 😎 destinations.", "_divya_jami_": "You are an amazing inspiration and i love the way you portray your thoughts ♥️♥️♥️", "aadishriiiii": "You’re free, unapologetically yourself, So confident, Just out here doing your thing and that’s rare and utterly beautiful @redheadwayfarer ☀️", "mansijain3334": "Because you are one hell of a woman and you are everything I would ever wish to be ❤️❤️❤️.", "neetzis": "Because you are unapologetically yourself in truest sense of this phrase. You come across to me as a goddamn real, genuine and authentic individual..no matter if your words/thoughts/actions pleases or offends someone else. I consider this a true way of living one‘s life at the core and you rock at it. I consider you a friend in my mind already. Lady, you come across like someone with a heart of gold, bravest soul and your weirdness fucking moves me. #willtobeweird #willtobereal", "_wild__cat__": "Why I follow you?? Are you serious.... You @redheadwayfarer are the one whose caption I read 100 times and show that caption to all my girlfriend and even my younger sister.... You are the one who inspired me sooo much in my life and inspired soo many girls out there...... You are the one who I wanted to be...... You are perfect women.... Just love you and you deserve to be followed by each and every person using Instagram.... #bosslady #inspiration #queen #ladylove... And yes if I was a boy I would definitely dated you😂😘😘😘😘", "_xnaiive": "You reflect everything about a woman. A gist of \"everything one must have\" can be found in You. And I want to learn this art from you. So here I am, enjoying, following a hurricane like you!💙", "arshdeep._.pretty": "Because saloni, you're real af. I love people who speak truth even if circumstances dont let them. ❤️", "thatcrazybrowngirl": "Because you give me strength to stand up for myself. You give me courage. You show the reality. You never fail to inspire me and you dont step back when you receive criticism and those disturbing messages and comments. You are a Queen! And I'm so happy that I follow a person like you. ❤️", "buttercup_6789": "Because you Empower and Inspire. Because you push us to love ourselves.😘", "_golden__feather": "Cause you inspire me 💞✨", "antimalunker_": "You're amazing..you inspire thousands of people❤️", "_sanazafar__": "Because you're the most inspiring and amazing creature I've ever seen.. You motivate all of us to look beyond the norms of society and be who we really are and maybe you don't realize it, but you really help so many people around the globe, you're an angel ❤️", "yogini_riadawar": "You are inspiring with your bold posts and lifestyle. I think you empower women, the way you think, your pictures. You make me feel strong. 👊😍", "noire_fanatic": "You are an inspiration. ❤️", "happytinyfarm": "I follow Cuz I want to know you entirely", "aayushdubeyy": "Well you're helping me become a feminist and there's so much to learn from you 💗", "neela_kamrun": "Coz I like your words ..🥰🥰", "bomb_ae": "You are extraordinary 💯", "puchku.thecat": "I follow you because you inspire me!", "imakankshha": "U make us feel free and independent ....we all love u", "_nidhi0808_": "You are an inspiration. You are the voice of the girls who are all afraid to speak up for their thoughts. I follow you because you boldly say what I cannot. I follow you because I then understand that I'm not the only one who is so-called \"too modern and eccentric\". So that I know that what I think isn't 'wrong'...", "prepapapa": "Cause I’m a moth and you see moths love other moths( you remember?)", "somraaj12375": "Well coz u r sexy and i will follow them", "a.r.y.a__k__c": "I follow you because you motivate me to push myself ahead each day. You thought me to love myself a little more. Thank you so much.", "medusa5197": "Because I like your content☺️", "varunshegal": "Free soul❤️❤️❤️❤️😘", "serenityofwordss": "because I love you♥️", "stutirebecca": "I love your lipstick shades ✌", "krishnamohitt": "Beauty beauty", "mr.jakke_911": "Beacause I learn many good things from your content💛", "sahil_nandi": "Coz i am kinda in love with u for the person you are and for the way u influence ppl❤️❤️❤️❤️", "musical_witchoria": "Because you inspire me so much di❤️", "ashleestanski": "I follow you because you are an amazing advocate for women around the globe.", "yashasvigupta29": "Cause you’re damn hot🔥🔥🔥", "sarawgi_saloni": "Hamare khyalat milte h aur nam bhi 💕", "_wired.up.weird_": "You're unapologetically yourself and support and promote that. You're real. YOU over any so called Instagram model always. 💯", "the_redheadhabanero": "cz you inspire those who fear voicing their opinions and fears❤️@redheadwayfarer", "meraki_by_prachi": "Because you are not afraid to be you! Which is rare, it's not easy to give no fucks but u do it effortlessly🙌👏 I love Everything about u and d entire u😇", "purvai.soni": "You give a voice to my thoughts 😊", "chackosharon": "Beacause you are beautiful in your own way", "motwanimeghna21": "Because I thought I have an open mind but after reading your posts I realised I have so much more to learn and grow!", "bhoomika_2001": "Because you are as real as anyone could ever be 🙌", "vishalyadav4059": "I love you", "_loveforwords_": "For the fearless you 🔥🔥", "chanchal_kriplani": "Because in one way or other .... You always give a bit more courage to get onto the next stage of life , to explore more , to smile more , to live more , to be more of who I am , to be free , to not give a fuck any more , to call out my inner self , to be more true , to be no hippie , to know that its ok , to know that i mean more than anyone else , to be bit better everyday.... And be happy ❣️❣️ @redheadwayfarer", "amritanayak_7": "I follow you cause you inspire me to be me. Not just me, but there are so many girls out there feeling comfortable in thier own skin after you led them by setting yourself an example of a lady who is not fucking apologetic for being REAL.", "devika_mohan_": "Coz all your captions are lit! And they don't fail to make me feel a lil better and as I relate to ur thinking it makes me feel I ain't that wrong and that I have an amazing person like you on my side...wch helps me believe in myself a little more...and you spread Positivity in a way different from the normal ones...", "vanshikarattan": "Because you inspire me.🌹", "_an_ebullient_": "Muse♥️", "__debapriya__": "Because you're brave and inspiring. And you and @rahulb90 are absolutely adorable. 💜", "hopeless_wanderer": "I dont know you still i love you i like you i want to be a confident independent careless fearless brave person like you....", "manyahahaha": "You are inspirational 🔥", "gurlwithflaws": "Because you make girls feel like they are meant to be and to make them feel free and independent 💜", "the.cozy.bliss": "💋", "chintanking": "Just i like you...❤️❤️❤️❤️", "monochrromi": "because i see myself in you. you inspire me. 💘", "xritikaax": "Because you're one of the most woke,strong, and inspirational women on Instagram.❤️", "sheetalgarg_": "you inspire me !! you hv given me confidence about my body my choices n how to be proud of it !! i love your thoughts !! sometimes you voice out my biggest fears and make me think about things from different perspectives!! ❤❤❤ i adore you !! 💕💕", "imsanjoy": "#immature", "taposhi24": "Because you bring in freshness to many of my dull days , when things seem doubtious your words have this charm of leaving people confident. Your pictures surely are great but your words your raw portrayal of your thoughts is what creates the impact. ❤️❤️❤️", "poonamwaghmare021": "Because you are so confident. i love the way you think and fearlessly put your thoughts out. I love the way you try your best to empower people. And yes you are freaking beautiful 😍 iloveyouuu❤️@redheadwayfarer", "thatgirlwidshorthair": "I love to read your captions ❤️", "shwetap89": "@redheadwayfarer Because, woman you , yes You , are very bold !!", "yuesmom": "I love your spirit!", "bhanukhetharpal": "Because you are brave, totally relatable, your words are so powerful.you empower me💕💕😍", "romaayyyy": "Beautiful Inside and Out💙", "kadambari_anuannal": "Hi , because you are you and I like this you", "writersometimes_": "Coz you are someone who inspire me in daily basis. Things you write, how you convey your thoughts ,your way to describe any issue is so amazing and impactful.whenever I feel low or whatever I go to your profile and start reading you captions it feels so light and wonderful !... actually in simple language you are amazing!", "inneres.meer": "I follow you because you inspire me to let go of my eating disorder (greets from Germany) ❤️🌊", "etee___": "You seem to not give a fuck about the stuff that shouldn't be given a fuck about!", "_karansb_": "Did u know abt army attack 🙄 where's your feminism 🙄😕", "ratnesh.jain": "♥️ free spirit", "vinitabarde": "Feraless brave hearts make history and I want to be witness to the history you are making.", "pathakpriyansha": "Because you are empowering. You make me feel good about being myself <3", "swechchha178": "Because u r such an inspiration😍❤️", "ankitamartya_70": "Because you are truly an inspiration to women and you empower them. Also you are gorgeousness combined with intellect and I love your smile 🙏💟", "my._.dumbass": "Cuz you're Shameless (Prajakta Koli's rap reference) and you make me feel less apologetic about myself. @redheadwayfarer", "euphoric_._": "U cant float", "sukanya_kon_": "Because you are you", "mansisharma7527": "Am follow u Bec I like the way u appreciate a girls rights an our our identity. The way u doing your work any dress like bikini also that's power to do an encourage us that we should fight for our rights an identity. To build what we are actually to be a girl the me myself and I . live a life for are own choices not to live only to be a wife , mother, daughter , sister an all these name ..", "theindiantequilla": "Because just like you, your words are fearless and raw too 💕💕 🔥", "mithila.kakkad": "Cos you are everything a woman should be. ❤️ And someday, atleast for a day I want to be as loud as you, as brave as you, as Amazing as you, as wonderfully strong as you... 😘😘", "ganesh_gai_tonde": "Feel good after reading or watching your stories and post u make woman proud fearless beauty 💕", "_arjunreddy": "Good Question😎", "saurabhi_singh": "Because I like how you don't give a fuck about looking pretty unlike others", "infinity_chaotic": "Healthy Feminism", "onlyhewwman": "Because you're wonderfully amazing,! ❤", "juggyevil": "You inspire the fuck out of me🔥❤️", "thelamenamegame": "I follow you because you make me feel proud to be a woman. And because you are someone who really inspires me. Because you are who you are and you are not fake. Thank you!❤", "_saloni.c": "Women need empowerment, indeed! - but more than that, for the same empowerment, they need someone who words their hearty feels so they can work the lives out on free terms. // I get that vibe from you. 💙", "jashneet_gill": "Because you're different and you own it like a boss❤", "ms.tribbianii": "You're one of my inspirations, your existence makes me believe that I too am a strong woman, and am proud of my body. You're pretty and your blogs/captions make my not-so-steretypical mindset a little more broader each day. Love you saloni", "bhagyasaiii": "Am still living its just because of you 🤗🤗🤗", "acatalepsy_226": "As they say, \" surround yourself with people that reflect who you want to be and how you want to feel.\" That's why.", "she_theuntamed": "Because you have an amazingly unique mindset and i adore @saerahstamps Too😇 godbless💋", "sharu.ramesh": "Because you are confident and totally inspiring when you represent every girl's mind in your words. You are truly amazing. 😘❤️", "ruby_m_03": "Because i luv the way u handle everything....and your attitude admires me 😘😌😌", "ritu_7781": "Your confidence🙌🔥", "namstaythefcukaway": "Coz i love love love love ur content- STRONG BOLD AND AWSM🔥🔥❤️", "muskaan._.kataria": "Because you are fearless and motivating 😍", "jaan_veee": "Because we feminists love you a lot😍", "mukaann_": "You inspire me and i love your captions alot ...also you and rahul are soo cute #lovelove ♥️", "poojavishwash": "Because I like you and your feminism 🔥", "sejal_dadlani": "I just love the way you live your life🌸💫you inspire me mam💛", "jellybeeen": "Because you are so courageously you. You are bold. And you write (beautifully) about all the things I feel and wholeheartedly agree with. Hoping some of that confidence and eloquence rubs off on me. :)", "tooofaaani": "Because your words are so fearless. 💛", "riyajain.xo": "You talk about reality!", "niyati_vaidya": "Because you radiate beauty and awesomeness out of you💕", "khushisah_00": "Hey my inspiration, love you!💗😘", "ishana23vats_": "Because you empower me. I love reading your posts and I personally love confident women.Women who are confident in their skin,who love themselves before others.", "ronak_shrimal": "Happy birthday", "boi_debnath": "You inspire me every moment 😍", "salluwayfarer": "RIP😢😢😢", "_dazzled_cutie": "❤️❤️", "janvisanghavii": "because you push me to love myself", "arashsees": "I read your me too story only recently... and now I want to see what else you have to offer to the world", "snehavatsa": "Because you give me hope and courage!", "farooquinamrah": "I follow you because I feel like Ur", "yourpriyahpriyanka": "Coz I liked your character in GOT and now I like the way you take a stand for women and their rights❤️", "anshul_el_maestro": "💕", "anjaliagarwal.a1": "Because you are doing something good. ❤️", "pargopoint": "👍🏽", "nishkama_karmayogi": "Because you are awesome 🧞‍♀️"}