{"tejasgamare7": "wowwww niceeee will love to see this kind of pics more", "domdsilva": "Great post !! Love what you have to say 👍🏻", "boss__betty__blogger": "Hey @redheadwayfarer u r just awsm gal these stupid guys are ok when someone lynched in the name of God (Jai shree ram) but they are not accepting a women wearing a dress which shows some god things uhhh hypocrisy at it's best..#gogirl #goodvibes #salonichopra", "prabhakar.r.9083": "❤️😍❤️", "dubifl": "Why does that sparkle ✨", "dogsoveranything": "@_puk_ar", "carlyfindlay\nVerified": "Verified", "zaradinkydo": "What type do you have", "nitin_nagole_": "Madharchod", "saurav.kr.1": "🖕", "mubashir_ambalanjeri": "😘😘", "teen8043": "So hot and beautiful baby🌡️🌡️😘😘", "utkarshsrivastava_us": "Waah kya nipple hai ekdm tight lgta massage achha mila hai but shirt thodi upar hoti toh aur maza aata", "barbie_doll_loves_u": "Wgat", "gauravdabral": "Beauty with... no brain... 🤣🤣🤣", "miraj_gupta": "Feminism is all about showing your ass and tits. We men should also start showing our dicks. Then let's see what these women accuse us of .", "roshanpadiyath": "I do respect women. It's just, if you are posting someone more legit, I think it shouldn't be sensored. A lot of pages in Instagram who post human portraits don't even sensor stuff.", "tafannum_azsan": "U jerk...hate this ....buddy change ur lifestyle....or if u want to live in this life than private ur Id....", "anirban_banerjee9": "Unabashedly beautiful! ❣️", "mahbuba.zerin": "foinni..detected", "sunainabhatia09": "Milky nipples😍🔥", "anmol_dani": "💋💋💋💋", "biker_boy_18": "@redheadwayfarer Yeah bitch we know that you are sexy.... But one thing is.... You are boobs is not a shape... Yesterday i saw in my dreams 😂😂😂😂😂", "bsuryasiddardhareddy": "లంజ", "girls_cars_models": "Gand me dum hai toh aise burqa ya hijab pehen k dikahao you people just know how to play with hinduism and our beliefs", "yahi_hai_vo": "But if incidentally if they are felling horny they would like masturbate sorry but thats true🙄", "imranseth2": "Lovely nippal", "rimasarkar": "Uncultured scum", "kaushikguptaa": "little sunshine😂 @himashreesahoo", "anmolpandey2000": "Wtf is wrong wid you Idiot, Do you have any idea what is written in your Top It's \"Hare Krishna\", You Have disrespected our God. 😠😡🤬", "rahulrajj173": "Body expose hi krni h toh thoda dhang ke kapde toh pehan lo bhagwaan ka naam bhi kyu khrab krna. Kuch bhi pehnne ko ajaadi h iss ka ye Mtlb nhi h bhagwaan ka name B khrab kro saath mae. Pta nhi kya thinking h tumhari but ye galat h. Or jo galat h usko galat hi bola jaye ga..!!", "kkrrssnnaa": "I WANT EVERYONE TO DM ME RIGHT NOW, IF YOU SEE THIS COMMENT DM ME, THIS ISS WRONG, THAT MDFKK GIRL IS.", "monikshasharma23": "Poor soul you are badly trapped in maya when you will know what are you doing you will cry ocean of tears", "_krishnavi_": "@redheadwayfarer u r insane .u need treatment", "adil_hasan786": "This sort of photos send bad message to the society", "nemichandranarana": "🔥🔥🔥", "shirish1818": "😎", "japjeet22": "❤️Do what makes you feel comfortable 😘 @redheadwayfarer", "unizodgamergmail.com6": "Indian feminist will be triggered when guys wear shorts without an underwear @redheadwayfarer what do u think", "_mateen_qureshi": "So hot and so sexy 🔥🔥🔥", "siddharth_peepra": "@redheadwayfarer hey stupid bitch...... please do this shit with hijab and burkha", "prickster.strikes.back": "Thundering thighs with little ttities . All this while all the talk for this ? Even thai shemales can make you run for your money", "pheonix_lurch": "Throw Ur rules bitch", "nakulmh1": "The day will come when u will be old and repay all ur sins till then enjoy", "koualwaysflying_": "@mr.bandyopadhyay", "shahzaib_rajpot_": "@chaudharyabul", "b_maithili": "It's interesting to see how most of the criticism is coming from our male friends who must've seen priests drape a similar cloth around their nipples. #bethechange", "almostsane_rumpyghosh_09": "@redheadwayfarer Hi.. Not a great fan.. Just an admirer.. Saw few if ur web series works.. Just saw ur post.. Nd was checking the shitty comments u got for it.. I just wanna say.. IDK the ethical facts nd TBH don't care.. It's ur insta id.. U can post whatever u want.. U can wear whtvr u like.. Nd yeah.. Don't give a fuck abt the comments.. Glad u posted a hot pic.. And u look stunning 😊 nothing else.. Just that.. I feel so pity on ppl who actually say 'MANS' instd of 'MEN' nd try to make a valid point 😂😂 loved the look ☺👍", "naughty271980": "Damn seductive", "arisxadika": "Gorgeous babe 😉", "__navi__98": "@jeya_krishnan_j", "bsnl_n": "Only for money", "ayush_ganjoo": "Is that infinity stone on her left titty?", "shwetabaghel92": "🔥", "mdeskman": "hooot", "nagendra_knv": "నీ పువ్వు💦💦", "arjun_teotia": "she have one infinity stone on the left side for sure , beware of thanos", "almostfammous": "I like your content always,Saloni... But you could have wore something else other than this.. It mentions God's name and we should respect that.. But still it's your body your choice .. !! @redheadwayfarer", "11.11.kk": "u bitch suck a dog ass mtf", "muten_roushi_sama": "😍🤤💦💦💦💦💦", "das_mismi": "T-shirt is assum❤️", "_azzy07_": "🔥🔥", "aaru_arjun": "What do you want to prove by showing your Nudity......I appreciate u and your quotes. But show where you need it, not unnecessarily", "yogeshadmane": "Nice", "___browsonfleek___": "Posting pornographic material on the net- Offence under Section 292, 292A, 293, 294 IPC punishable with imprisonment", "anikaitt": "You need some lotion", "rt_studioz": "Hey I guess I saw you at Bumble valentine party", "adarsmishra11194": "I don't care about shirtles or anything...U ate ugly eod", "anya.gupta": "NIPS NIPS NIPS! #freeeeeeeeee", "vishal__15__": "bhagwan nae bhi kyu sarminda kar rahi hai pagal.", "usmaniwasim": "Naked is beautiful ❤️", "mitesh_siju": "The girl's breast is very big and gorgeous and she is very beautiful😘", "ruin___nil____black___": "Free the nipples. 🔥", "abdulhadikasi": "Hi.", "instacraze2013": "Who donated this shirt to you. You obviously aren’t religious ..Either ways it’s a bad pic. It really didn’t matter what you wore", "visheshkar": "I Love", "prakashsoni9669": "💋💋💋👈👉👇", "ianirudhh": "@shivsena", "pgphotographynj": "🔥🔥🔥", "durvashamishra": "Sexy looking", "fa.naaz": "@anisazman__ weiyhhhh berkilauan sialll ...HAHAHAHAHAHAHAH", "sarojkumar.sharma2": "Hare rama hare kishna", "kiranagha29": "😘😘😘", "rajnirazz": "Hello sexygirl you", "zarya5670": "👍👍👍👍🔥🔥🔥", "bollywoodjournal": "Pretty hot photo🔥🔥🔥", "vidhu_photo": "Posing these pics is not feminism.. It's not women empowerment.. Nd what written in this shirt..does matter.. India is a Democratic country it's personal choice.. But having a lot of followrs.. Please first study what really feminism, equality and all that stuff you right is about.. Now it doesn't make any sense", "zahur_zadran": "Wow", "munna.ghosh.52": "😍", "shareen848": "How cheap is this you take a god name printed t-shirt with this nudity shame on u", "fuckyoumakeart66": "Feminism sucks👎", "vrunda4792": "U r too hot to handle even by girls", "bhatipanalal": "Nice", "ranjit__odedara": "Ye bhagwa rang hai,aise iss rang ka majak udta hai 😠😠", "sadhna8681": "@shruti_naik_0011", "silver_jewellery_115": "Freckles", "ig4info": "👈❤️🤗👈 want to be stunned by tricks hacks & innovations ✌️ stick around us 🕺", "ravi19654": "Nice shirt nice assets.", "demerrill75": "Wow", "jasdhanjal11": "Hahahahaha ,so basically showing boobs is what u call a modern girl,idiots.", "nishika520": "Check my status", "fullpowerk7": "I love what you're wearing!😍", "vinaymeena0033": "Are bhagwan ki dress to gandhi mt kr kutti", "olympus.an": "Sweet mother of Jesus.... For a moment I thought it was a dude... Trying to cross dress.... Shit.... My eyes....", "namo_rakshak_11": "Di aapse request h bhagwan ke nam ke kpde mt pehno", "brajesh_kabra": "If u dnt give fuck wt ppl say.. uska screen shot Nikal ke wall pr kyu daltiho phir🙄😂", "wthlllllllllllll": "Nipples 😋", "jaatsurinder88": "Naha to lia kar.ya is feminism kai chakkar m saaf safai aur personal hygiene bhi bhool gai..latest aspect added in this stupid feminism - be clumsy and dirty", "sandipjadhav0999": "Shart nikal", "the_reigns_grl": "Followers badane ki ninja technique 😐 #pathetic", "meee.yash": "I guess theres no sunshine out there 🤣🤣", "mymsftsoul": "Hold up, ichthyosis tho? @redheadwayfarer how are you?", "poojary2514": "Va bvc ya e"}