{"shreyaa.fly": "@manil97 Bali bro", "bha_van_a": "❤️❤️❤️❤️", "surabhidawande": "❤️", "shanu_mumbai": "Juicy 💋💋💋💋", "gourihari_uh": "Are you pergnant???😍😍😍", "prickster.strikes.back": "Awwww sho shweet.. but he is more better looking than you are . How about hitting the gym for a change . And cut the extra flab . Oh no you love your body the way it is .", "qum.rizvi": "If u guys look properly ...her nips are visible....what kind of nudity is this????", "aishwarya.pandit": "I like all your blogs!! Seeing you guys wants me to believe in love again!!!♥️♥️♥️🤗", "ravizahu": "Lucky photographer", "zoya_bravelady": "Check these pics @kaurp86 😂😉", "dcruz_aarav": "Piche toh dekho piche ...", "iam_f.a": "I was thinking who was there to click the pics", "hkayneferns": "Some awkward scenes for the photographer!", "devubodas": "I always had one question out of curiosity...do you guys hire any professional photographer to click candid photos of you guys whenever you are on a vacation?", "barbie_doll_loves_u": "😧", "_doe.eyed_": "Luk at your nose😂😂", "dhruva_dash": "❤️❤️❤️", "deoranineha": "@hitesh91bathla seee", "geetanjalipandey7": "8", "zaidkharchiwala": "🖤🖤", "siddhi.harmalkar27": "@monica.singh.thukral y don’t you go and fuck yourself some where! You have suck a cheap mentality And just remember aagar tune Shruti ko kuch bhi bola udaar aa ke teri Gand maragi", "motanayela": "@alvi.zmn", "musings_of_the_wildflower": "This is amazing!!!!!! I really really really have been planning Bali since years! It’s on my list ever since I read about the entire culture and love that this country spreads! How it blends with all castes and creeds and people from around the world and make it home for you. I have been following @dwarakavillas since sometime seeing your cutest pictures and posts and I can see how well they have curated each and every corner of the entire place and the experiences that they are providing. It’s much more beyond any hotel living, and luxury experiences. The beautiful history that this place holds, the space that is inspired by the serenity and legends of lord Krishna, the story behind all the Balinese architecture, the wooden crafts of the country depicted through the door panels, the beautifully crafted home linen, the insanely beautiful art of food that they provide, it’s just a dream for anyone whose a sucker for such details of life and cultures ❣️I really really really wish to get to experience this through you Saloni,because it will be no less than a real life dream ❣️more power and more and more love to the kind of love and life that you both are preaching! @dwarakavillas @redheadwayfarer", "shrutideb": "@robinhola holiday picture goals for the summer", "amrjeetkaur210": "@monica.singh.thukral So its true your mom does have 2 holes :v 1 for singh and another 1 for thukral hahahaha", "lokeshofficiel": "Couple goals be like🤗", "rupeshkumar104": "We love this place", "ankitv2": "🙄yeh saala pornstar se kaam kya h!", "audacious_varsha": "@vishal_arya_euditore We must have this kind of pictures and a beautiful trip😍😍", "er_supriyo_sarkar": "@moon_antara", "sahibaoninsta": "Oooo lala ! They for sure are hot but ooooozing with love! ❤️❤️ More power to you and more love!", "mimi_guchait": "#love♥🔥", "ratula.acharjee": "Firstly, i would like to tell you that, i really really appreciate the kind of work you are doing and also i love the content you put up. Now coming to the giveaway, my partner and I are into different professions and it's been almost 7 months since we sat and sepnt quality time and I badly want to win this😋. *Note- following @dwarakavillas as well*", "itsmekamleshpatel": "I always wait for your post as you always show us new places to visit.... Thank you.....", "aftermath023": "Thought i was watching 'naked and afraid'", "nushykagram": "Sajid was right", "m.b.adil": "ye photoshoot k waqt ek hi shirt ko pehenna jaruri h kya?", "muski6780": "🌹 you guys are love💖", "poornaseneviratne": "Favorites! ♥️ Hope ya'll are doing good 😌", "sandeepdhongade": "Super photo shoot", "tamannagoswami_03": "These pictures are you too adorable...lots of love...❤️", "the.wrong.colour": "For PEACE ! 💕", "_rubina.shaikh_": "@sajid.kadar hey hubby lets go again bali our favourite destination ♥️", "hemantmeena9": "@ritik__gupta18", "quote.by.u": "Cuteness Overloaded🔥💖", "_harsha_gupta_": "Oh my God, I just found you on insta and already in love with your posts. It’s amazing.! I really love this place and always had dreamt of going here, with my mommy. I really wanna have an amazing trip with her to some really beautiful foreign location. N do every crazy thing with her. I find this place @dwarakavillas seems sooo perfect, through your posts n would love to witness it myself! 😍❤️❤️ much love to you!", "shivangeeyadav": "❤❤❤ love U both", "my_daughter_dearest": "wamt to stay here just to get such pictures clicked like yours 😍😍 @redheadwayfarer @dwarakavillas", "abishek3933": "B grade girl and charterless. If you want to do se____ then join porn industry", "rsachdeva096": "I would love to win this as a giveaway nd wanted a damm break from my life ! It is feeling soo hectic with boring life 😬 Nd want some some time to feel the positive energy Also Bali is beyond beautiful:)", "indian.dose": "Perfect Jodi💓", "___aiiiishaneeee___": "Ah you guys ❤", "__glitter__babe__": "U people are cute💖", "priyakaur2015": "❤️❤️❤️❤️❤️❤️❤️", "pranjals_30": "@redheadwayfarer To get out of all the stress in life, including college, toxic friendships and family issues.... It'll be like a much needed break.", "siyasweet.singh": "Because just like you I am also an explorer!!!!", "ibombets": "Awww", "narula_gurleen": "❤️❤️", "devil._.moon__": "pure he dikha do ab to koi dikat nhi hai ek he bat hai 😟👀", "__cheenki": "I am sure i will feel the same vibes 💕 just as you guys😘 just can’t wait. We need this.. we will have this💕", "nk_5505": "Magical", "chucky.awsum": "4th aur 6th wale p nipples nazar aarhe", "i_m_pradnya": "Goals😘❤️", "shru2097": "@_ditachi_", "arilegent": "Wow🔥👌👌👍👍👍", "sandeep.9t2": "Very romantic", "pratzie777": "@redheadwayfarer beautiful pictures❤️ you both my fav couple and serious goals 😍 and I would LOVE to spend time with the love of my life @dwarakavillas looking at these pictures even perfect would be an understatement, there are a lot of issues between our families and hence in our relationship. The situation is tense and it would be a blessing to get out somewhere so beautiful, serene and peaceful.", "ibrahimkhan6303": "Wow best friendship year😍", "mahekaics": "I would dream a vacation here not only because of the fantasy environment but also because of your lively photographs.. Eagerly waiting to pose with my bae the same way you have.❤️😘😻😍@dwarakavillas @villasdwaraka @redheadwayfarer 💞", "thatbindigirl": "I seriously seriously wish to go out with him, it has been 7 years with my person and April we would be starting off with 8 years. I have just started my career, I stay in Delhi he stays in Chandigarh and now things are not going at all, I want to spend quality time with him and make everything great. The place would make the things more stronger than before. Falling for each other, talking to each other in beautiful place will be a paradise. I will be forever glad. All I want start up to travel with him all over the places and it would be our first destination. @dwarakavillas will the perfect place ❤️", "ramurocky6": "So cute!...", "_born_twice": "😍😍😍😍😍", "samyuktas._12": "Im dating a guy who is in the defense forces of the country , he is usually on deployment for 6-7 months , We meet twice in an year as im still studying I geaduated from university of delhi and im prepping for some work , till that time its a tough call for us , even if you give me a chace i dont know how will i manage going with him, but worth the try gurl. ALSO , youre my spirit angel , what an inspiring girlll man♥️♥️", "_s_u_n_n_y_2212": "so cute couple", "rahul.2097": "You make life feel so beautiful, despite whatever issues that come and go. Keep spreading happiness. Thank you.", "tanujmudgil": "As i said it before In love with @redheadwayfarer @rahulb90 @saerahstamps #fan ❤️❤️", "preetijoy157": "I love you both so much❤️", "upasana_kerudi": "Couple goals 😍😘❤️❤️ @redheadwayfarer", "biryanimonster_23": "Such adorable pictures😍", "bhavnaagrawal0803": "Bcoz i jst want to live the moment u r living", "wildfiresax": "Cuck @sharma.hardik15 @being_ranaa", "chaosisntapit": "To unwind and get pampered by nature.", "moumita_pakira": "So cute", "zayn_konvicted": "1st night ka video live to ayega na madam apka instta pe?????", "singhbhoomika": "@redheadwayfarer bcoz it is beautiful to just be there. Feel and admire the love all the people and things have in this world. ( and with the special person - its exciting)", "bose.sanjoy": "Love for both of you...!!!", "sabudanakhichdi_": "2 min silence for the cameraman here", "manishp2025": "❣❣", "ashwinlovesgym": "🤣", "kadam1995_": "Stunning 😊🌹", "faisal3786khan": "So that i could also feel the beauty and live the life that is impossible to enjoy", "parvathy.nath_": "We never really got the chance to be together. We always had to stick with the family to hangout. I always dreamed of being with my person alone. I need to be in the pool with all free without any rules or regulations.. I want to be free kind a bird with him...i can't wait for that moment. I want to witness the moon(my boyfriend 😂?) with my practical boyfriend 😍... And yeah about the stars I love them too. We never forget to cuddle because of them. Yaaayyyy... @redheadwayfarer", "shadow__of__love21": "👙😂😂 hell", "rafid_chowdhury": "@nowshin.aysharzo", "butterfingers_i": "Such beautiful pictures! I'd love to go to dwarka with my partner it seems so romantic and wonderful! I've never been out on a trip with him and going out for the first time in such a beautiful place would literally be dreams come true! 💕💞But really you both look so happy and that has to be the best compliment to anybody! ❤", "razeb3": "It’s simply a bliss that you find love 💕 in your life partner .... #bliss . Kudos @redheadwayfarer", "nimnair": "I really want to gift this as a honeymoon to my elder sister @sindhunair__ who gets married to her high school sweetheart in October this year. This will be the best gift ever I know for it's the number one Destination on their list! I really hope you consider this ❤️", "i_am_mr.holmes": "Soooooo romantic couples😇☺️😊", "abhishek_thadi": "love love😍", "sarada_debnath": "@redheadwayfarer and rahul ,you guys are giving major couple goals. I love you guys.... rahul and saloni ami tomader khub valo basi.....❤❤❤", "himanshibhatia15": "@chawla.aakash please refer this place for our honeymoon 🌹🥰", "subhankarghosh62": "Sab thek hai but introduce the person behind the lens @redheadwayfarer 😂😂😂😂😂😂😂", "smellslikeavacado": "@redheadwayfarer bringin’ it with brekkie in bed, with sambals & nasi gorengs always well fed 🍝 diggin’ the blue private waters, some skinny dippin’ for fun starters 🌊 @dwarakavillas be the utopian tropical pad, niggas chillin’ all day, feelin’ all rad 🌴 🙌🏻 😎", "ananya_gupta7": "🖤", "ashok2303": "👩‍❤️‍💋‍👩👩‍❤️‍💋‍👩", "_official.moin": "👙 ye galat h....apka sb dekh rahe h", "premniyogi": "I wonder who clicked the pics...🤔", "theneha.me": "So Pure and Ingenuous ♥️", "prraveengupta": "Find yourself someone' who look at you as @redheadwayfarer at her boy", "shilpa_dwivedi_": "I love u both ❤️ u guys r idol couple", "basheeerz": "❤️❤️❤️", "j.jannah12": "Hmm @ruchikaakapoor", "talukderasurjoukhi": "An amazing", "shriya.tripathii": "😍😍😍💓💓", "prashantkaher": "@redheadwayfarer nice", "clavical2012": "I want to work as ur photographer...will get any pay ?", "lamiashahdat": "goals", "tanmay_lahiri_7": "Beautiful couple 👌", "itsme_kailash": "ये फोटो कौन लेता हैं आप लोगो की", "_divya_jami_": "Awww... these pictures are so lovely♥️", "asav.ariel": "Absolutely mesmerizing 💕💕", "pradnya_karande": "Hey love ur energy in every post. It feels positive n energized after reading. Also , not undeniable fact that u r a bigger relationship goal to alot of girls like me ☺️😋 lots of love to you @redheadwayfarer ♥️", "umakedia": "Pyaar❤️", "written_abruptly": "@anveshika_28", "handeemyyyy": "Y don't u try in porn🔥", "elenasparrow\nVerified": "Verified", "ramsri385": "Made for each other.", "_wild__cat__": "Tell me one thing...when would we see ur wedding pictures😂😂....I mean you both look so adorable🌸", "shailjasays": "I want to stay here because I need a home away from home with my main. @dwarakavillas look cozy, welcoming and freeing. We've never been on a trip together, just us two and I guess with this I can finally convince him to just jump right in with me. Also, craving to visit Indonesia-Bali from a long time now.", "saloniiiii_02": "Beautiful ❤️💯🔥", "gyaneshwar_": "4th pic is 🔥🔥", "iam_ravikaushal": "Nipple😁😁", "souvk18": "🔥😳", "nuwanda_supertramp": "❤️", "sana.knm": "Have been wanting to travel from the past one your but would get delayed because of work and then finance. Since something will already be planned it’ll be easier to get on with it with my husband", "nancy_0997": "One day i swear I'm gonna take pictures like this. I so love you and adore you for what you are. I feel really sad when i see such hate comments. But you let me believe whatever you do they are gonna judge so be yourself. Thank you for inspiring♥", "basicsnaps": "I would love to go and stay here*", "blish_wish": "@pravarsh_kothekar check out the pictures baby. #goals❤️", "hem_mk": "Bless you both..Stay Happy", "jijin_john19": "I want someone like this... U too are an inspiration... Awwsum...", "im___vk": "@redheadwayfarer Bcoz I married my love whom i dated for 13 years but unfortunately after 2 years of marriage i cudnt take her to honeymoon or vacation. I regret it badly just because of personal reasons. I desperately want to win this. Atleast we can spent time together like we do spent before marriage. Ita complicated ❤️❤️💓💕💕💓💕❤️", "prabhleenchopra": "♥️♥️", "magnificent_faraz": "Who cliked the pictures", "moda_fied": "So much love😍❤️ you guys are goalssss😭😭😭🙈🙈🙈💕💕💕💕 it’s just so beautiful how you guys keeping everything so real, so transparent, with no manipulation, the kind of intimacy so beautiful 😍", "fk4gpc": "Eye candy", "ishikagxx": "This is soo adorable ❤️❤️❤️😭", "estaticaly": "Wait, who is taking these pictures?", "indian566": "💋👌👍", "pratikk0901": "Btw no offence who clicks these pictures???🔥🔥😍", "x23_shivam": "Nip slip", "vishal_rathore_007": "So beautiful all pic💋", "so.nu2082": "Excellent", "ria_tailor1619": "Love these pictures💓", "niravshah2505": "Fuck your r damn hot🔥", "ardently_jaded": "U guys 🔥🔥🔥🔥😘😘", "wmk_kaur": "One day i really need confidence lik you! 😍 i just love the way you guys live😘 lots of hugs 🤗and blessings to you guys☺ really want a partner like @rahulb90 in my life too! Who support my ambitious too! Good luck guys! All the very best👍 @redheadwayfarer 😍💋", "plaviadas": "😍@hrshadas", "diksha_goje": "Gosh you guys are adorable. I would love to experience Bali the way you did with @dwarakavillas . ❤️❤️ It would be a beautiful break from the city chaos!", "hamza__rajput_hz": "Awsm 🔥", "sumeetgarcha": "#couplegoals😍", "siddharthkaushall": "Couple goals :’) keep shining both of you❤️loads of love", "thatgirlinvogue.n": "Adorableee 🔥😩❤️❤️", "realsubham": "Who is clicking these intimate photos 😅", "imran.arab.1276": "Wow so beautiful 🌷🌷🌷🌷👌👌👌", "mrhussain007": "So Romantic", "mr.jakke_911": "😍😍", "_.dipty_rout._": "😍", "_slutforchocolate": "8th pic ❤️❤️", "_miss_ghosh": "I'm just loving you guys❤", "ask_mj_sonu": "Guts's beauty @redheadwayfarer 😍", "thequintessentialbong": "Such realistic couple goals.@redheadwayfarer your confidence and your outlook towards life, has liberated me. Loads of love and more power to you.", "prakriti_nature8": "Omg 😍😍😍 Babe let’s do this @nayeem_sreyash 😭", "rahullsingla": "I voted you ❤️🎥 @redheadwayfarer", "isssac1357": "Stop rubbing it on our faces. Assholes.", "krishnamohitt": "God bless you both @redheadwayfarer", "gandhimanshil": "Energetic 😋😋😋😋😋@redheadwayfarer", "sachin_ish": "Love💚♥️", "tiyashachaudhury": "Your babies will be so beautiful🙌💕", "amogh_stark": "I wanna win it coz m sooo poor that I can't afford myself!", "viishakha_s": "😍😍", "21_naksitimbadia": "How is dwarka? Im planning to visit it", "divyainstagra": "❤️I just loved the love you guys share with each other.", "shitizjain23jul": "So beautiful... 😍❤️ Cosmic love energy ❤️💕 Love you lovely couple 🤗😘😘", "vicky_vr7": "When will you marry ? @redheadwayfarer 💐😘😁", "_oxyfuckingmoron_": "U guys give some serious goals ❤️❤️", "shaantbachha": "Looks good. cant afford it. :)", "ranveen123": "He bhagwan 😥😥😥😥😢", "onlyanjali11": "First of all, I love you Saloni. I love you for the fearless , badass woman you are. You inspire me so much. Secondly, I’d love to go here because A- its beyond beautiful , B- Me and my husband desperately need a break from our routine to reconnect with each other before its too late. Please consider :) Much love 💋", "adrinapuja": "i am a solo traveller n as international women day is approaching...just want to tell all ladies freedom is our birth right n travelling alone also empower us with that freedom ❤", "wendyvwanniang": "You guys are goals seriously!", "pritinawade": "They're Goals ❤️💯 @shalini__2699", "kirtibhardwaj": "@redheadwayfarer I have alwys dreamt of a place where i can feel home- that warmth and comfort that we all find in our messy bedrooms. This place feels like somewhere i can just breath, visualise, write journal and simply be mindfull and the moment i saw your post felt like this is it.♥️", "jasmine.alappat": "I would LOVE a break after my boards exams and I can't think of a better place than this :)", "ektaavarmaa": "Y'll are soooooo adorable 😭😭😭😭", "preethica22": "@claytonserao check this out babe! How lovely they look♥️♥️♥️♥️♥️ and the place", "pujan.bhatt": "@theskyfall__ look at the hotness", "ashmitathapa97": "Couple goals😍", "mogli_14": "❤", "ankita3010": "God, those vibes and that love. I wish everyone is capable of falling and staying in love as much as both of you are. Sending all the warmth and love !! 🌸💐", "___twinkling___": "I really want to win this now cause my mid sem break is approaching and i want to have some fun time with my girls. I want to keep all the miseries and tensions away for some moments and be me! @redheadwayfarer Please give me this chance please?!", "ali.mehmood": "8th pic ❤️", "khushiikalia": "Damnnn you guys are couple goals😍♥️🔥🔥", "chris8843": "Lots of love to uh mam😊🤙🏻 @redheadwayfarer", "sixpack_loading": "you're such a tease", "17_clementinee": "You seriously never fail to impress ❤❤lots of love to you both ❤❤", "geeta_patra": "💕🔥", "rajjat0410": "So hottt couple", "yashnirwan": "❤️❤️❤️", "karan_sharda11": "Did u carry your photographer everywhere 🥴", "keval_rabari_2910": "@redheadwayfarer #😘✌😍", "naive_n_candid": "❤️❤️ @redheadwayfarer you r amazing 🔥🔥", "l_o_s_t_b_o_u_y": "God bless u guys 👍😊", "_apoo29_": "@__v_i_r_a_j_ viru.... Ubud😹😹", "babyumnam": "Goals❤️", "_rutujakurhe_": "💕", "hippiefromthecity": "Such beautiful pictures Saloni!", "lubna_saba97": "I would love to win because I really need a break after exams and this place can help me calm my anxiety... Love u though 💋❤️", "ahanangv": "@redheadwayfarer .. I need some self love and tlc, and this place just looks too tempting. Tired of all the body shaming and raised eyebrows around... Want the little peace and loving even is it's 2nights and 3 days... P.S- love love your pictures, you are so confident.. it inspires me! ❤️", "neaish_64": "Why so cuteee❤️❤️❤️", "bcsarita": "Loved Ur captions n pics", "makwanapiyush101": "So romantic 👭", "manishasingh___": "@redheadwayfarer You two are astounding couple♥️🌸", "dr.tony.tony.chopper": "Arre arre. Nazar na lage❤️ @redheadwayfarer", "keshav_babu_gupta": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "jishnu.ck.568": "Nice", "meghachauhann": "💙💙", "vikashchoudhary009": "Today instagram best lovely pic 💖💖💖😘", "pooja_chaurasia_": "Raw and beautiful❤️🌸", "bablibadmaashh": "Already following @dwarakavillas .. I am a solo traveller . Maybe I would find love there. .. haven't ever won anything before ... This would be a perfect gift to myself", "ghelaninidhi_": "@redheadwayfarer I soooooooo envy you yaaaa.... u both look soooooo super cute... and all these breathtaking places u get to visit with him....... perfect! (P.s please marry him... he is the cutest... sweetest and soooooo goddam adorable... and yaaa.. so are u... ) 💜💜💜💜", "vaishnvi_satpute": "U guys r 🔥🔥🔥🔥🔥🔥🔥 😘😘😘😘😘😘", "trashhboxx": "I love you both.", "vikram_s.saxena": "Beautiful 😂", "maha.khn": "So much of love 😍", "sanjanaroy276": "❤️ pure souls", "priyasharma_026": "Relationship goals af♥️", "swat_nahar": "💟", "diksha1235": "Hotness 😍😍 btw u both look super cute tougher 😘", "yamuna_reddy": "Woww😌😌😌 so nice ...best couple goals💗", "lightthewickk": "Such beautiful lovers", "ritturijhwani": "It seems like the perfect place to just celebrate love and friendship with your partner! 😍😍", "shivangi.taneja": "💕😍", "aditee_gp": "So beautiful ❤️", "diptishinde_09": "Cuttestttt ❤️", "abhishek_jain16919": "Beautiful couple 🔥😍❤️", "nadeem_hayat_khokhar": "Sexy 🔥", "zubairahmad698": "come into my message box please", "suhanigandhii": "And you both💕🔥", "_girlinterrupted": "You're so in love, it's so beautiful 💞", "imperfectmaster": "Beautiful you two 😍🔥", "meghamakhija7": "I just love u for being urself...keep slaying girl❤❤", "ashrika_mishra": "Love, Pictures & the Location like this! @surajjha03 💜🤑", "riptighosal": "Ulliiiii baba li....(it's a Bengali word) which represents Adorable at its best...😍THAT'S WHAT YOU TWO ARE TOGETHER...😍😍🤗💞💓stay blessed...😌🙌", "_.im_the_wolf._": "😍😍😍❤️❤️❤️", "_innocent_prajapati": "❤️👑", "_amritaaa_": "Cute but why so much PDA? 😐", "ashish9969": "For 4th and 6th pic❤️😂", "the_honeygirl05": "You both🔥🔥", "samkareem0712": "This gives me relationship & travel goal.. Adorable couple 👫"}