{"sharmakaran25": "To jab itna hi bhasan deri hai to vo yellow yellow drawing kyu kri hue hai bhai nipples pr khul kr dikhaa na fir agar itna bhasan deri hai to ache se hi present kr apni bat ko . Teri hi pic m saf dikhra hai ki tu khud khul kr show nhi kr pari hai agar hai himat to dikhaa na fir sb kuch kr . Abe bola jb kr jb khud puri pic dikhane ki himmt rkhti ho 🤷‍♀", "00rbr00": "🤣", "pihuacute9": "Thn why you hiding your nipples? @redheadwayfarer", "akriti_jainn": "Girl♥️", "chhayamanobi": "I just wanna know the reason of covering nipples with yellow lines here 🙂, can u answer ? @redheadwayfarer", "mostlysane_guwahati": "Jesus said chill", "mannubrar30": "Remember. No one does that. It's always the self wish. Stop this all shit. Both the genders are equal. And everyone has right to do anything that he/she wants.", "theplacardguy": "Redhead: let me roam naked. Me: okay ma'am, as you desire. Me: Let me also roam naked with my deck hanging out. Same Redhead: You pervert, raaapist, MYsogyNist, patriarchyyyy!!", "r_u_ready_4_it": "People! Why don’t you get it? You all are totally missing the point. Jab ladki ki baat aati hai, toh everyone has a say in what she wears and HOW she wears it, what time she comes home, who she dates etc etc but when it comes to guys, they feel it’s the guy’s own business and they don’t interfere. That’s ALL we want as women too - to be free to whatever the hell we want to do - whether it’s wearing less clothes or totally covering up our bodies.", "vaishhh.__": "@redheadwayfarer free the dick how about that . Even that's a right you want to show show it man no one gives a fuck but don't do it at the name sake feminism. 🙌 And yea breast is sexual organ and you will come up with 1000 excuses that saying it is not. Then boys will also come up with 1000 reasons saying that dick is not sexual organ and it's a Choice. Why is the only about boobs everytime seriously. Boobs are indeed attractive and yes scientifically it arouses different feelings compare to chest. 🙌", "snea01": "More power girl❣❣", "abhaymootha": "👏👏", "namaslaayyy": "GODDESS 😍😍😍😍😍😍", "fahad.ali17": "i want to see your nipples pic can you dm me your pics with nipples", "asmita__s": "Why do you have to cover her tits ? There is nothing wrong in them 😅", "nabhadeshpande": "You could have demanded rights in some other meaningfull way . Nudity or freedom of nudity is just a stupid way of misleading thousands of people under the name of female rights and gender equality .", "christinanamrata": "Y r u hiding your nipples saloni ? R u ashamed", "its__darthvader": "How the fuck in roaming nude gonna make someone feel powerful..It makes them feel disgusting..we still aren't in Early man stage.", "girls_cars_models": "If you live and fight for equality why are you hiding your nipples", "89_wolverine": "So This is the mentality of womens nowdays , mam feminism means equality not nudity 😁😁😁 if you want to encourage youth n people i 'm sure this isn't right way...so sorry for you...", "shasha_says": "@payal9531singh @indecisiveresearcher @swesha_singh @praji26_ @ysbhagwat53 @sim_15_ahuja @rachna_shukla_31", "ka.ran77901": "Nipples ko jalebi see cover Kar Diya and she is shouting equality Puri nangi hoja na fir bhauk equality ... Cheap attention seeker you ain't achieving anything by this .... Women roaming naked on streets in India isn't making any difference or prospering women ... Kuch acche values inculcta", "_shrishtiiiiii_": "@kristyt99", "sritambadtya": "Fucking mentality 🖕🖕🖕", "iamthekc10": "I don't know whether you're reading this or not but this mindset will arrive in India after some time . Short dresses are common now so, #FreeTheNipple can also be true in future.", "naresh_garlapati": "@redheadwayfarer who is Saloni Chopra .........is it porn star or feminist ?", "yashaggarwal21": "i appreciate this post but as i can see you are a big feminist i hope you write something for the pornstars too i mean it's thier body too it's thier rght to do whatever they want to do with thier body i hope you can somehow help them get some dignity in this type of societ", "yousuf1791": "She's a shameless lady openly destroying our Indian culture. Fuck off .", "vineettolani": "I didnt get it...so equality means to roam topless ,,,bravo", "thakur_dhruv_singh__": "Arre bcc itni feminism hai.... toh Jalebi kyu lga li vha😂", "ishbatra": "Rockstar you are! 🤗", "khushisingh.25": "YOU ARE SO BEAUTIFUL ❤️", "pranjali_khandare": "💕", "sanikasohoni": "Agreed🙂❤️", "dan._sh": "Kyaa bola hai yaar @redheadwayfarer", "mitaliimaru": "❤️❤️", "arthi_kiddo": "I wish I could throw this post at a few people in my life! :/", "gauri_s_jaikar24": "I am not getting what exactly you're talking about or u meant by feminism .....removing all clothes and showing is wat called freedom....I just don't get this type of freedom...", "lavanya_vaddavalli": "Happy women's day 💞", "sreya_c10": "❤️ honey.. lots of love. 😘😘", "_muggle_born_squib_": "Power to u girl🔥", "kaleprattk": "🔥🔥True that, but people do judge unfortunately.", "apnaprashant8": "To show boobs everywhere is not freedom... Galat to galat h ....koi v ni chahega ki koi uske boobs ko dekhe...think in this pic if ur mom doing the same thing what u did...achha ni lgega n", "parrth.mehta": "Okay this is for everyone, it is not about nudity or modesty it is about natural and unnatural 1. Males and females have two different organs, two different bodies and naturally two different sexual energies. 2. You don't see women getting turned by men going shirtless but that is not the case with men when women do the same, it is just naturally how they are. 3. Don't blame your man when you see him looking at naked girls because you normalized it in the first place. 4. Women are neither empowered by nudity nor modesty but by their natural sense of intelligence, care and love. So stop calling yourself open minded/feminist when you don't understand basic human knowledge.", "soniasharma1257": "please genuine replies only. I don't want any hate comments. i am genuinely thinking what would happen to that man?", "lg.d.raund": "#goa ao kabhi 😁", "mahadiksakshi": "I wish the whole world would think like you your caption make us feel motivated and confident #proudtobeawomen", "pavankumar_pedapudi": "Saying I don't believe in pseudo feminism or Feminazis is sexist? Then Yess.. I'm a sexist. I can't stand if some over powered shit a ruins a person's life by false accusations. No matter which gender they belong to. I can follow equality and humanity without a name, because names have always ruined lives. One can be whatever they want untill they harmfully affect someone. Then no, they should be stopped, their actions should be stopped. It's just like some religions. Started off with good will and then started massacring people.", "mewatiman": "Not caring for each other & doing what u love to do will ruin the society, and the sacrifice that people made for others will have no value, the biggest threat to being human is there own self, she is overwhelmed by her lower self also refer as animal soul, language is what makes us different from being animal, clothing is a part civilizated society, its not about nudity or being feminist, or even wering clothes, cuz there are still so many people who were clothes but still unclothed. She don't need to justify her being. Ur statements different on one part land to another part of land were as we have same value on ever inc on the earth. #lier #satain #clever", "thosethoughts6": "Yes women can do whatever they want but getting naked just to show that we are equal to men is insane. I support feminism but that's wrong definition of feminism. You are a powerful girl but stop spreading fake feminism. Getting naked or topless is not empowerment at all.", "_cykabylat1998": "So why did you even blur it ? Why not post completely nude? This shows your double standards and shows how much of a entitled bitch you are. Just doing a public stunt at least do it properly. Wanna be topless ? You feel empowered? Be like poonam pandey and proof it to your audience.", "okaybye578": "❤️❤️❤️❤️❤️", "poeminent": "We try to change the generation before us, and mold them into those who would accept our beliefs. But I think it is best if we let our generation be the ones in their position one day because then it would be much easier to implement our beliefs.", "the_holisticmermaidxo": "YESSSS OMFGGG YOU ARE EVERYTHING", "rajeshwari2496": "U are a true inspiration too allll the womens out there!!! ❣️Hats Off To You!!🙌🙌💯", "_.riteshkumar._": "Just respect for her words and thinking!🙌🔥 But as Indians could we even think about this change?", "swagatika097": "This girl is fireeee!!!..... Be careful folks!!!! There is more in the running😘😘😘😘😘..... Lots of love darling!!!!! @redheadwayfarer", "doubledekar": "❤️", "pragya_lal": "More power to u girl ❤️❤️😘😘", "ssp_gamer": "Bold", "ishuhot": "महिला दिवस की शुभकामनाओं के साथ।। दुनिया भर की महिलाएं चाँद पे जा रही हैं और हमारे इधर की हर महीने \"सैनिटरी पैड\" से शुरू कर \"ब्रा\" तक ही पहुँच पाती हैं। प्रिय फेमिनिस्टों.... आप अपने देश के पुरुष नागरिकों को इतना टुच्चा साबित करने पे क्यों तुली रहती हो हमेसा?? आपका अंडर गारमेंटस पुरुषों के लिए चर्चा का विषय नही होता, हाँ अपने बीवी-बच्चों का पेट कैसे पालना है, बेटी की शादी कैसे करनी है, कैसे पढ़ना है वगैरह-वगैरह में ही जिंदगी कट जाती है इनकी और फिर टुच्चे तो हर देश में पाये जाते है पर हमारी जनसंख्या थोड़ी अधिक है और साक्षरता दर कम तो हमारे इधर कुछ ज्यादा है बाकी अंडर गारमेंट्स नाम ही दिया गया इनका तो उसका प्रदर्शन करना भी कहाँ तक ऊँचीत है बताइये? दूसरी बात आप अपने सैनिटरी नैपकिन्स को चिल्ला कर माँगिये या कान में खुसफुस कर मुझे नही लगता मर्दों पे कोई नकारात्मक प्रभाव पड़ता होगा उसका क्योंकि वो भी मजबूरी समझते हैं बाकी आपकी मर्जी है कि आप उसे काली थैली में ले कर जाओ, या 4 बंदूकधारियों की सुरक्षा में छिपा कर ले जाओ या फिर सर पे ले कर मटकती हुई ले जाओ हमे क्या?? पर ये चुतियापा बन्द कर दो प्ल्ज़ और काम-धाम पे ध्यान दो, तरक्की करो... बकचोदी मत करो।", "ahana.chowdhury": "👏", "singhchauhanshivendrapratap": "Girls are stupid", "vrudhip": "You need guts to do this. Hats of @redheadwayfarer 🙋🏻‍♀️", "siddharth_peepra": "@redheadwayfarer your thpughts are inspiring.... you can bring a big & positive change😊😊😊", "m_a_.n._y_a": "Wowowww...total lit🔥🔥", "esthah.james": "Bravo!! But before putting the blame completely on us men or women know that the we way we think or do is mostly influenced by this inherited characteristic in DNA as well as the characteristics we are taught or we observe from. Change or breaking the conventions of thought happens only at a very slow rate as only a few people do so. And beware when you tell an older man or woman that the ideology or lifestyle she or he held till now is wrong because then it would mean that their whole life and existence was wrong. How would you feel if you were told that you were all these years living a lie??", "shreyanshaswal": "Just by exposing your breasts, you are not fighting for any women causes you dumbass.... Try doing something meaningful for girls, which will help them to achieve something good in their future.... Do not equate a topless pic to empowering women, just post your pic and leave", "ntirlotkar": "Jada Gyan mat chodo Jo chahte ho wo bindass karo itna kyu likhna apne app ko justify karte ho Jo sochte hai unhe sochne do", "ys.godara": "The way it's EXPLAINED 🔥🔥🔥🔥", "vineet_pratyush_widu": "🔥💯💯🔥", "gharwaapsi": "feminazis😂😂😂😂", "pallo152": "I love you ❤️", "priyanka_ambulge": "This is the best thing I read today❤️ So true!", "ketkisarange": "@mishapapapapa", "chintu_dixter": "👌👌👌🔥", "tulipearl_": "Wishing every man and every woman on this goddamn planet and beyond to look at nudity like she does. So powerful.", "be2_op": "Wouldn’t it be nice if your mom joins the same movement you are running", "aana_pruthi": "Your words your thoughts 💯💯", "d._.snowflakes": "❤️❤️❤️", "fio.naaaaaaaaa": "#respect👏", "guddu_bhaiya_mirzaapur": "If it's just a Pair of breast then why are you hiding it. People will speak in every situation. Don't give fuck about them. Upload pics you want to upload 😘", "parthivvvv": "Oh didi army join karlo", "pratishtha_paul": "Much respect with the way you think... I really wish everyone would hv similar thoughts... !! Much love..", "hunnyjindal20": "I am feminist", "mr_mandhanya": "Why you put that swirl in this picture?? You only proved that we have to live according to the society!! I am not against your thoughts, they are massive and matured enough! But unfortunately these are thoughts only! You can not make it in real!!! Education matters! As simple as if you post any picture without that swirl...Insta( society) will remove it!!", "lgbtmumbai": "💜💙💚💛🧡❤️", "shreeya._.161": "You are an inspiration to soooooo many young girls like me❤️❤️ Thank you for your words and the efforts that you are putting in to bring a change. More power to you 🌟💘", "_alzenaz_": "I just loved it. Thank you so much for such inspirational post. Love you lady @redheadwayfarer 💕💕😍😍😘😘😘😘😘💓💓💓", "educated__moron___": "❤️ that's lovely @redheadwayfarer", "___browsonfleek___": "I think we’re going back to Stone Age lmao where clothes weren’t invented", "zarr_21": "Women are precious and thus are supposed to cover their precious things.. being naked like guys is a wrong way to show or make people realise about feminism. Covering ourselves makes us superior than men. Modesty is always beautiful. By Posting naked pictures you are just giving those jerks to have a good time and talk about it. Feminism is nice and cool, but does being naked proves you won..? Good things can be done in a good way too;)", "khan__shireen": "Very well said ♥️", "shambhavijaipuriar": "@shambhaviiix @vishakha__11 @riddhimazz read the series. Its in 3 parts", "uttara_17": "WHAT A POWERFUL PICTURE AND WHAAATTTT A POWERFUL CAPTION!! I mean🔥🔥 ..uhhh❤️❤️❤️", "the.bad.eve": "@toter_mann_mit_einer_kamera post r comments gulo parle porish 🤣", "_wild__cat__": "You killedddd it as alwayss..💙💙💙💙💙💙", "lensbehindthelens": "People are just not habituated to seeing dicks or boobs/ vagina on the streets or even on the beaches all around the world except few. That’s why it is slightly weird for the everyone to see people naked in public places. Even if a man will walk without a trouser people will react the same way when they’ll see a women without any top ( if discrimination doesn’t existed). The point here is that there’ll be a reaction although it can vary around the world and it would be better if the reaction was same for both. I think it’s just about hiding your private parts men have less women’s have more and in every culture it’s taught to hide that’s why showing it is not normal. Equality would be if you would have written “ get over it’s just dicks and boobs”and also if the reaction for the women wouldn’t have been that illogical or the same for both.", "shoppingstyleandus": "To all who judge @redheadwayfarer , her rule is simple, I guess. Let people be what they want to be if they are not stealing, killing or hurting someone physically. Accept people the way they are!! And it isn’t about only females but males too. Peace ✌️ out !", "manikakeer": "❤️❤️👏🏻👏🏻", "ipsit__": "as social beings we should have some social standards . When no one around we can be whatever but in society if we expect something out of the social standards then either we have to change the society or their standards. It is like where this pic was taken the society accepts it there and it is normal but we cannot expect it as universal. It is good if we all human beings can agreed open to a single universal standard but we are far from that due to a lots of social differences. Excuse me as I may be wrong but This is my understandings till now", "the_rajanikant": "Aree wo yellow spot ki bhi jarurat nhi thhi ...#", "devilmiher": "Ok then don't wear anything and roamlike men in everywhere not only in beach every place like road,church,market,cinema hall ,if you can then only come here and give your speech ,we r eagarely waiting for to hear", "dank_sauce_sage_": "Unblur it and try again!🤷🏻‍♂️ If you want to pass on a strong message! This doesn't cut it!", "priyanshitalks": "💙💙💙💙", "govindasingh03": "Wow", "anushkkkaaa": "👏👏", "aadyamishra18": "What a piece ! 💜", "sed_d_mathews": "@jas_pics", "shuvv_ghosh": "Finally she learns what feminism truly means..", "asliarpit2725": "@redheadwayfarer stop inspiring other girls in a wrong way. You are a role model for some of them. Breasts are naturally sexualized organs and yes they are to be covered when meant to.", "dr_samrudhi_balvir": "You are inspiration.. ❤❤❤", "shraddha_deori": "Exactly a strong reply to those who think women are weak. And cannot even save themselves. Wearing what you want doesn't make you a slut. Not wearing what you don't want doesn't make you a slut. It's about the comfy of our own body and not the mindset of some. 😊. @redheadwayfarer", "tanvi_prashar": "Kudos man!", "khyatimishraa": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "mayuri_sreepada": "If only nudity was the solution for all the problems that women are facing everyday!", "sonal.chauhan_": "❤️", "snehal_p_gaikwad": "I love to pluto and back", "the_envious_buddha": "😂😂😂", "vaaaishnavi": "You’re the besttt❤️", "shreya_5124": "@shweta0111", "labdhivakhariya": "Oh my god, the caption! 🙌❤️", "_lostmyselfinthetardis": "@imotiweighted behen yeh dekho", "dressforyourselfofficial": "Caption♥️😍♥️😍", "fashin_girliyapa": "@redheadwayfarer Spain s pehle she went for a vacation in Bali...... Or kitta nanga hoyegi ye bhosdivali..... PS thanks for the shaiyari....", "alydoshambe": "This pic had nothing to do with feminism. This pic was taken at a place where this is a norm and accepted. If a man does this in on an Indian beach, wnt everyone there stop him? So the same goes for women. When you want to talk abt feminism it's good. And I believe in equality in every aspect. Usually ur posts are good but here u contradict urself. U start off saying feminism isn't abt nudity and then you talk abt restriction. Nudity is restricted by all countries in most of their places. Only a few beaches and communities have such freedom. But yes fight for your rights, be it a man, LGBT or woman. All are equal, all human beings are equal regardless of anything.", "gagan___sidhu____": "👏👏", "ishansingla": "https://youtu.be/_fiu9BEojTE Just wanted to share this video here. Felt like an appropriate place to share. If Link wont open. Try typing it on google.", "ayesha_panchi": "👏👏👏👏👏", "bindiia": "I love you my girl @redheadwayfarer on my next birthday I want you to present me a book ’written by none other than @redheadwayfarer❤️❤️what say kids!!! it's high time..isnt it?? Love you ALL 😘😘❤️❤️", "_beingflirty_": "upload nude once please.", "kirtika3004": "You always stand for the right and I very much agree to that point because if a girl is comfortable with her body she should have all the right to flaunt it @redheadwayfarer", "sreyankaa": "Preachhh 🙌🏻🙌🏻", "queen_of_monsters_nidhi": "Dii you are literally the inspiration 🙌", "shamsdreamerlover": "True!!!", "certain_kidd": "True word ♥", "zarya5670": "Hmmm....", "aniketacharjee": "This is cheating.. you are only topless", "saleem.saudagar": "Sexy 💕😘", "behudalog": "Empowerment is not about being nude or posting pictures like that baby girl...but still I don’t give a fuck. 🤷‍♀️", "aleee_na21": "❤️❤️❤️", "ibrahimkhan6303": "Wow😍😘", "07traveling_butterfly": "How beautifully written... Like a poetry that i want everyone to recite daily... 😘 song to my ear.... Tysm for being here whenever i've a doubt about something i read you and it vanished....😍", "rishabh.upadhyay": "@vani__sahu 😊", "cactussneha": "@nichal.jacob @ruchitabelapurkar", "risingsoulll": "More power to youuu💜💜", "d_delikate_wild": "I hope, one day, I would feel comfortable with my body as well. Powerful post❤️ with awesome PS😂", "neha_kapuur": "Lovely", "peii15_pam": "I felt like this is so me throughout while reading, love you gal💞 @redheadwayfarer", "harsha.hrk": "Wo sab toh theek h behen ji.. But y those yellow edits?? After such long essay ! At last u edited 😵😵", "arashmokhtari_7": "Sexy", "yogirajsinh_7": "#Full_support_☺️ #Malse_badhane👍 #લાઈક_કમેન્ટ_નો_વેવાર_રાખજો👍💥💣#धमाका_pic💣💥#_बोले_तो_εκ_दम_JακΚαS😍😍😍", "sukeerat_channi": "Well put and on point ⚡", "gupta.souhard": "No issue...wat u r wearing ... but a question for u...if u seriously want to raise ur voice on feminism...den do the same in india...vaise toh tumhara ye feminism ka definition hi mere bus se bahar h...", "shah_r.yan": "This is amazing...🙌", "kashish_sharmaa_": "Yes yes yess!!!", "tishaaaastic": "@__ankita_dubey__ 🔥", "neha.sarkar_": "Nice", "kinkinnatore": "Caption ❤️❤️", "abhishek.suryawanshi1": "Jalebi 😂", "vaibhavi_sawant": "Love this! ❤️", "bhavya__bose": "Oh my god so well explainedddd😭❤️", "prajjwal_vaishy": "Eye opening post bro 🔥", "sameershah54": "Every girl who is enjoying this women empowerment talks and being strong feminist are mostly same girls who can't even have guts to stand up to their own parents, have their own stand for their own desire of life and decisions. Feminism is basically just an excuse for you to brag about something.", "dpritze": "We love you @redheadwayfarer 💞💯🙌😍", "itbas93": "@redheadwayfarer ❤️", "chandpaa": "Sach me strong😘", "ridz_d": "🙌proud of u", "saltybuttercup": "Perfecto ♥️", "picsterzz": "Where can we get this uncensored pic 😂😂", "ooffomantasha": "@puunam___ read the caption ❤️", "swarthysagittarius": "You made my thoughts even more broad. Had always been impressed the way you illustrate reality check!♥️♥️♥️ #moreloverespecttoyou XOXO", "dead.____________user": "💓nyx", "_morningstar94": "As long as you abide by the law, everything is all right. But I don't like the fact the extortion become the profession if many women, and surprisingly other feminists support that.", "nutella.nutcase": "Feminism started when females were not allowed to get educated n work like men but somehow feminism then got associated with alot of things and all of it.. n all that is highlighted nowerdays on social media is pseudo feminism .. i think we should have moved step by step .. it sounds like in a country where more than half of the people are job less.. you are fighting that sat-Sunday’s should be non working ..", "love_marrige_specialist_uk3": "जय माँ भद्रकाली । ज्योतिष दरबार । समस्या है तो समाधान भी है । निराश माता व बहने एक बार फ़ोन जरूर करें । बड़ी से बड़ी समस्या का समाधान । जैसे -: लव वशीकरण, लव मैरिज, पति पत्नी में अनबन, जादू टोना, दुश्मन को खत्म करना, ग्रह क्लेश, लव प्रॉब्लम, सभी समस्याओं का समाधान, Love problem, Intercast love marriage, Husband wife dispute, Black magic spell, Relationship problem solution, Whatsapp Now +91-9587008635", "dreamy_delacour": "Love this post of yours. I see so many posts in social networking sites questioning how could this or that be empowering for women and dictating what should be considered as empowering, which beats the whole purpose.", "gunjan_dilip": "Mk", "onewith_thecurls": "You go girl 💕", "kaju_897": "💜💜💜💜💜💜💜💜", "orgasmbymassage": "Madarchod rand", "_swati__jha_": "@redheadwayfarer broh you’re an inspiration man🙌🏻 I feel this post You go gal More and more power to you 👄 Dil jeet liya @redheadwayfarer", "anoop_golwala": "R u stunt girl ? Who did paid you to do such nonsense things to post ? Photo upload karne se feminism nahi hota. Kuch aesa kaam karo or fir itna Lamba lecture upload karo.", "_toogforyou_": "You go girl❤️", "shrreyaa_": "The caption is so so powerful! 💯💯", "shilpishiva25": "😴", "yatin_yadav_": "Bc🔥🔥", "gharsha.dr": "Fantastic", "shobhu.v": "You have shown me how to love myself, my fat belly, my thick waiste and imperfections. The confidence that I have all credits to u. Thank you for being our power n more power to you alwys. Thanks again.", "pria_naik": "Awesome😊", "agarwalpallavi93": "Made my day! 😍", "avibratadey": "😲👙🔥❤💋😍💘😘", "mathurharshita": "Love love love love it", "thoughtcriminal94": "First tell me , who is \"they, them, all of them\" are to you people. Because is this a self propaganda? I don't think you would have gone through a personal humiliation regarding all this stuff. Because, if you have, you are on the minority side arguing, and it isn't about minority or majority here, the very fact that you think some alien human force is opposing womaninity from doing all sorts of things you are doing is absolutely impotent in it's rage and thought.", "evelyn_the_wanderer": "The post is just \"wow\".🖤", "harrien_patel": "Y do u relatd feminism with picturs of nudes. I guess u need to think more and post something else then nudes. And when we have such cool cloths to wear then may b, use them or if u dun want to wear then jus give it to those who r nt that lucky enough to hv evn one pair of cloth @redheadwayfarer", "adityagurjar9": "Y hiding then", "rachanarachaprolu": "It’s sad to see that even though you perfectly explained what feminism is people in the comments couldn’t do anything but comment about the nudity in the picture like it’s some kind of a sin? I mean you’re talking about being comfortable in your skin and how you should wear whatever you want and all people can concentrate on is ‘the culture’ or how boobs are a sexual, I mean sometimes I feel like people comment on here just slut shame you or honestly just for the kicks. More power to you and everything doing, and hopefully one day people will understand :)", "pixiee__xx": "why you hve hid ur nipples... u hve gone this far thn y u r hesitating showing thm up", "forever_clumsy": "This is what everyone needs to hear and understand...i wish your words reach every part of earth and help realise every person that has slut shamed a woman for her cleavage...or even for wearing cut sleeves...and i wish you and me and all the girls are free from these gender biased things that still plague our society❤️", "nica_viro": "♥️", "style_and_strike_rc": "🙏....Inspired......💖", "slayor_swift_13": "PERIOD", "itisshubhi": "You go girl!! 🙌🙌", "estrelster": "💛more power to you", "kalaiselvamani": "Very beautiful", "_.barennya._": "We need more women like you.💕 More power to you 😊 💕. Love you for the caption and feminism is exactly what you have described it as @redheadwayfarer ❤️", "pearl.what.is.this.behaviour": "You rocking it babyyyy💚💚💚💚💚", "tanmay_lahiri_7": "👌", "chauhan.hema": "India ko kyo blame karte ho yr .. Logo ki soch thik nai rght 😕i m not yr hater saloni 😞but me bhi ek an indian hu pr toh bharat me he attractiveness zyada hota hai 😊 foreign me nai 😏 vha zyada tar sub ese he ghumty hai isliye vha attractiveness hai he nahi", "ashmita.ghosh": "If it's just breasts (like you said in the caption) why cover it/edit it with doodles? Just curious to know. :) @redheadwayfarer", "goodfellas_5670": "Ohhhhhh teri ki 😂😂😂", "junahahahad": "Everyone is writing big big paragraph but i just wanted to say i agreed with all the things you said in your caption @redheadwayfarer", "_aayyyuu_": "I completely agreeeee❤", "_shubhu_8": "Caption 🔥👌👌", "liraipsita": "@redheadwayfarer more power to you. More power to us ❣️", "jag_.e": "🙌", "okritzie": "Amen", "payal1992": "💜💜", "sheetalgarg_": "you and your wordss !!😭😭 you are one hell of a woman !! I LOVE YOU 💜💜💜💜", "83833729191010_": "🙌", "barnita_24": "All u want is to post a nude pic of urs and ppl should not comment on that so u will write an essay on feminism. Very convenient smart .", "anushkaaomar": "Rise, rise and keep rising 💕", "anu_ram_07": "your captions are are a piece of art 💓", "i.shaona_": "More power to you and us and all the girls in this world!!!💘💓💕💖💗", "shweta_mira": "@neha_bharati19", "shwetashakya_98": "Your caption💥", "_ashim_jyoti_": "Uncivilised leads to civilised vice versa", "chauhanmuskan": "The list of people I want to show this to is endless 😂 'oh I'm a feminist but not when it makes me uncomfortable' I've heard so many versions of this. Love you babe🔥", "that._brown._girl": "From the very first day, like some years ago, till now I've never regret in following you or to say this is the lady.. The lady who inspires me every Fucking day.. They lady I love wholeheartedly ♥️", "harshitasahu_": "CAPTION⚡️❤️", "_ananya.23_": "❤", "nandini_303": "❤️", "prithivee_fans": "@redheadwayfarer then why the fuck did u strike Ur nipple out???? If nudity empowers u, upload it with censorship!!!🤔🤔🤔😐😐😐", "anshu.bisen": "♥️", "senjuti_007": "Just love ur thoughts...carry on with ur work....u are absolutely doing the right thing.... Dumb people are always gonna bark...they are under the trap of patriarchy....", "whoananyaswain": "More power to u", "pjigneshs": "😘😘", "pranali.shah1992": "Hey Saloni!! Support all your pro feminism thoughts...but at my wit's end to understand if these r genuine attempts to change people's psyche or just an excuse to allow you to post your nude pics at every opportunity u get!!! Just Saying as it's certainly giving you ur publicity!", "kajalnaveensardana": "Okk then what's the need of doing that drawing over there just fell free na....be the real feminist then", "imunim00_": "You are just amazing n motivate me like anythinggggggg❤👀", "manali_m21": "🙌🙌", "kiran.verma89": "You are an inspiration girl. #Respect💙", "high_on_sarcasm__": "More love, n respect for you 🖤", "vaishali.singh.1406": "This is the....best thing i have read❤.....", "shrenikshah13": "Well said 👍👍👍", "bhushanatote": "More power to you girl 💪", "lovepoemsandsongsofdespair": "You are fucking gold.", "suparvaogra": "Claps.", "a_wrong_advisor": "All power to you girl.... But if you are talking about \"being free\" and \"nudity\".... If I were to roam a beach with me being all naked, same as the way you want to be... You would run around a beach calling me a pervert..... So don't put unnecessary hashtags.... Being nude and all is a different concept all together. Rest it's your life... You can do whatever you want. 🙂", "saagarikaa": "❤", "noodlebeing": "Amen!", "soumyalovesyou": "@raj.shekhar26 is dis women empowerment 🐸", "poojabansal070": "Should have done this in India if you want to inspire.", "shraboniacharjee": "Live long girl ❤, people needa know this. 😌", "nishaaparashar": "@redheadwayfarer More power to you girl🙋‍♀️🔥❤️💋", "word_sucker": "Is it so? 😂", "pooj0a": "🔥🔥🔥", "venghatdilshad": "Nowdays this is we called feminism... Good great movement praise the Lord", "rocket.pocket44": "Can men get naked there too ??", "rahulpatel5": "Your words always inspire me. ❣️", "_justanotherwallflower_": "PREACH SISTER", "qatar_desi_shoutouts": "If u had to write soooooooo much then why did u blur out the nipples? Isn't that hypocritic? Or if u r concerned about Instagram's policies then simply post it at another hosting site and provide a link with ur post", "missitusha": "Exactly!! Let them live however they want! I love your words.. you put it exactly into perfect words 😊 and its amazing to see you be unapologetically you! It empowers so many of women worldwide.", "reansh.joshi": "Yes", "valakartik": "real🧜‍♀️ mermaid", "piavakharia": "❤", "ambar_rock_1": "Amen. But as a country we still have lot to do for this. #Power to you ❤️", "ramy_mark102": "@redheadwayfarer such long a post for a simple pic🙏🏻 just need to know, y is this pic censored like this??? Upload it uncensored & unedited to support ur speech", "meenakshi.guleria": "👌", "deepcorals": "Love the caption!!!!!! And obviously you ❤❤❤", "manrajbrar._": "❤️❤️ This is the called .. A to Z about feminism..🌸 explanation is perfect...", "ajaygoyal1": "👌🏼👍👏🏽👏🏽", "the_science_life_": "Wat a words.. Ur truly inspiration 😍", "ronak_kulhari": "😍😍fuckkk loved the caption", "thatconfusedhuman": "Amen 🔥", "rosh93": "You go baby girl! More power to you, more power to us! More power to our tits 💕💕💕💕", "riaagarwal": "Couldn't have said it better!", "nigganig.420": "Lol i say feminists suck. But other woman r f9.", "shreya.s.deshpande": "Perfectttt!!!❤️", "yashikasangtani": "i love this post ❤️", "_divya_jami_": "More Power to you♥️♥️♥️", "kalyanivatsala": "The was guys ask girls for sending them nudes because they want to jerk off and a girls breasts help them do that is literally disgusting. If some girl is comfortable sharing her body beyond a limit with others, you’d not have to ask for it. If she is sending them to you once even though she isn’t comfortable otherwise, you should know that you aren’t supposed to blackmail her to send them. If she refuses you have no right to bring any shame to her name. Treating a pair of breasts like some toy is the same as thinking of a guy’s dick as a dildo, and that implies it should be fine if a girl has multiple sexual partners, but people aren’t okay with that either because according to them ‘ye toh saali randi hai har insaan ke saath shuru hojati’ if people are not okay with this then they should have equal hatred for forcing a girl into anything she isn’t comfortable doing.", "jaaaanv_k": "Caption💯", "misha_zandu": "True", "thisisvedika": "Yes your are right and your boobs are amazing", "_cupcake.14_": "🙌", "natasha.john30": "@redheadwayfarer if u hav guts , post uncensored pics", "sunflowersoveranything": "THIS.💯💯🔥🔥🙌", "sdsinghdhanjal98": "Just a thing which i learned from great people ...DRESS AS SUCH IN WHICH UR PARENTS LOVE TO SEE U", "stupid.saha": "thank you 😊", "kedia.aditi": "@theundecidedengineer @menon_gautham", "rahmancraze": "Caption ❤️👌", "verymysogynistic": "You just need an excuse to flash your tits. Anyone can misunderstand you for a whore though you might not be one", "sudir_15": "I support you for your women empowerment efforts but I felt sometimes you totally banking on it.", "sarahdsouza1010": "❤️❤️❤️❤️❤️", "rajeshpatelu": "Is she you @redheadwayfarer", "pratibha_love181": "💋", "rashikamanwani": "More power to you girl!! ❤️", "heer.hp": "Was it just me our while reading the caption you could hear her voice saying it the way she talks.", "small__drawings": "Love this caption👏👏👏💕🙌🙌🙌", "kirti_jassal": "Wrote soo much and hid ur \"mhmmm \"...Mhmm.", "uddiptaghosh": "😂", "malvikasingh15": "Love❤️❤️", "__abanded_one__": "True🔥", "aayushi.laddha": "Someone said it right!🔥", "masta_dum": "Very well put across.. gracias", "karank.0_0": "❤️❤️", "_an_ebullient_": "@redheadwayfarer well ur caption is truly awsm but if u r really raising ur voice for Indian girls and women so u should do this in India soo it will be more worthy 😌😌😌😌 I hope u will reply me back coz I really want to know why did u click this picture in Spain not in India ! Whyyyyyyyyyy pls reply this is a question a imp question frm a feminism point of view ....", "kshitij_wizardiam73": "Democracy is here and do what you like 👍", "anj.krish": "❤️❤️❤️", "cinecstacy": "This is so amazing. Every single word.💓", "danishjain93": "You are the power", "p_a_nda_": "This is beautiful ♥️", "nehahahlol": "I like how nobody's staring at you.", "nandiniporwal1125": "You are🙌🙌🙌❤️❤️", "the_soul_monk": "@_.shreyaroy._ @kaustav_p666 ki boktobyo?", "mistymow_": "The best post ever ! Thank you fellow woman !", "candy_varsha": "You are going to be a revolution 🙌 @redheadwayfarer thank you for addressing these issues. We all women are with you 💕 keep going 👏 #inspiration", "siaartjewellery": "Well said! ♥️", "apoorvabora": "🙌", "ambica._": "Exactly what I wanted to hear.🔥", "_iammeever_": "🙌🏻🙌🏻🙌🏻", "puns_and_pizza": "Well said, queen! ❤️", "the_anonymous_boss_lady": "Chutiyapa😂😂", "lakshitaaaa": "Women like you bring so much positivity ❤️", "shree___1997": "Amazing Ma’am 🙌", "vishal_rathore_007": "So beautiful", "kaanchan_patil": "💖", "kenny_seb55": "Then why are have you covered your tits?", "malikadnan1298": "But it's universal fact.....", "shivyasaklanii": "Love this❤️", "paranoid.pandya": "First para has more meaning than my life has 😂😂😂😂", "_miss_ghosh": "We need more people with this kind of mentality🤔", "kolkataguy": "Hats off @redheadwayfarer", "debobroti_roy": "❤️❤️❤️❤️ @redheadwayfarer", "sticklerdioxide": "Ye sab hamrhe india ke beach pe nh hosakta h hamarhi soch galt h 👎", "ipsitatata": "❤️", "leon_a3100": "Is it our fault that we are biologically wired to get distracted by boobs but women don't get distracted by a man's bare chest?", "sonali.08": "💕", "gods.wild.child": "I’ve voted you for Cosmopolitan award in the category of ‘body positivity’. Just thought it might cheer you up a bit :) good day!", "kratika17": "On point. #queen", "princess_malix": "then why u hide ur nipples", "krystal_glimmer_life": "Caption ❤️", "modernwomaniya": "❤️❤️❤️", "himanii.shah": "Caption 💯 💯✔️", "iccha070491": "Bravo 👏🏻 ♥️😘", "unflappablegirl": "I love you.. more power to you girl", "_wired.up.weird_": "💪💪♥️♥️♥️", "siddharth.roy": "Pic thora kareeb se leti to achha hota", "car_thik_heyy_": "Much love ❤️", "_firewhiskey_": "More people need to come clean regarding their double standards of NUDITY. You go girl 💪🌞💥🔥 more power to you.", "_ignavihs_": "I wish I could like your captions separately 💟💟💟💟", "kshumit_malla": "Feminism ka matlab anjaan logo ke samne nanga ghumna hota hai kya..?", "ramya_vemireddy": "❤️❤️", "potter_head09": "I love you what you do sister but the bitter truth is you cannot ask for empowerment by nudity in India let's face it? what you wrote is on point and i feel the same as most others but it's india tell me you or anyone else can walk like this on a beach in goa? tauba tauba we feel harassed and molest even when we wear jeans and simple t shirt people will stare at you in such a way that they are going to eat you or grab those pairs by their sight itself. I hate when someone calls you as a show off or abusive for what you do cause all yo do is talking about empowerment but let's face the fact It's INDIA and by this i am clearly referring to the dark side of this country. not the good ones men here are taught to look at every women with lust and if she is wearing shorts or a bikini she definitely sleeps with every man next to her *i am not generalizing this btw but the ratio is very low*", "arkay_x": "You always kind off prove your point.❤️❤️ And please let the PS keep coming. 💯", "sun96d": "Always on point ❤️", "murli.kartik": "wow hot pic mam", "sonnnal": "Damn🔥", "bonikapoor": "🤘", "good_hopes_": "Thats soo true👏👏", "mohitpawar___95": "Nude😘", "avvngrs_": "Caption is so on point.🙌 people who actually want to understand and want to keep an open mind will definelty understand the need of all such movements after reading ur caption. And jinhe chutiyape karne hai vo sab padh kar bhi karne vale hai no matter how much u educate them.", "poor_we": "@virtual.flaneuse @akhilnigudkar", "arfathyasir": "Ohh god . News paper 📝", "pritiroy2002": "Thank you for describing this so well. ❤", "siddhikagautam": "❤🙌", "aishwarya_ogrey": "🙌🏻🙌🏻 @redheadwayfarer", "niharika._.af": "U ve just mentioned it all so nicely that I feel I just got a whole new perspective for Feminism♥️. I ve been following u from quite some time now and honestly its you who have explained the true meaning of feminism❤️🔥 so glad to have people like you ♥️♥️♥️ Lots of love and respect to you 😊❤️ @redheadwayfarer", "life_to_live_27": "Agree with every word..thankuu.. For TRUTH..", "anonymous_apsara_": "PURE GOLD 🔥😍", "symren_ydv": "🙌🙌🙌", "saree_nari": "What a profound post 👍", "krishnamohitt": "Respect", "ishiitaaa___": "I can't be thankful enough to girls like you who sores awareness give us wings and tell us that you can be happy without a boyfriend, without a husband and all other relationships. I'm happy that girls like you motivate us to be focused on our careers and stuff and what you wrote is just so appropriate I don't understand why people hate on a person like you but love you're amazing! One of the strongest woman I have ever known. ❤ An absolutely amazing human. You just bring the best of us just because of your existence there are so many people who won't quit. There are so many things girls have to undergo during teenage and stuff but you give us Wings to fly high and believe In our ownselves. You're always a part of our family. Much love x #Bossbabe ❤", "kashishh_narang": "Caption🙌💙", "a.m.a.l.7": "No words. Just respect 👏", "shiwangi_limbu_05": "Caption is preach.", "rinibot": "Yes, yes, yes, a million times yes!", "discodiwani": "You're my low-key ladylove now 💓", "stutee_agarwal": "Confidence 😎 u are love💓💓", "shanmukhi_shikaram": "Awesomely said..idk whenever i read ur stuff i just just feel why can't evryone think this way that its not the issue of male or female its about being human...", "_shreya.kohli_": "This picture and your words make me so happy. 😇💕", "agyapathak": "🙌🙌🙌", "_terms_and_conditions": "This is just a one reason to love you lotsss @redheadwayfarer", "jenish_kaneriya": "👏👏👏🔥🔥💯💯💯❤️", "ousephgeorge07": "Please do read", "vvversatilevarun": "Sexxyyy... 🤘🏻 Gud one @redheadwayfarer fr those a**h*** who use feminist's mask to hide their real filthy face..", "thisisthe_realtruthh": "Why she's not walking nude on Juhu beech?", "lasima_nazrin": "Such a simple concept and yet so many people fail to understand it.", "kanikaprakash_": "👏👏👏 girl u rule", "therealyouu_": "🙌💯", "_jaamu": "Couldn't agree more ! ❤️", "lamiashahdat": "Your captions 😍😍😍😍", "minal_kadope": "...this is lit🔥🔥 you go girl!", "_jyotikanad_": "Best thing read on internet today! ❤️🌈💫 More power to all the beautiful people out there who understand what feminism truly is. 💯❤️", "miely.gurung": "Words of wisdom🌻", "greenapple_vodka": "@redheadwayfarer I'm not amused that this picture was taken in Spain. But because your audience mostly belong to India, it would have been more helpful if it was taken in Juhu beach (or any for that matter). I am saying this because obviously the reaction of the men here would have been so different. People stare. (Unlike the men in the frame). You'd probably find some aunty coming upto you and ask you to 'wear clothes'. We all have equal rights, it's just that our country doesn't freely let us excercise it. We have to legit go out and face everyone and still do what we want to (as of it's a fight, as if we have to prove everyone that we are free) So the roaming however whenever wherever isn't so effortless back here. Also our government....", "smartypands": "♥️", "raapchik_vade25": "Well support to all the people out there who understand this and all the narrow minded commenters why are you even following her?", "prettyoatsgirl": "🙌🏼preach!", "anamika1418": "You’re the voice we need! More power to you @redheadwayfarer. 🦋", "sayani_majumdar": "this is the best thing ive read in a long time. thank u ❤️", "abhishek_jain16919": "❤️", "nick_nzy96": "True", "miss_chhillar": "U are fab ,💞", "rajani1904": "You are a such a gem 😘", "sushantgond": "Ohh !", "i_am_yourman": "The more I appraise you, it's less. Because you always outlaw the way people see the world! love from us!", "m_drishu": "👏👏👏👏👏 more power to you girl ♥️. @redheadwayfarer", "iamadnanali": "Irony is still hiding nipples by drawing.", "merrylinboro\nVerified": "Verified", "kapiljindal_": "😘", "gui.ahuja": "❤️❤️", "cosmicvibes_girl": "@_o_shruti_o_", "harrdy_0080": "Nice caption... 🙌", "__yadu_00": "❤️❤️❤️", "dawarheena": "Wowowwww💝💝💝 ur amazing ❣️❣️❣️a bi g salute", "patel.kinjal94": "Pr ek bat batoo tere ko yai photos dal ke mil ta kya hai women empowerment kya eysay hote hai 😂😂😂😂", "mycrazy.1ife": "❤️❤️❤️❤️❤️❤️❤️❤️", "jaiswal_ricky": "Abhi to ap subhe ko Rahul bhai ka bday celebrate kar rahi thi ....suddenly Spain bhi pauch gayi aap...bdw happy bday Rahul bhai God bless u.....keep rocking both of u💖💖💖💖🎂", "we.are.chocolicious": "Such true Content 👍🏻You go girl !! 💕", "its__s_a_r_i_k_a": "🙌💯❤️", "prarthana_sandesh": "You’re inspiring !!", "nisha_370": "❤️❤️❤️❤️❤️❤️tons of love...", "niginsharifyar": "🤣 Oh my god", "pyaari_bachi_": "♥️", "veronii._.pepperonii": "@nxdhi.s", "_rajniiiiiiii_": "I love it when you inspire other women to love themselves. We need more people like you who support encourage and empower other women. each time a women stands up for herself,she stand up for all women. 💙", "pallavisrivastav1108": "🙌😎", "mostly_lawsome": "I love you, you strong woman. ❤️ More more power to all the beautiful ladies. Who don't care what people think. ❤️🌸", "mayur.jain.bbm_53342330": "Dm me🔥🔥", "kanish_0910": "Feminism is about anything and everything you as a HUMAN* feel like you are restricted from doing due to your gender.. yep👏", "v_shirin": "🙌🙌🙌", "u_can_cal_me_max": "Fir nyi bakchodi", "creative_chaos08": "The caption.. 😘😘 If they understand 20% of this den world will be a better place for everyone", "yuktiiiiii": "Honestly, I think I'll never have the guts to do what you just did with this post. I love how that guy there is enjoying his own things and you're enjoying your own, it's still a dream to most of us. You inspire me in so many ways. Someday, I'll go to the beach and nail it like you do and send you a picture. Lots of love ❤️", "nimishanayak_23": "💙💙💙💙💙💙", "the_frangipani_": "Girl you are just wonderful❤", "dhavallkordawala": "Wow.. excellent caption..👌🙌", "_ektu29_": "❤️❤️❤️ absolutely love your posts. Thank you", "saraswati1298": "Seriously, the best thing that I've read today. 💯", "sushmitaroy.15": "What a lady. ♥️ You're so so so empowering @redheadwayfarer love ya. 🦋", "tulip_das_": "Best thing I have read today💕💕💕", "bhavya.meriyn.joseph": "This post right here is the reason why I followed you back then, it reminded me of my reason. I was having doubts with everything that was going on recently but this one just made it all go away. Thank you for reminding me what feminism is and what we are all collectively fighting for 💜💜 Lots of love, keeping doing what you're doing, you're inspiring and mean the world to so many people ❤️ #respect", "hamza_bbkh5678": "Where can I find this unedited pic of urs?", "sanjosmss": "👏👏👏", "sanskriti_2106_": "👌👌👌👌", "gemini_illusion": "👏🏽❤️🌻", "arjun.k9": "Wo sb to theek h dear...aap kaise bhi raho apki marzi h isme baakio ko kya lena dena ...bas muje y ajeeb laga ki ek pic k liye itna bada nibandh likh dia apne😐thumbs m dard hogaya hoga ....justify mat karo yr jinhe samjhna hoga wo bina ek word k samjh jaynge😂 jinhe nahi samajhna to likhte raho roz nibandh...", "taranngg": "You beautiful woman! I love you for every word you say every goddamn time! You are our voice. We just adore you Saloni. Respect,love and proud is all we have for you❤❤", "joblessjack5": "😍😘💕🔥", "vasudhaprashar": "The best thing I’ve read today. More power to you, Saloni and every single woman out there.🔥❤️", "imprazzy": "💪🔺.", "sanghmitramishra": "Feminism explained rightly 🌸", "api3_": "Love 🔥🙌", "shambhavi.shastri26": "👏👏👏💯😍", "vikrammehta934": "Zoom", "beera_br": "Then y Insta is still making a scene abt nudity ? When the person him/herself is confident abt posting their pics on public forum ?", "eri_thehuman": "Omg💯💯💯💯", "charmingly10": "The PS can have my heart thanks", "abhi_pande18": "Is going nude empower feminism", "gaya.mas": "❤️", "fovea_of_the_whole_world": "Always stating my mind 🙏 you are literally becoming my speaker 🔈.❤️ All my love to you and to feminism 👏🏽👏🏽👏🏽👏🏽", "vikashchoudhary009": "🔥💖", "sanchyaaggarwal": "You’re amazing 🙌🏻", "aishwaryaadarkarr": "You go girl ❤️❤️❤️❤️❤️👌🏻👌🏻👌🏻👌🏻👌🏻👏🏻👏🏻👏🏻👏🏻🙌🏻🙌🏻", "vintage_flicka_": "Caption😍", "_.im_the_wolf._": "🔥", "_shreyaa07": "Proud of you ma'am...really a true meaning of feminist🙌", "pratikshyakanungo": "Beautifully written and narrated :) @redheadwayfarer ❤️", "parvezmasum": "Wow💖", "sarathchandraghanta": "❤ love you", "__atithee": "Inspiring 👏🏻🌸", "tiaz_z": "True! Lookong at the way you support feminism has taken it to another level... Bro you rock! You inspire #women #notwomensday #feminist", "susrutroy": "Yes absolutely..... Very well penned ♥️♥️ we have to think in the same manner like you.... Many respects😊😊", "em0tionally_c0mpromised": "@rheadhir best thing I’ve fckn read today ♥️♥️😫", "vroonkashyap": "🤷🏻‍♂️", "_hayat__habibah_": "The caption ❤ @duttarishika_jims", "the.backup.brain": "Exactly what I have been wanting to say! ❤️", "amii_jais": "Caption ❤👏👏👏", "__madhulika__": "Omg loved the caption 😍 ❤️", "zehra_215_": "👏🏻👏🏻👏🏻", "tiyashachaudhury": "This woman and every person who does what his/her hearts tells him/her to do isn't a fact to shame for. Let them do what they want to do and you do what you want to do. 🙌"}