{"aphrodite_kidd": "I really adore your thoughts, but your pics are way too loud for some people. Stop promoting nufity everywhere .", "vanshita.soni121": "Well said🙌", "arpitdubeyy": "🔥🔥🔥", "shreyagadodia": "Much love beauty", "pu__sharma": "Why roaming like this in spain ???? Why not in India??", "everydaylife87": "Men’s are also not allowed to walk in the street naked !! I mean sort of parents u have who would allow u to do that ??? Disgusting", "aasna_2802": "U have courage n i m proud of it 🔥💕", "y.a.s.h.d.u.b.e.y": "U wanna Rome around shirtless right ???go for it", "___.elliie.___": "🔥🔥", "themanofethics": "We will definitely make our nation a real better place buddy", "iron_beast_421": "Respect 🙌", "kajalkapoor756": "🙌👏👏", "supneet.mann": "Oh and answer to the classic argument \" but men don't go around flashing dicks\" @ghansham_samadhar", "audax007": "Leave something for imagination for fuck sake", "pujah__": "Well said", "beant_dhaliwal1": "Well said 🙌", "brand_shoes_collection_12": "Then why u have to blur ur nipples", "abhaymootha": "👏👏👏", "cb_queen_": "@the__akashprajapati hope k tu caption padh lega..", "ankytrix": "What are you high on no one is judging you or any other women why so much profanity we are not livimg in stone age why are you so angry get a life all the best 🤗", "aayushmaniktalia": "I beli", "jay_raj_4": "You are a fake feminist.....", "katt2367": "Ye latke hue mangoes ka waqt guzar chuka hai ab", "_ajab_patel_": "Well said👏👏👏@redheadwayfarer", "uddesh_chhajed": "@redheadwayfarer A clear feminism of yours has been shown by yourself when you covered HER nipples, but not HIS. Think over it.", "a.sharma172": "💦💦💦💦", "iamrishabhkamboj123": "Very toxic", "yashviiiii_96": "Which beach in Barcelona?", "abhinavdang": "Tu masst chill kar bro, koi kuchh bole toh bataio, waat laga denge. 🖤", "better.than.pizza143": "You Are Volcano... 🙌🙌🙌", "harshikasharmaa": "Well said 🙌🔥❤️", "_janvi_102": "Goddddd this is soo muchh trueh❤️", "chirag1____1": "This is so delibrate 😂😂", "sainiasesino": "Connecting freedom 🤣", "shrustiarya": "I'm little confused. I kindly want to know \" boobs are private part or not?\"", "sosameerr": "Stupid shit", "saurav_champ": "What do you think, women empowerment and feminism is all about nudity? Ur each and every posts suggests that being nude is a sign of freedom, really? Ok agreed, nudity shouldn't be a problem but feminism is much more than nudity. U can show freedom by doing other stuffs.", "mahbuba.zerin": "foul", "shikker_": "I don't want to go against you but I just want to say that , women need to hide their vagina because it is the vagina through which men are born and it is through breasts through which women feed babies. They are the reason for the existence of men that's why they are needed to be secured and should not be shown to anyone. PS- I am not really opposing your thought", "shreedharapurohit": "Yasss💋❤️🙌", "kathakali_mandal": "I just hope someday these yellow covers will be taken off!! All the courage to everybody!! ❤", "magicfox3": "👏", "hamda_mehaboob": "Man in the early times was almost naked, and as his intellect evolved he started wearing clothes. What I am today and what I am wearing represents the highest level of thought and civilization that man has achieved, and is not regressive. Its the removal of clothes again that is regressive back to ancient times! - Tawakkul Karman, a muslim Nobel Laureate.. What more do you need, people?? Have some Shame! Not the desire to show everything you have to others!", "girly_gurl2": "What is this...women is women..men is men...dont do like this...and this is life..women have some rules even men..feminism is not a thing that all men do even women do..it is impossible..both have different styles and life..they have some lines..see..women did onething..men cant do..if men did something..women never..ok..but what the matter is..men so strong..power...good..at his life..then..women have too their powers in her way..look..men is men..women is women..both never be equal..", "zmatth97": "I just discovered you and read the whole story of your remarkable resilience in dealing with the pervasive degenerateness despite going through the hard times. Your courage has inspired many victims to speak out and stand up for themselves against the predators ready to prey upon. What you have done is absolutely phenomenal. But I disagree with you here. I think it's naive to observe that men and women are equal in all aspects and therefore women shall have the legitimacy to do everything as you have pointed out about revealing nipples. To put things in perspective we consider women breast as something to do with sexuality and so do penis and vagina unlike mens' chest/nipples. Slight visual of it might arouse men. I think it's too stubborn to show your nipple simply because men do. Just because men and women have equal rights, opportunities, responsibilities etc. may not necessarily mean the absolute parity. Obviously there's widespread gender discrimination in our country such as foeticide, infanticide, rape, domestic violence against women, dowry system and so on and thats our immediate concerns that need to be dealt with sever punishment. But what if some sort of strict laws being made to ensure that women and men or lgbt community shall have the same number of representatives or labourers in factories, defense, jail guard, contruction, mining or any hazardous working environment which is unlikely suitable for women? Do you think equality still relevant to this situation? I am 100% with women rights but there are still questions that need deeper introspection. We have rights to express ourselves but laws don't guarantee protection for its consequences. In other words we use our freedom at our own cost. It's ugly but harsh truth!", "trinadha6": "I like you", "debo4insta": "Yes you are right if you can show it on beach then why not on instagram its basic 👏👏", "bittooo___619": "Hatsss off for this writes 🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌❤️❤️❤️❤️❤️❤️❤️❤️I totally agree with this or also add this to my story too @redheadwayfarer 🙏🙏🙏🙏", "qawsedrftgyhujikolpmlnkbjvhcgx": "I get what you mean but truly speaking this picture and post seems really deliberate. No hate", "o_pankaj_ku_22": "❤️", "_whiskeylollipop_": "@auradevoura", "_aarzoo_kaur_bindra": "Man!! I adore you as a person @redheadwayfarer you are the voice the girls of our country need to hear.thank you so much for being the face to thousands of girls here ..I love you for the confidence you have", "sagarpendhari7": "वहा के लडके अपनी माँ, बेहेन n दादी माँ को भी half nude देख सकते हे....वहा ये सब नॉर्मल हे but हमारे इंडिया मे नहीं देख सकते so i love my इंडिया n love my culture", "kaushikguptaa": "wow😍@himashreesahoo", "girls_cars_models": "Feminism died a silent death", "j._.k469": "Don't you think you are promoting nudity in the name of feminism for both male and female . I think you should stop these shit .", "ruin___nil____black___": "Please upload the uncensored nipple pics on twitter. Its allowed there. 🍒"}