{"im_shiv_damade": "@rahulb90 bro what helplessness you have...😂", "dvvy_virus": "India m bhi ghumlo ese hi", "john.vj.73": "If you feel liberated while showing upper part then why not try lower part of the body? I think you should try then only you could feel complete women in you", "sense.reminiscence": "I hope one day you don't have to put a mark on them like in these pics. Nudity empowers some. Modesty empowers some. True... Also, saw a very sick comment telling to feel yourself more by showing the lower part as well, modesty or nudity, they have the same perception, to view it as something not someone to have sex with... That's all. Salman Khan can be shirtless, no one ever asked him to pull his pants down while being that, right?", "neha.kalavati": "I feel really sorry for people trolling her, guys go get a life, follow bhi karte ho, comment bhi karte ho, she is feminist and she has cleared thousands times ki nudity is not feminism, it's personal choice. Abhi indian traditional typical mindset logon Ko can't help. Ladkiyon Ko ladko se barabari karne mein koi instrest nahi hai, humari marzi yar, jo bhi hum kare, kapde chote pehenliye toh problem, nahi pehne toh problem,pura pehenliye toh behenji lagti Ho, har step pe judge karte ho yar, what's more pissing me off is ladkiya be trol karri hai.", "lemonnsoull": "Beautifully said. Eventho the comments here show most people can't think beyond the little box their minds are limited to.", "shilpa_dutta99": "If you are so much into Feminism n dc what the world thinks...whats the reason behind hiding those tits?? with some scribbles on it??.... Things that are meant to be hidden should be hidden....its not about knee length dress or something but bout showing off private parts....if it doesn't really matter to you...stay naked the whole time....you r moving back to the Stone age Era where ppl used to be like you ....naked XD..... We civilized n understood dress are meant to wear n not to remain naked. There is a beach in spain ...ppl are naked ....n thats not about mentality or something ....its stupid for them as well....It simply means You dc who sees you naked", "immayo786": "Remove the lower part then give lecture, it would be could, downside also as same as upper, why half naked?", "raj_malikkk": "You want to close billion 💵 textile industry 😂😂😂😂", "everydaylife87": "Even the white people are feeling uncomfortable around her 😳😳😳!!!!!", "bhavin_bavadiya": "Aabe ....yaha aa....tuje to chappal se maruga.....🌵🌵", "supneet.mann": "@ghansham_samadhar my point in a nutshell..explains a little if not much", "rishabhrai2225": "❤️❤️❤️❤️❤️", "fahad.ali17": "but i want to your nipples also very sexy you are", "srushtisalvi_10": "❤️❤️❤️❤️", "uphadhaya121": "So free the boobs because every child is fed by it then i say free penis every child is produced by it!!!it doesnt make sense!!! Its like free having sex in public because everyone does it!! Wow!!!", "aditya_roy_14": "@whimsical_annapurna perceptions can vary but the truth can't. And the truth is there are a lot of women, not these girls ....real women who are making exceptional stride in their own fields and dont even bother to join in to these craps you know why ? Coz they are living empowerment rather than beg for it . And that too in a way that is completely obnoxious and shallow to the core . Get me one women scientist with half as much as followers on social media as someone who is nothing but cleavage ..you cant coz we as a society , both men and women are so drifted away from truth and true equality that we are doomed for eternity", "subhashreedas.7": "Iss post mai to adhe se zyada comments gaaliyan hai. Ye kab samjhegi bhai? India ke log don't roam around naked doesn't mean humaara culture hi kharab hai!😂", "vikas_sharma011": "Instagram Ko 13+ ki age ki bache bhi use karte h but aapko isse kya fark padhta h aapko to ye nangi pics daalne se aur ye feminism ka Gyan baaton se fursat mile tab 2 to 😄😄😄😄", "be_like_god__": "So true❤️ @redheadwayfarer", "sassy_somebody": "All women should not be allowed to be liberal rather they are born to be free.. We women sometimes undermine our peers and expect that the male counterpart worships us.. we should first uplift our sisters💓😘", "sadak.chhaap.ladki": "These two shameless men showing off their nipples. Chii chhi chii. Men will do anything to get fame and attention. Disgusted. I am sure they fuck around (Sarcasm attached)", "imrseyygal": "Attention ke liye kuchh b.....😐😐", "christinanamrata": "Y r u hiding your nipples saloni ?R u ashamed ?", "rakhii___": "You idiot women !! foreign jake beaches pe nude ghumke apne aap ko feminist blah blah bolna shayad bahot easy hoga tumhare liye coz u just have money to roam around dats it . have u ever visited places in india (chattisgarh, west madhya pradesh , north east india , rural bihar Uttar pradesh) just visit these places their you'll come to know about the condition of women and the reality of life . pls stop such stupid in the name of women empowerment feminism ...🙌", "sudipta__27": "Coz u are dumb as a box of rocks😂", "kanishkalamba": "@ruchika_1415 @khushbookandwal @hemagupta182 @jyotidwivedi221", "theamandeepvashishtha": "Go girl... You can also visit Spiaggia di Guvano.. har har faminism ghar ghar faminism..", "shiningsannu": "Dikhana hei to Pura dikhao...pane adha chautha mat dikhao", "sagarpendhari7": "देवी माँ को क्या लागता होगा ये स्त्री ki उत्पत्ती मेरे अंश से हुई हे? ... 🙏", "neha.sharma_13": "Caption 🔥💯💯❤️#sotrue", "shindafraud": "Hahahah hatt bhenchod chutkhana", "magic_sparkle_events": "And you walking topless, posting shitts around insta is doing great for the nature and the planet as well. And for the society also. So from now we can call you a social bitch. Idiot.", "ka.ran77901": "Waah re feminist🙌 if you're such a feminist flaunt your nipples also like we men do cover karke bhot bada Indian culture ka tune respect Kar Diya in our India women aren't cheap like you to Rome naked ... Women like you are responsible for imbibing shit values in younger females ... equality equality karti hai toh when a women slaps a man even a man should have equal right to slap back a women tab Kyu tumhari Gand jwala mukhi fat jati hai ? Tab kaha jati hai equality ... Shit feminist inculcate good values in younger women teach them to protect themselves from this bad society teach them to succeed in life how to be successful and not to be dependent on males for their living make them bold because some women are still very scared and just spend time at home in depression.... Tere pass followers hai so make use of them to imbibe good values aise chutiya jaise naked ghumne k nare lagati ghumegi toh ghanta kuch ukhadne nahi Wala", "ssanks__u": "Feminism ko apne apne kapdo se connect kr liya hai..", "_naveedbutt28": "@syedwali._", "luckybyg6": "Dont provoke youth in wrong direction .", "sarthak1110": "Sab Paise ka chakkar hai babu bhaiya.... inki jaisi ladki rashta dikhayengi ab... 🤣🤣 no doubt dumbs will follow her..", "darlin.dawn": "I love you❤️❤️❤️❤️", "monu_omveer_singh": "Madam ji its your life , live as you want but dont blame others.", "harshrathore_22": "\"Instagram isn't a man or a woman, it's a reflection of this society's values. It's a mirror to your value system.\"...so why did you even blurred the nipples,Instagram isn't a man or women , right? It's reflection of the society you said, DUH!! it's a picture sharing platform as per the description of it. Even instagram doesn't allow your show of \"things\".", "cherry_at_the_top": "Great write up🔥 too good", "joy_vik": "Wow everyone has so much time to discuss this shit couldn't stop myself taking my frustation out hate these people who are playing their trumpets in her support it seems a new trend now days who can mock our culture the best who can brag the most that our traditions our roots are backward bloody fake white collar wish you had just one day of a life of a poor family you would have forgotten your all gyan people can't cope with their basics and these social media's hypocritical coconuts talk about about their empowerment sitting aside a beach in Spain🌴 showing your boobs women empowerment 👏plz F...O..", "shubhankar___sharma": "ye feminism ek din india ko le dubega😂😂", "rahulkoul_7": "God bless you! The idea of being free and do what you want to do is perhaps the best thing there is and its so liberating! I get the idea..you are not there to flaunt your body ..you are there to experience your life and feel the freedom without being judged, without being unsafe etc ..women are always told to cover their body, not reveal their body etc and acts like these are liberating and there is a sense of freedom you feel in yourself! People who are equating this to feminism are not getting it...this is freedom...free to be yourself without any judgement and everyone has a right to be themselves without the worry of being judged by others!!!!", "kejal_bhansali": "More power to you ❤🙌👍", "i.m.das.95": "Needed an advice Today I got into an argument with my warden of the hostel that I stay in. She commented on my clothes cause I was wearing a sleeveless top when I had gone to take my food from the kitchen. This wasn't the first she said such a thing to me earlier i kept mum about it. She said that the are male workers and I should not be wearing such clothes in front of them. I really want to take it up to the higher authorities of the college but a few people are supporting me Some even said cause my breast are big that's why she tells me such kind of things. But truely we are in the 21st century.. Can't I wear what I want and where I want.even if it a rule ain't it wrong. I don't know how do I go about it. Also I have little to no support @redheadwayfarer", "escaping._.einstellung": "Takes a lotta courage. Damn woman", "rafiasaadat65": "@yellow_loofah", "onlinechorbazaar": "bhartiya sanskriti ki to maa behen ek kar di esi aajkal ki ladkiyon ne, i feel ashamed.", "yoongleschu": "I personally don't have a problem with nudity like whatever as long as u r a good person idc what u wear or just go nude. Ofc i believe there's a dress code for every occasion and situation but if anyone is getting shamed for it then it's nasty. Do you.", "afaanfuzail": "Dear!! What you want to proove?? So sad to see your pics like this!!", "muskan_chhabra05": "You go girl!!😍", "adorable_aish1": "🔥🔥🔥", "life_of_gratitude": "The caption! Spot on!✨", "manisha.raikar": "❤❤❤❤", "chaos_in_order": "@redheadwayfarer you're the power and thought churner to girls who can , instead of writing shit could join to make some changes to our society. Thank you for existing.❤️ You're an inspiration.", "reinvent_me": "OSHO tells us how best to introduce children to the world of sex, so that they can rise above it and transform The first step to free the world from sexuality is to allow children to remain nude, as much as possible, in the home. As far as it is feasible, it is advisable to allow children, both boys and girls, to play in the nude, so that they become totally acquainted with each other’s bodies. Then, later, there will be no necessity for them to snuggle up to each other in the streets. There will be no need to print nude pictures in books. They will be so familiar with each other’s bodies, that no kind of perverted attraction will be possible in the future. But the way of the world is just the opposite. The people who have covered and concealed the body have unwittingly created so great an attraction for it that, although it has overtaken our minds, we still haven’t felt the full impact. But the disease is already there, and it is increasing. The existence of the disease can be observed in the bulk of obscene literature now being published. Sex is natural, but sexuality is the product of anti-sex teachings. If these teachings are followed, if the advice given in these unscientific sermons is taken, the soul of man will be totally filled with sexuality. If man understands sex properly, he can rise above it. He should rise above it; it is necessary that he rises above it. All our efforts to date have borne wrong results because we have not befriended sex but have declared war on it; we have used suppression and lack of understanding as ways of dealing with sex problems. The deeper a man’s understanding, the higher he can rise above sex; the less his understanding, the greater his attempts to suppress sex will be. And the results of repression are never fruitful, never pleasing, never healthy. -https://www.google.com/amp/s/www.speakingtree.in/article/free-your-children-of-inhibitions/m-lite", "javeria.farooq28": "Well, I believe that women are allowed to wear whatever they want to and that's a different thing but walking naked isn't giving benefit to feminism, you are doing coz u want to feel free but there's nothing to be proud of and secondly this isn't empowering coz women in India and in other countries too dealing with terrible issues, working on it and at some places succeeded in it and this is called empowerment u can't do anything in the name of feminism... walking naked isn't a big thing to do, you are doing it for your satisfaction but that's doesn't mean other people are regression if they are fully dress-up and if u feel empowered in going topless than there is no need to hide ur titties...", "_sunshine_023": "😡😡😡", "sayliduraphe": "@chittoshchatterjee this experience would be epic!", "sehajgroverr": "I salutee❤️", "hit_ace_007": "if no one is looking at her then does it matter if she is wearing something or not😂", "jessicajames653": "Love you lady. Really like your thoughts. I was there once and missing being topless. Will try next time.", "jiyaprajapati__": "@raudrisingh", "jetsingh01": "waah feminism bc 😅😂", "khanabadoshiii": "@bharti_tyagi_", "naresh_garlapati": "@redheadwayfarer who is Saloni Chopra ? Is she indian porn star ?", "jug_headss": "I want all those girls to post their nude picture who been saying 'well done' and giving lectures on how equality should be like. ❤️", "sonitulsyani": "@adityaprakash.94 and this..now u'll get it", "thatvagabondboy": "Respect ! 🙂", "aakansha_0312": "You have no right to call people sheep in a herd. There are many ways of doing and posting about women equality. Your posts not gonna change mindset of the people but your actions. Why don't to stay in India and fight for the women who are victims of domestic violence, raise such issues and make some noise for them on a big platform which you got, there are many such things for women you can raise your voice for rather than louding for nudity and all. Many issues are more severe and deep to act on than these top v/s topless. Kindly use your fame in a way to make a deep impact on te society not on instagram where majority of victim women are unaware of and majority of dirty mind people are too unaware who do such things ✌ peace, no offense. That's what i have a say from my side", "chandhana_singaravel": "@rishieeeee_rc READ", "karan_2.0": "Imma take my dick out next time and rant on for 3 pages and finally say #HappyMensDay #meninist", "saara_sabel": "@redheadwayfarer Feminism doesn't mean showing off your body.WOMEN like you don't really know the actual meaning of feminism. Feminism is seeing if women pilot seek revenge on the phulwama attack , feminism is realising that our defense ministry is led by woman, feminism is watching women officers lead a parade on republic day, feminism is knowing that our foreign ministry is also led by a woman ...not just this, there are thousands of women who work for their nation and themselves in the field of sports, technology, business etc that's what feminism is. On the other hand there are girls like you as well who tag topics like nudity into feminism.Getting naked is one's choice ,if you want to so be it but don't tag it into feminism just to get your doing an approval.You have no right to defame my country because it doesn't support nudity.", "surendranjegatheesvaran": "well being topless wasn't taboo in india until british victorian modesty was imposed upon indian society [moddern hindu religion was manufactured by the british by carefully concealing the true past and turning temples into money spinners]....many ancient temples required both men and women to be bare chested during their 'darshan' or one on one worshipping of the deity when the spiritual energy or chaitanya is beamed from the deity to the heart of the devotee", "shri_jana_": "Proud of uh @redheadwayfarer 😊🇮🇳", "shreyansh4791": "If she needs to be a feminist, first speak about how dowry is still prevalent, how rape happens everyday in some corner of this country. how girls are too scared to speak. How men are so disgusting that they try it on their own family members. Groping, touching and wrong places, is RAPE. You need to educate them that this is NOT okay. They had let others do it too. Being abused because you were born a girl is NOT okay. It is NOT your fault. First talk about that. Then their hygiene. If you have so much money to roam abroad and everything, and you are a feminist, then why don’t you actually okay, maybe only once in a month give out pads to atleast ONE VILLAGE in India only? Maybe that had prove to be a true feminist, instead of blaming everything. Lastly. You had roam topless. No problem. But the first to judge wouldn’t be men, it would be women itself. So grow some brains. Look at the major problems", "kadambaripujari": "@sidrah_syed", "vandanananaaa": "Going naked is not women empowerment", "fashin_girliyapa": "Tum jaise Chutiyo ka Sahara h dooston ...... Y topless feminist vale chutiyape ka Sahara h dooston", "utk7rsh": "Time to relocate to Barcelona 🤗", "___iamdiksha___": "People who are saying ki '' ehh besrhm ldki... Shrm n h.. You should not go like this...r*ndi khi ki... This is not feminism n what not. Guys do you really think she gives a fuck abt you 😂 no she don't, she won't, she'll do whatever she Want, she'll post watever she want. It's you who's coming here. Commenting and doing all that shit. But you don't exist for her. She don't give a fuck", "im_thebeast010": "DM girls", "okaybye578": "u r true inspiration", "joseph._silva": "What's the difference between feminism and a pencil .... Pencils have a point!", "miss_basundhara": "#notyetwomensday this is so true.... 😊", "vinoth128995": "👌🏼", "fankara_here": "That's such a truth mhan", "delta_knight_": "@tithisharmaa is that best you can do? Lame", "ishuhot": "Hey @redheadwayfarer I respect Your opinion but You never raised voice for muslim women's ,I mean why you afraid to do so , there condition is wrost , you are roaming naked it's your freedom but you know they are still in jail of burkha , they are even not allowed to show eyes , full body has to be covered with black burkha and also they are not allowed to remove hijab , I have seen 3 year old girl coverd with burkha , I mean this innocent kid is even not knowing about her freedom 😔", "shivani.agg17": "Inspiring as always. 😍", "shreya_0507": "Wow!! Well said.. but I hardly think there would be enough Indians really learning. But hats off to you girl!! 👐", "hamza_bbkh5678": "Lame reasons shared. U seriously need a life babe. Just stay good in the bed with ur boyfriend and show ur feminism and empowerment. You’re not brave enough to post the real thing here rather just try to catch attention.", "pranjali_khandare": "💕", "palak.1207": "India yet has time for women to enjoy what they deserve.. thankyou for standing out... Thankyou for being the mirror to men out there sitting just to criticise... stay strong 🍻", "positivepeachi": "So proud that there are Indians like you. You go girl!! It takes a lot of guts to not only do something such but also post it. I wish india becomes a free country for real where people can live the way they want to.. without harming anyone", "_muggle_born_squib_": "More power my girl👍🔥", "beinghuzaifa____": "Chutiya 😂", "hashtag_shrish": "🙌💯", "hina.sharma": "more power to u gal... n obvio to the double standard society too..luv ur thoughts ❤️", "tanisha.mahanta": "💓proud of u💓 haters #teachyoursons", "dedicado._": "❤️", "kanakaa": "The fact that all of us were born naked.", "___i.s.h.a____i.n.s.a.n.e__": "I am eager to know this series name of yours ❤️", "_alankrita___": "❤️", "noorkaurwrites_": "Wonderful... best way of women empowerment", "zankhanadalal": "Yeah! Not yet women's day in many sense . But still wishing u for your fearless choices.", "natasha.0918": "❤️", "prathikshabhojaraj": "I don't have my phone locked, because I have nothing to be hidden. I don't give a damn about what anyone thinks by seeing my phone. But I realized that I paused for a second when I wanted to save suchha beautiful writing (caption) that made me feel more light about being concious towards my body. I realized that I am from the same society you spoke of. But no more. I don't give a damn to what anyone thinks about the saved post because they don't give a damn to read the caption and what this picture intends to hold along(message). #morepowertoyougirl 💕", "daredevil0036": "Love those BLACK NIPPLES🍼🍼", "anu.shhh.ka.0708": "👏👏👏👏👏", "human_god618": "#feminismiscancer", "soniasharma1257": "@anuragrawatv1.0 Only if there were more people like you!! People are fucking getting motivated by saying this! They have really set their bar so low. Saloni is enjoying her life which is good for her but throwing feminism on the face of girls who are begging for equal rights in so many important issues. And girls here are actually supporting her. Trust me. Everyone here knows that breasts are so intimate and private part of our body that we wont want to roam naked. Men’s chest is non-functional and you know what , men would have faced the similar problems if they had bulging breasts. I mean they have balls ! they are not throwing that in our face !", "__mr____khan__": "\"LADIES PLEASE NOTE\". One young lady arrived at a meeting wearing clothes that were quite revealing her body parts. Here is what the Boss told her: He took a good look at her and made her sit. Then he said something she will never forget in her whole life. He looked at her straight in the eyes and said; \"Lady, everything that God made is valuable in this world, is well covered and hardly to see, hardly to find and hardly to get... Where do you find DIAMONDS??... Deep down in the ground, covered and protected. Where do you find the Biggest PHILIPPINE PEARLS??... Deep down at the bottom of the Palawan Ocean, covered up and protected in a beautiful shell. Where do you find GOLD??... Way down in the MINE, covered over with layers of rock and to get them, you have to work hard and dig deep down to get them. RIGHT??... He looked at her with serious eyes and said; \"Your BODY is SACRED and UNIQUE\" You are far more precious than DIAMONDS, PEARLS and GOLD, and your body should be well covered too. \"So, he added if you keep your TREASURED MINERAL just like diamonds, pearls, and gold deeply covered up, a REPUTABLE mining organization with the requisite machinery will fly down and conduct YEARS of EXTENSIVE EXPLORATION... . First, they will contact your government {FAMILY}, sign professional contracts {WEDDING} and mine you professionally { LEGAL MARRIAGE} But if you leave your PRECIOUS MINERALS uncovered on the SURFACE of the EARTH, you always attract a lot of ILLEGAL MINERS to come and mine you illegally. Everybody will just pick up their CRUDE INSTRUMENT and just have a dig on you just freely like that. . Keep your bodies DEEPLY COVERED so that it INVITE PROFESSIONAL miners to chase you... Let us ALL ENCOURAGE our SISTERS, DAUGHTERS,WIVES, and FRIENDS to DRESS WELL DECENTLY... AM I TALKING SENSE? .", "vrindabhutani_22": "Thankyou for this @redheadwayfarer", "shiprarawat36": "😂😂", "nayeem._farooqui": "😂😂😂😂 hahahahaha", "iam_abhinav.p": "Well no offense to her but frankly all your caption look like against men mentality ... And feel like you just trying to get attention ...I don't wanna talk about picture cz it's none of my business...It's your life your way...But about caption ...You seriously fed up with your mind ...Do you seriously think that mens only watch out for girls boobs and body only? Girls don't check out mens body? And being nude allow in Spain but not in our country it's called culture not cz to stop rape or anything ...Girls with cloths also get raped (no offense ) so nudity doesn't have anything with rape I belive it's men intentions and thinking issue not about girl nudity ....But here you also talking like mens only watch nudity in girl ...Like girls don't watch out for men body and sorry every child fed it with in our society? You seriously out of your mind...If that's case then please stay out side india only cause then your child will also get fed with this.... Problem is not with nudity of women...Problem is with thinking of few men towards nudity ...So stop talking about being nude is crime in our country ...It's our culture which don't allow sadly but it doesn't mean that each men is rapist or pervert .... Please do some work on your mind ...And if you call this women empowerment then I am sorry I pity on you...There several women who really are women empowerment...Talking about nudity and this is now empowerment...It's sick mentality of yours....Well nothing against women it's just your thinking is sick", "_dwarf_1": ".", "shitizjain23jul": "🙌🙌🙌🙌🙌🙌🙌🙌 You are mind blowing girl... Inspiration to all... Super girl 😍❤✨ I love you... 💕🤗😘😘 Thank you 🙏😇✌", "ooty_sethu": "@redheadwayfarer how many women got inspired by seeing this post???? And for what they should get inspired \"Being Naked\" Is this women power..", "harshithaharii": "You are doing a great job as always ❤❤❤also i wish there were more men out there like @rahulb90 who belives and empowers others. I love you both @redheadwayfarer and @rahulb90 ❤❤❤", "lazyidiocy": "Happy Women's Day to you!!!!Love your post and I hope it inspires other people also.❤️", "amrita_rajpal": "@redheadwayfarer You go girl! More power to you! Agree with every single bit of this! Much love to you! 😍❤️", "_darkrider__": "Women's day m nanga hona hota h kya😂😂😂😂", "neupaneshristi": "@redheadwayfarer ❤️", "hoaxx_lord": "Is this all women need in india ? Just to be naked around ? Are you really making sense ? If instagram gets deleted boom you are not a feminist anymore then cause you are not running a pro-women movement you are running Pro-YOU movement. You should better do something to empower women by education them feeding them sending them to school from remote areas. Please visit the real india. Please dont defame our country for some publicity.", "anoop_golwala": "Tum iske alawa or kuch kar bhi nahi Sakti. Bas aesi hi post karna aata hain tumhe. Or ISS post main Naya kya hain ki itna Lamba lecture likh diya post pe. Sabki apni personal choice hoti hain. Kuch achha kaam karo or fit post karo.", "rekhajadar": "Happy womens day .. kudos to you..😘😘", "payalsoniii": "You’re amazing ! ⭐️", "shrija_gour": "Amazing💓", "billion_dollarproject": "Wow 👍👍", "dusadrohit": "All 3 are looking same", "kxranv": "🙌🏻", "archanadalavai": "Thank gawd😂😂.. at least you blurred your nipples.. I think you know the slight difference between men and women🙏🙏.. I don't blame you fighting for equality.. women should be equally treated with men in education, in jobs, in working places, in sports, in society and all, but not in removing clothes.. you are showing equality only in removing clothes, not in any other competitive activities.. you beat any men in sports, education etc.. but not in getting nude.. do you know Yusuf Malala..?? She too is fighting for feminism from many years with her clothes on, not by getting nude.. you see malala's picture once, she is fully dressed and fighting for equality in education, sports, and for equality in society.. not for equality in becoming nude.. @redheadwayfarer once you think deeply..", "lonewolf__404": "So aap ne sb ki trf dekha ki koi aapko dekh rha h ya nahi Sahi h mens v to nipple show kr skte h Aap ne v kr diye Equal hi to h Fir to koi aap ke nipples ki trf dekh le to bhi problem nahi honi chahiye h na Just a body part hi to h Itna drama kyu bhnnnn 😂", "sanjanaroy276": "M so blessed to following u 👏... ❤️", "drkverma": "Love you for writing and posting this😍😍keep giving us strength", "februaryloveee": "LOVE EVERY POST OF URS!!!! You go girl.....💪🏽", "maanssayy": "More power to you girl! 🙌", "mr.sudeeptripathi": "It's Only About Our Thinking, Thoughts", "nialicious88": "❤️❤️❤️ Well said. 👌🏻👌🏻", "____shivali____": "Whatever it is ..but i m just thinking what the scene would have been like if you were doing this in INDIA.", "rohitthorat8": "Happy women's day", "priyarana4879": "You are so strong you have given women's lot of courage then why are u ashamed of ur body why are u covering your nipples one side your encouraging others side your hidding", "priyal.04": "@redheadwayfarer When it comes to equality why do you always want to compete men, why are you so desperate to gain all the freedoms men have, instead you can raise your voice to limit the freedoms men have. I really think your understanding of feminism is to just put men down and nothing else which is not correct. Neither is feminism good nor is machismo. Be neutral and chill out! By putting topless pictures and only covering your nipples and not covering men nipples and writing long captions is of no use. Use your writing talent to good use and actually bring a change. What you are doing just amounts to stupidity/cheap publicity and nothing else cuz it's not bringing any change in the society all that your followers are doing is praising you here but while they are leading their lives in their respective societies they are aadhering to the rules prescribed by the society so your objective of bringing in a change for women betterment ( if I'm not mistaken) is not achieved. If you really wanna do something worth while then work to address these issues at the ground level and not by posting naked pictures of you on Instagram and writing such long writeups which is not even helping anyone", "r.uchika": "I am amazed at how the entire attention has been diverted from a basic point of personal choice to debating whether nudity is empowerment. The ones with all this pent up hate speeches against why she needs to go topless; check dictionary under personal choice. For the ones asking why not India? Its a question that we as a collective need to find answer to. For the ones worried about her not focusing on the entire realm of feminist issues and just on the basic right to be howsoever she wants to be clothed or not ; feminism encompasses a lot of issues none more important or less important than others but all seeking a core belief an equality of the sexes on all levels and that includes the use of their body as well however a person wants. For those wondering why aren't men allowed to roam with their dicks out, do tell me why is it that dicks out usually connotes a sense of fear, and male superiority first and then a body part. It's when you negate that fear then we could all be comfortable with men roaming around naked. Do cartwheels for all we care but first make it comfortable and mostly not a red alert for the other sex.", "harindersingh1090": "😘😘😘😘", "ashiskumardakua": "Very well said... Happy women's day to you girl....loved the way you are 👏🏼👏👏", "3idiots_rajurastogi": "Once a bitch . Always a bitch", "mast_tani": "👏🏼👏🏼👏🏼 thank you for saying it!", "patrickprashant": "Agreed! Also hope that you took consent of those men to be in ur post as when and if the situation was to be reversed I can only think of problems for the person that shared a post. Not trying to be personal✌️✌️", "zarya5670": "You have patience to write so much....", "sushant.deshmukh": "Hahaha...those man boobs though!!why not cover them ???", "jojo_hahahhahhh": "Salute to ur spirit and the belive behind it", "mr.niloysarkar._": "You were walking down the beach withou wearing a bra or something?", "isinghsubhomoy": "Brave girl,,,,,,I like your attitude", "vishnu_dev_": "Hats off to your vision", "real_kaysee": "@redheadwayfarer This is not you being strong and liberated or something. This is you just being plain stupid. I fail to understand your idea of feminism. Neither do I understand the people who are calling you strong. Do you perhaps think roaming naked on beaches and being topless is what is required to bring women equality ? I'm sorry ma'am, that idea of yours is foolish. Also, it's not some privilage that women are prohibited from. That's just a difference. I will pray for a healthy mind for you on your behalf.", "randomperson_1529": "Queen 💛 :)", "mon.693": "Hatsoff. Ladai abhi baki h Sis..😍", "psychotic._.pessimist": "@sourhita 🙌", "misterrr_nobody": "Yes we are sheep in a herd because it's our CHOICE to wear clothes. We are not empowered because we are not topless. Today u made many people proud because u are an INDIAN who has gone topless in Spain & we are so narrow minded because we don't follow your thoughts. So if you really think going nude or topless makes women empowered then plz grow up. Most people are living in scarcity of food & water. Going nude is not the solution. AND you are so right about people, They really don't ask question, they simply follow. Everybody can see that in your comment section. but I have some questions.", "karina_bhambhani": "I can't describe in words how i felt after reading all these posts💯 i really fond of a good content on instagram which actually challenges the mindset of people and i felt so so happy that someone took an initiative and this is probably the best kind of message to celebrate womens day! Perks to me! I really believe words can help to win the wars! This is a war between people with broad minds v/s stereotypes! Keep going girl! Hats off to you!", "_goodgirl_inc": "straight to the bull's eye ! 🙌❤️", "ludoraja00": "BEGONE THOT", "curlyspills": "🙏🙏🙏💕💕💕", "nehapandeyy263": "You are imparting liberation. You are such a motivational person to all the females. ❤️", "simpsonmyers_": "Love this so much! 💖", "qureshiirshad83": "👏👏👏👏you should fully nude please you dont hide you're nudity🔥🔥🔥", "tanveerhala": "@redheadwayfarer you should try @Twitter as your main social media application , @twitter don’t delete humans nipple or breast pics ?🤷🏻‍♂️ @imsumeett @rahil.97 @chintanmakhecha", "mitrazidane": "Dumbest shit after Trump", "krishna_tulsani": "🔥", "_avreen.kaur": "❤️❤️❤️", "khan.saheb0000": "Sb kuch nikal de tainu 👍", "saumyamittal18": "And how do I thank you for saying things that people need to hear. You inspire me and so many more girls. You are the rising sun. None can stop you. Keep going girl❣️🔥", "tonyxxx360": "If our country have so many bad things then don't come back stay there in spain.", "__meme__life": "If ur right why u hide this picture ? Tell me", "deepak_sharma701": "Boobs goals @redheadwayfarer", "_corona_go_": "women empowerment = Nudity", "tasleem_noor": "Ye ek din depression se mar jayegi bechari, jald hi break up hone wala hai iska.", "wordonate": "@redheadwayfarer I wrote a letter to you on my profile, I'd love it if you read it.😁", "sudipta_maiti_jitu": "Big F 🖕", "samkareem0712": "Everything has been answered beautifully in that caption. Incredibly written", "being_yogesh92": "@redheadwayfarer why u mark yellow on it if u think women equal to man, Instagram also don't allow", "keshavkanvaria": "Good keep it up", "blurryface_94": "Getting publicity in the name of feminism 😂😂🙏🙏", "rounakgandhi1234": "such strong words", "smriti_lal07": "You nailed it bro 💙 🔥", "divvyaaaa___": "I love you so much", "_swati688_": "Inspiration 💯", "purvi8891": "Kuch mat pan acha hai 🥶🥶", "laxmipriyasn": "So inspiring. And thank you for the words", "sonuswe.naik": "I don’t want to say anything to @redheadwayfarer (Saloni Chopara ). But I Am Really Surprised Nd Jealous Becoz She Got Such A Wonderful mind blowing person in her life tht is his bf @rahulb90 . His support is her biggest strength. Kudos to his bf. Really a Gem. @rahulb90 next life plz b my bf💋💋💋❤️❤️❤️😍😍😍😍", "kh.luck": "@rahulb90 Respect!! ❤️", "girl_with_glitter_": "@redheadwayfarer you are like the therapy to me. I mean how can you be so youuuu it feels soo fresh just to scroll through you. 😘😘😘😘😘 Ohh man i litrally cannot feel more proud. 😘😘😘😘😘😘😘😘", "sizzling_shoot": "❤️", "bawara._.mann": "💓", "skylightlion": "Thanks for Show Bob", "sameer_mayekar21": "Disappointed", "starsanddust_": "I wish India was more like Spain but I know that's impossible", "rihan___hussain": "@being_azman_khan ek bar Spain zrur chlna h bnde 😉😂", "jjuhi12": "More power to you🙏♥", "pranitgotsomewit": "haha mahn you’re the only one who can turn India into a developed country..after Narendra Modi(joke) #proudproud", "avvngrs_": "👏👏👏", "reality_bite": "no words.. but", "singhchauhanshivendrapratap": "Women's are stupid", "sidj_1404": "Just want to say no matter whatever people want to say but I'll say that beauty is what u show and that's what ur showing to the world nudity is not bad but its ur own choice and its not about being wieird at all it means ur changing the viewpoint about nudity is its beautiful isn't it there's nothing wrong in it", "pallav_k": "If going topless made u feel liberated and free. U could have gone bottomless as well. And could have blurred ur vagina for the sake of Instagram. Why not????????", "vaishnavi2377": "Respect 🙌💕", "d_delikate_wild": "Finally you answered to the long list of questions of the 'ultra social media and Indian Culture Warriors'🤣🤣Though it still wouldn't shut them up, but...logon ka kaam hai kehna🙃", "hunk_on_the_hunt": "Kya jabardast bola re baba👏👏👏#redheadwayfarer", "priyal____sharmaaa": "❣️❣️🔥", "dipashamulasi__": "All these captions of yours make me feel 1000 times better,happy,liberated,free also proud of being born as a women. And ofc my fav was “it felt weird at first,i won’t lie” #morepowertoyou#myfavourite#freethenipple @redheadwayfarer", "ekum25": "@manmeet_2413 people don't given a damn fuck in this picture , just minding their own business... That's what mentality our country needs READ THE CAPTION if you can 👌", "shra_anand": "Uh r luv😘😘", "ashimamj": "I adore you lady .", "thecouthysoul": "So true @redheadwayfarer #NotYetWomensDay ! While growing up i realised that women don't just do not have the right to wear what they feel, infact each and every action of us is subject to public scrutiny. And the worst part is that some women don't themselves support empowerment of other women. How on earth is it ever going to be a happy day to celebrate womenhood?", "moumita_pakira": "Great....my motivator", "abhishek_jain16919": "🔥🔥🔥🔥😘😘", "bhanu._.jangid": "PLEASE STOP!! Firstly, not all the things you write makes sense, using complex words, countering it with illogical statements just to prove yourself right. Yes,if a women wants to roam topless, completely okay hum nai rokenge aapko madam. But isliye topless hona kyunki aadmi topless ghum Raha hai, doesn't make sense.Kitna kuch h ladne Ko...Ladkiyon ka education ...Dowry Female killing..Rapes ....And all they care are nipples like seriously!Biggest Scam, you are not being an influencer...you are just like the ruling party, which makes chutiya of ppl. What they did, they made a statue of fucking 3400 Crores the money of tax payers, totally unnecessary, quite not useful when you have people dying of hunger, kids not getting basic education, health, opportunities to craft themselves. Now the point being undoubtedly we didn't require that but people compare it with other countries where they do stuff like this, man they are developed, they already have basic facilities, not thousands of people die of hunger there, nor their judiciary is too weak to punish the person in Power or Corrupt. Same point is with you, you are influencing girls in India (majorly) if they will start thinking like that now onwards, how will the really oppressed women will get opportunities to come forward, to fight, to get their rights while the majority is roaming topless, ignoring these facts. See the thing is in India the needs the priorities are quite different from the countries you compare to, first we need to give the girls best education so that they can decide on their own what the fuck they to do not getting influenced by others, secondly they need better sanitation, they need to be acknowledged abt sanitary pads, menstrual cups that can really change their life, 88% of girls in India don't have access to pads, many are dieing due to unhygienic use of cloth for it. Mr.Arunachalam Muruganantham(a MAN ) is fighting to provide and improve the pad distribution in India among the girls unable to access it. Jab basic requirements puri hojayengi tab karna na ye sab, janta apne aap samajhdaar ban jayegi and bilkul accept kregi.", "brohhh_devv": "It's tottaly mad and ..you are provoking just this chep mentality ..coz u know why because shame is also part emotion that comes from inner side ..if u want to inspire other by your post ...post some fitness , some self-defense and etc stuff ...that means woman also do such things what man can do ...if you are saying that post some nip*** pics and all nd saying that this gender equality soory GIRL I think u lost or something .... Again I am saying post in some u do wanted to do just do it...but atleast do not provoke such rubbish ...", "_the_store_hub_": "👏😘", "ketang26": "This is so beautiful..", "vikasrana15198": "Puri nagi ho jaaa", "thetatatop\nVerified": "Verified", "neha6747": "❤️❤️❤️❤️", "enigma4_you": "You are idk but u r jussss breathtaking ♥️ ily ♥️🔥😍", "barkha_gabri_": "Proud of your perception 💗💗 ur so inspiring", "anmol._sharma": "Best", "bakedodyssey": "Lol you'd have to be crazy to go topless in this place 😂", "___astrangerforyou___": "♥️", "saahibaan": "Well i m not in favour of nudity or saying that nipples of men nd women are same...but your 3rd point really is relevant for men to understand....though being nude is not right or watevr but no one on this whole gives u a right to stare,grope,abuse or rape a women...learn from these men of barcelona...they are also men like u nd are also having sexual urges like u but the difference is control nd minding their own businesses and their egos are not getting hurt by other's choice...i mean have an opinion but dont try to force it or abuse or slut shame anyone by being a pious teacher.", "mysorerasam_rice": "❤️", "prince_f_o": "👌 Inspiring .", "coupling_along": "How I I'm in love with all that you write! ❤️ Thanks for putting it the obvious out there, yet again!!🙌", "mo_sheef": "Waaooowww!!!!!!! You go girl.", "harshsngh5": "Phr bhi randi", "cunylyngus1": "Wow wow wow. Lady you just slayed instagram.. Not by the picture but by the words. You are one kickass lady and I wish I can be like rahulb for my gal (whenever I get her) and I hope I have a daughter whom I can bring up in a gender neutral world.. Keep up the good work 💪👌👍", "jyotsana.katarpawar": "🔥🔥🔥🔥🔥🔥", "___aakashkadam07____": "@_i_prajakta_", "_mr_aviator04_": "What is our Indian culture??", "ss11_subham": "u r unbelievable in many ways... go ahead girl❤...", "narendrapalsinh": "what a love", "amitaggarwal8": "@instagram should block this", "sayantan_bagchi": "BUTTER on THE GRAPES", "suffer_to_safar": "u r dropdead gorgeous... doesn't matter anything...not only abt women...u rvan epitome for men.... truly", "dips_the_pooh": "Oh godd , nipples of those men aren't covered . Ohh man i am so disgusted . This isn't right . I am outraged . Man should cover theie nipples 🙌", "dhamss_dvs15": "proud that india is having such grls that can change peoples thinking... u are lit💥... it will take time to change pplz mentality but surely ppl like you one day will change it", "atheethmuthava": "Caption!", "jbn.15": "Wonder why people relate nudity with feminism....", "ankita_raisinghani": "@prateekraisinghani", "_the_browngirl": "You have my heart @redheadwayfarer ♥️♥️ lots of love and respect to youuu for taking the first step for all the girls who are so bound with the rules of society. You make me happpyyyyy and beautifulll. Love youuu. More power to youuu💄♥️", "anil_k_keshari": "🤣🤣🤣😂👌", "hey_its_neha_negi": "After observing you , I'm proud that you're an Indian. Well our country needs more people with a mindset like you. You are so confident and inspiring ❤️ HUGE FAN.", "_firefries_": "Equality 🙌😪", "netra.94": "You rock! ♥️", "rahul.brar": "Is that a sticker or paint on your tits?", "abhisheksharma.19": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "ruchikazing": "@glenmaytum I love this woman ❤️ you should follow her.", "nishadkshirsagar": "Perfect timing for the post. A night before 8th March. It's like 'For society, by society'. Everyone needs to change there perspective.", "_oh.prediction_": "Wow. This is something so prefect and something that I've always been thinking since I grew up!", "shree_artofoutdoors": "This thing. To go against what society teaches. I wanna do that. Feels like I am caged. It's so heavy.", "ayeza.salman": "randi", "killer_ritzz": "if ur writting that nipple is not a big thing to show then why are uh hiding it upload the picture with nipple as ur this confident dont hide!!! im confused after watching ur pic and reading the caption 😑", "i_am_sahilmahajan": "Nice 👍 Fearless girl 🤺", "brijeshdoshi80": "God makes women body very nice compare to men but don't say to expose in public places...", "riyatyagi._": "@shivanir_ @shreyaatyagii happy women's day babies 😘 read this out girls , it's amazing as hell 😍🔥", "a.l.i.c.e_ecila": "I just wanna say you deserve a big salute and you are the perfect Definition of how a women should be unapologetic.... You influence me to be confident in my own skin.❤️❤️❤️", "soumyacs13": "I just love the way you express what you feel whether its through ur words or the pictures. If not everyone's but at least for few its like \"yeah right\". Jst don't give a damn abt negative comments, dey have comment on each and everything you do. If dey have so much problem with ur posts, y don't dey jst get out from ur followers list. They'll be waiting for ur posts jst to comment negatively. #TrueRight @redheadwayfarer @rahulb90", "deyanupam143": "Don't know why but I luv u very much dear.......", "piavakharia": "❤️", "_vaibhav_dange_": "There is a difference between equality and will. The choice of clothes is a will and that is irrelevant of gender. Equality is a different thing. As far men and women are considered there can never be equality between the two. The sun and the moon cannot fight for equality so is the night and the day. Each and everything has it’s own importance under the sun which is irreplaceable by any other. When you are looking for equality with men, you are actually killing the beautiful feminine within you. In today’s world, brain is the king and hence there is no limitation for a person of what he/she can achieve in life. I agree there has been a grave issue of oppression against women based upon their gender and that has to be fought fiercely and slowly we are improving as a society. So equality is in terms of equal opportunities. Rest, a man and woman can never be equal. If they would it shall disturb the equilibrium. The universe functions on equilibrium. If we move a planet by 1 mm from its axis, the equilibrium of the entire solar system might be disturbed and the earth may perish. So , there can never be equality in two beings. Everything is the way it is.", "__suprima__": "I m sure guys those who are querious ,are knocking there mind to bring change towards there perception through ur confidence ..thankyou .😊 yes you!", "tasneem_z_basta": "👏🏻👏🏻👏🏻👏🏻👏🏻", "shreyashekhar7_": "fullpower💕", "geetanjali_adhikari": "You are fine", "_.riya_rana_": "You go girl..loads of power 💞you such an inspiration!!!!! So proud! loving u more everyday..dont feel abase with these idotic comments🔥🔥🔥🔥u r savage🔥", "gamy_25": "Wish people here in India was literally open minded!I am just blown away by you girl!Super woman!Keep smashing!You are more than a Hope Atleast in my life..I wish I could gain that much confidence in myself ♥️ can't explain my love to you..it's limitless...was seeing your posts but today couldn't control myself!🙏💚💚💚💚💚♥️", "devanshiaroraaa": "You are solely an inspiration. Not power and love to you. ❤️", "roohchika": "I like it lady👍", "simranjain_12": "You are just Lit😍💯 Commendable to what have you written...Its not raising voice against society..Its just raising voice against what is right or wrong...I have read all of your captions. It just motivates me to have different perspective to some prblm in life❤", "vishubawa009": "@redheadwayfarer God bless you", "azay070": "Yai likhna ta isilye vo pic dali ti ye tumhri life tumhe jasi jeeni h jiyo par india k bhar rahke india ko criticised mt kroo😐😐", "manindertuli": "I can feel it and would like to add that it's not just questions with female but with males too. Being an Indian guy and culture we have bound to adapt made me difficult in Germany while experience the beaches over there but I made it. Though found some Indians who were surprised to see me like that and I know they were clicking my pictures so just middle finger expression for them is perfect. In the end I would say it's not about nudity, it's about mindset which someone wants to believe.", "____boss.ladyy____": "@ahanaaaaa___ @gods_own_girl212 @gayen_rashi @_____triple_____adorable_____ @___.snehaaaa.___ @srizsar Happy women's day in advance to all of you, my lovely ladies ❤ This post made my day!", "miss_munnchy": "👍", "i.dream_of_unicorns_": "You go girl 😊🙌", "saiiichavan": "Probably this is what I needed to read after a shit maths paper.", "supreet8638": "I am fan of what you write 🙌🏻 # Always # More Power to you !!", "chauhanprityy": "You are the bravest..lots of love♥️♥️", "bhawnajain178": "Big fan 🙌", "snigdharny": "Haha", "gauravbaronray": "I read some comments where people are saying that in India we don’t allow nudity bcos it spoils our culture . But even though girls wear more clothes in India than in western countries , our rape count is still more. So this mindset is illogical . And if Instagram as well as our country laws are narrow minded . Then obviously one has to hide private parts . No one wants to get arrested . Yes only nudity doesn’t means feminism .but it’s one of the various things that we should be allowed to do atleast on a beach . But I am shocked to know that a platform like Instagram considers a woman’s nipple as nude but not a man’s nipples .", "roshan_salaskar_": "This is a real girl. don't worry people what he say , enjoy your own life🤘", "tanyaadel": "It’s so important to normalize the female anatomy and I get so wired up with the concept of modest wear not because I have a problem with people choosing to wear what they want, as I personally am a conservative dresser but the fact that they are further objectifying . Ones breast are nothing more than tissue mass and cups to feed ones little ones . I say power to you", "_nabina12_": "@pearl_8818 @pallavi_roy_97 @shammo_29 too mordern😂", "siddhangar": "@eshanmehra", "ekbhuliguftugu": "\"It felt weird at first and I won't lie.\" my favorite line. Sending you bohotsara Pyaar and Magic Vibes from saat samundar paar girl 💛💛✨ @redheadwayfarer", "garima004gupta": "💕", "nancyjain03": "I really salute you for the kind of mindset you have . Their are really very few who can understand this and also very few who can appreciate that . I am very happy that atleast you came out and spoke it so well and also frame it in a proper manner. Thankyou for this ma’am. I am really speechless. Once again Thankyou for this 😊", "arashmokhtari_7": "Sex sex sex sex sex sexy", "ohhfatimaa": "🔥💁💁❤️❤️❤️❤️❤️", "navya_vvj": "@sanyam_vvj caption", "kinjal_haldani": "🌼🌼truckloads of love to you🌼🌼 @redheadwayfarer", "_abdulqadir_": "some people really need proper education", "100_rabh_thakur": "5th - we have the most excited society .. Everyone needs a topic to talk about...", "vedika_ag98": "More power to you🔥❤️", "jatinsoni12": "🔥🔥🔥🔥👏👏👏👏 well said", "that_nishant": "It needs VAGINA to express the way you do. Oops ! did i forget BALLS. You go girl #respect🙏 @redheadwayfarer", "asliarpit2725": "Show this to your dad. He'll be proud", "snehadhara99": "❤️", "_gabby_lips_": "Proud of you and love you 💖💖@redheadwayfarer", "__samridhisareen__": "❤", "rima_bezbaruah": "❤️❤️❤️❤️", "swaathy_ps": "@redheadwayfarer omg omg omg..Why are you so amazing??🖤 Love love love..!", "s.h.r.u.t.e.a": "❤️❤️❤️❤️❤️", "gui.ahuja": "❤️🌸", "hemantmeena9": "Chale Spain @abishek_sengar nange ghumenge jaise Bachpan Mai ghuma krthe the😂😂😂😂", "specsyzclickocurldiary": "Great write up👍", "the_positive009": "Apki shakal h nahi ye kaam h ab apke pass follower bi bada h 🤢🤢🤢", "kanishka_rao": "You roar ❤️", "shubham_gangwal_": "Well said..!! Main thing here is \"jis chig ko chupaya jata hai humans ko usi chigg ko janne ki talab hoti h\".", "basheeerz": "❤️❤️", "7wik.go_": "Oh yeah, be sure to run around topless at a bus stop, train station, and every place you go for the rest of your lifetime. Cause that, these days, signifies female upliftment. And not doing so makes you a chicken. Lol. Hilarious . And i actually cant u beleive how many people buy this shit everyday, on several social media platforms, from people like you. Shame.", "hetveesanghani": "Nailed it! Was just waiting for these answered to come out and shut down mouths! @redheadwayfarer truly commendable and hats off!", "_rajniiiiiiii_": "Well said 🙌👏💯", "sarahahaha____": "❤️", "itbas93": "❤️❤️❤️🎉", "harshpreeet": "@redheadwayfarer \"Barcelona didn't get me groped, stared at, or raped\". In which context you used it..? Is it in context of your own country \"India\" ( atleast what wiki is depicting about your nationality) or any other? Please do clarify..?", "sandhya_singh_": "I am proud of you💓", "sarcasm_swaadanusaaar": "you such an amazing and inspirational woman! 💙", "prathamsatalkar": "I think upbringing plays a big role in who we become after growing up. And that is one of the root causes to most of the wrongs in our society. Also India as society that lives in denial. We just don't want to talk about real issues that plague us. The moment we talk something that makes everyone uncomfortable we are told not to make noise for right causes. We lack qualitative sex education in our schools. Boys are treated as raja beta while girls are raised to submissive even today and we talk about empowering women. Sometimes I feel we are still living in stone age while rest of the world is light years ahead when it comes to equal rights for women and men", "badassincee_2002": "4", "soulofmadart": "You are a Inspiration for us ❤️", "gaurivyalekar9": "Proud of you🔥 respect💯🙏", "ashok2303": "🤙🤘", "ishikagxx": "The 4th one - if Instagram deletes pictures having nipples uncovered , then how come Instagram doesn't notice men being absolutely shirtless . They too have nipples uncovered . 🤷... @redheadwayfarer ... #w&m_equalrights", "ca_shivangiagrawal": "I am so happy that at least somebody is giving words to the thoughts most of the women have ... More power to u ❤️n so proud of you !!! ❤️🙏🏼", "sweekriti_sweekiborn": "👌❣️", "varsha.mahapatra": "Hey @instagram . Get the point?", "roshu_beta": "💗✨", "_shalin.shah": "So if I crop the nipples of men out and paste in on women, would @instagram censor it? 😂", "__.tanii._": "😻👏👏", "saurabh_oggy": "👏💚", "abbz_82": "Bravo! You write very well", "sera95das": "More power to you girl 💖", "crookshanksx_": "You are just 🔥🔥🔥🔥", "rathour_therajputboy": "Respect👏", "priya.pj36shan": "You are an inspiration for all girls just love u ❤❤❤😘😘😘😘", "mayankcraze": "wow you are looking ugly😃", "lucky_helen": "Peace is being nude... ??🤔Women empowerment_means getting topless ??👏🏼👏🏼 👏🏼", "harshalrandhir": "I loved to watch porn bt i see there is no porn in this pics...u r really inspiration to others....nice pic...wish u all d best...", "jahnavi_ahir1": "👏love and respect!", "shabnam_thakur4": "You go girl! 💙💙💙💙", "brihasi_dey": "I wish someday women's body be considered just another normal thing like that of men's and not seen as a piece of flesh that has to be hidden and I hope people stop judging/slut shaming/describing what actual feminism means/or more terribly harrasing or raping when women try to be comfortable in their own skin with or without hiding it as per their wish just like men are allowed to and evryone just kind their own business and spread love and peace. It would so wonderful to see our daughters growing up without wondering if they would be groped if they don't cover their cleavage or be badly stared at if they wear their favourite shorts or raped if they roam alone because women's body is still a taboo in our society that should be hidden. @redheadwayfarer Your posts are so strong that I literally get goosebumps seeing them. Posting exactly what you think and know is right where half the people might judge you is rebellious and courageous and is needed. All power to you. ❤️❤️ Lots of love. ❤️ And yes, @rahulb90 lots of respect❤️", "komalpreetkhullar": "Instagram should take this picture down now bcz boys ke nipples. Not to forget the other women is also lying topless. She's doing this where she can get the freedom of doing it and no-one cares man. Good that she explained as people don't know instagram don't allow nipples or even period blood. My blood is pure and beautiful and we feel happy when we see blood on our bedsheets as that's a healthy period. If we bleed less or don't bleed at all, no-one will be born through us. And why instagram don't make a rule of blurring the whole breasts then? If they r so concerned sexually.", "_ach_sanskryty": "More power to you", "mr.manojdas": "Everything is ok but sticker Kyu lagaya ????????", "___manzi___": "Love 😍", "vvikram2404": "I really appreciate ur work to empower women in this #hypocritical society... Love u ... By the way Where can I find these #uncensored pic ??? 😂😂😂😂", "paranoid.pandya": "Bo D +😂💯", "ravishingtwinkle": "This one thing I live the most about abroad , if one is not much clothes , theg will just go on their own way focussing on themselves , they wouldn't pass dirty comments or molest as it is done by some Indian men to even women wearing full salwar kameez on streets , colleges , offices , malls.", "ashishbaijal": "You made so much sense .....Proud", "gyaneshwar_": "अंकल की बेजती कर दी🤣...", "priprimajumder": "I read all the captions of the other posts in the series. And I just wanted to say wow, I feel so so so so good after reading your captions and you are one hell of an amazing empowering woman and an inspiration. I wanted to write more but I am just so awed that I don't know what else to write.", "aishwarya495": "To all those people commenting on why @redheadwayfarer is apparently \"wasting\" her time walking around \"naked\" and talking about it....let me explain something-you see,female empowerment in not a ladder,there is no damn checklist of things ranging from mild to unbearable,no classification of patriarchy based on what's more important.Every form of oppression is stifling -be it of our bodies ,minds,ambitions or just plain wanting to live life they way you want to.Atleast she is out there,opening conversations and provoking thoughts about things which are frowned upon in society although it's something everyone faces in some way or the other.She writes what she feels about and irrespective of whether you agree to it or not,bravery must be saluted.Kudos to @redheadwayfarer for refusing to be caged in.More power to you.", "dikshamathas_": "💕💕", "ronak_kulhari": "Soo true", "harry_singh_1992": "I feel amused and desolate at the same time to see how we indian people don’t have anything to do aur die but peeping in each other’s life, Period.", "dee___nah": "My inspiration♥️😍💋", "pritiroy2002": "I just loved how these guys around you are minding their own business. And not staring at the nipples. Thank you for sharing @redheadwayfarer . I just love you. Thank you for sharing.", "madhura.1796": "more power to you❤️you make us believe in yourself", "akadityacool07": "👏👏👏👏 not for the pic. I don't even care about the pic. But this clap is for the 4 things that you have said", "ritikaa.19": "@shreya_ralli97 🔥", "msfantabulo": "Next stop full frontal, Yay", "ravirohatgi1986": "You happy you Topless 😍", "kashmirabagade": "You nailed it girl with these series of posts! More and more power to you @redheadwayfarer", "we_too_exist": "way you go girl 💛", "be_real_u": "If u r that open.. Then why don't u show nipples...?!", "zahooraghani": "Man will be man hahahaha 😱", "jhanavi_bysani": "💕", "sanskriti_2106_": "You're an inspiration💋💋", "miss_stun_gun": "Girl seriously! You’re the voice of the nation. Ever since I’ve started following you, I have changed in a way I thought I couldn’t. Whenever I open my insta I know that I’ll come across some or the other post of yours and truly get inspired. You make us believe in love through @saerahstamps , you make all of us girls believe in our true unfiltered selves with every of your post. I don’t know whether you’ll see this or not, but just wanted to write my heart down here (like you do in every of your posts, unapologetically honest). Bless you 😇", "the.cozy.bliss": "@instagram fix your shit! damn i didn't knew about this", "shamsheerbains": "I AM IN LOVE WITH THIS POST!🌸 I was so upset to see some people commenting hate and their disgusting mentality on your previous post, but after reading this, I feel like this was a tight slap on their faces. You never fail to amaze me @redheadwayfarer ❤❤ So much of love!", "_beautifulthings_10": "I guess instagram is the real culprit in this equality era #unfairrules #freethefemalenippleaswell", "saheen_mehzabeen": "🔥🔥you're surely giving some meaning to ur lyf nd also many other women", "mohanty_sristy": "People thrashing hate speech on this post or any post like this are the reason the country could never get the actual \"freedom\". Suckers from this society are the same people who are proud of the epic \"kamasutra\" and also intolerant of women behaving like \"people\" and not any specific \"gender\". May the female Goddesses from holy clouds bless your maculanity! @redheadwayfarer and @rahulb90 fuck em. You guys rock!", "chhatrashal_singh_rathore": "Khali do nipples per itni baate likh di aap nai. Hope u understood Hindi. Yes it is seen differently in India bcoz of different culture 😊", "_lazy_sp": "♥️♥️", "alliloveiswritingg": "Power!🔥", "zankhuu": "i have never seen or read this open post till date... salute to u yaar u did it. and as usual indian people will never gonna accept this...and thts y new generation are moving to foreign country", "tarun_xviii": "PROUD OF YOU @redheadwayfarer", "d.i.y.a_07": "damn i feel actually good that i am alive at these very moments to read what you write! #feministforlife", "kamakshi_bhatnagar": "👏👏👏", "aayu_mishr": "You did great! It must have been scary, but still you did it! I wish for women to get more stronger like you but in their own way! You are an inspiration mam", "sumit_beerbuddy": "Good message. Cheers", "yash.khairnar7": "Respect. Power. Love. ❤️🤗", "pokhriyalpriyanka0": "wow well said @redheadwayfarer 👏🏻👏🏻 you are an amazing soul n inspiration to many ❤️❤️❤️❤️❤️ love you 😘", "bhupi_kkc": "You fucking dumbo, if you are awared the consequences of nudity in india then why the hell you want walk nude on the beaches. There is nothing wrong in you but i believe that there is something mis happening with your mind and don't you dare saying that if you were in india and were trying to do such things you will be afraid of getting raped or groped by someone, and yes it is illegal in india because it's necessary because we Indian's don't want the people like you came to our country and try to spoil our youth just for the fucking attention. If you think being nude is a freedom then go-ahead who stopped you,and let me tell you it is not only illegal in india but on Instagram too that you have censored your.. fucking dumb ass.", "khushboo_abrol": "💯", "sugammishra917": "👌", "koyena_deb": "Love ur posts, u r really an inspiration..love u loads @redheadwayfarer", "just.preet_18": "❤️❤️", "sooraj_soni": "You Go Girl!♥️🤟🏻 @redheadwayfarer", "thatbindigirl": "Happy international’s women day, not meant for India. ❤️", "gunner_nik": "👌🏼🙌", "kaatto786": "Don’t worry about people .. kuch to log kahenge Nd yes u have actually somehow changed my way of thinking .... lots of love nd power to u .. gbu", "aradhanaangeldevil": "Great going girl...love it...", "jateenkumar": "itna paisa kaha se aata hai mam ghumne k liye apke pas 🤨", "unapologetic_mon": "You go girl😘😘", "i.ix_ix.vii": "Now this is what I call 'happy' women day. I am glad that you explained all the stupid doubts the male counterpart had!", "shehzad_patrawala": "Very true..✌️", "yuvi_mewara13": "Agar aapko logo ki soch badalni h to jo dhaka huaa wo bhi nahi dhakna chaiye tha", "_.pawyall._": "Waiting to report that one jerk who'll say some bs like \"this is why you get raped\". Immense respect and power to you @redheadwayfarer , you make such a difference, I hope you know that 👏💖", "nycslk": "Greatest picture ever", "iishita_roy": "Kudos girl✌🏾You are such an inspiration!", "sanke.tk": "Seems the guy who handle instagram is women or probably gay who can’t tolerate women’s nipples.", "nisha__nimavath": "🙌🔥🔥", "kavyaaaa": "❤️", "just_another_dreamer_leo": "Proud of u mam hats off to u. And yes #notyetwomensday", "manalijamad": "@redheadwayfarer I am just curious to know how did it all start ? As our history says earlyman never wore anything except hiding their genitals.. so who started it ?? Bunch of society jerks ?", "sex_and_runnn": "Who reads such a long caption", "shrishtimittal": "Proud of you girl!! You are an inspiration 👏❤️", "pvtttjanavi_": "You truly are my spirit animal! Looking at your posts and reading your captions makes my day better 100000x, it doesn’t only teach me to be comfortable in my own body but also allows to have a wider view about how all the bodies are different and about how we as humans should not shame others for what we as an individual don’t find acceptable. Nudity might not be the escape for some but it empowers some, and nudity is as normal as an individual fully covered with clothes. Women’s day is not possible till us as a singular human being change our opinions! Charity starts from home! So let’s start it! #notyetwomensday", "khitijaa": "This post makes me wanna quit Instragram, but again who's gonna enlighten me with such great values if I leave :) @redheadwayfarer", "ahanadutta24": "Since u guys came 2 social media...u just hd changed da real meaning of feminism...practically dekha jaye 2 u r disrespect women by showing nd asking us 2 show nipples ....bro our pride, our respect is our body...which needs 2 b protected n covered...not bcz of competition frm men n shitt...coz its 2 be...men move shirtless coz they dun hv boobs...we hv...nd we protect dat instead of showing off 2 da world...men hv dick...dats der pride n respect...did they ever moved without an underwear?...abey they move shirtless coz kuch nai hai unke chaahti pe.... ye kis type k barabari hai bhai... bina bra k ghumne se konsa feminism jaagta h maate...nd y hv u scrambled over ur nipples agr itna he dekhane ka shauk h toh....", "_selcouth_atul": "I'm not a female but still i understand most of the things you say because it's the bitter truth. Sometimes even i find your posts offensive or a hard to swallow post but later on i realized why it's like that because whether we wanted or not but we grew up with a mindset where same thing male do is so so normal and for female it's a sin. You are indeed doing a great job. More power to you 💪❤️", "arjunhardas": "You're awesome!! More power to you. Do what you want. Whenever you want. May ever woman be like you! 🤗", "zain_khan_online": "Salute", "benudharswain": "Why u doing propaganda for just a picture. Its ok ppl are mature to understand. You uploaded this picture because u want to discuss things not abt thinking of indian ppl.", "sunshine198906": "So beautifully written....words that needs to be spoken...that needs to be heard ..More power to you woman ♥️", "nushpai": "so important! And really lovely to see discussed by an empowered Indian woman 🙌🏼", "___rajashree": "Just falling in loving with you and your writings every time😘😘❤", "i._wisher": "Applaud! 🙌🏻 I'm in Goa right now and this is exactly what I felt and you actually penned down the perfect words! You are an inspiration! ❤️", "imsleepingeatingwanderingolwzz": "More power and love to you🙌🙌🙌🙌😍❤️❤️", "mohitpawar___95": "Nude 😘", "tiyashachaudhury": "🔥", "siddharth_pincha": "The men women part. Just loved it.. AMAZINGly put up", "ankitanayak_": "You own my heart. We need more humans like you. I'm so in love with you and the caption.❤️🙏", "applecustardmixture": "Wonderful summary. I appreciate the way you have unearthed the pseudo nature of looking at a woman. Very much thoughtful. Salute to you👏", "ziindagi_": "Bravo", "prraveengupta": "You're slaying as always", "__queen_honey_blossom": "👍❤️💋", "thesatyamsharma": "Red head di then why not boycott Instagram if Instagram is still reflection of values what do u say.....🤔🤔🤔🤔", "_ocean.gurl_": "❤️", "shreshtha_awasthi": "Damn woman, you got the gutts. You're truely inspirational, you know? ❤️", "aayushdubeyy": "This inspires me to be a better man..thank you🙌🙌", "_pr3ttypriceless_": "People ask these questions inspite of knowing the answers. I mean- mate you're one of the reasons why. 🤷", "desai_snehal_": "I just love you @redheadwayfarer ❤ keep shining and smiling always 😘 I feel like you are the voice of so many souls including me who cannot express their thoughts so freely and firmly 😊 sending a big tight wala hug for u 🤗", "pri_ya_nka.sharma": "Babe you're love... you inspire a lot... Whatever you do nd say I love", "anushkaaaaa": "👏👏👏👏🔥🔥🔥", "mumbai2.0____": "Hello There ! I'm A Boy Trying To Help Alone People Who Might Be Suffering From Any Issue Or Who Feel That They Are Lonely. Well If You Wanna Talk Or Feel Like You Wanna Share Anything Just Hit DM. ( Check My Story 🙂 ) Thank You ! 😊😊🤗🤗", "muskan_bhat": "🔥🔥❤️❤️", "mehk.kaur": "more power to you 🙌🙌❤️", "fishy1597": "Dude, woah😍. @danishaikh94 u shall give this caption a read.", "snjymudgl": "Beautiful", "iajay_aj": "You should have blurred out nipples of those men too, it would have been a burn on Instagram terms n condition.🤣🤣🤣🤣🤣 @redheadwayfarer 💪", "sorryraghu31": "U just did unthinkable but can v get uncensored nude pics of u in other platform like Twitter or fb or any other source. Bold brave and hot", "_kaafi.lost_": "Great respect!!❤️", "wastedtimes11": "Go girl. M so proud of you. Literally, it's blessing to have such people existing. You are an inspiration. I mean it. There is something about your aura, whenever I am lost or feeling low ..I choose to read your captions instead of novels. It's feels to right.i mean , my mind has accepted that whatever she has to say is true and it's correct. There is so much energy in it. Thank you Saloni (sry m 1st medico student...thou I adore you and u are my fav.. don't really get much time online to go through posts.) ..", "gethigh.bcn": "🤩", "deepika0305": "The way you articulated all these thoughts is exactly the amount of dose needed by our ‘so called value system’. More Power to you girl ! ✌🏻", "swarthysagittarius": "I wish people get mind-set as yours,(ugh!!!no doubt neither do they try to change nor understand to get the exact concept of जियो और जीने दो, I simpl words! Life would be much easier, I suppose. #whyjustonedayofwomensdayhonour.", "electrifying_shashank": "U r women legend😎", "07bir": "Writing blog will influence only educated and mindful people.You,we and all really need to find some smart way to change the mindset of society and that should initiated by doing numerous campaign in school and collages and sharing awareness to our youth .only celeberity can do this with the support of govt.", "amanjot_kaur09": "The best thing i saw and read on instagram today 👌💪💕 P.S. I love ur posts and captions...you're a fabulous girl...keep slaying 💜💜💜", "isheeta_yadav": "YOUUUUUUUUUU 🙏🏻🌼", "heyustfu": "@_toxic_shot_ just for society😊", "jyotirana777": "I love you... You make me go to spain", "niravshah2505": "Something is there I think yellow💛", "anmol.358": "You go girl❤️ 🤘🏻", "_sakshifagnia_": "You are my constant inspiration to love my body as however it is . You are courageous , you always will be :) God bless you !! Happy women's day in advance ❤", "minalrks": "♥️♥️♥️♥️♥️♥️♥️", "anoushka_neerunjun": "🔥🔥 u really inspire me .. best pic that defines freedom and the caption is 💗💗💗💗", "sonimartolia51": "Well said💕😍", "rathour5592": "I don't understand what r u trying to prove .. According to u women should go topless... We live in society not in african jungle..... If a man showing his dick... Is it justify just bcoz it's his own body part.... No its not.....", "nikitajain003": "♥️♥️", "jain_chirag0": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "swatikr.music": "& i guess that so many sick mentallity are barking on these post without reading the caption which is fully 'an appropriate' . Instead of barking here they should get their life.. coz these things are out if their sllybus... this woman in a picture @redheadwayfarer is an inspiration .. with an healthy mind . Which is rare to be found in india. ❤", "aakashhaistar": "😂😂 so many if, dear if u go toples at juhu beech believe me no one will raped or grouped u but u won't do it here becoz u also know it's not right but ya on IG platform u can post anything n talk about anything bullshit, if u think getting nude is women empowerment than u r misleading", "taraboogeyman": "👏🏾👏🏾👏🏾LOUDER FOR THE PEOPLE IN THE BACK👏🏾👏🏾👏🏾", "bilal_era": "Ja behn apna kam kar", "deepika_jain30": "You’re truly an inspiration... i love reading your posts 💞 long way to go girl 🥂", "dr_thrive": "@redheadwayfarer Bohot hard boss 🙌 😘", "keshhhhh__": "WORD 🔥", "muralijikiladki": "I just love you dude @redheadwayfarer 🤘", "zarrishfatima89008": "❤️", "crystalsinghya": "@yatish_puhal_ya30 ❤️🌹 Thanks for not judging me everytime and making me feel free! That's what all guys needs to understand boobs,ass and vagina are just body parts", "meandmrdarcy": "Great boobs and screw closedmindedness. You're doing a fabulous job at being unapologetically you 👑", "rahulrajj173": "Yahi baat krne ke liye sb right gud bole ge. Kya tum log kr sakte ho ye public mae Or itna open hona h sahi h girls women ki respect jruri nhi h kapde utarne pe hi ho. Iss mean toh kal ko sb kapde utar kar road pe ghume lg jao. Ye kya Betamizi hue. Jo jo ye bol raha h sahi h gud. Kya tum mae se koi aisa kr sakta h infect iss mae sahi h hi kya. Kapde utar kr chalne se soch badle gi kya logo ki. Abhi itna B besharam mt bno ki family ko B satg khade hone mae dikkat ho iss hisab se toh brother father ke aage B nanga ho kr ghumna start kr de kya fir ghr pe. Mentality insaan ke hath mae hoti h wo kapde utar kr ya pehan kr chalne se sabit nhi hoti. Disgusting., 😡😡", "mewiness_": "@sukku_03", "_the.moonchild_": "🔥🔥🔥🔥🔥 i loveeee uuuuuu", "vishal_rathore_007": "So beautiful looking gorgeous💋❤️💋", "mysterious_anwesha20": "You are the one person whose posts I check every time, read with my soul and get inspired... Lots of love for boosting up the strength😘", "payal_bathija": "Notyetwomensday. :'(", "__soumyasharma__": "You are an inspiration❤️ #growgirl @redheadwayfarer", "deeparna98": "Thank you for being you.💙 Always.", "xx_bacchi_xx44": "#nice💞💞", "_amrutadoke_": "You are an amazing individual!! ❤", "satan_me": "Once a man DM me on Facebook , sending his dick pic basically , he was a complete stranger to me and not even once did I speak to him. I felt that to be very dehumanising and tried posting it publicly, but it went against Facebook norms , haha.", "modernwomaniya": "More power to you girl ❤️", "swatibanik2000": "@redheadwayfarer respect for u😊", "luvarora14": "Idk if it's just me but the more I look at that picture, the more Normal it looks... Is it Spain magic or is it just the fact that ppl around you just don't give a fuck about it, makes it not weird... All in all, more power to you for writing such posts, bcoz really it requires a lot of patience and courage... Great work!!", "me.royaljatt": "But then say you what 😉 I feel liberated when I unhook by bra before I go to sleep 😍😉", "travel__miles_with_smiles": "Proud of u..🙌 Be how u r always❤️", "shrutibekkeri": "If you don't mind I have a question!! Have you taken her permission to post this picture?", "vaibhaviiii_1332": "damnnn u gooo girrlll❤❤❤", "mimislittlecakeshop": "Love you lots...more power to you!! Thanks for these wonderful posts🥰🥰", "kajal_ds": "❤️❤️😍", "dressforyourselfofficial": "Love your writing! Proud of uh Girl♥️♥️", "aishaupmanyu": "🔥🔥", "arushibagde22": "You are seriously true true inspiration!!💋💋💋 society needs mindsets like you 🙏", "ridz_d": "U r inspiring girl", "ii.intactsk1712.ii": "😘💯", "rinidanielle": "You inspire me so much 😭", "debayandd": "Is this feminism? Then stop ✋🏻 you are independent to do whatever you want but this is not the fucking feminism you are showing sorry", "kajal9771": "❤️", "sovushka_irinelle": "You are a inspiration for girls like us. I hope one day we can all live without fear from our own body.", "anisha_trisal": "Gender inequality at its best... There are so many minor things that differentiates a role of woman in a society to that of a man even today in our country. Be it in terms of a daughter, daughter in law, sister etc. For example how a son doing a household chores will be a bit harsh on him so let's get it done by the daughter in law. There are many subtle situations like these that still persists in our society. I think even if we try speaking out loud, this gender biased society will never pay any heed.. but nonetheless we won't give up and will fight for equality. #happywomensday", "mr.wallia": "U r owsm yr ❤️ #Respect 🙌", "the.wrong.colour": "I didn't notice anything different with your nipples and the man's nipples... everything is because of the awareness and liberation in our thoughts... I really thank my parents for raising me like this..to think freely !", "spandannshukla": "🔥🔥🔥", "juhiiisharma": "❤❤❤❤", "__yatii_": "You're amazing", "_ashmi_30": "Girlpower apne ko frk na pdta bhad m jaye jnta", "pooj0a": "Love🖤🖤", "the_smiling_khaleesi": "Well said👍👌", "someones_indeed": "I totally embrace you and your words. Your words definitely leave mark on my mind and many more like us. You are celebrating women's day in true senses. I don't know about others, but I totally take stand with you and your words. What you say and do to bring about a change in society and people's belief is absolutely outstanding. Big heart for you Saloni Ma'am❤️", "irenethemoonbeam": "You are one of a kind... 🔥🔥🔥🔥truly amazing", "thefunctionalwardrobe": "I adore you woman ❤❤", "officialnafy": "And the reason I ask my female friends to follow @redheadwayfarer is her Braveness to speak, braveness to do whatever she wants, braveness to become what she wants. She has won many hearts and many more to come. Society will change \"Not today but One day\" We are with you @redheadwayfarer 🤗🤗", "d_urg_aa": "👏🏻👏🏻👏🏻👏🏻👏🏻", "thebrewederotica": "Hey, our page is working on an initiative to raise women issues from around the globe. Would you be interested in being a part of it?", "stxtii": "Needed to be said and heard", "heenakhubani10": "You’re amazing", "badani_simran": "Are you in real? Will be glad to meet you some day. Dear real feminist !truely an inspiration. Loads n loads of love.", "rushaa_._": "I love You! And I admire you so much. ❤️", "psychedelic_smile": "We need more humans like u .... Srsly .. ❤ (in a world where female body parts concern more ppl than melting glaciers do ) @redheadwayfarer", "justin_model__killer_": "Super", "shivi18_": "#Respect ♥ more power to you ♥ you inspire the world ♥", "tanwervikash": "So true words 👌👌👌 & 👏👏👏👏 for you", "shree._.j1510_": "Again its the truth about the society and the m8ndset should be changes !! Youre an inspiration mam", "mandvivermaa": "You're amazing❤️", "wallflower_soul": "Hello my girl crush and I adore u...love ur writings and no filter posts .....Love ❤️", "_my_thougths_": "Each time I see and read your caption I get inspire and Offcouse enlighten in many ways. Offcouse this post isn't about justification it's about how to shut up idiotic mouths. Love you man great respect.", "dive_deep_into": "The credit should go to @rahulb90 for supporting you! Great Man , Full power to you both @redheadwayfarer @rahulb90 #couplegoals", "ishiitaaa___": "Babe❤️", "mysterious_2413": "Proud of uh Girl !", "potterhead_p_08": "Happy women's day💞", "adi.ti.wari": "You're amazing💋💖", "alwaysso_extraaaa": "Well said!! 🤗", "oyesalwa": "Do you see the beauty of this picture? YOU being YOU and people aroung minding their own bussiness. Damn! BIG fan, lots of love❤", "upadhyay.suwash": "I pity eh woman. Just for attention and fame. Eh will do anything.", "_anxshkaa._": "You go girl!! 💕😘 So proud of you.", "gargiraveendran": "More power to you. ❤ You give people hope. ❤❤ Cheers to that. ❤", "nimishanayak_23": "💙💙💙💙💙 I Just love reading ur thoughts!! Thankyou for inspiring us ❤😘 More Power to you 😘🙌💋", "tinatengra07": "You go girl 💪", "singh.sexy.tish": "👌", "aryakale16": "Ur the best ❤", "_ignavihs_": "🌞🌞🌞🌞🌞💟", "gawde.1peg": "@badasss17 like you always say ‘Freedom is naked’ 💙"}