{"sarwhinyyy": "And why are you always attacking men? Feminism means equality between both genders. Not women being superior over men or vice versa. Feminism doesn't mean lashing out at every man. Sure, india has many disgusting and fucked up men. But not everyone is like that. You probably dont even know how much this guy would've worked for that body. Talking about nudity i dont think women want random other men to see their tits or i don't think men want random women to see their dicks. Loving your body is great. Self love and body positivity doesn't mean going nude. And that's why there's places like nude beaches where nobody even cares. Nudity for men or women is limited to places like that. There's bigger more important things to deal with right now.", "athaparth": "Ye psycho pagal aurat hai", "healthyram_": "showing naked or bare body is not freedom..if you have certain amount of followers use it wisely..show ladies that how can they come out from male dominance and gender biased..Fake women empowerment band karo Didi", "barbie_doll_loves_u": "😢", "emaadali01": "Who’s here after lakshay chaudhary’s video?", "this_is_oura": "No one stop you if you liked be nude then do show nipples who cares lol. I don't think any boy exit in India who share him dick pic coz something are good to be hidden.👏", "vicky_rawatwebe": "There’s more to feminism than just showing nudity and asking for equality in terms of dressing alone. Merely just showing nipples or not wearing a bra isn’t feminism. Please show more of women empowerment in terms of what actually women are doing to meet the needs of their families like working women or women who have taken a stand to take their families out of poverty or just provide her children food.", "sunainabhatia09": "Hot tight boobs😍🔥", "hamzah.ahm3d": "Nothing much here to see folks...... Just another one of those Attention Seeking Wannabe feminists that's all..... #instagramfamous_wannabe", "abhinav_mmishra": "Community ki bat krti h bina chote kapdo k followers bna k dikhaiye pahle fir bt krna ,khud gnda kar rkha hai community ko uske bd bdnam dunia ko karnge..khud bhi caption nhi pdha hoga par copy paste krke nangapan dikhana h likes k liye", "navirana023": "There is difference between male and female chests.If u think they. Are same then u are. Mentally I'll.Men can go shirtless in public but u can't there is a reason for that and u should know that.", "garimaagarwal_": "@saransh_bansal1999 and this", "bablu.13": "Remove bra", "anvyshrivastava": "I don't understand some people commenting on feminism. Didiyan aur Bhailogon, do you really think that you can talk about feminism without acknowledging parts of it like this post. Let's keep feminism aside for once, if a man advertising for a brand in his undies doesn't seem asking-for-it or attention than why it's so different for women. She is trying to explain the sort of bubble we are living in. Society manufactures such thought process and expect everyone to adapt to it without questioning and in a patriarchal society every notions caters to men's so-called-comfort. And don't get me started on 'agar itna hi hai toh nange ghumo' part, history jaaan lo. Aesa kya hua that women were forced to adapt to a certain type of clothing they never had. Padho history women clothing, indian attire sab. Khajuraho ke bahar kyu nude god idols hai. Goddess Durga ke manifestations, Chamunda ke manifestations. Bhailog aur Didiyan, mai jaanti hu because of the comfort of not having to research, aap ko jo milta hai aap bina analysis karke bol dete ho. https://www.bbc.com/news/magazine-30330693", "manshi4980sharma": "🔥😘🔥🔥🔥", "r_u_ready_4_it": "This is the best post I’ve seen from you! This is so true!👏👏👏", "rajatkakodkar": "I don't understand wht do you want to prove.. You sound like an idiot here.. Just bcz you have good command over english language and in the name of feminism you write whatever you want to.. means like seriously? Why you want to free the nipple ? For wht reason ? To show equality?? Showing the nipple is called equality ?? Do you even know that breast are secondary sexual organs of a women and yes they attract man!! Not bcz thy have lust but because they are meant to get attract but humans are made that way.. you can't deny this fact!! (I'm not saying that every man should keep on looking at a girls breast all the time let me clear that) and that is why thy are not exposed men do not have breast but have nippels but their role is not for any attraction hence they can go topless. You have a platform to speak that doesn't mean you should write things that doesn't make any sense!! If you wanted to feel that women should have right to free the nipple then why didn't you post a picture like that ? You wore a bra right? Similarly women are not comfortable to show their sexual part every other men. (Not just women no one likes to post pictures of their private parts, their are exceptions) instead of writing rubbish assays here go and help a women their are plenty of women who need help who are not treated well you can help them. Sitting at home writing about issues that doesn't make any sense won't do anything.", "prickster.strikes.back": "Riddle me this. I recall the infant in my family was on to breast feeding . Loved the site of nipples .would simply make a dash for it . So once I was sitting bare chested . And the infant had to be pinned down lest it suck my nipples off . Why ?", "asthapassta": "Slow and steady. But we WILL RULE THE WORLD IN OUR PANTIES🙌", "theanonymouslover1": "Acha hai. Sadko pr nanga ghoomna shuru krdo.", "koualwaysflying_": "@mr.bandyopadhyay", "chicken.steam.plz": "What's the outcome ??? 😶😶 There are a lot of social issues women are facing right now and they are definitely some bigger problems than freeing your nipples, just to prove equality.. if making the nipples free meant equality, half of the female social workers would have been naked by now🙄 #justSaying", "shadab007ali": "No everyone is not threatened by the female body by your definition breasts that fed your future generation should be free so the vagina that gives us birth ,the penis( half responsible for birth ) should also be free and anybody who feel this should roam free , it can be your opinion but i don’t see any logic here tell me one thing will it be ok if your brother and father roam naked or your mother it can be ok for you but i don’t think that it is ok ! Owning your Sexuality is great but forced demonstration is wrong .", "brettlee7119": "Wow bra ............", "sweet_as_caramel___": "There's no equality left.. At all.. Only people speaks about it.. But then too makes a huge difference till yet.. The Society thinks all this shits.. About the clothing, looks, body.. Etc people should not make a difference between a male and a female.. A male can be nude all that ohk.. But it comes to female even if her bra strap.. Is seen people makes lots of.. Gossip about it ..this is what fuckin.. Thinking is yet there.. In society.. Whatever you told all thats true.. Female are not respected..fully.. Such a shame 😔", "rohit.beniwal.jaat": "First of all hastags like hotgirls or sexygirls are even not banned...and if you think that ur bo*bs are not anything diffrnt from males so why dont you roam on roads without wearing anything...will you...jst nudity is getting publicity by using the name of feminism...why dont you join army or any police force..i think it wll promote ur femenism more than this shit..", "_instafunny20": "Chup saali chinal its nt our culture.... Saali illuminatiii", "black.turtleneck": "💖💖💖💖💖💖fvck yeah!😤", "muradabdullah1": "🤦🏻‍♂️", "twishajhala": "Listen ! I believe that you are overexaggerating the situation of girls in India . What do you want ? , People should roam without clothes . Will you get married naked . feminism is not being how much freedom you got being naked . Its about your your intelligence , its about men should never be prioritise over women .", "yoongleschu": "Okay but there are women who don't respect men too... Just saying", "vijaychauhan2041": "Vijay", "ja.laj": "We as humans and most importantly as males and females have forgotten we all are just animals like others our there. Be it lion or dog but just a little more evolved. And in animal kingdom males fight each other to mate (have sex) with female out there. Of course they are aroused and go to any extent for what they want", "ben_benedict": "What will be the outcome of this agenda of this, kya outcome hoga free the nipple karne se plz answer me", "scooby_doo_890": "He should take off his underwear. Free the nipple free the dick😂😂😂😂 .#faminism", "abhishekraushana": "Nhi jyada bada hai.😁😁😁😁😁", "kushprj": "I agree but plz can you suggest any solution for it? I wonder with no negativity that \" Are man only responsible for this situation ?\"", "venky6316": "Puku", "dnt_rush_me": "Woah! ✊🏻", "rupama_roy": "New new bra(s). 🤔No work for social change only inspired to go topless😂", "ritika_sodhani": "Well said !💕", "shanu_mumbai": "Hot n sexxy girl gorgeous i love you shona ❤️🔥💋💋💋", "_cat_woman": "You go girl!!!! I support you!!!", "karankumar8568": "👌👌👌👌👌👌", "asma.malik96": "More power your way✨✨", "_priyanka_dhingra": "Omgg this is soo true😱 and you are an inspiration 💯💯", "cutedesichicks": "Make account on Twitter. There any female can show nipples. Twitter respects all", "appyiie": "@deepucca she is something else. ❤️", "sakkumyself": "You are amazing ❤️", "drunken_panda09": "We must change the mind set of the people we can't control their minds but we can give them a way just like we can't stop the flow of river but yes we can give a way to flow from other side 🔥🔥🐼", "beinghuzaifa____": "Ab ye instagram ko report karegi 😂... foolish woman", "let.me.freak.out": "even if u want to roam nude...we dont have problems..why u think so much about other peoples mentality...u cant change them...i am unfollowing u cause honestly i find u talking nonsense...no body really cares...nipple dikhana is not feminisn...nippple nhi dikhana is also not feminism...do whatever makes u happy and for godsake stop now...no body reads long captions..wear what u want.. just dont make it a way to ugh people @redheadwayfarer", "ananyabhattt": "Reading this post scares me, for my future along with other females is endangered, my right to freedom is in jeopardy.", "shubham_mohanty67": "@redheadwayfarer listen u r just diverting the mass towards wrong direction. .................Let me tell u that women empowerment is different and what you are showing here is different.............Let me tell u me as a Dad will never let my sperm to be a girl like u....................I will wish to have daughter like Kalpana Chawla and Kiran Bedi who truly display woman empowerment..........................Man body only have one major sexulal organ that is dick.......and no man with dignity would ever roam around showing or revealing his dick", "jugniology": "On point! I came across these double standards myself", "jahnvidhaka": "Girl you are inspiration ❤️❤️❤️👀", "sheetal169516": "😍 I've seen someone fighting fr love and hapiness all around fr d first time..bebe ure a dime!keep going ...💐", "theayushimathur": "This needs to go out there! This is absolutely on point! We need more of you 🙏", "menon_17": "Daaaamnnn! Bold and beaaauttiifffullll😘😍😍", "thehyderabadii": "Very thoughtful", "peterlinoy": "O thats sad...", "surendratotaram": "Nice bra and boobs..", "kishore_jaisinghani": "boys nange ghum jayein to sab sahi... R ladki bikini m ghumein to character less... Sab k sab dogle hai... Thank saloni madam on the earth we have some people like you. 🤘🙏😇🤗", "ratnishaverma": "Oh girl!....we want all the women and men to think like you❤️....salute you!!", "_danish_shan": "Wow lovely look", "humandamu7777": "U look like indian actress, his name is sana fatima", "dr_writer_gurpreet": "Always Agreed with you @redheadwayfarer ... keep it up ...my best wishes are always with you .... pay my sincere regards to your parents as well 🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻 @bindiia mam 🙏🏻🙏🏻❤️ Regards from Dr.Gurpreet Singh", "_soul.on.fleek_": "🙏", "bom__baee": "I truly agree and would like to support in any way possible society are WE ...we make society it's not a pre devloped ...we as an individual unit n its make society I don't believe that they claim to be so modern and rich they want hi-tech but there old rusted mind is same @redheadwayfarer", "roushanray99": "Nice madam", "raahhul_did": "@stage_pe_improv_maar_denge", "readmymindwithnamita": ",", "sunnygupta5909": "My favourite girl", "raghurajkunwar": "@redheadwayfarer .....It's a sort of discrimination...If you have to proscribe ...ban all ..I truly support you", "charmingly10": "Okay so now we really gonna live a society where even hashtags are monitored for ladies but not for men...WONDERFUL!", "borgaonkardivyesh": "1) freethenippel = yar if you want it to be free then raho na waise tag ki Kya jarurt hai.. 2) #thetatatop = wear hi kyu krna hai jb wear krne ka koi Matlab hi nhi and tag ka Kya Matlab uske bhi wear it and post it without tag 3) #sexygirls= yar ye to aise hua power bank ko code connect krke khudko charge krna.. I mean #sexygirls tag q lagana hai.. wo complement koi de to smjh me aye na.. samne wale ko bolne do ap hi khudko bologe Kya sexy 😂😂 khudki taarif 4) #hotgirls = Yar ladki hai temperature nhi Jo garam hogi... Chalo koi na dusre tag use kro #freethenipple =#nipplekiazadi , #thetatatop = #thebyebyetop , #sexygirls = #sundarkanya , #hotgirls = #angaarladki 😎😎😎... Now you can thank me", "_mehax_": "It's a constant fight for owning our own body", "_.jesssie._": "👏👏👏", "utkarshv13": "Why does feminism in India keep revolving around just the physical appearance of women?? The points you made are totally valid but don't you think influencers like you should expand the scope of 'gender equality' beyond women's body parts and sexuality? In our country, women are facing issues like female foeticide, child marriage, improper sanitation, lack of menstrual hygiene, poor or no education, sexual harassment, unequal pay and so on. Please dedicate at least 10% of your attention, thoughts and social media posts on these issues too! 🙏🏽", "avneetsinghbassicheema": "I am a huggeeee fan of you today for all your beautiful thoughts! @redheadwayfarer", "pari_3010": "These people cant just make everyone belive what they feel is right and feel that everyone should think the same, well that's not fair we get to choose what we believe in and some people can't just impose their thoughts on us, we can decide for ourselves for what is right and no one needs to come and tell us this that it is how it should work.", "silk.sp": "Very well written ❣️", "sabi_khan93": "Mjhe smjh nhi ati ye kon si freedom ki bt kr rhi hai nipples dikhana kahn ka freedom hai :/ naked hone se kon sa freedom milta hai isko ajeb soch hai iski :/ bht shoq hai naked hone ka ho jao but is ko women freedom ke liye use na kro asi freedom ksi orat ko nhi chye ... Iske ilwa iske ps kch hai nhi dikhane ke liye ajeb or jahn tk boys ki bt hai unko bhi psnd nhi kia jata jis trah ye nipple free ka hashtag use kr rhi hai is trah ke lrke bhi wse hi pics upload krna shoq smjhte hain tmez rkhne wla koi orat koi mard asa nhi krta", "ketanshah555": "U r always graceful and true say's.. Love ur opinion 👏🙌👏🙌", "sushb23": "I wish i could ever get the sense of writing like you do @redheadwayfarer always on point. Not saying anything out of the context. Hats off. @instagram doing a great job by blocking all these tags. No words👏", "texted_strips": "🔥🔥🔥", "_.chetana.chaudhury._": "❤️❤️ Inspirational, and just so mind touching caption. ❤️❤️", "shehzadalikhan3456": "😋😋😋", "ahanadutta24": "Hense I was wondering it's been long tym she hasn't post anything nasty or exposure 😂 nd here I got... showing ur cleavage boobs ass vagina ...is this feminism all abt?", "virtually_dumb": "EVERYBODY PLEASE READ THIS. AS LONG AS THE PORNOGRAPHY INDUSTRY THRIVES, WOMEN WILL NEVER BE RESPECTED FOR THEIR PRIVATE PARTS. NEVER. THAT IS THE MAIN CAUSE OF AROUSAL IN MEN WHEN THEY SEE BREASTS, NIPPLES AND VAGINAS. AS LONG AS WOMEN SHOW THEIR PARTS WITH A SEXUAL DESIRES, ALL WOMEN WILL BE CATEGORISED AS SLUTS OR SHAMELESS OR WHATEVER......", "beacon.___": "Its awstruck😍", "____.s8n.____": "Nobody asked for your opinion 😑🖕", "divyanshi_agarwal_": "Today I learned a totally different point of view and I just loved it 😍😍😍 thanks for being so inspirational ❤️❤️", "aakashhaistar": "Why don't u make ur own site n publish ur nudes no one will be there to stop u but u want controversy", "manaswi_gumpula": "@sushmithaarji get a load of this", "alankriti.singh13": "Still don't lose hope to change minds, we'll definitely do it.💙❤️", "chh.avii": "Great post!! 🙌", "kaushikguptaa": "iske pics to ache hote h bt caption parh ke mur kiba belg e korbo mon jaye😂 @himashreesahoo", "celinasen": "❤️", "marieu_elf": "Where can i get this bra? Help out please", "meghna_choudhury12": "👏", "tisha.scorpion": "Don’t spread hate!", "sharanaithal": "Well said.", "hrsumukh": "Fuckin cancerous pseudo feminists lol. Who the fuck can even think of equating women empowerment to getting naked?!", "insane_filters": "I admire you", "_h.0.e.s_m.a.d_": "Well... I'd say that women should indeed roam nude :v... That way, we'll save the data that we use up in watching porn :v", "paints_and_pixels": "I wish I could put in words how much has this move by Instagram disturbed me :(", "21_naksitimbadia": "Hi didi I really need your help regarding something can you please check your dms", "rajputrohit227": "👌", "___manzi___": "Home❤️⚡️🙌", "dpritze": "❤❤❤❤❤❤❤", "fierce.star": "On point! You are the VOICE! LITERALLY!🌼", "rathorprachi": "You nailed it ✌🏾💯 @redheadwayfarer more power to every woman out there 💛", "rajugowda.r": "WO oooooo super", "nutella.nutcase": "I think its more about respect .. we talk about India as “mother India”.. we never say father India 😄.. guys can fight for that .. we celebrate woman day .. so guys you can fight for that too.. what i mean is i understand that girls should be free to wear anything ..but i feel every place has its own rules .. like in dubai you cant go out without a man at nights, they wear burkha .. every place has some decorum to save people loving in it. even in India girls wear bikini and roam .. but you have to see where India is coming from.. i mean people here specially men coming from orthodox mentality who were used to the concept of girls wearing pallu n look from behind it .. are yet to cope up completely n change their thinking about woman. What you are talking about is absurd . Because this is only for the good of girls , i mean i have no objection to not wearing bra n showing nipples but i am sure its gonna make girls feel unsafe and rape cases will increase .. you need to see where you are coming from i feel . Its like fighting for 2 days paid leave a week at your work place where in your country half of the people don’t even have jobs . Anyways no hard feelings but that’s just my perception .. i don’t mind even if gov say females have right to show nipples , but in India i wont feel safe so wont do it .", "baloch_7": "Amazing, matching your bra and lipstick colour @redheadwayfarer", "dip_ikaa": "Heyyyy nice bra😻❤️", "paushalli": "You said it, girl. You're amazing.", "dr_thrive": "Sad reality that we have to live with", "mr.manojdas": "Wow amazing 👙👙💋💋👌👌👌", "thetatatop\nVerified": "Verified", "jr.mishra": "I like ur post. But n my first reaction was.... Oooooooo nice bra. I want one too.", "kenny_seb55": "Man stfu. U wanna show then go ahead. Don't say all these things just to cover up for ChristSake.", "parasjoshi3": "That's why we are lacking behind..@redheadwayfarer", "mukesh.gelot.1675": "Sexy pic😍😍", "2lit2quit.tm": "This guy who used to like me saw my pic on insta story where I was wearing a black singlet however I was cold so my nipples showed and he told me quote “I can’t be with a girl like you Cus now everyone online has seen your nipples” 😮😮🧐 trust me I was happy Cus now I knew how he thinks and I was out of there!", "ssbberry": "Iske paas itna time kaha se aata hai itna lamba likhne ka?", "yellowboxfdreams": "❤️❤️❤️❤️❤️", "khushbupanchall": "You’re on point.", "prernaakashyapkhatri": "Thank you for being our voice. Love and hugs! 💜", "srishtynine": "YOU NEED TO SEE MY DM", "rhutulaj": "🙌🙌🙌", "ayeshallthinkaboutit": "Whatever this pic sucks", "nehaaxyz": "❤️", "so.nu2082": "Excellent mind blowing", "orgasmbymassage": "Chunaw lar lo....accha likhti ho😂🤣😂🤣", "sagar_singh_007_007_": "Saturday #Extravaganza🔥❤️", "asliarpit2725": "@redheadwayfarer kaash uss raat tumhare daddy soo jate😌", "sunny_sharma0": "Respect 🤟++++++++", "aakashvashistha": "Love what you doing!!! thanks for inspiring many people like me and reminding us to do our part.", "__nikkk_._": "🙌🙌🙌❤️❤️", "aanjney08": "There are other ways to empower women, roaming around nude or fighting for free the Nipple movement won’t prove anything, but will be considered as extreme by some. Other ways could be encouraging women professionally, it’s no people like you who needs empowerment, it’s them who are from backward backgrounds and economically weak women, who have no freedom to even talk about working in their families. Free them first, they literally don’t want to have stuff like free the nipple or any thing that it related to body acceptance or normalcy in roaming around half naked. Work on the ground level if you want to, not many are at this stage where you are. Let us all consider ourselves privileged that we are at a stage in life that we are not dependent on anyone, and not take our freedom in a way that leads to widening the gender gap, as this would. Don’t get me wrong this is my point of view, I welcome your point of view for discussion and not debates. Awareness for breast related medical conditions are to kept as exceptions.", "mishpi": "@redheadwayfarer What a coincidence! It was only yesterday that I slide into your dm addressing something about that hashtag 'free the nipples' and today, I read this!", "_the._.shuvy._.way_": "@redheadwayfarer You're driving a change to a change in mindset in a society where a toxic patriarchy prevails. I really hope that you're damn successful in this conquest that you're fighting all alone. Let's just hope that the situation changes and changes for the good. More power to you each passing moment. You're the Wonder Woman 💪", "akshata_shah_": "Such a powerful writeup. Also, I loooovvveeedddd the bra ❤️ Much more power to you, qweennn", "swapnaanjali._": "@instagram Why though?", "datgrlwithbooks": "I read your captions and I know why I should not let my voice die❤️", "be_a_busybee": "Well this is really saddening?", "devanshimadaan": "More power to you!!", "fergmurillo": "You rule! I could not agree more... we still live in a society where the Victoria’s Angels is the deluded type of body that men desire and do not respect at all. And as su said #misogony and #patriarchy is still a myth not recognized by many many societies", "cryingdutchman": "Your posts should have Tl;drs", "subhashree_bal": "I don't understand why we are upto these free the nipple hashtag where we've real issues to tackle .where we have bigger issues like equality in education, in job platforms, in household chores to resolve but we are going after these silly Idea of free the nipple. What the kinda freedom we want through this! let us first give equal education, equal opportunity , equal wages. I'm tired of this nipple equality war.🙄", "chi.swaroop": "Good that instagram is taking action and blocking these kind of nonsense hashtags. I support them...", "obscurewight": "❤️❤️❤️❤️caption 🔥", "anarchic_ataraxy25s": "U are just so sexy 😍 people thought \"sexy\" in its literal meaning ..but actually what I meant is sexy thoughts,sexy words,sexy mindset,sexy post,sexy caption,sexy hashtags,sexy is the respect that you earn from us and its a sexy you @redheadwayfarer", "johri_sahil": "Yehhh Kya", "_mridu_": "@redheadwayfarer Seeing the hatred you and people who follow you and agree to your thoughts and opinions, i cannot agree to this post more. There is no way One or maybe few people can actually change the way the society thinks, functions and react to things. It’s sad to know this fact and live with it, knowing your efforts will never be able to change the way the society is. But the least we can do is to change the way we think and impart the same to our future generations.  More power to you. Keeping growing like you already are. ❤️", "keval_rabari_2910": "@redheadwayfarer #🔥🔥😗", "feminist123456.1": "you are not posting your view you are just same as politician who are making fight between men and women. if you really want to spread your nudity why dont you join porn industry you will get all freedom to post any kind of part of your body. those feminist who are supporting her will need to start watching porn with your family. this kind of profile should get reported because you are not creating awareness i have seen many actress profile which dont show nudity for publicity or neither they show any hate toward society still they are very much popular but just your negative mind showing your way of thinking towards each and every post.", "pearl.what.is.this.behaviour": "Who are the fuckinggg Instagram wale to reportt", "safi2273": "Amazing", "_arshiyayayay": "Its there now and its incredible", "indian566": "Beautiful😘", "larkspurrs": "I can hear the caption. 🔥 #power", "shrushhtii": "Lit lady 🔥 .. ALL HEARTS ♥️", "the_anonymous_boss_lady": "There’s a difference between equality and your vulgarity! Stop teaching wrong things to the younger generation for god’s sake!", "toxigrapher": "Absolutely right", "andysidhhpura": "🙌", "_crazy.hunk__": "Why are u always having problem with boys yr I really don't get.. @redheadwayfarer", "mayur.jain.bbm_53342330": "💋💋👙only one side😍", "vikram_s.saxena": "Kindly inbox me repirted item from you post", "istalker_23": "🙄🙄", "riptighosal": "❤️", "sak10170": "Hottie💕💕💕", "pratyushgp": "This is just ridiculous...if insta cannot understand this let us raise our voice towards Instagram... Such a shame", "__anujprajapati": "Sach khrai h ap", "_divya_jami_": "Its so sad that this is happening. Stop treating a woman's body like a sex toy. Its as normal as a man's body. @instagram why don't you block people posting nasty comments and giving rape threats instead. This only strengthens the bigots. Its a shame really.", "bolly_wood_hungam": "For the equality you have to show the whole tit, just like the guy in the post. Ese to aap peeche reh jaoge", "komalishq78": "🔥🔥🔥", "06baneetkaur": "I sent you a message about this as well. Thank you for posting! @redheadwayfarer", "s_h_ais_t_a": "Y you want to showoff? Uske bina mar jaogi kya?", "ankita3010": "@leonardperis man read up the comments ! They are crazy!", "payal_bathija": "Love you😤😤😤😤😤❤️❤️❤️", "pc_chaurasia": "@khandelwal_kusum", "verymysogynistic": "@lilly_comeback but boobs and ass are major sexual characteristics. If you say that it's okay to flash tits because it's used for just feeding babies, you should treat it just like your arm and be okay with people touching your tits too", "pulkitarora8": "What the ####", "sachinkhelukar": "I like you ❤️❤️", "mansichhabra_01": "Uffff couldn’t agree more🙌🏻", "col_touqeer_786": "Mmmmmm", "sonakshirawat65": "@redheadwayfarer Your words are amazing and so are you🔥🔥🔥", "sanjeenamal": "Woow", "poojat915": "@redheadwayfarer Bro, I am sorry, but Indians still have a long way to go on broadening their horizons and developing different perspectives. The victims (ladies) for whom you are struggling themselves don't understand that they are the victims and instead they're standing up against you. More than men, I think women, especially mothers and millennial ladies need to understand the msg, change their thought process first, inorder to change their family's", "shakink22": "More Power to you! 💪", "bertholdt8": "tum koi naukri wagerah karti ho ki nhi ...", "junahahahad": "You always speak and you speak with logic and thats so rare in our counrty right now @redheadwayfarer", "nsi.rumesa": "True as fuck.... our body is threat to these people who for our body crave at such an extent that they prefer prostitution or if not possible then rape and spread the word that a girls body should be hidden and it's impure to see such photos like that...what hypocrisy dude. Atleat now we need to open our minds to accept ourselves only. And grow up to remove all beeps out of our lives", "thechubbytwirler": "So are hashtags like #curvy #curvygirls ...for a brief period even #plussize was shadowbanned last year .", "__khushiiii.18__": "True as fuckkkkkk💯💯💯", "ii.intactsk1712.ii": "This is what we all really need to understand.. You're so strong and inspiring @redheadwayfarer 🙏 More power to you!💪👏👌❤", "rihan___hussain": "Ja simran ja jile apni zindgi 😂", "siddharth221080": "Love the colour of ur bra and ur lips 😘", "aladdin__________": "Don't worry Twitter allows you to show nipples 😂😂😂 I'm a Twitter user since 2011 trust me", "_sheeba._": "💯💯", "maanushirana": "Seems like need a hashtag to free the hashtag. @prernakhatri_ @shreya.leo", "shreyab24": "Instagram can block such hashtags, where as it cannot do the same with the accounts that post shitty comments and content. Those accounts seem to \"Not\" come under their so called \"Community Guidelines\".", "rickmxd": "My only concern is why do you write long notes...", "vishal_rathore_007": "So beautiful", "lavina_dingrani": "More power to you", "manyaarora695": "Man posting their pictures naked with #fitnessgoals do not trigger @instagram but women posting their pictures with #freethenipple violates the guidelines!🤷🏻🙄 oh cool!!😂👏🏻", "trusfrated_af": "Amazing❤️ 👏👏👏👏👏👏", "amiableabhilasha": "@redheadwayfarer I am not able to view the content, saying it has been reported", "sassyparantha": "This is why we need to free the goddamn nipple!", "sdsinghdhanjal98": "And the end the point is nanga ghumo (both boy or girl) if u want to get freedom... once a legend said Dress as such ....in which ur parents feel happy to see u", "sarah.fit.24": "@redheadwayfarer you are so amaze!!!! ❤️❤️🔥🔥 You go girl . You put every gals feeling into words Love you tooooo much 🥰🥰 #respect#feminism", "deepak_sharma701": "Fucking hot dear 🔥🔥🔥 @redheadwayfarer", "bansal.2.5": "Amazing 👏👏👏🙌", "nameis_surag": "You are some thing special it's not sentence to make you feel happy.each thing placed Instagram are so perfect.most of the people can't talk in a common platform like this.so keep going🤘🙌✌️", "shreyasvvaidya": "Attagirl! I have said this before n am saying it again, Instagram is just a social media platform, a reflection of our society. Should Instagram change its regressive stupid stand on the issue of female nipples, absolutely YES! It's just that as a society we need to change our attitude towards this issue, Instagram will definitely follow. And this has to begin at the level of every household, every family. As long as parents don't change their attitude towards raising kids equally, Instagram changing its policy would just not suffice. Stop telling ur daughters to cover up n not even batting an eyelid when ur sons, husbands, brothers are roaming around the house topless, regardless of whether they r in shape or not! Simple as that! @redheadwayfarer", "aditya__guntupalli": "If their policy troubles you so much dont cry just quit Instagram 😜", "ouusheen": "@navya_malik", "ramesh.v2509": "🔥🔥💓💓", "hortipriyanka26": "You are a mentally sick women... So annoying and irritating, all you want is to be nude and naked all the time, and also want society to do the same, same on you....", "yuktika.sinha123": "👍", "bubly_bubblegum": "Will talking and posting about this things always be a taboo? Its 2019. When will people use their brain? Even i posted some pics of me naked or wearing a bra just because i wanted to. I felt like posting them but i received really nasty comments even by girls.", "dramatic_lil_bitch": "Gawd! What's wrong with people? This internalised misogyny and patriarchy is sickening. The female body is not a threat. It's not a ticking bomb. When will society understand this? @instagram", "shreyapanthangi_": "🙏🙏🙏🙏 so accurate @redheadwayfarer", "venghatdilshad": "Hey Instagram and the world please let them show whatever they want if we think this is they called gender equality.... I support women empowerment and gender equality sister ,but most of your posts not about equality,it's about topless nipple boobs etc etc ... #genderequality #womenempowerment #respectwomen 👩‍⚖️👰👸🧝‍♂️🧝‍♀️💁‍♀️🙅‍♀️🤰🤱🙆‍♀️🙋‍♀️🤦‍♀️🤷‍♀️🙎‍♀️", "sunita.sutar90ss": "🖤🖤🖤🖤🖤love you the most beautiful soul ever I have come across 💯😘🌺🌺", "_mayank_aggarwal__": "SO good😍😍🔥🔥", "triyasha_": "THE VOICE, YES YOU ARE, LITERALLLYYYYY THE VOICE! ❤️", "the_17th_reason": "#girlontop🔥🔥", "aditya.khapre": "What I learned from this post - what feminists care about is what is what clothes people should wear in a photograph on social media. What is important is how much skin is to be shown to the world, not your intellect, not your skills, not your dedication. I see more feminists talking about skin than there are who talk about education and the stuff that actually matters. Just posting pictures and calling oneself brave isn't feminism. This will harm feminism in the long run.", "abduljabbar7234._saude": "😘", "gulshan_rai_leh": "Lovely Love wonderful", "_______shams_______": "Satta ko Satya pasand nahi aata, authority never appreciates the truth.👣", "neha_anand_raj": "Go..do some good work instead.", "beat.baba": "Fake. Its all written to make a place for yourself in this social jungle. Being nacked haven't doesn't proove freedom for either men or women. Lol. Also - just like #hotboys and #sexyboys, #hotgirls and #sexygirls too aren't banned! We all adore you for your work, please post sensible stuff 🙏", "ravishingtwinkle": "Exactly why are women related hastahs banned. I came across some sick Instagram and Facebook accounts where they share pics of Moms or stealthily clicked Pics of women from public places , when I reported them @instagram @facebook finds them nothing offensive.", "priyanka.vrma": "In solidarity with you!", "benzykumar": "We as a male society should understand the point of females our thinking should be brodend otherwise one day this society I'll deminished.", "mevaishalie": "Keep going @redheadwayfarer", "prettyoatsgirl": "On point! So many women shame other women with words like \"arey tum ladki ho\" when someone stands up for themselves. We need to educate ourselves. We need to be progressive. We need to change.", "sixpack_loading": "you can always go to certain beaches or attend #wnbr or festivals where its allowed to bare yourself. you can do movies or express on twitter where nudity is acceptable.", "gemini_illusion": "👏🏽❤️ My goodness.", "we_too_exist": "#anxiety even blocked.", "rupal_rudra": "You know it's not only females It's about stereotypes. A few days back I came across this man who is not very good looking, hairy body, curvy back, protruding tummy. He put up some pictures of him topless face covered with a pallu. There were some pictures of him sitting topless crying saying \"Mard bhi rote hai\" Believe it or not, Instagram banned it too! So even for males, Instagram is selective. Till you are fit and pleasing to eyes, you are good but if you don't fit the stereotypes,", "_lazy_sp": "♥️♥️", "mohanty_sristy": "@instagram I hope you read this!", "hritusagar1715": "@redheadwayfarer ma'am u don't need to change yourself for anyone be the way you are #The real you 😊😘", "__.neeh.__": "Huge Respect #feminism#respectwomen ❤️❤️❤️", "tanyachaturvedi_": "❤️", "misha.thakur": "Exactly I mean why can't people let genitals as any other body part , why they carry it in their heads, why can't they just look beyond genders and stereotypes and political myopias.", "kunikag7": "Simply astounding. You are a huge inspiration to me. Much love. More power to you. @redheadwayfarer ❣️❣️", "utkarshkarmwar45": "This girl is all determined to make girls roam nude.🤔This the age of equality of opportunity not the fight of dick boobs fuck shit loda lasan", "middlemarchmoon": "I feel this on all levels ugh and it's fuckin disturbing, disgusting. Patriarchy, toxic masculinity, internalized misogyny. Can't get over it anytime soon, can we? SICK. @instagram as a powerful platform it is ,should not even act on such reporting and rather use the agency to thin out silly stereotypes, than censoring stuff because a bunch goofballs think it's offensive.", "specsyzclickocurldiary": "So tru..! Great content for this post.must be shared👍", "_.jiyaaaaaa": "I follow you since “GIRL ON TOP” if you remember you did that show on MTV. And am so proud of myself that i follow you!", "ajmal_khan_azmi_": "wow 🔥🔥❤️❤️", "amaan_sid07": "Kon chutiya pura caption read kiya like karo😂", "divya.dbs": "Wowww...these hashtags are blocked but no the people who comment like idiots on women's posts.🙄", "viralmarathiofficial": "Fantastic 💣💣😍😍😍💯💯👍🏻💜💜😘😘💛💛💥💥💓😉😍🔥👌🏻😉💛👌🏻😉🔥💚💓🔥💚💓🔥💚💚💛💚💛💓💚💓💛💚💓💛💚💛💓💚💓💛💜💛💓💜💜💓💥👍🏻👍🏻💥💣💚💜💣💚💥💜💚😉💜💚💚💜💚💓💯💚💓💣💚💓💣💥💚🖤💚💥🖤💚💥🖤💥💚💣💚💣👍🏻💥💣💚💥💣👍🏻💥💣💥👍🏻😍💣💓👍🏻💣💜👍🏻💣💜💚💣💜💚💣💜💚💣💜💚💣💜💚💣💜💚🖤💚💜🖤💜💚🖤💜💚🖤💚💜🖤🔥💜🔥💜💣💜💚🖤💜💚💚💜🖤💜💚🖤💜💚🖤💜💚💣💜👍🏻💣💚💥💣💜💥👍🏻💣💜💣💚💥💣💚💜💣💥💚💣💥👍🏻💣💣👍🏻💥💥👍🏻💣💥💚💣💚💜💣💚💜💣💜💚💣💣💚🖤💚💣💜💚💣💚💜💚💜💚😉💚💜😉💚💜💜💚", "charushichugh": "Wow...arent u just an unconventional kickass inspiration..❤ truly dumbfounded by ur captions every single time..at the way you look at society♥", "harshaheda": "Your thoughts and mindset is so rare @redheadwayfarer Saloni you truely are an inspiration👌", "makeupbysupriaarora": "First thing to many in Creed - 'Bring it on' ! You help us become better & this kinda content I say is pure intellect and is all sense ! So aptly written @redheadwayfarer", "_rohit_chopra_06": "I got the point but all these hastsgs are working..🤐", "aasthadhasmana": "I'm crying this makes me so sad you are so right", "flipping_memories": "Everyone needs to hear this🔥", "isheeta_yadav": "On POINT! Hope I wish those men/women sitting in a room and deciding the rules on Instagram get to see this and understand 🙏", "aerpreetkaur_official": "Love love love💋💋💋 love uhh alott ... @redheadwayfarer ❤️", "im_y_o_g_i_": "😜", "syedafarhin17": "Patriarchy is just getting uglier than ever🙃", "m.b.adil": "Q krti ho behen ye sb?", "_shivanshishivhare": "It's still there. The hashtags. #freethenipple"}