{"jcbvalememe09": "@jcbvalememe follow kro plzz", "lakshayranka": "I don't even know how u guys come up with so negativity and memes just to shame and increase ur followers base....@redheadwayfarer i think this lady here is doing something which is really needed...women empowerment i believe....not like many people who jus take candles and march on the road after everything is done....jus to become a talking point and increasing ur followers by this means is so cheap.... She is doing a great job....people who have problem with her writing...let me say you that she writes whats going on with women.....so jo ladke hai woh apni behen ko support kardo (agar ho sake toh) aur ladkiyan jo inki uda rhi hai....tumhare toh kya kehne .....", "a_r_j_u_n_2": "Ohhhhhh dear you are gorgeous...... Plz post it again in coloured", "iamujjwalsethi": "Lol", "shivamsarohatfl": "Saif ali khan with long hair?", "ludoraja00": "If you don't even know what size clothes fit you than how can you suggest a good coffee you", "theaaliyashaikh": "You are beautiful ♥ and i appreciate you so much.", "dragothedevil": "People r jealous of yr Beauty....fuck them off...why wasting time nd beauty on fuck shits....Gorgeous ❤️😚😚", "harryshahrukh": "To all the people saying, \"she's asking for it\" or that \"she's showing too much skin\".. you weren't taught better. A woman is not a whore if she wants to show some skin, just like it is for guys. Like, you guys are sexualizing it. It wasn't meant to be that way. Learn to be better men and educate yo' damn selves. Also, great post!", "the.beachybitch": "I'm definitely going to try the hot to cold transition now. Another addition to my obsessive coffee habits! 😁", "nikisrani": "I really love the coffee collection you have mam..", "karnika_singh": "I love your dress😍", "itsmedeepikajha": "We Are Retreating to \"Early Men, Homo Sapiens\", Style Of Life 😂 Going Back our Genesis 😂😂😂😂😂😂", "dylenium": "Thanks to the heavens for everyone who's talking about the coffee and not about equality", "sajidsony__": "Ohhhh sponsored post !!", "ayeza.salman": "ek baar puri nangi hoker aja or jb tera bacha bara hoto usko dikhana", "vardan.sharma81": "Ahuuum...hummm 🤤you so beautiful and sexy really 😍😘", "syedsahaab": "Wear feminism as an armour dont wield it like a sword.", "yvishal8626": "lovely boobs 🔥🔥🔥", "heersinghaa": "Instagram should have a dislike option", "siddharth221080": "Its always good to see u open - i like u as a postmodernist - 😘😘", "vandu_sayings": "Or kuch to pata nahi. Ajkal kuch bhi boldo. Sabne ek word to seekh lia. \"Feminist hai ye\" 😐 jal rahi hai sabki ki ladkiyon ne actually bolna shuru kar dia hai. Ego hurt ho rahi hai. Nothing else.", "nitin_19t": "Amazing pics👌", "jbs.y": "@sparry_as_in_sparry coffee 😎", "ahsonpeeran": "Coffee - my fuel", "jeeva7976": "Hi so nice", "the.barefootangel": "I’m in love with you. Thank you.", "deshpande.sarvesh": "8th pic is relevant to the caption..", "__sinskari___": "Adrak ya masala chai😻 that's one thing I can't go without.", "vandan1505": "Nice publicity... Showing just enough skin to make this photo viral but not so much that people go gung ho that she's way out of line in posting such pics", "kanika.n04": "Beautiful", "rakeshsapra23": "After this pic I am blocked to like posts for a month", "jaysingh2918": "I just thank god when I wake up every morning and that fixes my morning grogginess 🌻", "teen8043": "i like your sweet 🔥🔥Ness❤️❤️😘😘", "iamrajivtandon": "❤️", "arvind.ramalingam": "❤️❤️💋💋💋💋💋😍😉😉😍😍❤️❤️", "miss_marwaa01": "🔥", "sonali.08": "👏🏻", "smiiontu": "😍", "ssinchana11": "I am not getting weather she is promoting her cleavage or coffee...", "deshwalhitesh": "What sort of girl is she🤦🏼.. Why she display her body which is not at all related to a subject she is posting", "philophobic_spirit": "Coffie🤤 Addicts😋.....@varsh1825", "sudhi_rerum": "Sexy hot", "kaushikvachheta": "Your looking fo ossmmm..😘😘", "aakil_madakiya": "💋", "chosen_on_": "Fuck the feminism bitches..", "subrata_kuri": "Nice", "the_westlifer": "Like when u see it🙌🙌😂😂😂", "solitary_writing": "You are my constant motivation and inspiration. I admire you a lot 💛💛💛", "tanisha_nh": "Same❤️☕", "lost.sillymoon": "You look like #YARA FROM GAMES OF THRONES. Theon grayson's brother. @redheadwayfarer", "palakmanglik": "One thing I do after I woke up has to be getting my motivation beaam out of ⛅ sun", "bellaluna_71": "The night before bed I literally look forward to my cup of goodness and my morning cigarette not the healthiest and totally counterproductive to the lifestyle I try my best to live but I'm a work in progress 😍 you go girl!! I do however have to have mine HOT!!😂", "khushboosinghtaank77": "My mother's face. Every morning.", "ravi19654": "Too much caffeine not good for teeth and sleep.Take care girl", "appyiie": "@deepucca she really loves to write, doesn't she? I think she can write essays on anything that has existence. Essay classes leni pdegi.", "rishbaba08": "Bat bat pe nange hona hi freedom h to mere dost glt ho tm!", "aakashhaistar": "It's coffee or something else u want show", "purishivu": "I drink coffee the same way!!", "melitamarkmartis95": "i love you", "saurabh9399": "👌👌👌", "vikas.jaiswal494": "😂🤣🤣😂", "kay._.vee": "Y’all stop reading it bothers you. In contrast to you all, I’m here thinking how well she managed to write so long about coffee! Lol", "blackrose3445": "You can do commercial of coffee by putting off that buttons too.. I do like your views on feminism but this post is not so cool @redheadwayfarer", "tattoo_klakaar": "Follow my page plz @tattoo_klakaar", "flamboyance9": "👌", "amaldude93": "Whatever u r trying to post and make people understand is now making them bored and Calling it posts #fakefeminism now. It is high time that u should start talking about other aspects of women empowerment too..cuz being a public figure who is having no. of followers can inspire and motivate people in all the other different manners including what u use to post each and everytime..", "malhotrar186": "😍💖", "farhanali7028": "🖕👌", "shailjamishralover": "lichadd", "r162k": "💖", "pankaj0013": "M nly fan off u r nose 👃...😍", "neelakshipandey": "Go back to sleep😴", "nitin220762": "👌", "mayur.jain.bbm_53342330": "Kadak💋👅🔥", "crazy_3v3": "@lavender.gardenia this reminded me of you.. ur habit of drinking the coffee over hours.. 🥰😍🤣", "aliamailk20": "Cuteness", "joblessjack5": "💟😍♥️🔥😘", "stylesavitri": "Looking gorgeous girl 😍", "dsrija": "Your dress is soo pretty❤️", "saumyaahahaha": "You're the Lorelai of people 😂💙", "thechubbytwirler": "Ohhhh ... I'm obsessed with their coffees ! Hazelnut is one of my faves... Will give the berry a try and I recommend trying their mint... it's sinful 😍😍😍😍", "tulipearl_": "Omg! I like my coffee just like you do.. hot at first and spend 1-2 hrs sipping on it as cold as it can get. So it makes it very easy for me to have a conversation with someone over coffee and hold onto it for hours. My friends never understood me. Lol.", "rayan_rockstar111": "i can see ur nipple 😁", "_norwester": "Ohmygod! I do that drinking one up over hours thing too! 😅", "camelia4_": "Your words are sharp.And i undrstand them.Without making a point you make a point", "smokingfemale": "Right👌", "limit_less_soul": "Lady love😍😘", "sushmitasarin": "Is this just an ad, or is it really that good?", "nealnomad": "As I religiously do, I went through your post and Suddenly wanted a cuppa Coffee ASAP ☕ Then I did something I don't usually do, I went on to read the comments because I thought let's see how people like their Coffee and apparently most people just like ignoring the whole point of this post and going on to just find reasons to somehow demean you for being a feminist and Your choice of clothes and just about anything they can think of at that point, and for the men all I can say is seeing you seeing so comfortable in the way you are challenges their manhood and for the women, I guess, because we've been conditioned for so long to believe that our cleavage is basically the measure of our Izzat (for the lack of a better word) , we've been conditioned to believe that we just can't get to comfortable with being ourselves or wearing what we want . It's my Damn Nipple man, I can show it to a bunch of you because I wanna show it or J can choose to cover it up because we've been thought it's the proper thing to do or just because that is the way I feel comfortable about my body. I can't believe that people want you to wear something more \"suitable\" to have a cup of coffee in your own House. Ugh!!! It's so fist clenchingly annoying to know that a man wouldn't be shamed for posting pictures of a cup of coffee hiding his stuff, but a fully dressed woman gets so many derrogatory comments. Such a long way to go, and still so much to Fight for. I can only salute your unbreakable spirit because some of these comments make me wanna pull my hair out and those of the people who've commented.", "so_much_sonal": "Great for you guys to keep looking at her clothing when she was talking about coffee :P. You see, if she was wearing a t-shirt, you'd pay attention to the coffee, but dare she wear something that is not normalised by societies standards, the debate would go to why did she have to cross the standards for coffee. You don't see that she is working for a world where even this is normalised by societies standards, where it wouldn't matter what the girl is wearing.", "khan.saheb0000": "👗 is ka matlb kya h", "shrutisharma8769": "Smoke sutta", "aatikaa7": "One cup for 2 hours and hazelnut ❤️", "meghna32._._": "Too much drama for coffee 🤣", "neetz07": "In pursuit: I just kept swiping right", "anikate_monish": "Pretty girl 💙💙", "_kiran_jot_kaur_": "I usually stalk ur Account, I see negative cmnts more than positive bt I believe they r jealous of where u r today... Cmnting upon Someone's character or dressing is very easy, who the hell has given uh the right to speak upon her dressing or whatsoever she wears... She also talks abt Sex, Vagina N Boobs, it's none of ur business N she talks abt it that means she is Open- minded... N BTW if uh don't lyk her then why r uh stalking his account N Cmnting a shit daily... This is her pErsOnL lyf, she can do whatever she wants... I don't really think ur Indian Society ever change their thinking... @redheadwayfarer SHE IS A TRUE FEMINIST WITH GOLDEN HEART😍", "rudraagarwal1986": "So beautiful", "guru17001": "Best__Astrologer__( pandit vivekanand sharma _Ji ..).{{_one_call_change_your_life_contact_numbar +91-89-555-457-42 ..}#_एक_फोन_पर_समस्या_कैसी_भी_हो_घर_बैठे_72_घण्टो_में_100%_समाधान } 🕉🕉 #_आपके_जीवन_में_ऐसी_समस्यायें_जैसे_आपके_बनते_हुए_कार्यो_मे_रुकावट_आना_बहुत_परिश्रम_करने_के_बाद_भी_सफ़लता_नही_मिलना_इंटरकास्ट_प्यार_में_रुकावट +91-89-555-457-42... आना, शादी विवाह मे रुकावट, पति पत्नी के रिश्ते मे अनबन होना, पढाई मे रुकावट, नौकरी में रुकावट, गृह क्लेश, नशा मुक्ति, टोने-टोटके का वहम, मनचाहा प्यार पाना, वीजा प्रॉब्लम, वशीकरण करना और तोड़ना, मांगलिक दोष, बीमारी में दवा न लगना, व्यापार मे नुकशान होना, विदेश जाने के योग नही बन रहे है, पारिवारिक समस्या जो आपके रास्ते मे आ रही है का 💯%पक्का समाधान | संपर्क करें🌲🌴 +91-89_555_457_42 love my love problem 🍃🌱 👉🏻Love marriage problem specialist \\\\ 👉🏻Love Problem Solution \\\\ 👉husband wife relationship problem solve \\\\ 👉vashikaran mantra for love\\\\ 👉Black magic specialist ..+91-89-555-457-42 👉Black Magic, inter caste👉 love marriage specialist (pandit vivekanand sharma {Vashikaran specialist} ) Call Now🎋☘ +91-89-555-457-42", "k_nift": "👅👅👅💦💦💦", "creative_chaos08": "Okay I follow you since a long now and I love love love your thinking about feminism and how you put them up here on instagram with your WORDS. But at times not really happy with the type of photos you show up. For this if you would have made a cup of coffee and rather showed us urself drinking it we would have believed u dat yes if she is saying this coffee must be great. But there was way I feel no need of showing up so much of skin jst for a coffee. It's like those commercials on tv which has a girl half naked jst to gain attention of the viewers for the 2 mins. I mean i m not against showing off body. But showing it off for a coffee is not relatable. That's my point. Still following u coz I still love the way u write on your post", "wydnike": "okay but like where’s this dress from ??", "gladbach_saint": "I can't function without THC", "riyaahooo": "❤️❤️", "aju_ashok": "🙅‍♀️🙅‍♀️", "isiddharthyadav": "Hot!", "we_too_exist": "💛", "deeparani804": "Waise coffee pr lecture dena tha ya apna button dikhana tha", "_farhaha": "I have a preference for tea. Your caption made me feel like maybe I'm making coffee wrong. How do you make it?", "riddhiiii01": "I do the same. It's a ritual for the soul.❤️", "v.vaibhav15": "Hotho se Garibo ki nargis fakhri lgti h😂😂😂...", "iamsyedamirali": "Well, my preference is tea ☕️ I’m sure everyone have their own rituals 😊😜", "charmingly10": "Why is this me dude WHY", "ss_creation_04": "💚", "ariftake": "nice pice😈😍❤️🔥", "harish_rathore_95": "Why you giving long lectures just for one coffe.kitna pakati ho", "bettingkingno1": "Hello bhaiyo kya hal hh sbka ..world cup k liye jin bhaiyo ko 5 top performance player dream11 ya kisi bhi app pr khelne walo k liye or bookies k pass ya online khelne walo k liye jaise ki lotus ya any one all news about which team winning or loss only 10000 per match ...jis bhi bhai ko chahiye msg kre"}