{"ketkisarange": "@she_vanii", "srinivasrockstone": "@grigytt This Bitch wants to spread her legs and wants others to do too... This might be interesting! 😍", "mahartshi_das": "Toi ata bohut dangor Kamur suali be kela", "akumar.rawal": "Just take urself to a best psychiatrist... U are sick.. and making sick to ur followers olso", "kumar_anoop21": "Bahan tu ek Book 📚 likh Moti si .... Aur please Instagram pe bakwas band kr for God sake 😎🙏🏻💐", "_aman_25_08": "Itna free time kiske paas hai yaar jo ye itne bade captions padhe 😂😂😂", "girl_inshiningarmour": "Caption😍", "prabhakar.r.9083": "🦋", "anotherangryfeminist_": "@kanchan_2903", "sham.gulbarga": "Lovely darling🔥🔥🔥🔥❤️❤️❤️ love you @redheadwayfarer", "seemranpatra": "Hey really lov u 😍😍😍😍.... u r lyk sooo amzing💜", "dssspj": "@redheadwayfarer I don't why would you like to be naked publicly and why would you want everyone to see that is yours. You are so beautiful and you seem happy too by your photographs , then why do you have this kind of attitude. If you want to be naked then be naked what is the need to show your body to the world. And also I am unable to understand that how is feminism related to it. In one of your beach photograph in Barcelona you are walking topless with a man by your side also walking topless, I just want to ask you to ask yourself that why are you so conscious about female rights of showing chest, men show chest but they don't bother to advertise it. You also do it and don't bother about the comments and if you do please make your profile private. Because in private profile there are only those people who you know and they will not post negative comments . The problem with you actors is that you want fans/followers also and you cannot tolerate negative comments. You will have to realize that everyone of your follower is not as broad minded as you are. You cannot have everything in the world either you have this or you have that.", "bnarzarynarzary": "Bute Full", "shubhammalhotrafl": "@prachibehrani the caption 😏 reminded me of you.", "cannedmybinoids": "I'm just in love with you mind and you giver those boosts of much needed self esteem, really thank you so much for existing and bring who you are & spreading the word thank you really", "sairanikhatimam": "Who is stopping her or anyone for that matter to not accept the flaws.. My only question to who thinks exposing.. Showing body parts or nudity how can that be liberation and being spirited?", "yvishal8626": "lovely panty 💋💋", "belugamamaa": "@unnati_gajjar follow her too", "nikaylyn.grace": "chod to saali raand ko aise hi position me...bhenchod naangi hoja..ab yahi bacha hai", "charles_darwin001": "People commenting \"I'm a feminist myself\" don't even know what feminist means", "aman_007akash": "main koi hater or sexist nai hoon but u need to understand sharing nudity is not feminism u r just a high class attention whore", "eric_m_93": "THIS. IS. EVERYTHING. thank you once again for putting so beautifully all the chaos I've had running through my mind. ❤️ No one does it better than you, Saloni ❤️", "kripalecious": "I am reading with my legs wide open and gloriously enjoying the breeze entering everywhere! 🙌🏻", "ssinchana11": "Who the fuck said to fold your legs... Wide your legs and get fucked by everyone... I think in your school you used not to wear panty so your teacher may said to fold your legs cause not to fucked by everyone... If you were listened in your school, you wouldn't have been became like this worst... Why you posted your pic by wearing panty, wide your legs open panty and show hole to everyone, I think now no one is their to say something to you", "pallav_k": "U should get it done indeed", "itzs_sairaj": "🔥🔥👌", "prettymummasays": "Best thing I read❤️", "shivakmathur": "🔥🔥🔥🔥🔥", "harshita_kaler_23": "Can uh please stop all this drama ....so called feminist 🤣🙌", "awkwardsouza": "@bodh.deb.29", "mycurvesgotglitter": "People’s hate is any day better than self hate ❤️", "arpita_here__": "Even I also feels the same but I didn't have the guts to write. Im very happy that I found a girl who even thinks the same like me. My soul sister you have become 💜💜", "tushernorth": "What a fucking hot ...", "beingankitsinghl": "🔥🔥🔥", "yadwindergill1981": "awesome", "sanjeenamal": "Beautiful", "atharv22sep": "Kaun hai aise log, kaha se aate hai? Inke pas itna time kaha se aata hai bakchodi ka", "farukazi": "Rocking it, girl 👍", "lotteholterman": "❤️", "yogesh_onmove": "Awesome", "mr_sahil_37": "Thank you for this post 🙏", "puj541": "@khushdarji10 @upasanabhatt94 @avani061288 read this...👌👌", "bosky.wadhwa": "@mohit_gupta_mg_", "aashnadogra": "I'm a bisexual, everyone knows this except for my immediate family. They think people from LGBTQ are psychologically ill or in their words \"mental\". And even though they don't know about my sexuality, I have never felt ashamed of being one because I know what I am, nothing they think or say will change that. The second you realise and accept your truth, there is absolutely nothing that the world can do to bring you down. Abso-fuckin-lutely nothing. I have had the privilege to know the people from my community and to be honest, acceptance is the key to moving forward. The hardest part of going through something is that we take too much time in accepting it. The second we accept it, the \"problem\" becomes null, it doesn't have power over you and that my friend, is freedom.", "meghaa_002": "Favourite♥️♥️♥️♥️", "shanya0000000": "I love you 💛", "silkywadhwa": "Absolute love! @bosky.wadhwa @shikha.01 @patelraina @dkk2512 @arjunjulka @sahilshah01 @sarudua @shiturbc @thisislsd", "voices.of.my.head": "Out of every other time, this is the first time that I've found her caption so wrong in so many ways", "wholesome_goofball": "💛💛🔥", "nijjersimi": "Madam Kadi te clothes paa lya kro", "_dilpreet09": "Motivating 👌🏼💯", "sonamagc": "I feel this आवारापन 😘😙", "_ravishankar25": "😍😍😍💕", "rishuwashere": "10000", "sidhnath_thakkar": "Damn this is so good. ❤️", "jaajaaabor": "Feminism in the true sense.", "radhika_56": "A brave girl only can scribble this very furiously.Fantastic. I love yeww❤👍", "ka.ran77901": "This post is as useless as my pubic hair💩", "iammaharnab": "🤣🤣🤣🤣🤣🤣", "tahniashabnum": "I love u so much for ur confidence and great personality 👌🏻👌🏻💋💋💋🙏❤️", "khushboo830": "@kosha.v @ashok_14", "iam_ash.1006": "Respect 🙌", "daredevil0036": "CHICKEN TANDOORI🐔", "_indusingh_": "I am honestly in love with this", "so.nu2082": "Excellent", "alpha_sden": "More power to you ❤️", "pragya_mis": "Preach!", "a.r.c.h.i.e_s": "❤️❤️❤️❤️❤️❤️", "k_nift": "👅👅💦💦", "tejalmohite": "God i love you so much!", "lifeluvershru": "Love, love, and more love, girlie! ✨💕", "mr_not_to_mess_with": "Feeling so relaxed...... Nothings more fun than relaxing in sun on awedmsome day 😎....caption💯", "shuttermakhi007": "Caption ♥️♥️💚💚💖💖", "_shuakhan_": "i love u so much...... your captions always make my days..... always so motivated.... always helps me to over come.... my self hate self pity.... thankx for being there 🤗🤗", "georgeleomartin": "U we're told to sit properly by ur parents... Don blame the society.... No body says anything to any one .. it's a free life u can live how ever u want..... Tats all... Njoy cheers", "irohinisingh": "On point.❤️", "puja_sinha_": "🙌🙌", "vanshika_.bhatt": "🔥", "crazy_lady.03": "You are amazing proud of you💝😍", "shirish1818": "Wow very funny sexy happy pic😘", "prajjwal_vaishy": "@redheadwayfarer not for the sake of saying I don't care, tell me something about wat u percept regarding their behavior or action in mental terms?", "not_your_sadharan_nari": "❤️", "_abiiee__01": "Lucifer nd his demons are waiting for \"7sins\" 👌❤️", "parvezmasum": "Wow 🔥🔥🔥", "rahul.thorve": "🔥🔥🔥🔥", "nehaa_88": "Natashanoel001🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗", "kunikag7": "This is so so amazing. And so true. 💕💕", "curiouscrayfish": "@sunitamaurya550 thought you should read this :-)", "mit_ilicious": "Beautiful post ... The best post yet ♥️👌🏻", "sanju_ca": "Love the zero inhibition thing Saloni... And agree totally with our fucked up upbringing... Love ur thoughts! Bold is so beautiful! 👌😍♥️♥️🌷", "officiallyuntoldvanity": "Hey saloni this is so good can we pls share this on our page too and tag you❤️", "netraapatil": "The language. The word. The main point of writing this whole big para. Is to Change old/cheap mentality. People just dont want to change their false illusions. Unless they are actually aware about that.. If this is her writing then Oh god its so beautiful and you are an INSPIRATION 💕", "sawaipratik": "\"people's hate is any day better than self hate\" yaas🙌👏", "baibhav_gogoi": "🔥", "manyu47": "💯👌👏👏👏✨ Bravo! A much required speech!", "sachinkhelukar": "I like you ❤️", "anushtha_jha": "You talk our hearts out❤️", "samprity99": "💜💜", "sanna.eeyy": "And then I said.... He is my dad, probably he is the only person I can wear anything I want to in front of. And when dad arrived home, and saw me like that. He slapped me as hard as he could. And that was the only time when he slapped me, after that I never tried anything much.. That I really wanted to!", "_.barennya._": "Post❤️🔥💯💯", "charmingly10": "It's scary when the people that you thought are on \"your side\" are the ones to talk about this. It's surprising when no one and I mean no one hesitates to make you feel ashamed of yourself. And the only way that it's possible for you to actually feel proud of yourself is when you don't let them decide what is \"good\" or \" bad\" for you.", "cmrann_": "❤❤", "ani10199": "Female version of aklilesh yadav.... 🧐", "certified_investment": "❤️❤️❤️❤️", "shilpaa_arya": "Your posts are so inspiring and so powerful 😘❤️", "shrikritipachaury": "Hey! Saloni ur post is awsm n ur caption is👏pls check out the recent post on @s_k_p_writes ❤️", "_sahilsaifi_": "🔥🔥🔥", "the_pinklover.b22": "So true❤️", "bunnygoyal96": "Mast tand choddi h", "sanchit.kash": "I just want people like u to appear from every nook and corner of India, multiply, and preach these things to every other extremist/pseudo preacher hiding down there. Go all Guns blazing.. more power to you!! Really liked this post and that “parlour wali didi” one.. 🙌✌️", "joblessjack5": "🌈💟😍😍🔥👙😘", "tannumakeovers": "🌹🌹🌹", "surendratotaram": "Very nice panty dear..", "mbhardwaj_1695": "❤️", "cosmosblender": "@sootymas for the next time you tell me to sit like a girl. 😋", "thesmalltownblogger": "This is so true. ♥️", "ruin___nil____black___": "Chut", "waytoomad_": "Ayy cutie 🔥😂", "das_kishorekumar": "U are a Real Threat in this Unreal World ❤️", "siddharth.roy": "Little bit closer plzz", "rajugowda.r": "Woooo wonderful photo❤️❤️😍😍😍💋💋", "filmi_billi": "I am love with the picture and the brilliant caption 💋", "gurrlleenn": "Beautiful💜💜", "prachee_kc": "Very powerful post anf last words are even more powerful... Others hate is much better than self hate...", "chhaviverma89": "\"People's hate is anyday better than self-hate\"... Really motivating!", "dressforyourselfofficial": "You are sooooo amazing!", "manveeenn": "WORD. 💛💛💛💛", "asliarpit2725": "you are one big PERVERT. Also you're spoiling the other girls by motivating in a wrong way. Sorry to say but girls like you is the reason sometimes for the harassments and eve teasing women go through. What a rubbish mentality of going topless in gyms. Ye koi randikhana hai??? You can post any shit just for publicity. You are a big stain on dignity of women. Shame on you...And yeah I suggest you to start doing porn films. It will not just give you employment but also fulfill your wish of spreading your legs", "_anu_hindustani": "@adeeba_nihal see🙄", "rafa_johnbecks": "😍😍😍😍😍😍", "chhavi_basra": "😭😭😭😭😭❤️❤️❤️", "mayur.jain.bbm_53342330": "Alone👅👅🔥💖", "_winged.eye_": "I love you ♥️ @redheadwayfarer", "gulzaar.13": "People ' s hate is any day better than self hate 👏👏!", "vicky_vr7": "Pink k niche pink🤣", "insanely_kyaut_": "This pic looks so comforting n cute n cozy .. idk why❤️", "minutiae._": "Beautifully captioned🧡", "parthvicipative": "Ayyy so sexy you look in this :))", "_.iamphoenix._": "caption👏👏👏 go girl😘😍", "dugarmeghna": "♥️", "somya1516": "Wow! Your words are so empowering.👏🏽", "oh.myy.goodness": "Wow♡", "s.a.l.o.n.i_09": "I loved it💯🙌💙💙@redheadwayfarer", "gourmet_in_you": "❤️❤️❤️", "penningforsolace": "love love love 💜", "lekha_holic": "Oh gods!!!🔥🔥 you'll be the inspiration😍 lots of love😘", "vishal_rathore_007": "So beautiful😻😻😻", "prettyoatsgirl": "❤️👏🏻🙌🏼🙌🏼", "neha.sarkar_": "❤️", "siddhi_chaudhari": "The caption is seriously everythinggggg! 🙌🏻", "the_potato_kid17": "Amazing words", "storiesstooker": "Such a nice capture😍", "neha_anand_raj": "Yeah like u snatched money from one of the boys sleeping with u in that \"waking up with whatever\" series p", "hotheadd95": "I just want humans to stay on earth✌️ others who have categorised themselves under these labels can go to other planet", "h.a.r.s.h.h.c.h.a.u.h.a.n": "This is so amazing...", "out_of_ur_reach___": "😍😍😍😍", "hussainmaksood": "😂😂", "sarahliampaynee": "I'm seriously overwhelmed by these words. I'm a feminist myself. And you've been my inspiration since day 1. My only question to the society is, Why are we asked to pretend things that we don't want, in front of the people. I mean if you're dead inside you are still asked to smile - so that no one can judge you through your pain? Seriously? If I'm raped and I'm asked to smile and ignore the egrosive behaviour that happened with me - I'll smash their faces and stand up for what happened ! This is a small world and everyone gets a payback . My request to everyone of you is - stress and depression helps you to be a better person and makes you wholesome ready for the next time. Don't let people question you about you choices ! Do what you want ! The way you want ! Thankyou !", "shivam.kumar.rai": "@i_shambhavi_i", "browncurrent": "Why don't you write a book? @redheadwayfarer", "aaryan222294": "Nice panties", "ahujadivya4": "🙌", "natashanoel001\nVerified": "Verified", "desai_snehal_": "😻😻😻", "_dark_sugar_": "Sooo amazing caption 😍👌#keepinspiring ❤", "ii.intactsk1712.ii": "There lies some real words in this caption♥👌👌", "koyel_mukherjee1995": "Cheap feminism in the wrap of nudity", "govindasingh03": "Superb", "sajonar_": "This is epic you are bosss i love u", "amazingly.awkward_": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "yoursenpaii666": "Oof", "shipra.kumar_": "👏👏👏", "jubilant_akku": "@anamikabajpae", "khyatiiiiiiiiiiii": "Sexists and moral policing entering the section in 3..2..1", "_winterains_": "absolutely queen ;) 💖", "roshanpatil99999": "#⃣#⃣#⃣🙈😽😻😎🤘✌😘😘😍💋😊💞👑🤗😍😗😙😚📸👙👙👙👙👙👙👙👙👙👙👙💄👑🕶👁👆👆👆👆👆👆👆👆👆👆👆👆👆👆🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕Ⓜ️♨️♨️♨️♨️🔝🔝🔝💯🔥🔥🔥💥💥💥♥️♥️♥️", "pranetisethi": "@richa_chamoli Read this..!!", "iartisharma": "Caption as always 🖤😘", "tanvigarg03": "This is suchh an inspiration for all the girls out their who are hating themselves and are not able to break the norms of this society. 👏🏻👏🏻👏🏻❤❤🍕", "pradeepjyani": "Happy like a kid...", "eshwarya_": "Yaaaaas girl 💜", "_jesssss_23": "💯💯♥️💯💯", "binzz.travelfeet": "I love you & your write ups @redheadwayfarer 👏👏👏 it really encourages me", "meg.hna_": "Perfectly put ❤️", "aanya.b_": "Inspiration ❤", "nishad_shalini_27": "💕💕💕💕", "nishthamanchanda": "❤️", "aatishhh_17": "Omg...Your writings are so awesome❤️❤️💕..And even you are the prettiest❤️..You are perfect combo of beauty with brains🙈❤️", "_theboldbrat_": "You've made my day Saloni 💞😍", "ahmed_fdiix": "👌🏼❤️👌🏼", "a_chimera_": "@redheadwayfarer the last line❤️❤️❤️❤️❤️❤️", "kausar20a": "Beautifully written ❤️", "she.conquers": "@rawatjimayank", "paleja.sam": "Oh gosh😍 Had these thoughts since childhood but never ever I could've or will be able to express or explain like you did🙌 No wonder only the @redheadwayfarer can do this damn thing very well🤟 You go girl💪😎", "aliamailk20": "😍", "shefali_chaudhary": "You are so so so sooooooooooo amazing girl! A rebel in true sense who questions the beliefs we all have been brought up with. I am sure it makes everyone comfortable, but to hell with it! Thanks for existing and sharing this wisdom! Love and power to you!", "milli_jhalli": "But isnt playing someone wrong?", "zo_kap_002": "these is so fucking amazing... i loved to spread legs in class wearing a skirt but front bench boys use to bend down and lookn at my hole. then as u said in College i had physical relationship with many class mates and rich guy who would sponsor my life style and also my professor so he could give me good marks and all was as u said amazing my life my Choice 😍", "sakshisaini712": "Damn true lines. More power to u!😍💖 my lady love @redheadwayfarer keep inspiring.😘", "deehegde_2.0": "Well said ❤", "lookadonut": "Write a book🗿", "priyankabhat__": "👌👌👌", "foodie_148": "🔥i love u @redheadwayfarer ..completely 🙌", "abhishek_jain16919": "Hot😍", "tripathi.priyanka": "Thank you for being real and inspiring to stay real! ❤️", "aadyamishra18": "I'm out of words for you my lady.", "thepandathingy": "So powerful❤️❤️❤️❤️❤️❤️❤️❤️", "stylesavitri": "Wow! This is so cool 👌👌", "rayshayray": "I love you, woman.", "drish_2802": "❤️❤️🙌🙌", "__ditiiiii__": "Those words literally touched my soul. 💙 Thanks for such an amazing secret :') Love ya gurl. 🙌", "the.bawsy.bele": "💖", "_dhruvi_28": "You're inspiration!!❤️❤️🙌", "sameeer.19": "Sometimes I like you and sometimes I don’t. I don’t know why", "_apoo29_": "Power girl!💕", "pooj0a": "Damn @redheadwayfarer i cannot trade this inspirational words with anything else in the world🔥🔥🔥🔥🔥", "poonamkunwar_10": "Damn girl you’re brave enough to expose the untold truths of society❤️lots of love from Mt.everest,nepal 🇳🇵 ❤️", "rrzioe": "Ahh... 💞 It's like we always have these in mind & when you've written it.. It just clicks..", "arsshiikhaann": "Heyyy inspiration❤", "aphrodite._69_": "You write really well.", "r.d.ambaliya": "👑👑", "cappucciinnoo": "Your caption ❤️", "chitra_guha": "The subject is great but the conclusion just stole my heart.", "bhookapakoda": "🔥🔥🔥🔥🔥🔥faaaaaakhhhh... Everyone needs to read this...@redheadwayfarer u r my inspiration, a massive powerhouse. Love you😘", "taranngg": "Why are you so good with words @redheadwayfarer? Every single time I read your words, I fall for you more and more. Your words are soul capturing. Thank you for writing and thank you for existing❤❤❤❤", "bookstackedbrowngirl": "You make me own my own sexuality by a little everyday. Thank you! ♥", "muskanthakkar": "You are amazing ♥️ and your words have such power that it makes me feel happy with what I am and not what others want me to💜", "smarikaaaaa": "You're an inspiration ... wish the world starts thinking like you💕❤", "_nidhi0808_": "Oh my gods! Honestly never seen a caption so relatable! Keep going girl, you're such an inspiration! I love youu ❤️🔥", "barkhadayal": "@redheadwayfarer no doubt why you're my inspiration love boss lady ❤️😻😻😻 I love you 💓💓💓", "tarandhillon02": "Oh girl 💕 you are an amazing writer . More power to every individual 🤗", "the_mountains_and_the_waves": "🔥", "zukhmani": "Wow💖💖", "nelvianelson": "🙌🙌👌", "diksha_basnet": "You are an inspiration ♥️", "_yukktiichawda": "❤️❤️❤️", "vanae.mars": "I love you 🙏👣", "iamnitis": "😍😍😍😍", "thodasaahilarious": "How is this little? This is so long. 😔", "jashneet_gill": "Well said❤️", "jainaliesha": "U r true inspiration 🙏", "akshaya.khushi": "💗why always these things are on point! You are a society changer.. As your posts have a great impact!", "sneha_udyavar": "Ma'am I don't think you have any idea of how big an inspiration you are to all those people who read your posts! People like you make this world a better place to live in. Wish u all the success and happiness 😊", "saivartika": "Beautiful💋", "mohitpawar___95": "🔥🔥🔥😘👍👌", "ashu2011.naughty": "😘", "vikrammehta934": "Relax"}