{"vikasravitp": "That's a \"science based\" lie. Fetus are already a human life in it's beginning. The step one. Your feminist ignorance can only do more damages to humanity which is already in pitiful situation due to the corporate poisoning and wars. People are dying in huge amount out there but do you care.. It's soon coming to India too.", "ujjwal3539": "Why u r always trying to a grow a feeling of so called feminism in Indians,do u think wearing half-naked clothes and expecting to be supported by the people for this bloody shit is a part of feminism..", "parth0891": "I too think that abortion should be allowed as after all it’s the woman’s decision but claiming that the foetus is a clump of cells is beyond ignorant, the badh that you call a clump of cells starts having a heartbeat at about 6 weeks and later on it also discovers the sense of touch, a woman undergoing abortion should be made aware of that, after all it is a creature, don’t spew out bs arguments to further your audience on the baby killing side because believe it or not, you are actually doing that. The debate on abortion is a very complicated one and has both moral and rational high grounds to it, please don’t insensitise your followers honey", "sneharabraham": "kids not being taken care of , doesn’t automatically pave a way for abortion madam ! These are 2 different issues ! What a dumb video", "wit_ness_08": "Woooowww💕", "mir_kanojia": "Fuckoff you moron", "trupti.tripathy": "And giving shitty lecture and spreading shit is none of your business.. getting nude is all your business and you mind that. You have to do is demanding for freedom of showing boobs,nipples, freedom of getting nude. Fuck your feminism 🖕", "devinakhandelwal": "@sonamsrangstot", "justin_james95": "It's none of our business but it's not a tattoo or some shit we are talking about. There is a human growing inside and its not you who decide if a human should live or die. Show me one orphan kid who is not grateful to be alive. If you don't want baby then don't have unprotected sex.", "khuz_.k": "Abortion is necessary for many women who mistakenly ..does a mistake and wants to improve her life..u @redheadwayfarer have no idea only of ur family and society would have been harsh..u would have known abortion is a woman's choice and none of your business its waht she wants", "sathwik_shetty": "I totally get what you are saying. Yes we still need to care about these orphan kids. But abortion is still a big deal. Abortion is like exploiting our own body. Scientifically what you said is right. But its still like having an boiled egg if left with it's mom would be someday a living being. You made abortion very light while it's important that we use protection than exploit our body and abort. We need to be responsible for it. Yes give fuck about underprivileged children and we should do something about it. But here I don't know I myself have been thinking I have done nothing that great. But I am proud that I enrolled some children to government school and they are in their degrees now. So it's time for all to give back to society. And not just talk.", "my_food_tales": "Oh I knew you would definitely come up with this. Well, anyways, I really doubt how much of science you know, but just for your knowledge, the discussion is about increasing the bar to 24-26 weeks ( not 4-6 weeks as you blurted) and secondly, a foetus of 24 weeks does have organs and body parts, and one more thing, a woman cannot claim the right to the child just coz it develops inside her body. Yeah she plays a very important role in a child's growth and maturation, but ABORTION isn't anyone's right, just the way it's not in our hands to decide when a sperm would fertilize the egg and when it won't. Nobody has the right to kill anyone and try to prove that it's right to do so.", "amrita.s19": "All these emotions are also felt by babies that are taken away from their mothers just so you can have a ham burger. You talk about feminism and you talk about women empowerment yet you’re such a slave of your taste buds that you won’t give up meat or dairy. If you want to stand up for female, then stand up for those in slaughterhouses as well.", "simritiiii65": "Listen I'm seriously not trolling you but stating a fact! You followed by many small teenagers n kids too...so before putting something out in public just thing of influence you are gonna have on them! I agree with your concept of having \"own body and own decision!\" You're absolutely correct there girl! But this statement is right just about you have sex! It's okay if you wanna have sex to one person two person, daily regularly ,somethings that's your choice! your pleasure ! Your decision! But when you abort a child its not only your body honny...specially when you had a choice of using a condom! Or any kind of protection! But your post lift up the idea of getting abortion is cool ! So please think before you speack! Yeah it's agree if someone due to some issue got pregnant by mistakes! Or anything that justify her action... But knowingly the girl who casually think I won't use a condom n later on will get pregnant n that's totaly okay as wrong! ( and trust me I'm not trolling you)", "therhoynar": "So you are opposing the Indian Constitution ? Really ?", "________simran________": "Some people trolling her in the comments make no sense to me🤦🏻‍♀️", "nagraj_nagraj24": "Enjoying sex.", "suvi.gya": "It's a couples business, you wouldn't understand the love part but it's ridiculous what the govt did there 🤦🏻‍♂️", "dwivedi_arti": "what you are saying it’s right help the children who is already in the world", "aspirepawan": "Aesi bakchodi BA wale hi karte hai. Use condom.", "_99sincerely_frh": "Every women has a right for abortion... u told that abortion doesn't make the child pain😑..first try to do some research and then u shout and say your opinion...usage of contraception is the best way than killing a baby....you will only come to know about this when it happens to your life..you told it's just an organ,(a baby of eight weeks) and u told that children in the orphanage are suffering pain....moreover, will u do an abortion and adopt an orphan child", "i_monaa__": "The baby is not to be considered before birth.. He/she is considered after birth on this planet , before its birth the baby is in mothers womb, so indirectly the decision is up to the mother, if she is not ready to be a mother, she need a rights to abortion... Why this is fucking illegal.. .. Body is mine, baby is mine, responsibility's are mine, decisions are mine, who d fuck are politicians to make this ban and illegal?", "pretty_akanshya_": "fuck up", "warriorhi5": "Abortion option was always accessible to women in majority of the cases. Then ye my choice ka bawasir ko faila rahi ho. My choice - I can have sex outside the marriage, I can do whatever shit I can. Yeh right of equality chal raha hai ya right of superiority? Tab ye feminism kahan jaata hai when you get extra liberty and favours at your workplace by your co workers, seniors. When a man gives you his seat on a bus or tube for that matter and what not. When you seek a man’s helping hand for a physical task, because unfortunately physically you’re not as strong as men. Nature has made both genders differently and equally attractive and responsible to each other. Respect it. Besides few society made customs against women in the past generations, women of today has every right or luxury. You desperately seek man’s touch at the peak of your periods. You still wanna have sex with the men you labelled ‘Pervert’ only based on your convenience. There’s a long list tho. My comment is not only in the context of abortion. Start respecting everyone as human and the world will be a better place.", "pintu_pin_2": "Its been a long time ago in Europe mentally like you get raped on the street.😢😮🔥", "redeemerinmee": "Get Life!", "ujjwal_kamboj99": "are o faminist ki maa tune kitne orphan baccho ko adopt kra hua hai ? itni fikr hai tuze to kuch kr na", "akash.13.amr": "Fuck off mother fucker", "himanshoogandhiofficial": "Chup Kar bewakoof aurat!!", "ankush__1919": "Can i fck u", "john_jacob_90": "I really wonder ., why and how people support all the crap that you speak or write in caption... They support your captions like it's the ONLY truth in the holiest book in Multi verse.... Do you INDIANS realize if ABORTION was legal in India, then many of this dumb Indian womans would have not been born or killed before birth for being a girl... I seriously don't understand the mentality of people, seperation every fuction debate/ problem into two gender's like seriously just because Man do not have uterus so cannot talk about Abortion ?? Next what a doctor is Male so cannot save females life ? ORPHANAGE hahaha let's not talk about it coz i personally know people who cannot have babies even if they want to and hapilly adopt children from orphanages.. HONESTLY wana be famous and have fan's i get it, its your choice, half of the people who support you are just hatched chicken egg don't even know what an woman go through during and after abortion nor do they know about the consequences of multiple abortion, INTERNET and WIKIPEDIA do not describe the pain and suffering.. Cannot even take the responsibility to use condom or Use contraceptive and you all are talking about BANNING ABORTION... p.s i know you will block me or delete my comment coz you know i am right and you have done it before !!! Adiós !!", "shreya101__": "Ur voice is just strong and bold as like u!!", "abidn2": "@redheadwayfarer Govnt should take a step on adoption not abortion ✅", "the_vague.shadow": "@nikitanainwal", "its_advaita06": "If you want to abort a baby why produce one😑 such a easy answer to abortion.. I mean why do u want to kill a life when you don't want one? Just use some protection gurl!!", "salgadofede": "👏🏼❤️", "flamboyance9": "Ur right 👏", "piyu3123": "Exactly. Banning abortion will only increase population, drgrade the quality of life for so many poor families and will also increase illegal abortions done by quacks", "urooj.fatimaa12": "💕🔥😍😍🌸", "november.yankee17": "Have you done something about it?", "lookgoodflgood": "Any one having all tears for the zygote , ever had any tears for orphans who are abused traumatised stigmatised and fight for food shelter clothing ??? Ever know what it is like to die 1000 days and live with mental illness trauma and get tortured !! It's always good to practise before preaching. Anyway zygote at times get destroyed in fertility clinics.", "amit_the_limitless_": "Especially to ALL THE MEN: Regardless of what you believe or don't believe you NEED to #remember that the fetus or the baby is #inside a human's #womb whom we call and know as WOMEN, so we gotta ask THEM what THEY #think and #feel about it before we make any judgement, actually we are nobody even to make the judgement, instead we need to take THEIR #permission by all means before making any #sound judgement or belief or whatever!", "ka.ran77901": "Didi but I also believe that people will start misusing this law if abortion is made legal then there can be problems as well.... Not all girls act responsibly Didi some of them will simply fuck around have unprotected sex and simply get the baby aborted I mean that girls might get irresponsible.... I think abortion is some cases should be banned like rape, minors", "the.wicked.queen": "What you say makes so much sense. Looking forward to see you speak on issues pertaining to India too!", "sairanikhatimam": "You earn crazy as a video blogger, can you share the statistics how much you spent on funding education on orphans?", "sahid_afriddi": "True.. 👍👍👍", "aj_pandey": "🙌🙌🙌", "reecharanjanrox": "Point👌👌", "pradeepjyani": "All you say is great, but do you consider life form in a fetus is substantially lower then a living human why there's a discrimination between life form and they all were made equal, no one have a right or business to ask women about her life and decision but it's her decision to end a life.", "_korobiii_": "👏👏👏👏💯", "young_mullah_1898_": "For y'all killing human being is fine but if someone kills an animal wow such a chaos is made", "anmol_mertiya": "♥️♥️♥️", "nirvana__24": "Preach 🙏❤️", "handeemyyyy": "Go and fuck yourself 🖕", "sketchingdreams786": "Totally disagree with you..", "kishlay_p_sinha": "Just get a condom bhruv... why kill the baby?! Its less problematic 🔥💎", "freakouted": "U r such an idiot, uneducated, pathetic person living on the face of earth.....@redheadwayfarer", "joblessjack5": "💟", "mausambaruah": "No need to go that far..use contraceptive instead of killing embryos, half grown babies, getting pain after abortion..👍👍👍", "brijesh_jhariya": "Katrina i am so exited for upcoming movie. BHARAT. All the best", "devenbora01": "Fuck off babe🖕", "raj_7121": "Completely agree with u @redheadwayfarer", "thesaint00017": "THINK OUT OF BOX:- Governments are doing it knowingly,they want everybody to focus on that topic instead of the main ones,they will do exactly what we people dont want to hear it,and which is not good morally,they want the fucking attention why you are giving them,they want you to protest focus all of your mind on it,it is ultimate a mind game.dont you see everybody are against but by govt. Choose to do it..they want the public to divert their attention ,WAKEUP,WAKEUP ,WAKEUP. DOnt do exactly what they want.THINK OUT OF BOX INSTEAD SEARCH OF THE THINGS THAT WHICH ARE THOSE THINGS THEY ARE TRYING TO DIVERT OUR ATTENTION TO", "taranjeet1805": "#truewords🙏🙏", "anish_maurya": "True", "karan.naudiyal": "OMG ...you're so American....👏👏👏", "shreyansh._.pandey": "I know you're spreading a good message but way you present is pretentious and crass", "nxndoz_": "People should just adopt kids from orphanages", "priya_choudhary98": "Always full of positivity 💕💕💕💕", "_selfobsesssedjiya_": "🙌🙌🙌🙌", "maahistic": "Whatever happened behind the walls with your desire was your personal choice.... but if it won't be impacted your health, so why are you have the fear to show your love( if it actually was) to the people. So please don't make this society demn emotional fool with orphan kids.... We all have sensible feeling for these kids. And if you have enough intellect than you should have used protection. Abortion is a great invention for whom who actually needs this, it's not to hide your previous sin...!!🙏🙏🙏", "rahulrajj173": "Kuch kam b kr sirf sirf baat marne se career nhi bne ga 😁😁", "anivesh_pandey": "🔥🔥🔥🔥🔥", "sushmi_ra": "Well, I completely agree with you about hypocrisy of the people's mind about \"saving a child\" when nobody wants to even adopt those orphans. But that doesn't make abortion a less of an evil act. I understand that some of those women have to abort a child because the situation calls for it but it's also another child's life and by aborting something which did not even get a chance to come to this world just because 'you' are not mature enough to handle a mess that you created in the first is just beyond 'not okay'. Yes, they don't have feelings but also they deserve a chance to come to this world and aborting a baby just because they cannot handle it is something you shouldn't be supporting.", "akindrew": "Even though I completely support that any decision about abortion is a women’s right and only she should have the power to decide what she wishes to do. So completely in agreement with that with @redheadwayfarer. . However with that said, i always question your intention on this topics purely for the reason that you post something and then post al the appreciation you get for raising the issue in your instagram stories. Why is that? Do you need a validation of your ideas or do you do that for publicity to prove a point that so many people praise you for saying what you say? Either ways it makes one wonder about your intention. . . There is an old saying “Self-praise is for losers. Be a winner. Stand for something. Always be humble.”", "mr_ashwin_2125": "And if uh can't take care of baby then why to kill them ..... just use condoms fuckers", "shreyaadass": "Totally agreed❤️", "p_raju_x": "Nice said... It's just wow", "charming_chats": "It was my decision not anyone.. all the doctors asked me first nd den my husband.. all they said was its ur body are u ready to cope up nd this baby mite not survive.. i cudnt think of anything how can i trouble someone who hasnt even been born nd let it go thru struggle nd see it die in the end. IT WAS MY DECISON. No one had any say no one double check me. So those bastards should just stay out of this.. they are noone to decide a woman future nd deir rights", "riya_shukla01": "You're love such a dope soul you inspires many people out there i love you my lady love keep this spirit throughout @redheadwayfarer", "syed_imtiyaz_9": "If your correct so why your mom not abortion. Why she is born you . Dont be spreads wrongly its india", "pujahjp2000": "👌👌👌👌👌👌🙌🙌🙌🙌", "anukshabharat": "🙌🙌🙌", "innocent.mustafa": "I’m not an expert to comment on this, but one thing I know is women should have the right to decide what happens or not to her body..", "pruthabokade": "agreed👌", "wholesummerness": "@redheadwayfarer Absolutely right. This is exactly how men try to control women and their bodies, their lives. For all these people who are so called concerned about that life, have even 1% of them taken care of any child from an orphanage? Or supported a young single mother to take care of her family? My body, my choice.", "hritusagar1715": "@redheadwayfarer that's the reason I Love you because your thinking 🙏 well said it's our decision what we want. 🖕 People nd their thinking 👊👊", "mamta_0310": "To the point 💯 yet all these comments from ppl among us ! I feel terribly Sad 😔", "thanvi_uthaiah": "You are 💯 right...nobody has got rights to decide individuals body, thts totally left to one individual who can or Can not be able to take care @redheadwayfarer", "brightside2032": "STFU!!! Did you hear of late term abortions? It's murder! Do it at your own cost ( not tax payers) & within a set time", "misti_kaju": "♥️", "swatilekha_roy": "Totally agree with you", "darran0312": "Disgrace to humanity!! Anyways, at the end of the day, it’s your opinion.", "boymorgan2k": "Aaaahhhh nice n tight 😘", "zarya5670": "Absolutely....", "a_4_ankit722": "🔥", "_justanotherwallflower_": "This is beyond frustrating. Where was this outrage when children were being shot to death in Parkland and Colorado? If people are so in it because of children and \"protecting life\" then why not formulate stricter gun laws instead of outright banning abortion? This has absolutely NOTHING to do with them caring about children but everything with men controlling the bodies of women.", "npc_185": "Killing babies is not okay #feminismiscancer #trump2020 #abortionismurder", "gehlott_": "Today's generation r becoming too oversmart . Specially girls .n promoting sex great ..", "prabhakarsinha42": "Love you 😘", "sucheta_shukla": "👏👏👏👏👏👏", "aashnadogra": "Fun Fact: An embryo is the size of a poppy seed at 4 weeks. An unwanted pregnancy will destroy a child and screw up their parents in more than one way. Imagine the horror of growing up in a place knowing that nobody wanted you. WORSE, What if they leave the \"baby\" at the door of an orphanage? Nobody thought about that, huh \"pro-lifers\"? Next, let's give this \"pro-life' a different angle, why don't all men of the state, get a vasectomy. It's not too much to ask, is it? I mean, yeah vasectomy is expensive and could be very harmful but so are birth control pills so, get over it. Or are you going to say that you won't get a vasectomy because of your dignity? Well, imagine carrying your rapist's baby. Pro-life is not actually pro if you can't do shit to protect the living people/organisms from getting doomed. Make strict laws against rapists, stronger laws against guns, care about the environment issues, THAT'S pro-life. Getting your business inside a woman's vagina/uterus is only spreading like an acid in the female community with a pH level higher than all of their vaginas, combined. If men can't stand with their masculinity and dignity on trial, why does everyone expect a woman to always be on trial for her sanctity? In short, \"No uterus No opinion\".", "trushali_2504": "@redheadwayfarer you're an inspiration!♥️", "____kimmmm____": "You are one of the reasons who I wanted to go for Gender and Women studies and in less than a month I will be in university studying \"Development\" with specialization in Gender & Livelihood. Thank you for being an inspiration. ♥️", "tonyleggio94": "I believe life happens at conception. I don’t believe the baby is somehow an appendage or an organ of a woman. It is independent of the woman. It is its own self.", "surendranjegatheesvaran": "abortion due to unwanted pregnancy is not something that can be judged by the state but know that there is cosmic karmic residue that needs to be resolved by the parents if they do go ahead with it [speaking from personal experience] because what could have been a full fledged human got prematurely booted out and has to find another womb to manifest but in some cases they linger on in the family causing some adverse problems......if people want to enjoy sexual intimacy without risking pregnancy they ought to make sure they're not doing it during 'fertile' periods or they can practice techniques to orgasm without releasing sperm while ejaculating during intercourse which are much better than resorting to artificial birth contraceptives that have long term hormonal and health disadvantages", "aisha.pervez": "People are concerned about the 'life' of that fetus inside a woman's body saying they are pro life. But don't give a damn about the 13 years old girl's life who will have to go through all the trauma and risk to raise a rapist's kid. They ain't pro life, they are just pro control.", "dank.eggrolls": "Hoes mad", "creativeanimation": "That’s wat this patriarch society has done to us, they don’t have anything else to do, don’t care about what their fellow men are doing but they are so free and exist like a godly figure who thinks that they are allowed to take decision and we as women are the ones who should obey them blindly and if we will not then our respected fellow women would come first And castigate us in every possible way! Remember we are the creaters, could have peed after having it(that day) u specially who are barking loud and coming up with there rules and social dictation wouldn’t have even having a life to live. Ohhhh poor u! Don’t dare to interfere in our personal choices , yes it is a choice because its our body! If it bothers u so much talk about ur body make rules for it and live proudly. (Vasectomy) debate about it. And please get a life! @redheadwayfarer agree ? #abortionisachoice", "shruti_karande": "This actually changed my mind", "sharanyamohanty": "💛", "iamwahajahmed": "Then why don’t you adopt a kid from an orphanage?", "vampire_vira_shree": "#indeed💯", "akhila._ganta": "So fucking true 🙌 This is some basic sense people need to have 🙏", "naresh_garlapati": "@redheadwayfarer because of people like you India lost traditions ,culture,festivals etc etc .", "vaishalii_": "@redheadwayfarer So beautifully said, how that accent tho. 😮🙊", "i_daddysangel": "Well said 😘😘", "stylesavitri": "I totally agree on this.", "_hakuna_matata_99_": "Why do people poke so much for each other's responsibilities than being more concerned about their duties towards the society ! Lots of love to you ! @redheadwayfarer", "its_khushi1010": "@kri.shaaa", "gauravbaronray": "U have exposed the hypocrisy in our society . People show so much concern about a child getting killed in abortion . But they don’t care about children who are orphans . Society seems to hv a problem with everything . Until marriage parents don’t want their kids to roam around with opposite sex friends . At time of marriage they only want opposite sex for marriage . Some our societies principles lack logic. We have pre conceived notion about every thing . For example I am a bhakt . Most of the girls think I don’t respect women . Even though is support women on every platform ...", "yashshree_1108": "You said exactly what I did. But people just don't want to understand this simple thing. A person I know literally said, \"ABORTION IS MURDER, and no one can change my mind on that.\" I mean it's unbelievable.", "nofukenway": "I’m pretty sure killing a fully grown baby inside the womb causes pain to the baby while children in foster home are still alive and lethal injections/ metal objects are not inserted into their bodies when they are no longer wanted. Nobody cares what you do with YOUR BODY - that’s why piercings, breast implants, cosmetic surgeries etc have no pushbacks from pro life people and is not a subject of controversy. Abortion involves another human being getting killed and that’s why it’s considered criminal, just like killing a 1 day old baby", "25_mansha": "💯", "a.raman.noodle": "Leaving kids without families resources and love is worse than murder if you ask me.", "_rajniiiiiiii_": "Well said 🙌👏", "harish_rathore_95": "Speak in Hindi sometimes ,afterall you are Indian.", "saheliiipaul": "Exactly❤️ people needs to be changed", "sahaja_khanal": "😍😍😍", "tiyasha__das": "Thats the pretty truth", "arif_alimd": "I guess.. you have to probably read more about the baby in the womb", "zo_kap_002": "yeahhhhhh 😍 im finally do an abortion thanks a lot to u saloni i was just waiting for ur reply and u did it. now i am sure i dont want these child whos inside me due to my negligence so wat i did a mistake and it was my choice to do that mistake. so wat if that child has my blood and flesh thats not my concern. abort and get over with it.more power to u girl 😍", "gourav_khandelwal__": "#bethechange💯", "merlinroy27": "You are inspiring ♥", "__minnie_19": "Ua jst amazing my true inspiration 🙈🔥 iluvuhdmossttttt", "tp_junaid": "❤️", "vshikaran_exprat_8888": "🌍🌍🌍(( ईधर-उधर न भटके_विशवाश है तो एक बार जरूर फोन करें)) @आपकी सभी समस्याओं का हल, guru jiजी से ले।@ 201% समाधान 📲📲📲 No...+91-9610054794 #मेरी_कोई_फ़ीस_ नही_है_जो_भी_श्रद्धा_से_देंगे _वो_ही_हमारी_दक्ष्णा_है# (((माँ काली की शक्तिः मेरी भक्ति))) (,.शक्तियो और साधना का मात्र एक स्थान #चमत्कार_देखें_☎☎☎one call +91-9610054794 ## घर_बैठे_24घंटो_में_101_ %_#गरंटीड_उपाय #.... .. _ specialist - -------] (( #स्पेसलिस्ट_प्र ेमी_वशीकरण ))(मनचाहा प्यार ) (काम-कारोबार) ( पति - पत्नी में अनबन)\" समस्या है तो समाधान भी है \" #all_problems_solution specilist💔💔💔 Solution_with_in_24 _hour chat on whatsup and call now 📲+91-9610054794", "salonishipra": "yeahhh di ap sahi h!!", "khushi_aayesha_shaikh": "🙌😍"}