{"abhilasha.vashishth": "It is never too late to leave the claustrophobic spaces run out breathe deep.. there is dusk and then there is dawn again.. life is fair because it is unfair to all.. get up be a fighter not a victim", "appyiie": "I was feeling this way since the time my woke up. I don't even feel like waking up nowadays. I can't sleep well too. There's a void in my life and a pit in my stomach. It just feels like there's no end to this feeling, like nothing ever is going to be right for me. I want to let people know, sometimes I do and they say you stay strong, you're not this, but I'm this too, and it feels everything is falling apart. I want out of this desperately but all I see is dark. The word hope is fading fast, and I don't know what to do anymore so I'm just going to go with his feeling waiting to feel better. @deepucca I'm tagging you because you've been really supportive but still I want you to know that I feel I'm drowning.", "niharika.hossain": "❤️ u r love❤️", "thicccwasabiii": "That's exactly what im feeling lately. It's more like im in a cave or some shit idk how i ended up being here but it's so cold and dark, and it's freaking me out. I want to escape but i can't even move, more like my body stopped working and i've no more efficiency in me to get myself out of this i guess lmao so much negativity and anxiety attacks. Can't even see that glimmer of light at the end of the cave im stuck in my own goddamn thoughts. Aah nvm that cos im \"not alone\" maybe thank you @redheadwayfarer for giving me the space where i can at least try to explain what i feel also you're amazing and ily (no homo :3) . (I really wanted to say this depressing lines anonymously so that people won't judge me but.. XD)", "yashikabedii": "❤", "kanishkabhatnagar": "Relatable. I too felt the same yesterday. Feels like I'm touching the dead end. And there is no looking back.", "gupta.aishwarya": "Hi Saloni, You have always inspired me in some or the other way. I love to read what you write, I love the way you express your feelings, I feel light when I read them. Thank you for all that, and know this you are not alone here in the fight for anything real. Loads of love, Your fan.", "snowvia_d_chillo": "Feels everyday 😔", "anette.varghese": "I eat stress everyday", "puja_sinha_": "You spoke my heart out 😢", "i_am_abhi.saini": "❤️ 🙌", "prattyandfood": "This is weird. A year ago, I sat under my dad's desk and cried my eyes out for 2 hours before I could muster up the courage to go tell him I need therapy. Everytime I could gather an ounce of courage, is breakdown again. @josephs93 gave me the right amount of nudge over WhatsApp texts, to go ahead. And Juju I'll always be grateful to you for that day, you're my light of hope, I love you ♥️♥️♥️", "introvert.xx": "@aftermath023 this will pass I promise and you'll see days of only happiness, ily", "sakshi.sinha": "This is me totally me every single day of the last week", "okurrrrrrr.r": "It's like sometimes you wake up and the whole universe is dragging you down...that too for no reason at all...and this horrible feeling of being alone and deep down knowing that you got no one by your side makes it worst...power to all of you suffering out there silently", "parmarbhavika_29": "I am also very very sad and very alone no upset and feel as if things never going to change ....feelibg hurts and makes me mad alot and each day it's just affecting more and more", "perceptivefairy": "@redheadwayfarer Yes the feeling hits you and you want to box yourself up or hide away from the world.", "_just.kush_": "You're beautiful.", "sangrey_3815": "Life will get easier😍❤️", "_ladyraga_": "Got dragged back to this today after all these months.", "priyanka96chauhan": "Thank you for this post @redheadwayfarer ☺ much needed❤", "kdeepanshi": "Better days are coming your way.🖤🌻", "goelambika_official": "😢😰", "_oh.prediction_": "Anyone reading this post or my comment trust me this too will pass! However big the depression may feel right now just know that positivity will definitely outweigh it and it's all going to get better. You'll smile. You'll live the flowery life with all the happiness you want. :-) 🌸", "aabhadoshi": "Completely relatable right now...😥", "heyitsme5179": "Well i can totally feel this. I am always there for everyone. Whenever my loved ones call for help i am always there for them but still i am never someone's first priority. I am not even my family's first priority what should i say about others. I am tired of being rejected and ignored and i don't know. I just want to be someone's first priority for once. People talk to me because they have no one else to talk to and the moment they get someone they just stop talking to me the same way. I have questioned my existence earlier and here i am again doing the same thing . i know i dont want to. But still. I want to feel loved. I am tired of my life. Why don't i deserve love? Why am i the only one listening to my parents fighting in my family. I dont even remember what i have written so far. I have felt this before and it was hard for me to overcome this feeling and here i am again. I know people say good time will come. Its been many years and i still have no one. I just can't stay happy and motivated all the time. It's hard you know.", "i_am_thedoc": "This too shall pass..", "its_ankuuuuu": "Yesterday was the same day I couldn’t even move an inch and didn’t use the phone too.. but all of them who were riding the same roller coaster it’s okay to feel sad and being numb this is gonna pass life is much more than just being hooked upon some bad times you know the deeper the sadness the more happiness bounce back I hope y’ll feel better soon and life gets less dramatic.. love and hugs❤❤", "s.u.d.i.p.t.a": "Thank you for writing this. For the first time I felt that I am not alone. ❤️ @redheadwayfarer", "nycslk": "It means so much that you share the up and down and good and bad and happy and sad. Sometimes social media builds people’s expectations that life is perfect for other people. This makes them depressed as they don’t recognize the 3 dimensions of people’s lives. They see “celebrities” traveling and partying and “having it all” and feel less than. You have a true artists heart and soul and the level of sharing you give is uplifting. Only when you have had days or times when the black cloud lowers can you understand what that feels like and only then can you empathize with what others are going through. In the states we have minute clinics and emergency rooms for quick medical access but trying to find someone to talk about your inner health is daunting and expensive and not easily accessible. Thank you for sharing. ❤️", "elixir_of_charm": "There are noises of vehicles.. encircled with people... Still I feel the hollowness... It happens almost every day.. you won't believe but this 18 years girl has no friends in reality.. it's painful.. nd it's more painful when it's taken so casually..", "randomlyrafia": "Hope you feel better ❤✌", "ishhxh": "Is it too awful, that I feel like I wrote your caption? It's like, a 100% relatable. 💯", "himanshirustagiii": "@varishtinarula", "chikoo_16": "Miseries never end, it just finds company to feel more miserable. It's like quick sand, the more you try to get out of it the more you go deeper. The very thought that \" i want to be happy\" is a depressing statement. But human will is powerful and it has the ability to make a person whoever they want to be, it's just that not everyone is blessed with that ability. There you need the support of others but people dont have that kind of patience to wait for the person to come out of their zone. My only request to people is to not abandon people even if they are pushing you away, their sadness is not what they willing indulge into. Be there for them. They want you to be there even in their denial. Dont say that \"we left because you asked us to leave\". No. You're giving them more reasons to believe that you aren't gonna be there in the hour of need. Be more present towards the feelings of your dear ones. Saying from experience.", "__miss.fabulous__": "Sadly this is how I have been feeling for a while now. But as you said I’m hoping this too shall pass.", "sashayachu": "Thanks for this :')", "poojashuklapoojashukla": "Who click the picture 😮", "_.doppleganger._": "@redheadwayfarer you know , as i was scrolling through the comments i noticed that the usernames all belong to girls . Although it feels good to know that these girls are expressing themselves i somehow felt bad for the guys. In most homes guys are brought up as though they HAVE TO be tough and crying or showing any sign of weakness as a matter of fact isn't good . That they have to be manly and not behave like a 'girl' . I don't know how has this misconception come to be and why is it still continued .", "mamta_richa": "I consulted a counselor for the first time yesterday and it gave me so much courage that \"yes maybe someday I'm gonna be fine\"", "mrs_rinkal_goswami": "Who clicked this picture btw?", "saurav.rana_": "she-plese click my photo but in a #pose of #alone 🤔👎", "blurred.ramblings": "This certainly will pass. Stay strong. 💕✨♀️"}