{"farm_foody": "Buy a good vibrator men are not sexual object", "charyadee": "I wish we could discuss abuse, atrocities, pleasure, biology, sexuality, psychology and above all else, respect for another human - ones form, rights and the vessel, the body without associating it with 'dirty' 'obscene' 'disrespecful' etc in our minds. Probably just like how cricket is discussed.", "sathwik_shetty": "@redheadwayfarer yes we need to ask what works and what doesn't. Everyone women have their own soft spots it's not game to find that spot. It's to talk about it and it's to make them feel better. Like what is sex without orgasms? And we men also need to understand it's not about how long the sex last or how big your thing is. It's basically the head , we need to comfort women. Not keep them under pressure its just about Make it a mutual thing. In most cases women orgasms with mastrubation more than sex . Have we ever thought about it? It's just about what she wants and not what you have been taught all these years . Every women is different , every women is beautiful.", "vaidehi.0": "Good job ma'am👌", "__.prxgya.__": "Seeing so many comments and trying to understand everyone's point of view all I can say in brief is that: there are people who are wondering why saloni talks so much about nudity, sex and \"hawas\" as some are saying. IDK if she wants to be \"popular\" and gain money but what she's talking about is also important. There have not been many people (at least those that I have seen) talk about these so freely. And it's not only about women if that's what you're wondering. It's about both the genders. Women are mentioned specifically cause usually men can at least talk about it in some way and women usually don't. And this isn't forcing anyone to be free about your body and talk about this. All it's saying is that it's fine. Fine to want pleasure, fine to talk about your problems, and fine to talk about your body. I tell my guy friends to tell me about their morning wood, masturbation freely and not feel ashamed. I know about it and I'm not gonna judge. And honestly a person can't cover all aspects of a problem, because a million more come up. If she's targeting it about being free and open about our bodies others are talking about education, sanitary pads etc. Every aspect is important and those who have an opinion not so much in favor of it you're free to express just don't spread hate. And those trying to make them understand please don't get too aggressive otherwise we're not treating them equal. Well anyways. The point is what she's talking about ain't pointless. Thank you for reading so far if you did and constructive criticism and opinions are welcome", "lakshyagaur17": "I think men don't know how to do it or how to provide the pleasure to women during intercourse or sex . I think one must know and should know possibly. It should not be just spreading legs, laying on each other it is an art that one must explore. As per my knowledge an average time that women requires to reach that stage is 15 to 20 mins . (AND ALSO READ THE ARTICLE OF DR. NICOLE PRAUSE TO KNOW BETTER). Im waiting for my experience.... @redheadwayfarer", "the_ad_venturer": "Niceeeeee!", "0hungryalways": "Forget orgasms fix your nose first asap..", "abishek3933": "Yellow teeth", "shilpa.verma.39": "Sex, orgasm, showing nipples ass is not feminism.. Talk about real feminism.. There is so much to talk about feminism like right to vote, to hold public office, to work to earn fair wages or equal pay to own property, to receive education, to enter contracts, to have equal rights within marriage and to have maternity leave. Feminists have also worked to ensure access to legal abortions and social integeration, and to protect women and girls from rape, sexual harassment, and domestic violence.", "beingakshit": "Visited your Instagram for the first time and for the last time. Instagram models (or wannabe) are all so dumb. God. Wish wannable influencers like you would be smart enough. Sad. Seems like all the problems in the world are there for just women. Sad to see people influenced by you. You should follow people who achieved something in life, not ( A traveller ).", "nawabzadasahi": "Very smart 💋💋💋💋💋🌹🌹❤️👌👌", "theayushimathur": "Oh thank god someone finally spoke about this! I have so many friends come to me and express that they've never experienced an orgasm and it is jarring that the stats are that high! But don't you think it'd because we don't communicate well? When will we all get the fact that it's equally important for both partners to orgasm. Otherwise what's the point?", "khuz_.k": "I agree", "ludoraja00": "All these women are horny as fuckkkkk", "sssssanamm": "Annnnd the comments begin.....because we will watch movies with sexual content and 99% of web series or movies are all sexual but we won't talk how sex is equally a woman's desire just as a man. Because we are oh so cultural and culture tells us that men need to be satisfied. That's just it. It's nothing to do with feminism you boneheads. It's called a basic human need. Look it up. Saloni, I commend you for sharing this and I am not big on modern feminism. I am just a human activist. So yeah you all teying ro be smart need to stop being hypocritical.", "sassy.aak": "@minnie_nandam", "kunwar_rks71": "U just need to go carrebbean country 😂😂", "ruin___nil____black___": "Fuck me and you'll know what an orgasm is. With all due respect.", "shihab_mosco_": "O... 70% okk... can you explain y they don't hav...??? If they are loving their partner surely they vil satisfy with the play.... and as your request we men give follow African cultures and foods to gain more stamina to satisfy themm #happy @redheadwayfarer 🙌🙌", "art_of_anush": "Luckily I met a sex mentor and a loving friend in my early young days, who is gay and understood women and such crucial issues. He taught me everything right from the vaginal structure to some amazing techniques to make women orgasm. I am proud to say that I have had the pleasure of helping many women since then.", "neha.sarkar_": "❤️", "hotheadd95": "😂", "tazeen141": "Inspiration.... Lolllllllllllllllllll", "emilano_de_may": "Im man and you are some how change my perceptions towords women", "uroojahmed71": "Tell me than wat we have to do?@redheadwayfarer i think we have to take classes about it...", "pratttp60": "#feminisimiscancer well said.", "m_bilalvd12": "Agree", "himalidave": "*menstruation", "herenow_poet": "Wow. How come people miss the crux of the post and discuss side angle. Everybody need to have more orgasm to clarify their thought process.😄 @redheadwayfarer u keep writing and killing fucking hidden dragon. I am with you.", "khushboosinghtaank77": "I personally never had sex so I don't know what orgasm is or feels like. But from a point of science, it's only possible for women to orgasm if their partners make them equal during the intercourse. This means the women feel free to feel everything without being judged by their partners later as how they know this trick or that. Their primal goddess is not forbidden. She feels safe and secure to just loose the knots and fly away.", "sway_tha11": "I'm glad about this. Thanks 🙌❤️", "nikki_1901": "You are doing a great job 👌. Many people will try to pull your leg down and try to stop your voice because they are becoming insecure that what will happen if the women's starts to speak. But you should never listen to them and also don't keep there words in your mind. They don't understand that you are spreading wonderful message to every boy and girl out there that they can be what they want to be. And they are free to speak about what they like and what not there are no limitations based on the gender barrier. I salute you for creating an awareness and taking this step🙏. I wish that God will bless you and help you in each nd every phase of your life. All the best and keep doing this work👌.", "bhaktiharsh.18": "Love ur voice deeply ❤", "_anuska_choudhury_": "Atlast someone said it!🙃", "ghosh_sanjana": "@redheadwayfarer : Agreed with each and every point of yours so much! When the word \"sex\" comes, it is indeed about love and lust both. The ones who are saying being a girl/lady, \"sex hi sab kuch nhi hota\", \"itni hawass hum mein nhi hai..\"-WHY? Sex is not just the main agenda of a relationship, but it is one of the important factors too. Just like a guy gets satisfied, a girl should be too. She is not here to please the guy, AND VICE VERSA. If girls are so ashamed to talk about it, then really can't blame the guy who sleeps totally satisfied and doesn't care. Why so much toxicity and negativity in the comments section? That too, from the girls as well? What's the fuss about discussing about sex. She isn't describing HOW TO HAVE SEX guys! True that, feminism doesn't ONLY means sexual desires of women and talking about being comfortable in their own skin, but topics like this, are ALSO one of the parts of feminism, and needs to be talked. Why are some of the people making it a taboo? We belong to that nation where we top in the population criteria (cheers, lol), then why to feel so much ashamed? And what's so wrong in talking against body-shaming and promoting about \"FREE THE NIPPLE\"? Guys, who are so much against \"free the nipple\", kabhi poora din, bra pehenke dekho. Then you'll get to know if that's suffocating you or not. Agreed that, men do face a lot too, like false rape accusations, men also become the victim of domestic violences at times, they also face all kinds of harassments in their field of profession. Talk about it! Who is asking you not to? Why are you under that pressure like, if you talk about it, people won't find you \"MAN ENOUGH\"? Why do you care about the taunts? At least we don't care, that's why we stand up and speak for it! 😀 Peace out! ☮️", "yashfreddie": "Ye Kya bavaseer fela rahi he!! Koi modiji ko bulao", "invinciblle0411": "Where to talk and what’s the solution! 🙄😕", "_hulk_rik": "Alright then just the truth now! Do u get orgasm everytime when u r with ur partner? @redheadwayfarer", "john_jacob_90": "I feel you're pain and frustration... Sad that your bf is not enought or sucessfull ... Hope you can choose a better one next time .. \" People do not talk about things they have or get, they talk about what they don't get or have. \" Basic human greed... ✌🏻✌🏻✌🏻", "thetanush_bhatt": "Ae chutiya aurat", "_miss_saxena__": "You are such an honest and brave person.. Cause many women's are out there who can't even talk about their intimacy with their boyfriends or husbands. They feel that it should not be told.. But I wish you will be able to open their eyes.. Love you... Keep inspiring people😘😘😘😘", "mehul115": "@redheadwayfarer I so agree with your thoughts. The society we live in is full of hypocrisy.", "bloodthought": "Female orgasm is as much of a truth as is male orgasm! Most of the men and a few women who are jumping and having a hard time digesting this content are either in denial or don't understand the importance of owning one's body and especially if that is of the female gender. Deep rooted patriarchy and underlying influence of patriarchal systems is so ingrained in family values that a women's right to equality has now been made into a drawing room discussion or has been made into a joke. Sexual intimacy and relationships are crucial chapters of human existence and in fact family values. I have seen families breaking into pieces due to adultery and bitter marriages due to unsatisfactory sexual relations between husband and wife or partners. This is in fact a legit problem oftern ignored because 'Log kya kahenge'. Female orgasms are beautiful and natural and one doesn't have to twist it into discussions of feminism if someone as @redheadwayfarer is choosing to talk about it. Human desires and owning up to it is very basic and carnal so there should be no shame and taboo associated with it. Nudity or modesty both can be equally empowering for women and it is their prerogative to choose. Free will and choice are fundamental to us women as it is to men. So we can choose to have more sex, be more nude, wear more bikinis, uplift more women through advocacy, education, livelihood or just by letting them be and letting them talk. It is our choice and men should not have a problem digesting that. Many don't and the ones who are twisting this post into a display of fake feminism or a means to gaining followers or whatever, its her damn choice and you can obtain your mental masturbation elsewhere!", "tassie_xo": "🙌🏻", "moin_hussain": "I think it's about time that we start dicussing about \"female orgasms\". Enough of all the discussions of \"male orgasms\". Oh wait do we even discuss male orgasms?", "shazdah": "@neha_siddiqi @zainakhan3912 @taibahdesai @masira_khan23", "shambhavi_130": "I've read your posts and also been inspired by them but this is high time that you realise that feminism is not always about promoting nudity and women's sexuality.. And much more than that.. Not every girl wants exposure to body showing and going topless But instead the main focus is upon women practising their right for expression.. And MEN AREN'T ALWAYS RESPONSIBLE for fulfilling a woman's desires.. And not everything is about SEX!", "_b.h.a.v.e.s.h_": "Women who think that sex is a transaction are as stupid as men who just see women as sex objects. Sex isn't something you give. You both enjoy it and if you aren't then don't do it.", "_bhavika07_": "Some ppl are afraid to speak it out and you raise your voice against it....after this i started lovin u more n more and more respect for uh😄 you're such big inspiration for me ..keep posting love yaa🤗💞", "the_anonymous_boss_lady": "@lakshaychaudharyofficial dekh bhai isko", "a_gypsy_soul_01": "You're love, n my real motivation", "anuhya.t": "Right now I have a feeling only lesbians ACTUALLY get orgasms because they make sure that both recurve enough pleasure", "neha_anand_raj": "Seeing ur story.. I want to ask u, about the data u gave regarding how tough the life has been and is still for a lot of women! What have YOU done for that anyway? How freeing the nipples is gonna help them? How Living in with a boyfriend and making a fuss about is gonna b helpful for them? How roaming around semi naked is gonna help them regarding education?", "verymysogynistic": "Your opinions don't reach rural women. And women in cities are quite vocal about their sexual preferences. What are you whining about ?......oh I forgot that it's a paid promotion and you're allowed to be retarded", "ahanadutta24": "Ni didi ji... hamare ander itna b hawas ni hai... kuch real feminism k bare me discuss kr liya kareye...jb dekho tb bra panties sex pussy dicks hawas k bate krti rehti hai...😅", "skilanator": "Honestly I agree with her, I like to feel an orgasm and it's unfair that sex which is a 2 person activity leads to only one person bieng satisfied! And I as a man would love to help keep my woman satisfied by learn about female orgasms and how do we actually provide them!", "_hitesh__sharma": "Respect to the remaining 30%", "aashnadogra": "The people who are getting angry and posting hate comments over this post, probably have their brain so far up their asses that they don't know if they're getting an orgasm or are TATTI in bed. If a female doesn't get an orgasm during sex it's not her fault. If men expect to be pleased, women want the same in return. Ego pe matt lo gadhon, thoda Dimag bhi lga lo. Sex is one of the physiological needs of every society, if you think i'm lying, google it.", "__sneha.narayanan__": "I am glad you decided to throw a light on this topic. Much needed for all the ladies out there. You go gurl! I adore you ❤️ @redheadwayfarer", "theskymiles": "You make that content which can be viral on instagram 😂 strategy huh ?", "_b_a_n_j_a_r_a_n": "@redheadwayfarer finally someone is talking about something that most people avoid have conversations about. This is the reason why you are my favorite person in Instagram .❤️Girl you are a blessing to the female society. Every women deserves to be feel the pleasure 😊😊 and not fake it . More power to you sister 💪👊", "shubhamsethi16": "I fail to understand what sort of a man doesn't want his partner to have an orgasm. I mean, how selfish must men be to just have theirs and walk off. Also, kudos to @redheadwayfarer for making men uncomfortable with your content, it's high time we realize our heritage of patriarchy and take steps to mend it.", "lotteholterman": "🙌🏻🙌🏻🙌🏻", "shubhangi112002": "Your writings are so goodd...❤️", "_nigamayushi_": "I love you means alot i always wanted to talk about this", "dontask57": "Kamasutra humne h likhi hai aur zamane se log bht tarike use krte aa rhe to reach that level for example in ancient India wife's used to make drinks which helped there mens sexual power to enhance and hence resulting in good sex all these weird poses we see in porn came from our own texts even ayruveda has things which were regularly consumed for enhance powers but the problem is ajkl ki ldkiyo ka attitude hamara lifestyle aur logo ki chutiya sooch itni gir gyi hai ki humko bas apna dikhta hai.....ur partner couldn't satisfy you or better said he didn't wanted to thats his own personal mindset every man is not like that or even if i talk about myself when i fuck my girl i make sure her eyes roll backwards and yes i very much enjoy that expression on her face coz i believe that sex can only be enjoyed to its fullest when the lady enjoys and contributes the same. Ek Saach toh mai bhi bolunga ab maine bhi aisi ldkiya date ki hai jinke saath intimate hona felt like a rapist......i qoute \"tum kr loo par mjhe kch krne mat bolna\" aur the whole tym ldki ek laaash ki trha leti rhegi as if am raping her dont you think thats a issue as well humko orgasm milta hai ye kisne bol diya tumko u dumb fuck..... ejaculation= orgasm ye kaunse book mein padh liya tumne. Zamane se Indians ke liye sex iss aurate leti rhegi aur mard upar chadh ke lga rhega dont you think wo ek issue hai. Ab mard agar bole ki hume bhi maza chahiye ldkiya satisfy krengi humko hum kch nhi krengay tab kya bologi. Mens do all the hard work they pump you like bulls so that both of them can have a good time agar tumko khud attitude dikhana hai toh hum kyu kya dikhaye.", "thatbong_girl": "😂😂😂😂😂😂😂", "noodlebeing": "For some reason, women are expected not to be open about their sexual needs by their parents. Men need to start encouraging women to open up about what they WANT in bed, instead of just thinking about their pleasure. Not all men, but most of the men don't bother to even understand if their partners are getting pleasure that they're seeking. And I feel one of the main reasons is the stigma around it, we Indians need to chill and make these conversations NORMAL. I'm so glad so many women are coming out to talk about this, cuz if we don't start normalizing these topics now, then it's never going to be normal", "anmolkanwar": "So true 💯", "vinam27": "The lack of basic sex education in India is so troublesome.", "retikabhatia": "Amen girl 🙌", "zo_kap_002": "i think if men can't u orgasm's jusst CHANGE the men, having orgasm's is my fucking right 🔥. and for having that i keep multiple partners who can give me what i deserve. 💯 i feel sad for all those who dont get orgasm's, coz its most amazing thing any women should have ....", "amit_the_limitless_": "Before #orgasm it is about #honesty, that is how honest you are in yourself with yourself and then communicating that honesty with sincerity to the partner; if you compromise your honesty then you compromise your #integrity! #SexualAwareness #SexualExpression #SexualFreedom #SexIsBeautiful #TreatItAccordingly", "harish_rathore_95": "Saloni should start a sex university.", "real_media4india": "Well in that case ladies can text my friend @shubham_1559 he's an expert in all these matters... I know that it will be awkward for some ladies that kahin pta naa lag jaaye ya y should they trust a stranger but tbh... He's the one who's dealing with all these type of problems in my city... And for online clients i guess it will be free... So ladies if u feel hesitate and shy then u can talk to him... He always hide privacy and open minded expert btw hi saloni @redheadwayfarer u r really amazing in giving captions and thanks and power to u lady...", "rajeshwaride97": "And yesterday only, a guy told me in answer to my *Fuck you* that only he can fuck me, not the other way.", "aritrigupta": "Thank you @redheadwayfarer . This is something that needs to be addressed, communicated, talked about without shame or prejudice.", "sammal1188": "Thanks alot to all Feminists for inspiring me. After going over a lot of articles and videos on Feminism, I have decided to do following: 1. Will talk about night falls and how we feel after getting wet 2. Will insult and abuse anyone who talks in Hindi. Will correct grammar to win debate 3. Will talk about how to fantasize and masturbate 4. Will talk about experience of receiving a blowjob from women 5. Will talk about morning erections 6. Will openly talk about women's body parts we like the most 7. Will post pics in undergarments as it's our choice to show our body 8. Will talk about how to make a women pregnant 9. Will talk about itchy balls and will start a campaign named \"Free the balls\". Will post selfies of Balls to spread awareness. (Similar to your \"Free the nipples\" movement) 10. Will talk about fake rape and sexual harrassment cases against men.", "prabhakarsinha42": "Love you 😘", "sahilpahujaa": "Life is good but orgasm makes it heaven.", "crestede": "And the day they all realise what they consciously kept under the wraps and were devoid of ...they are gonna regret for the entire generations of mankind for much much deeper reasons👆✌️", "_dhruvi_28": "🙌🙌🙌", "sophyfreebirds": "I am gonna write my story here, and it's gonna be public and I am not going to feel ashamed about it like I should, because I am walking away from the social construct which has drilled this wrong notion into my mind that sexual talk is a taboo. I didn't orgasm , and I helped my partner orgasm. But when it was his turn to take care of me, he didn't. He thought it was his mf right to cum , but when it was me, I was just a means to an end. That man thought that women are very complex creatures, it takes a lot of time to set Their mood , and it takes longer for them to climax. So it is better to blow off your own steam on them rather than engage in the act. It was such a chauvinistic attitude. I was pissed . But I took care of myself while he was right beside me, and the look on his face was priceless. I am not ashamed to take what I want. Since then have learnt to read my sexual desires and embrace it. And I clearly say what I want, and I am very precise about it. Everyone no matter men or women should not feel that their desires are sick or twisted they should just embrace it and follow it up with the right person. And the number of comments here is less compared to your other posts which clearly says what you want to say @redheadwayfarer . People are ashamed to embrace their desires, let alone speak about it openly. And when a woman does it, God help me. She is a slut. P.S - I know I am going to get a lot of stink eye after this comment. But truth is the truth. You either deal with it or man up. (P.S- I love how this time man up is actually talking Manning up) 😜", "_soul.tripper": "Thank you. 🌹", "excuseme.123": "U inspire so many mental girls..... Good job👍", "faisal.syed101": "I always make sure my partner has an orgasm. Though sometime very rarely they don't. But majority of the time I make sure they do 🙌", "drnkphlsphr": "Wish we were taught to communicate with women about it. Alas never late to the party, party being women having orgasms. I guess men need to be taught on how to. Be open to learn. I might be wrong here. Just saying.", "prabhava.n": "Such a relevant topic...it's hard to figure out who can u talk to bout this..", "charvisapraaa": "@naasamjhdoggy", "prabhjotkmann": "Bro @harleeenbains", "padmaa_llmo": "@chosdol_diskit @stanzindolma24 @stanzin_yangdolll", "swag_satrangii": "True! 👍 Glad that someone started talking bout it! 💥 I admire the concepts you bring out... That too so beautifully! Keep going and inspiring! 😘💐 @redheadwayfarer", "aradhya_agarwal_07": "Wish it could be that easy to talk abt orgasms in open but the credit goes to our society that it isn't like dis ...women need to communicate abt it", "aravind_bhamidipati": "It's not a threat but is a thing which being very downgraded by the society. And moreover women and men deserve what they are entitled to, and having the need to discuss sexual desires is one of them. Women are free to do whatever they want, and even free to question someone who questions them. Don't think of it as supression or something, women and men are unique in their own ways and recognizing this fact basically iradicates the need to impose equality over the other gender. So yeah, what you said actually needs to be addressed.", "shrutikotak_": "YOU NEVER FAIL TO ACCURATELY SAY WHAT I FEEL MY GOD"}