{"_.snehaghosh._": "❤️", "siddharth221080": "Its bit hairy - love this 😘", "vaishhh.__": "@redheadwayfarer and please instead of doing this shitty things do something in real life . Work for women not only women work for poor people. Women who are forced to wear burkha , and follow their horrifying rituals work for them instead of doing this. This is normal everyone has hair and it's nothing new. Soo ismei dikhane vaali kya baat hai.", "john_jacob_90": "You are either fucking dumb or such an ass who dont know the basic reason of using @...... after ever fucking comment...", "insane_resh": "So sad I just saw this ...want to login but not getting access....could you please help me out", "artislove_923": "Underarms to karva leti😂😂", "scor_nihal": "Where is pussy hairs show me", "tanmay_lahiri_7": "❤️", "hitesh_1295": "💯", "tanmayakumar.sahu": "👌👌👌👌👌👌", "jix_love": "1 rs me shaving krne Ka blade milta he BC jaao krke aao", "iamthor699": "I love your armpits I can do anything to lick them", "a.pretentious.storyteller": "🙌", "rajugowda.r": "👌👌👌❤️", "navin_pandey13": "Love your hair under arms", "ayeshay09": "More power to you @redheadwayfarer ❤️❤️❤️ all the dumbass people commenting shit go get some life man!!!!! Live and let others also live 🙏🙏🙏 If you have a point then present it in a constructive way or simply ignore..... I dont get from where do people get so much energy and time to talk shit about other people as if there arent other things to do in life 😂", "awais.furry86": "Lol next pic pussy with hairs 😂😂and caption women empowerment shitty", "deveya_rana": "M sold at 5th point", "mdrizwan2971": "Nice pic", "dhrishit_": "Loving the armpit hair #hairyforlife", "mohammedjawedoo7": "Please use hair remover baby", "suraj_hatkar_888": "Can you follow me pretty lady ❤️🌹🔥🌹", "deep.singhg3": "😢😢😢😢😢😢😢😢😢", "samy_shokeen": "Are yar ye bc smjhana kya chahti h yar..", "aryaroy6969": "Chudbooo", "ib5879": "Loved ur armpit hair", "abduljabbar7234._saude": "Gorgeous", "__mydarksoul__": "U people need a Doctor....", "kumar_anoop21": "Hadd hai yr .... Bagal k baal dikhana sign of Woman Empowerment kabse ho gya 😎😂😂😂 Ye log Instagram pe gandagi dikhane hi kyo aate hai ??? there are lots of good things we can do in our life for development, education or poverty but Dirty Armpits 💩 Yakk 💩", "a.cup.of._wish": "@redheadwayfarer I just have one question why should we only talk about underarm hair and all the people talking about feminism keeps their underarm hair and removes other body hair like on hands or legs , if we are talking about feminism we should talk about whole body hair and should embrace that hair too ,this was just my point , do educate me on this just embracing underarm hair", "_peanut03d_": "My question is....isme feminism Kahan hai?! It's just an advertisement.... totally unrelated to feminism...why are dumbass guys AND GIRLS going gaga over it making it an issue.... Tooooooo much spare time to talk shit about others!😂😂😂", "pforpooja_": "You are super free-spirited🌹 it takes a lot of to have this much confidence, I wish I had it too love ya ❤️", "manik.kapoor.88": "Super sexy", "anjalishivi31": "I really fail to understand this utterly simple thing that if someone doesn’t like a person or a celebrity, why do they have to CONSTANTLY stalk or follow them!!! I hardly comment on any post, but today I feel really sorry about this mentality. It’s so disturbing and disgusting. Not everyone talks about national issues!!! Get this straight! And if you want content related to that, then please go ahead and follow the respective pages! People popping out of nowhere and talking about national issues, I would really like to ask them as to what have they done regarding the issues??? At least, Saloni is coming up with the real issues that we face in day to day life, and nobody feels right to discuss about it openly because it is considered a taboo. So let’s just respect that, and if you cannot, then just try not to disrespect her or her posts.", "saurabh_ganga": "Oh my I love Point 5! ❤️ I'd like to ask, is this a brand for feminine clothing only?", "fashionmodelsaman": "CASTING FOR HINDI TV SERIAL FOR COLORS 'MOHE RANG DE' FOR STAR BHARAT ALSO NEW SHOW. FEMALE LEAD FACES REQUIRE . FEMALE MAIN LEAD REQUIRE FOR ALT BALAJI WEB SERIES 'ISHQ ME RISK' . ALSO REQUIRE FEMALE MODELS  FOR FASHION SHOWS,MAGAZINE SHOOTS,CORPORATE EVENTS AND PAGE3 PARTIES . FOR APPLY WHATSAPP ME PICTURES 9820751120. ITS DIRECT WORK", "__anujprajapati": "❤️", "bombaybollywood": "❤️", "welcome_to.my_profile": "❤❤", "sanjeenamal": "Love it", "dharmandracharah": "❤️", "rahul.thorve": "OMG...beautiful 👧😍💓", "karanj0t_singh": "U need to clean your underarms", "satish_gahlot": "Looking hot", "adtpatel": "indian cishet men need to calm tf down jesus christ who peed in yalls drinks", "maney._": "I want sleeevessss in the outfit. Please do something about it.", "sharmaji_ka_navabzada": "Its your body mam. You cand do whatever you want to. Underarm hairs are normally. We all have that. But you may see some great comments of ass holes of world. Just ignore them and always shine like a star. Love you mam", "pranaykhera": "Those under arms. Yyyuuuucccckkkkk !!", "abhihritwij1592": "Sunder👌", "grrut": "BC uske bs ek hi post hote hai , mtlb saara feminism ka Gyaan isi kse pass h #jaisherawalimaa", "yogesh_onmove": "Angel", "shrey_d_": "Can we customize our own beach wear?", "khushbupanchall": "This is the best.. I wanna buy this ♥️♥️ POCKETS POCKETS POCKETS 😍😍", "mahiraaa_gupta": "@redheadwayfarer For all the confused people, I'll put it out clearly. She is showing underarm hair, in order to show that women can also show it and that they should have the choice to if they feel like it. Feminism is about women's choice, so if I feel lazy or don't have the time to shave it's my choice, to have hairy underarms. She trying to say that women or men should not be shamed for that choice. They should have the choice to choose whatever they feel comfortable with. It's not about her showing hair or not. It's about her choosing to show it, to not shave because it's her body and she can choose to shave it or not. If she chooses not to then we have to respect that choice, we might not like it and think it's gross but we have no right to shame her for that, we have to respect her choice. If we don't like it we should keep our opinion to ourselves. Feminism is about making people respecting women's choices, for underarm hair or other things. At the end of the day it's her body and her choice we gotta respect that. That's all just respect it nobody is asking you to do it, but don't tell her to not do it because she made her choice and you can make yours!", "drawat38": "😃", "aanchi02": "@redheadwayfarer hi i really adore you , you are cute , beautiful , you do what you like and people like me are always thr to support you . This is india they are always going criticise a women either shes ugly or beautiful dsnt matter . i hope these kind of comments dsnt bother you much but it did to me i hate it when people talk shit about a womens personal choice . Keep heads up lot more to come yr way , keep posting some people really adore you the way you are 🖤🖤😘😘", "thetatatop\nVerified": "Verified", "zubeen_zeyan": "Wax krleti", "chuck_username": "👌👌👌", "shoaibmohammed_official": "I think she only plays women’s card thts all who told her to put like this picture nd thought tht wt others will think no sry wt v think for others exactly wt v r doing her unfollow right now shame on this thinking", "samsamar6474": "Are apne armpit toh clean kr leti yrrrr😁", "50cupsofchai": "Goddamnit she is promoting her designs on this post and that's her body, her armpits, her account and she literally just said, \"girls have hair too\". Y'all hyprocrites need to stop bending words just for your five minutes of fame. That's her way of empowering women. It's COMPLETELY upto her.", "tarun_kashyap__": "#Shittypost #gogetalife #youareinsultingwomen #wtf #kyadikhaanachahtihaibehan #shame", "akshitapyla1": "Hairy like a woman ❤️🙌🏻", "_amritaaa_": "Some of your posts are really good and relatable thatswhy I followed you par kabhi kuch bhi post karti ho feminism ke naam par, women are also humans toh it's quite natural to have body hair isme alaag se bolne wali konsi baat hai? Though some of the topics which you talk about is necessary but you should also talk about the other essential things as so many people follow you and get inspired from you. Hope you understand.", "official_yuvraj_vj_singh": "What do you want to prove? Sweet heart 🥰", "suk_anya": "❤️", "mehedi_afroz2000": "Why don’t you wax your underarm? 😷", "26abhaykumarsingh": "But..... The outfit is not even nice.. looking", "sushantgond": "Smelly underarm yuckk", "kazi_for_yaad": "Under arms me kuch laga", "modern_caveman_pro": "I don't get it why people with no dp and 0 followers have a problem with feminists are you afraid with people knowing u and your mentality 😕😕😕😕", "ii_abhiishek": "Dont post nudity on sake of feminism", "thelocaltrails": "Dear @redheadwayfarer , this is Saba from Karachi, Pakistan. I know I won't get any pieces from here cause of obvious reasons but I LOVED pointer number 5 for pockets! Every girl dress should have pockets I mean seriously men have pockets and somehow still women don't cause they have handbags and such. I stopped buying clothes that don't pockets cause I decided that I'll wear things that cater to my needs and not JUST looks. Peace.", "kadirmughal": "Feminism is the new dhanda..", "pre.et.y": "Loveeeeee it", "niharika._.af": "By reading some comments here i can see that people have soooo messed up thinking 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️..... Dude its just underarm hair, as normal as hair on head. Like literally its normal and as humanly as possible 🤦🏻‍♀️", "_innocent_prajapati": "👑👑❤️❤️", "anur.ag450": "So alluring...and beautiful..♥️", "riti_das_dhankar": "@redheadwayfarer i love your posts. It takes guts to pen your thoughts honestly inspite of the harsh comments and abuses that you face. Kudos to you. May our tribe continue to grow! 🥂", "_the_sarbojit_": "My God wat a lovely bagal k baal", "notshelbyspecter": "@redheadwayfarer i dont agree with you over a lot of issues and on many occasions.....but i always feel you do things with pure intentions, i may not be a fan of your attitude and way of presenting ideas....but i do admire your spirit and your way of utilization of the stage that you have. So at the end i just wanted to say that may god bless you and rahul sir also, and may you achieve whatever you seek to achieve.....i wish you luck in this business of yours, you are doing a good thing by being inclusive of all shapes and size...i respect you for that.........baki aapse vicharuk taur pe matbhed ka kissa kabhi aur sunaunga 😂", "nishank_mani_bhatt": "I love you❤️❤️❤️💖🌹", "gpooja_30": "Mam i read almost every comment here. People are so mean. 😣 I just wish God gives you enough strength to do what you feel like and also i wish these people to heal. More power to you ❤️😘🤗🤗", "reni_rog": "Kaisi si ho yar aap.... agar koi ladki clean armpits rakhna bhi chahti hain... toh kyu unko galat motivate kar rahi ho ?? Unki life unhe rehne do jaisa woh rahe.. we dont ask or force you to keep your armpits hair clean right?? And yeah first of all we are no1 to stop you from posting such pics but please on name of feminism teach yourself not others..", "yadavvv__": "❤️", "_yashmin_banu_": "Hey... U make me feel beautiful whenever i see my self in mirror ... Coz now i dont have to worry what other think of my body its just what i think of myself first .. Thanku for that ... @redheadwayfarer", "hannah_pietersen": "@redheadwayfarer YOU GO GIRLLLLL ❤️ I really don't know how you stand so much BS, these guys out there are such idiots and morons.", "soumit_143": "Hii ma'am", "bishubasnett": "Do u shave ur pussy Or u have hair there also😂😂😂", "techhungryguy": "so what is your point ... girls can definately have hair...agreed so we have hair removing machines, razors to clean it..its called basic hygiene.. i do as man and all women do... Can you explain your point here", "sagar.samrat_1701": "Sexy 🔥🔥🔥", "__gfy____": "There is a reason why people shave their armpits , it's hygienic (be it men or women ) if u wanna act like your unHygenic self sure but don't u dare rope all these naive ppl into your dhanda", "lovelyjain80": "Armpit hair is not related to feminism. It’s normal. We all have body hair and it’s natural. Let’s take a moment to appreciate this picture and @redheadwayfarer courage. More love & respect.", "nonienair": "POCKETS 💕💕💕", "stylesavitri": "Loving this picture totally ♥️", "kant.rishav": "Waaaah Didi waaaahhh 🙏", "ganeshsonawane652": "🔥🔥🔥🔥🔥🔥🔥😍😍😍😍😍😍", "landonhope10": "You are perfect😍", "sshwetapayla121": "more power to you🔥", "eshwar.s.bujurke": "U LOOKING PRETTY CUUUUTE PIC 💕💕💕💕", "my_insta_bazaar": "Did You Smile Today? If Not Than Smile Now 😍 And Do Follow Our Page @my_insta_bazaar For Best Budget Jewelleries And More... And Don't Forget To Like This Comment. Have A Wonderful Day!!!", "varunshegal": "💋", "syedsafirock": "So sexy sweetheart", "priiyaa_aaa": "😘", "charmingly10": "Shit I'm gonna be in Kuala Lumpur and I'm gonna miss it DAMN IT", "azimalpha": "Unfollowed for over processing your ideas of women empowerment!", "rahul_sharma08071992": "yar we got it what message you want to convey.......please dont overdo this....now it seems you post pics like this just to stay relevant on instagram...", "anikate_monish": "😍😍", "riyasharma7790": "I love the colours , designs everything. Beautiful", "sammal1188": "फेमिनिज्म के नाम पे लेले बाबा!!!", "tofik_m_vohra": "😘😘😘😘", "knovokaine": "Just hearing the word \"POCKETS\" makes me so happy 😂♥️", "richa__the__wanderer": "God damn man you are just superbly disgusting....", "ngspice": "@snehu12_official", "paulholmes1816": "Damn I love that armpit 😍😍😍😍🔥🔥🔥🔥🔥🔥😘😘😘", "_akith": "Wonder arm", "nidhi_ahire": "@redheadwayfarer Babe..I have been looking at your comment section for a while now..N all I see are men trying to prove that somehow they are a superior species. Most importantly, they feel like they have a fucking say in your life.😑 This irritates the hell out of me. We aren't interested in their lives...But I can bet this that none of them are happy or comfortable in their own bodies. That's why they express their frustrations by bringing you down. Just know that you are going to receive such comments from these morons forever, but there are people who get inspired by you.. so keep treading as you please, my girl!😘 I freaking love you❤️ You are pretty! You are strong! YOU DO YOU GIRL!❤️", "sankshipta0519": "Poseeee🔥🔥🔥🔥🔥", "_easter.girl_": "Curves♥️💥", "aditi_choudhary10": "💗", "iamsonu555": "Big fan of you saloni ❤️", "teynidhi": "I love how everything about you is free-spirited 💕", "gondaliyaprachi": "❤️", "golu9194": "Hair bhi remove ni kiya😂", "beingsonu_bob": "Hotyy😘🔥🔥", "achyut0900": "Ewwww🤮🤮🤮🤮🤮Disgusting.... Mann kharab ho gya ye Bawasir dekh ke🤮🤮", "yashikabedii": "Hairy like a women! 🙌❤", "vanae.mars": "This pic is fire 🔥", "chaudhary_akshay_007": "Pls cut your underarm hairs😅", "lexie_chicca": "Your shot is great!", "pulkitarora8": "What do you want to show", "shri_hc": "❣️😍"}