{"drroshanrajan10": "50 years? But this is what you look like right now...😂😂😂", "foodpromoter10": "U still look like thisss😄#fakefaminist", "gladyforeva7": "@__lonely__stoner.__ 🙄", "prangotnochill": "😂😂😂", "souravchauhanofficial": "😂😂😂", "arjundutt88": "Her nipples look burnt off lol", "sahil_jswal": "😂", "ca_ch_et": "@anto_patrex hey let's start a campaign against her... Everyone block her and report her. Why this? She is just made feminism all about body... We are wise people... I like her thoughts but she is just a fake person.... We are powerful people, if she can talk about ' do whatever you like' then we as a powerful people can block and report and teach other people too that we won't accept shit... She herself doesn't understand what feminism her... She use her Instagram following to earn through controversies... More followers, more brands will approach her... She talk about something else do something else... Totally fake... These kind of people should be boycotted for the better of the society... She is misguiding everyone... I afraid young girls will have a bad influence... Let's be a team and teach a lesson... No need of such hypocrisy... Fake people should be blocked... She just click controversial pics in luxury hotels, her poor acting couldn't earn her a successful career so she chose this method of earning fame... I am feminist too. And I know so many women who are so strong and struggling for female rights in real life and guess what? Without talking about ' nipples' and 'tits' . This should be made clear on social media if you talk about 'do whatever you want' then be ready coz there will be an outcome, people don't like you will block you and report you... Spreading unnecessary controversial messages and not understanding real feminism, just showing off will not be accepted anymore... A wise person will not tolerate wrong things... It's our duty to ignore her... She is using our rage for her benefit... Boycott will teach her a good lesson and other fake People like her.", "white_storm211997": "😂😂😂😂 damn", "vaishhh.__": "@redheadwayfarer and yea please someday wear indian dresses too.", "maninder3665": "😲😲😲", "badass_0101": "Tu toh abhi bhi esi hi dikhti he", "rutubhatt_": "😂😂", "berry_the_goldengirl": "Those are known as idiot", "artislove_923": "Suits u😂😂", "moullanjalil": "@payalghoorhoo so youu", "eutopia119": "🔥🔥", "kashmishr": "भारत के मूल विचार,भाव और दर्शन \" आत्मा \" में निहित है। शरीर को एक माध्यमिक आवरण की तरह लक्षित किया गया है। अब यह तो हम सब के सोचने,समझने का विषय है कि हमें किन विषयों पर केंद्रित करना है। शरीर पर चिंतन ,मनन करना है या अपने मूल, आत्मा के रहस्यों में निहत हों जीना है।", "sidhart_ahuja12": "Yess girl ❤️❤️❤️", "caprice_669": "😂😂😂", "dank1bruh": "watch lakshay chowdhari vidio ....you deserve what he said about you...hats off you lakshay chowdhari brooo😍😍😍😍 aise india ke bahar baith gyan chodne wale deserve karte hai ye baate", "07rajat": "😂", "ishuhot": "😂 😂 you also look old 😂 who think showing nipples is women empowerment 😂", "remon90per": "👏 exactly I don't know what is this woman trying to prove... Feminism is not equal to exhibitionism.....its OK to post pics in bikni bt why mix It with any ideologies ???", "mmc001": "❤️❤️❤️❤️❤️", "yadavmanasa": "We need lot of feminist like this i support her", "iam_lalahimanshu": "Abhi Kise hai wo to dikhaaooo", "shrey.datta": "Lol", "mojo_rojo_": "😂😂❤️", "zeee_ali_": "Had hai lekin ye to", "roshanpadiyath": "I am least bothered about these", "_boroe_": "😂😂😂😂", "sain7347": "😛😛👌 good joke", "nidhhiiee": "@redheadwayfarer 😂", "deopankaj": "Apologies but speak 3e", "ni8in": "@kitrakrehk yeh feminism hai? Yeh dekh meri booty meri cleavage, mere nipple!", "teller_of_taless": "😂😂😂😂", "yash_vardhan0285": "❤️🙏🔥🙌", "yogesh_onmove": "OH My God", "the_neha_kaushik": "🔥🔥", "amaldude93": "She'll keep on posting these things always...I want to understand are these actually a topic of women empowerment or these are choices of every individual women out there...with all due respect I wanna request all women out there that this is 21st century today all men and women are equal in each and every aspects of life or If m not wrong women are doing much better than men. There are few assholes who judge women by their fashion choices and other things that doesn't mean that women empowerment is about nudity and sex...there are more important topics to talk about...I hope u understand.", "zeybahaider": "🙌🙌🙌🙌🙌💖❤️", "orrumasaladosa": "😂😂😂", "secretleman_aayuu": "😂", "_sh00bs_": "Nice👌👌 start wearing pushup😜bra", "spidouir": "😂😂", "in_search_of_moksh": "But y u wanna show your body in public at any age 🤷 ... Love your body but it's not necessary to expose it everytime in public ...", "_an_ebullient_": "Do smthing good so that we also can try to be a part of it like helping u in that particular agenda uploading such things is good but for me action is great telling nd sharing opinion everyday is like u know boring nd a sign of a true coward ...sharing opinion is good but not everytime do smthing atleast trips pe jke r u really trying to chng women's perceptive ? Kbhi Gao jke sanitary pad unke Sath ek week rha ke unka prml jna h unne unka rights btya h ! Bus award lere ho ap sharing pics nd opinion ke I love you seriously I rscpt u alot but I also want u to take a step ♥️♥️ well atlast stay blessed 📣", "dreamkanika394": "Thats me ☺", "priya_mukherjee21": "😂", "plump_potatoo": "😂 true", "ahanadutta24": "Y the hell those nipples r hidden... Jst flaunt it... Ur article \"free ur nipples\"... U also pls free that and post a picture of it... We r dieing 2 get such kind of inspiration by looking at ur nipples 😂", "photostories_by_rajesh": "Well you are doing good keep it up keep post ❤️❤️❤️❤️", "inishith07": "Slayed and Chopped well! All that is left is frying and let's eat finally, I'm hungry 😁🤣🤣", "_.swathiiii._": "This picture is meant as a joke. Stop taking everything so seriously people. And the point of this post is to be proud of your body regardless of how you look. She's not suggesting you to go flaunt yourself out there. Love yourself peeps 💜", "revati_3024": "😂💕🔥🔥🔥", "sagar_musafir": "You look almost same now.. may be after 5 years you will be like this 😅😅😂😂😂", "bust_a_move__": "❤️❤️❤️❤️❤️", "golu9194": "Oops😂😂😂", "das_mismi": "Mujha samaj nahi ata hay app chahatay kya hooo", "thepoetryempress": "😂😂😂", "dimplekaim0096": "😂😂😂😂😂 @iamkaju96 we😂", "anshul.iitbs": "😂😂 Good one.", "iamgohar_shahid": "Really😘😘😘😘😘", "chestharajvanshi": "😂", "dougbowzer": "Commit no alive I must", "ch.rohitkhari": "😛😂😂😂", "mirelahmed": "Ur fucking outta ur mind @redheadwayfarer attention seeking bitch and nothing else", "drpratibha_singh": "True", "_joyshrii_": "Shortest caption by her guys!!!", "sketchingdreams786": "Hadd hai bc", "soares_diandra\nVerified": "Verified", "tazeen141": "😂😂", "mindfully_busybee": "😂😂😂💖", "kt19__": "AYY LMAOOOOO.", "rohan__ayare": "@anto_patrex irrespective if your questioms were a mere query or a challenge, street cannot be made safer, but a man & woman can be made aware of how to tackle an unsafe street. So yes many Men and Women now know how to keep themselves safe on an unsafe street and regarding disrespect for Women so both uneducated and educated does this and the fights still on to educate PEOPLE the basics how to respect Women. I believe the practical and real reaction to urge you havent seen a women being molested and tried to find out if that person or a group is a village uneducated or City Educated, have ya?? You simply dont expect others to serve you shit when all you give them is respect right?? You have to change first to bring the change and then comes the team, then a society, then a community and then the world who would come close to make that change #YouBringTheChange 😉", "rahul_rock20": "😂😂😂", "prerna__sharma98": "U go girl ✋", "halaayadi": "😂", "drishhtti": "slaying the haters", "mehraaddy95": "You are always gonna look beautiful 😉", "sabrina.mumtaz8055": "proud of u🤗", "datelessgrin": "Hahahhahahaha, laughed my heart out!! WHAT AN AMAZING COMEBACK 😍😍", "ishan_chavda": "hahaha this just made my day 😂", "radheydutta": "Nude party", "taranjeetkalra": "🤣🤣🤣🤣", "i_daddysangel": "❤❤❤❤❤❤❤❤❤❤", "svloni": "🔥🔥🔥❤️❤️❤️❤️", "shweta.singh.921025": "🙌", "kandurisandeep": "😂", "_jahaajee_": "Why only in 50's ?? You can start now also", "nongthombam_rupali": "❤️", "pulkitarora8": "Are you mad", "sushantgond": "Yuckk buddhi", "neh_bansal": "🙌👏👏👏", "_samiksha_30": "😂😂🙌", "rashmified": "Best comeback. 😂 These angry guys are so scared of liberal women. I like it.", "ruchaa_pandya": "@h_p290", "imperfect_tapestry": "Awesomeeeee❤️", "rishi_mi7": "Tum chutiya ho kyaaa", "anisha.bhowal": "Ahhaaa😂😙", "shri_hc": "Yess !! 😂🙌", "aboxofmundanewords": "🤣", "an.any.a": "Best reply🔥😂", "rohitkidewani": "Hello Saloni C, when can we expect your and Rahul's marriage, because we all your feminist fan wants to see you in bridal wear unless you choose for Nude Marriage ceremony, also apka honeymoon as well as SUHAGRAAT already ho Chuka he, so just waiting for you to comeup in Traditional Indian Bridal Wear", "borntoshine03": "🔥🔥🔥", "smitassgosavi": "savage🔥🔥🔥🔥", "reetsingh20": "😂😂😂👏🏻👏🏻👏🏻🙌🏻", "clair_de_soleil_": "😂👌🏼👌🏼", "kanchannsinghh": "@shuklaaji 😍❤️🙌", "sanjosmss": "😂😂😂", "i._wisher": "Too good 😂", "wendymariieee": "I'll join you ! 🙋🏽‍♀️", "sammal1188": "Every move that seems to propel the already free women outside the boundaries of morality and law is intrinsically labelled as a cause for feminist movement.", "anto_patrex": "Its not always a wise decision to flaunt ur body parts in the public. I means its all your choice after all. There is always the princess kate character which a true lady can actually show. Though u post all your feminist views on social media, how many changes have u really bought on the society. Have you really made atleast one street in India a safer place for women? Or have u in your life time educated any uneducated village man to respect women. Its time to take practical and real actions rather than sharing views and opinions on Instagram.", "m.b.adil": "🙈🙈🙈 chichichichi.... kya dekh liya... amma g ko meri taraf se kapde dpnate kr dena didi... paise mujhse le lena", "stfu.charull": "😂 ♥️♥️", "prabhakarsinha42": "😢", "filmyladkii": "😂😂😂😂✌✌✌", "gunjani__": "😂😂😂😂", "kumar_anoop21": "Yupp According To You Showing Boobs is a kind of Woman Empowerment in a country where people dying due to Bad Health, Farmers are dying due to overload of Debt, Lacs of the peoples sleeping roadsides even in winter ❄️ or rainy days, Approx. 35-40 % population is still uneducated, Crores of Youngsters are still unemployed but According To you Showing Nipples is Woman Empowerment 😡 what a shitty idea 💩👞👟 #Shame_On_You_Bitch & Go and jump off in 💩 We are not living in Barcelona or Bangkok #Bitch 💩👟👞", "lalit_rajput77": "uh still look like 🤣🤣 an old age women #thisisnotfeminism", "sanskaari_joker": "Savage AF...🔥🔥🔥", "amreenwsk5405": "Jhanumi aurat", "___.couch_potato.___": "She's just so wholesome MOOD😍", "singh_1525": "Beautiful 😂", "radhikaa.sharmaaa": "Savage🔥😂❤️", "malika_k31": "😂😂 so proud of you", "thatindianyogini": "I relate to this too 🤩🤗", "uddesh_chhajed": "@redheadwayfarer Yes, And you'd still be hiding the nipples of females, but not males. And you're a FEMINIST! NICE!", "aairah.sona": "Why 50,,, ? You can flaunt as long as you live this life ❤️", "adrijaboseee": "Hahaha love you girl😂❤", "bhardwaj_rishu_rishi": "Savage 🔥😂💕😍", "thebooklizz": "Her smile is priceless 😍", "itra_14": "Beautiful❤️❤️❤️", "me_imhsar": "Katt gya!! 😂", "hetvi_alina": "She is just so me", "ankur8242": "Right😂", "tinu_baid": "Haha 😂😂❤️❤️", "shruti.pokhriyall": "YOU ARE JUST PERFECT💖", "__kimayaa": "I love this", "tarun_inder_kaur": "I never comment. But this is the BEST. ❤️", "shivikakakaaa": "😂!!powers🙌"}