{"saira_ima": "Any talent other than body 🤔", "behindthecurtainofediting": "Hey all!! I'm so excited to launch @behindthecurtainofediting . I just can't express my happiness and my excitement. So little something about the username and the goals of this page: We all filter out our thoughts and feelings so that other people don't judge us. We've lived in a fear bubble and have always thought about what will people say? Or what will they think about me? So I created this page because since very long time, I've felt the need to always be surrounded near a space which can be safe and positive. A place where anyone can share their stories, their desires, their fears and their insecurities, or anything that is otherwise considered as \"taboo\", without fearing that you'll be judged. Do give it a look. Thanks. 🎀", "its_sam_ca": "sucks....🥶🥶🥶🥶", "sakeermanakulam": "❤️❤️❤️❤️", "rahul156335": "Nice cleavage 😍😍😍😍", "yourmelloww": "I know its your body but you so desperate for getting famous (बिच)", "deepsea_diver007": "Boobs💓💓😍😍", "boymorgan2k": "Aahhh I love the way you flaunt your juicy biigg bubs..they look so yummy here 🤤", "ka.ran77901": "Aur yaha par kafi low neck pehen Kar apni gully dikhate huye feminist Didi", "faridtufansinger": "Love you", "poulamimukergayi": "You go change the world the way you want to.", "jamilab26": "Always inspiring💕", "ron_the_wanderer": "She doesn't has boobs and she's showing it😂😂😂", "dinesh_mandare1991": "😘😘😘😘😘😘😘", "shilpa.adsul": "Feminism ko badanam mat kar... Stupid", "hasteedoshi": "Just because someone disagrees with what you say doesn't make them morons. Thinking like that makes you one for sure.", "misra6556": "It's so funny how she justify being naked and girls right to choice of clothes to feminism", "adil_ahammed_saddam": "😲😲😲😲😍😍😍😍", "xena_fdes": "@redheadwayfarer sometimes it's so hard right I mean u r trying so hard n still people r saying such degrading shit... Can't a women now even choose what she wants to speak about I wouldn't be a feminist if it was all about equalising men and women but because it is also about equalising women covering herself fully to a girl flaunting her body the way she wants... Blaming a girl for rape is like blaming a knife for a murder , know the knife never told u to murder u used it the wrong way that makes u a fucking murderer... U know I have realised one thing if at all I become someone I will become maybe in some other continent it hurts seeing women trolled like this tbh a Vitoria secret model also never gets trolled this way atleast not with rape threats... The very fact women don't get to enter some temples n mosques n the fact that they were burnt alive is a reason why feminism is definitely necessary", "shaaaayarr": "Fake feminist fake followers 😏😏", "adorable_aish1": "@viiidhyy FEMISNISM means equality to every gender. Many feminists believe that freeing their bodies includes being able to show body parts that have been censored by society for centuries. On the opposing side, some feminists, again, believe that women exposing their bodies only feed into the objectification and sexuality imposed on us by men. So, which is it? Can a female be a feminist and show off her body as she pleases, or should she cover up to avoid being sexualized by men? The simple answer I would like to give here is that women should have the right to do whatever the hell they want without neither men or other women having a say. The point is not to simply walk around naked all the time, it is to have the choice to be able to love and show one’s body without having to worry about the people who say, “you need to cover up”. Women are fighting for the right to cover up, but that should not mean that women should be restricted on what they show. Men should most definitely not have a say regarding what a woman chooses to do with her body because he does not own her- that is what feminism fights against. The bigger issue here is that it is other women, even worse feminists, who are doing the “slut-shaming” that feminists are supposed to be against in the first place. “Free the Nipple” was supposed to be a movement where women fought to stop having breasts sexualized, because they are not a sexual organ, and they wanted to have equal rights to their own! So, I would say screw the male gaze, and screw those who think women who are not completely covered are “immoral” and “not decent”, women as a whole need to acknowledge that we own our own body, not each other’s, and we need to stop making decisions based off men, when we are the ones who will actually be affected.", "rupali_mulik_baraskar": "We need more of you & @rahulb90 . Keep inspiring n keep Influencing!", "thev6025": "Our country has given everybody a freedom of speech and expression and misusing that on a platform like this you will develop more haters than likers . As a teenager i really loved your posts ,the way you put your thought in front of everyone , breaking taboos , it was really inspiring . But there is a reason why our country is so renknowned and it's because of our culture . Following western thoughts and culture is everyone's personal choice but glorifying it isn't . India is what it is because of its culture tradition and authenticity and by following western culture blindly just shows how you are degrading your own country . And also nudity never empowers a women ,it never will bcoz women don't need to show their body parts to get empowered . Empowerment comes from education and freedom and when a woman supports another and shows her right direction . Your posts are good , your thoughts are good but u have travelled so far from reality that you can't see the difference between", "thecoolsunidhi": "Tf man I want a Rahul too?", "den_sinyo_abung": "Beautiful", "natashanoel001\nVerified": "Verified", "neha.vaze.13": "Too good 👏♥️", "harsiddhi_chhaiya": "You're amazing never stop writing ❤️", "amruta.gajjar": "Just loved it!!", "majidmuneer": "Your followers are men too, Saloni. You inspire us all.", "irshad437moll": "Wow so sexy", "raviparmar7028": "🔥🔥🔥🔥🔥🔥🔥🔥🔥💯💯💯💯💯", "zahid0903": "Best boobs quality", "shahsapna1791": "Dear Rahul The morons you are talking about and how are they raised.. Nobody teaches their child to go topless and naked and post on social media. Im sure you would nt ask your daughter to post pictures like your girlfriend is doing and talking about feminism. Wearing short clothes doesnt mean you are high on your thoughts. everyone have their perception. We live in a country where tradition customs and values are still prevalent. in case @redheadwayfarer want to go naked and topless and want to talk about feminism india is not the right place. I cant expect a man to respect me if i show them my body part. If Saloni want to promote feminism there are many better ways rather than abusing those morons by herself getting down.", "pranaykhera": "@redheadwayfarer dont you have proper clothes ? Looking at your sagging boobs early in the morning ruins my day. Yuckk", "charmingly10": "Please tell Rahul to occasionally write with you it's nice to read from a male perspective too", "aditya.johny": "❤️❤️💐", "raju.godai": "Hot", "hussainmaksood": "Hot", "nisha.singh9912": "Hotty", "jix_love": "U suffering from skin diseases so contact soon at nearly best skin specialist doctor...", "skylightlion": "The middle cleavage is phenomenal", "oceandeepoasis": "@rahulb90 SHOULD TALK MORE💕", "aryaroy6969": "Thora aur dikhao sexyy", "nishantkumar1496": "👙👙", "soniadixit73": "I follow you because you are taking on our culture's oldest prejudice -- the Madonna-Whore complex. In India, \"good\" women don't take pride in their sexuality, their bodies. They modestly cover up their bodies. \"Bad\" women take an interest in sex, in uninhibited sexuality, and in their bodies. Indian women are taught that their bodies, their biological processes, their sexuality, is shameful. Women must be desirable, but their sexuality and bodies are owned and defined by men. Your work is important", "dr.unapologetic": "You’re blessed with the most amazing boyfriend there could ever be! ☺️", "ignatius9367": "Waaaaah😁", "adhoore__alfaaj": "Check my Profile For Sad Nd Loved Thoughts🙏🏼", "munnabach": "Mindblowing 🤗 😍❤️💖😘😘😘👍", "iamganeshbadgujar": "🔥", "hibu.holic": "Very beautiful ❤️❤️❤️", "suruchichauhan7506": "beautiful", "ashu_shukla4": "❤️❤️😍😍", "yahukh": "Cool cool 😍😍😍😍", "shyamli.bajpai312": "👏", "clumzieeee": "God bless ❤️", "alisafiul": "Love you 😘😘❤️🔥🔥🔥🔥", "miss_jain12": "Hats off to a guy like him to be on the other side of the crowd and facing the world with you! You're a rare kinda species! 😇 @rahulb90", "priyanka_rawlani": "Rahul yaaaass👏👏👏👏", "shanayas_\nVerified": "Verified", "zeybahaider": "We really do 🙌💖❤️❤️", "amir.sab.3572": "Very hot 🔥🔥", "scor_nihal": "Where is your boobs and vagana??", "_loveforwords_": "@rahulb90 We love your woman 😍🙌💓", "panda_pallavi": "More power to you. ❤️", "faheemba2648": "Looking#hot🔥", "rahulrajj173": "Kbhi toh dhang ki photo daal lia kr 😒😒", "radhika_deshpande_": "@redheadwayfarer Lucky you , you are lucky to have found a perfect person -> @rahulb90 I adore you guys as a couple. I find warmth and comfort in your relationship that each girl longs for in finding for herself.", "jaideep_gupta_26": "👀", "natasha_dutta_": "It was so right when u said \"Influencing is not about making people feel miserable about what they don't have, it's more about actually 'influencing' them in a positive way. We all get inspired from u when we look at the way u tackle all those haters. Thanku for always making us understand the fact that being famous or know is not always flowers and daisies, but comes with some bigger responsibilities too. We love you 😘❤", "indian566": "💋👍💕💗", "a.sharma172": "Always show tits is your habits", "viju21d": "So accurate @rahulb90 @redheadwayfarer ❤️❤️", "irshad.zargar.77": "Blowjob ❤️", "golu9194": "Nice view 😍😍", "shiwangi_limbu_05": "I love the caption. Happy to read that men actually think like that. ❤️❤️❤️❤️ And I love all of your post and you give so much courage to girls like us. Thank you.❤️❤️❤️", "essnasir": "Big boobs", "oddsoccs": "Goddamit i love you two so much :'))))))))))))", "naseer00001": "Nice tits", "being_antra_18": "Rah👌👌😊", "_aayyyuu_": "Caption on pointtttt", "rahul.brar": "Don't worry about morons. They also serve a purpose to let you be aware that all ain't so cool. They teach to take precautions so take them as a teacher. It helps.to understand people around you and the mindset of masses or random.", "yashmeen_sidhu": "Wowww! U r lucky girl 😍😍❤️❤️❤️", "vxdhxy": "I never commented on pictures of celebs cause it's of no use in the first place I m doing it right now cause I feel that you should know the difference between feminism and stripping feminism is empowering women in the society get them even opportunities in total but I think that for you it's just faulting off the body and the permission for that is feminism ☹️ but sad it's not like that you should support women to work better, empower them to take their own decisions and responsibilities; that's feminism and women empowerment not disclosing female body🤦 if this is feminism I ain't a feminist anymore 😪 being a celeb you influence a lot of people out there so choose your content wisely and yes for your kind information stop tagging Instagram in your posts about freeing nipples and all cause Instagram is accessible to children also🙏 please be the change maximum women live for. I ain't a hater nor I won't to send you negativity just wanted to say this.", "sweeneypereira": "👏👏well said ... 😘❤ caption...😍🙌... ur ma inspiration hon.. its true some1 somwhr gets inspiration ..people like you are really needed in dis world where small narrow minded people exist... love u girl..", "shahnoor_ayaan": "❤️", "rockrajmal": "So beautifully photographed", "s_h_r_u_t_i_a_g": "You’re an inspiration to a million fans out there. We love you ❤️", "a.bhardwaj7": "Big fan♥️", "syedashafquatwasti": "Can I have a rahul as well? @rahulb90 so lucky u r 😢😢@redheadwayfarer", "kunikag7": "Thanks for the wonderful caption @rahulb90 💜 much love to both of you. 💙", "avni.0999": "😍💣💣", "niharika._.af": "I really really wish to have a guy this supportive in my life ❤️❤️😍", "mdrinku9685": "Hot", "_winterains_": "💜💜💜💜💜💜💜💜💜💜💜💜💜", "its_dollycious": "The best boyfriend says it all 😍", "yatinkumar1010": "Caption contest - ugh don't mess up with me", "rnagarofficial": "Amazing click👌", "flawesomephoenix": "💗💗", "zsabiulla": "Hot sexy boob", "itsmesalmasazia": "At the cost of getting backlash. Why do u expose so much. I mean on occasions it can be understood but every now and then. Clothes have certain use else we would be wandering around naked . Plus breast are also part of secondary sexual organs.", "raaz.patel1": "😍😍😍😍😍😍😍😍😍", "roja.pvt": "I should say a million things about how wonderful this is but u know....", "dis_trouble_maker": "❤️❤️❤️ Luv uh girl...", "udan_khattola": "❤️", "vikramsingh_1986": "U look beautiful with open hair ❤️", "prachiii_.__": "I thought men like you @rahulb90 , have gone extinct. I'm so glad you proved me wrong ! We need more men like you.", "sharmarocky6386": "Sucking boob's 😘❤️🌹🌹", "edenilson4296": "😍😍😍😍😍", "sir.caustic_": "@ridhima_sharma11 hey there beb🖤", "akshay.jaiswal.in": "Loved the caption😂😂👏👏❤️❤️", "isha59011": "Boobs show for gaining followers 🙄", "rishabhkashyap167": "Ma'am I huge respect for u ... I don't know how to say these things but I like the way you carry on to the things you wanna support... I always HV smile on my face while seeing your pictures I m really feel proud ... 😊 May you live long ma'am", "sonaliiawasthii": "Powerful thoughts @rahulb90 🙌", "outrunning_karmaa": "Haaye...!! ❤️ nazar naa lag jaye dono ko. @redheadwayfarer & @rahulb90. U guys are amazing and yes, #bethechange", "daredevil0036": "LOVE Those MILCKY ORANGES💋", "aaqibmajeed007": "I only follow few celebrities u r 1 of them.....I ador u.....lucky rahul", "r.yewale": "Why you sad", "hottestgirloftown": "😋", "inglejikabetaa": "Hot❤️❤️😍😍😘😘", "anupriya_singh12": "caption 💕", "bawabairagii": "sometimes too real makes you lose intrest in that thing. I lose interest in female body after seeing ur photos", "sammal1188": "Munna Rahul, If you have so much faith on your love of life then you shouldn't be worried about my \"Negative comments\". My comments should not bother anybody on this page. You shouldn't even feel annoyed because my comment won't make any difference to you all. Isn't it? Why are you all afraid of my different opinions? All I want to say is focus on national issues as well. It's been 2-3 months I am requesting this but I haven't seen anyone on this page talking about national issues. All you talk about is sex, orgasm, boobs, nipples, traveling. That's it.", "bhavsarviru": "🔥🔥🔥🔥🔥🔥", "avstar06": "The men folk need him too!", "hetvi_alina": "U don't read the comments of your haters... I will fight all those morons for you", "_diikksshhaa_": "caption iss soo perfect. ❤️ can't get no more.", "m.b.adil": "Awww... didi kaisa bf rakha h .... ek no. Ka philosopher... sahi khel gua banda..😂😂 I learn a lot of thing from him how to deal with a gf and how to answrr her...😂😂😂😄😄😄", "nongthombam_rupali": "Powerful and stunning!❤️", "rachna190": "I love ur conversations.. he is partner goals!", "prabhakarsinha42": "Love you 😘 looking adorable", "eshwar.s.bujurke": "U LOOKING PRETTY CUUUUTE PIC 💕💕💕💕", "sumedharao": "You are honestly such an inspiration, your posts a part of what is getting me out of a dark phase. Much love to you and @rahulb90 . ❤️", "aish_2526": "Its lovely 💓💓💓💓💯", "_misariii": "He is absolutely right!! You inspire me and so many othersss!! I've told this probably a lot of times but I don't think you've noticed so I just wanna say that I love you so much and you are like the person me and other 18 year old girls look upto everyday! Thank youu so much, I am what I am just because of you! I've watched you since Girls on top and I am so grateful for that! Also the best thing about my birthday is that I share that with you, which is literally my biggest accomplishment! Thank you for being you!", "aye_sass": "💀😂 “ you should talk more”", "kalyanivatsala": "Damnit @rahulb90 you’re so right. In all ways, she is probably the best “influencer” I’ve come across. It’s only because of her that I know now that it doesn’t matter if I carry few extra kgs as long as I’m okay with it. Only because of her I know that standing up for yourself if not being selfish and mean. Only because of her I know that the way I feel about things is alright. It’s because of her that I know that I’m not the only one who feels awkward walking in a park at 4:30 in the morning because it isn’t safe. It’s only because of her that I know it is okay if someone can see my cleavage because my neckline is too low. I love her so much, I recently visited Mumbai and when we were about to land I said to my mom ‘Saloni bhi yahi Kahi rehti hogi’. She is like a sibling to me because whenever I’m hurt, I write it in her DM or some where else addressing her and that makes me feel 1000 times better. Everytime I’m feeling something, she writes something very similar and it cheers me up or calms me down or whatever. I can go on and on I love her so much! 😭❤️", "hidyaa_nawab": "You are an inspiration to us, I mean we all need to stand for each other, we need to discard these beauty standards and we need to be who we really are.", "alishaa2000": "😍😃😃😃", "__shraddha1877": "You are doing a great work ❤️", "rohitkidewani": "Your dress is tooooo long 😂", "nonsense_bug": "Bro. You're so damn creative. And he is right, you really have made a positive impact on my life🍑", "sajozachariah": "Whobthis sexy???", "richa_mourya": "Rahul u gotta find me a man like you or m gonna die single. 🥺", "thesameeroberoi": "Khoobsurat💝", "_sheeba._": "Omg caption on point. I love you. And it is so true what he said😍❤️", "prakash34445": "WoW", "hshmtpwryn": "🔥❤️😢😂", "shutter_bong": "This is such a lovely read.more power ❤️🙌🙏", "shwethah_paul": "Fuck the hater's who cares...🙌 we all just care about you.❤❤❤", "borkakotea": "You guys are such goals. Only love.", "obscureoptimist": "And all the haters/trollers... Am very sure don't even read the captions.. They are missing out on million dollar vibes and thriving on their cheap ones", "seventeen_.edits": "Sammal coming in 3.....2......1 with \"You feminists afs.......\"", "juhiiisharma": "I too need a Rahul in my life 😂", "chauhansugandhita": "And somewhere, some girl who was too afraid to be vocal about her opinions as an independent woman feels much better and happier and confident because your posts give her the strength, your words reside in her mind for the whole day and she's no more scared of the world. She feels confident in her body, in her flaws and knows now that whoever falls in love with her will fall in love with her completely, with all her flaws. ❤️", "theguywithoutaplan": "Oh 😍😍😍😍😍 how come you always manage to win our hearts with your posts and captions ❤️❤️lots of love", "muskaansehgal__": "❤️", "darkpoetessisme": "Caption is on point", "bmanoj2791": "🤣", "sayaliiiiiii7": "❤️", "manigangadhr": "wow wonderful 👌👌", "unnatibagri": "No matter what haters say. I love you @redheadwayfarer 🔥😘", "fitnessfreakammy": "💯👌👌😘😘💕.. I really like u plz ek br reply krdo", "_laiba_qamar_": "😂❤️"}