{"siddharth221080": "Nice 😘", "the_oceanid__": "Uski iccha bc tum log kon ho judge karne wale.. She has her own power on some things.. better we should not interfere but respect what she has written.", "saurabhdahale": "Gorgeous", "priyanka_0990_g": "Sorry but this is an articulated image, nothing natural about it. Everything else stops for me right there.", "deec_05": "@redheadwayfarer didi feminism ka matlab sirf nipples ya nudity dikhana nhi hota h, kya kiya h abhi tak aapne feminism ke naam par, bas nipple dikhane bol do ya yeh faltu harkat kr kr aap famous or hona chahti h", "skylightlion": "Alllllmost", "roshan.kumar.singh211": "Nipple dikh ra h tera", "imranshaikh061991": "👍", "__foxhole": "U know how to attract followers Beautiful🙌", "vaishhh.__": "@redheadwayfarer boobs aren't a sexual organ .but yea scientifically it's arouses different feelings compare to chest. But yea that doesn't mean people should rape or something like that. But more than science it's about mindset too. But yea if you see it as sci breast are indeed attractive and it's naturally attracts men. And that's true :) and @abigail_pande you can check her posts even she post nude pictures she is a yoga student but in a proper way and with a proper caption and sci. She always hide nipples and vagina and boobs too. And I amazed foreigners loves our culture and following it and we are busy promoting west . And following it. Just saying :)", "unique_sparkle_": "You go girl more love ❤️", "chaitali_dafda": "if u wanna make money thru insta give some good inspiration to the youth not by this type of cheap tactics...really shame on u..have some responsibility dont try to b kim Kardashian", "raj8718": "Nipples are so cute", "ssnskritix": "You're doing right @redheadwayfarer and everybody gonna proud on you soon ❤", "_lostmyselfinthetardis": "@imotiweighted wtf", "shah_nawaz_aly": "Turna dikh ra apka😍", "jordan_indian": "Damn🔥", "sohel_shaikh0009": "Wow😛😛", "priyabasu26": "@merlinrodriguez241 3rd part", "ramnarayankachawa58": "Fuck off", "warrior.brat": "Twitter allows showing nipples. If you want to seriously normalise female nipples, you can post there and start your feminism awareness, if you actually are bold as you claim on the rebellious posts about how Female Nipples are just a body part.", "mdeskman": "looking hot", "avni.0999": "Showing nipples is not feminism", "i_am_lone_warrior": "Saloni javaan ho gyi 🍼 ki dukaan ho gyi 😂😂😂", "priyaagarwal05": "Loved the caption 💓", "uphadhaya121": "Isska 🐵 ka account report karvao!! Yeh bandariya manegi nai!!!", "mohammed_danish_official": "Yr nip slip", "boymorgan2k": "Wanna dip those in choc sauce and lick softly for hours 👅👅👅", "__nirjhor_barua": "free the nipples....", "a.aarti11": "M smjhi nhi ldkio ko kesi freedom chaiye koi ldka y freedom kyu nhi mangta ki vo bhi Bina kpdo k road p walk kre yr jitna freedom m janti Hu vha mrji s rhne s lekr apni mrji dress ldkio ko chaiye to thik phno Jo phn na h pr atleast phno to ap kya show kr rhe ho logo ki Bina kpdo k rhne k liye fight kro short dress ya jesi bhi dress ho phno but atleast Kuch y nhi naked road p ghumne Ka right mango shame on u yr seriously or jis ldki ko y right chaiye go ahead but ap mind or heart dono s Puch Lena kya y right h Bina kpdo k to adimanav bhi the to agr dubara vo BN na h to itni mehnt krke hmne Apne apko itna develope Kiya hi kyu seriously disgusting Nd m least interested in this shit", "imdevsarswat": "Arre hmme Esi pic se koi dikkat nahi h To q faltu me itna Lamba Gyan post krti h 🤣🤣🤣🤣 bC KHOOD cover krti h or hmme nerrow minded bolti h 😝", "ishuhot": "Only indians have female god in world 🔥🔥 we indians don't need to learn \"how to respect women's\" From this western hijacked people, we are doing it from ancient times", "tanyasharma3": "🧡🙌", "_aynakus_": "♥️", "rishxp": "98% of cunts talking about the little peep from her breasts,2% of them talking about the caption and yet Everyone says \"India is my country and I'm proud of it\"Lol..", "umeshkumar_053": "Supb beauty", "neha_anand_raj": "Kuch b becho matlab feminism k naam pe", "a_blank_verse": "More power to you❤️✔️", "thatbrown_girl_": "I loved it... 💞", "rakserpentina": "But I am totally digging the Nails. ❤️❤️❤️", "kanak.vyas": "This was all that needed!! 😍🙌🙌", "dcentdevilvikram": "Arre Bhai Bhai bhai 😂😂😂😂😂", "im_grootttt": "😍", "akindrew": "#instamarketingfordummies", "reincarnatedme": "bnb 👍", "vitruvian_monk": "After all this gyan, all you are fighting for is being free to flaunt your bodies and have sex? Probably 80-90% of the women in India do not even have freedom to make basic decisions about their lives. But no, you should have freedom to show boobs 🙄", "brijendrasinhvanar": "NEO PAYEGA BEHEN AAPSE", "sanjanabk1406": "Feminism k naam pr apne shonk pure krti hai", "matt_murdock11": "The pic in ur post and the angrezi u wrote doesn’t relate.. but still i love this post (because of the nipple) keep posting ur semi naked pics... we horny ppl love such posts and do not bother about ppl who criticise u for nudity and other bullshit. वो लोग भारतीय महिला सशक्तिकरण के ख़िलाफ़ हैं और पुरुष प्रधान सामाजिक व्यवस्था ही चाहते हैं । Love u babe , i love ur pics", "sharad__deshpande": "💖💖", "into.my.wardrobe": "I love you Saloni ❤🌻", "iaatifuzair": "Lit🙈❤️", "hottestgirloftown": "Beautiful tities 😋", "gurprit_gb": "🌷🌹🌷🌹👌🏻", "nayana_premnath": "If there's one Indian woman I'd love to call a true influencer, here in Insta, it would be you! I love absorbing all the love and compassion that you spread! Thanks for being such an inspiration for all women, feminist or not!! 🥰", "criminaldefenselawyer786": "What a thought I want u to be a president of India ......", "manik.kapoor.88": "Super hot sweetheart. Sexy legs", "mradul_bansal": "😂🤣", "namrata_0605": "Yes we support free the nipple campaign. Please free your nipple. It will make everyone strong", "anshu__choudharyy": "Full sexy full hot 😍😍😍😍😍", "henna_hub_sydney": "I adore how you give zero fucks to all negative comments x", "kriti_mist__": "#feminismfordummies 🙌 Caption 👍🏻 And you are looking prettier 😍😍 #myinspiration @redheadwayfarer I support you", "anukshabharat": "🙌🙌", "rahulmuttineni": "This is the most mature response to all the trolls on feminism made from a place of love instead of hate. Thank you for this! 👏", "sharmarocky6386": "So beautiful", "ani16_09": "❤️", "ashishbhva9966": "wahh... sexy..", "ashraf.hyder": "Thinking being feminist is such a foolishness, you feminists are the only people who thinks you are weak and differentiating yourself from men.", "s__s_ahmed_": "🤞", "rashidchaudharyy": "nice nipples", "akansha.gupta06": "Why you trying to show Private stuff . Is it so necessary ?", "wolferian_": "Free soul", "warissaiyad007": "Ohh", "that.cool_guy": "#freenipples", "anishak055": "I LOVE YOU", "_mateen_qureshi": "So hot and so stunning 🔥🔥🔥", "mansoor___ahmed": "Kabhi show hi kar do ap ka nipple @redheadwayfarer", "happygocrazy_": "You motivate me every single day @redheadwayfarer ❤️", "ohhfatimaa": "@redheadwayfarer YOU are the best and this makes a lot of sense❤️", "samriti_goel": "@msharmonys for some reason...I really wanna know what do you feel about this image and this caption", "the_racerback_mama": "Saloni💖💖💖 You're born to write! Much love xoxo", "aliaahmed3641": "This is one of your bestestestest posts out of your other best posts. I love it! True inspiration. I hope people now really understand what feminism actually is", "iamkirtiwadhwa": "Well said..😊", "ramesh.v2509": "🔥💓💓", "shakeel1bhutto": "Free hone do naa agar Itna dum hai to", "dpritze": "❤❤❤❤❤✌✌✌✌✌", "rehan0007ks": "🙈", "asshileapple": "Saloni, you're the best. I love you❤️❤️", "nishantmistry90": "😍", "chokobartea": "This made me feel soooo better today! You are an inspiration...way ahead of the time!", "bablu.13": "Superb... Sexyyyyyy🔥🔥🔥🔥", "gulshanchaudhrey": "Hot🔥", "vijayssbss": "Ye ldki na muje bahut pasnd h .... dikhane me sarmati nhi h", "manoharpargai": "Is exposes means feminism, how shame", "sunidhi__sharma": "Some people don't have a life it seems. Can't we just celebrate our bodies? Narrow subjectivity towards nudity is what's killing your brain. Let it think beyond. A slight sight of a nipple is creating havoc in your minds, I am sure some men just roam around with a naked torso like it's nothing unusual so it's really hard for me to comprehend the hate women get for this matter.", "hughjackman1100": "🔥", "priyankaa.sh": "In love with your mindset❤️", "ardima_bajpai": "@ishah_gupta you should read this in order to make people understand what feminism actually is", "riya_shukla01": "Bow down to such greatness such relevant thoughts ! you nailed the real meaning of the feminism in every single posts of your 💛 @redheadwayfarer more power and love to you💓", "vishal_rathore_007": "So beautiful💋 love you😘", "zafarwestern": "💗🌸💗🌸💗", "rahul.thorve": "🔥🔥🔥🔥🔥", "_singh_aditya": "She is just cashing in the insecurities of young girls. She is a privileged Australian girl pretending she has figured out feminism. Just go to indian villages and you'll see yourself that they don't care if they can show their tits and ass, they just want basic human rights. If you can't compete with actual models of Instagram, don't put on a facade of feminism and do the same. It's just plain disgusting.", "unnattti": "you guys are slut shaming her and for what ? showing her nipple ? y'all really act like she's doing it for fame and i'm sorry i just snorted. i guarantee y'all that if a guy posted a picture, showing his nipples, none of you hypocrites would've been here judging him. and if a woman (saloni) posts a picture where she doesn't really care if her nipple is showing or not, y'all attack her. this is what feminism is. if a man does it, y'all are gonna hype him up, and if a woman does it, y'all are gonna judge and slut shame her. how is this even equality? this is what feminism is. fighting for equality for both the genders. if you guys can't handle it, please leave with your 60's thoughts and take your negativity with yourself. thank you.", "sagar.samrat_1701": "Sexy", "binay825": "Nice", "moon0640": "🔥🔥", "fahad5731v": "Moron😂😂😂", "game___slayer": "Chuchi dikhake agayi bencho feminism ki badi badi vasan marne", "filmyladkii": "💟", "gourav_khandelwal__": "❤️❤️", "chetanverma0013": "Raw! 🧜🏻‍♀️", "harshsagwal.harsh": "Pura hi dekha de", "aman00019": "U r not a feminist!! U r just a shameless attention seeker. @redheadwayfarer", "i_daddysangel": "🧚‍♀️🧡🧚‍♀️", "vidushitandon1605": "You are really an amazing women.❤️ truly adorable 🌸🌸. In a society where everyone just wants a gossip session abt any celebrity,without actual knowledge abt the topic being spoken...you taking a stand so courageously...is just soo amazing❤. Love you soo much ma'am. May you always be empowered with strength. 💯", "yvishal8626": "lovely legs🔥🔥🔥", "rida_malik555": "Feminism for you basically means to roam nude on streets like a male can ... nd tht leads to aethisim bcz no religion Allows nudity which u call gender equality @redheadwayfarer", "prashhy": "My cock is tight now❤️❤️😍", "_alzenaz_": "🔥🔥🔥😍😍😍😘😘😘 #MoreLove 💕💕", "pearl.what.is.this.behaviour": "Saloni, i seriously need your reply.. I can make a big change.. But what if my parents stop me to make it.. They don't let me interfere to empower someone else or to protect their rights as well as mine.. What can i do here.. I cant convince them anytime.. Because they are my parents and in India specially in rural areas you are not allowed to speak in front of them.. Now how can i convince the parents here who stop me everything to make some change.", "kanikaprakash_": "If u really get over from zooming in the picture , pls do read caption because that's the real thing in this picture ❤️🙌🙌", "shww.ata": "Yess👏👏👏🙌", "indolent_oddity": "😍😍", "bombaybollywood": "❤️", "shanky.loves.u": "😍😍😍😍 u r just awesome @redheadwayfarer 😘😘", "elilahfurtado": "Fuck off man", "gym.lovers71": "😍🙌", "sammal1188": "I can understand. Feminism doesn't have any cure.", "104yogendra.mayur": "Nipsss❤️🔥", "wehehehheehehe": "@freethenipple", "asthaverma318": "@redheadwayfarer Let me just write all of this because this is the only place where people might actually read it. Before you all anti-feminists start saying shit like , oh you're a slut , arrey poora hi utaar deti itna bhi kyun pehena hai , teri jaisi ladkiyaan hi toh slut hoti hain , feminism ke naam pe nudity promote karti hain. Tell me something , there are so many tribes in Africa where people don't wear clothes, Neither men nor women. They aren't raped. You'll never hear a woman in an African tribe was raped because she was naked. All of the people are naked. We're born that way , the clothes purpose was to provide warmth in the cold and a sense of fashion as we evolved. You all religious cunts in the name of religion and beauty and grace twisted everything to suit your needs , to suppress women and even some men because you sure as hell knew that they would come out stronger than you. Just to gain power , you all stereotyped women being graceful if covered from head to toe. People, all the rapist fucks are worse than animals. Even animals try to win the female , not go ahead and rape them. You all neither understand the concept of consent and clothes. Let me let the truth out. You all are no fucking saints. The reason you rape is because the way you've grown up , seeing the society the way it is , issues made out of fucking breasts, you think they're too big of a deal but they're just parts of the body. All those oppressed physical and emotional stress of not getting laid drives you crazy and you cannot fucking control your own self. So you all rape , because you sure as hell know that with the mindset you have , no girl would willingly get laid with you. The reason why a little part of her nipple out is such a big deal to you is because it's unusual to you. You've never seen it. To you it's slutty to be posting such pictures. It's her choice. If i am fully covered, that should be my fucking choice and nobody else's. Understand the fucking point.", "diya.bose99": "🔥🔥", "_17_c_r": "🔥", "vj41219": "❤️", "ganeshsonawane652": "😍😍😍😍😍👏👏👏👏👏", "indian566": "😘😘😘😍", "melek_yilmaz2793": "❤️", "sajonar_": "Gawd i love you❤️", "selfobssesed047": "Flaunting nip slip intentionally is the new definition of feminism according to this money greedy girl. Just want more ads and money in the name of \"influencer\" ! Asshole", "wildcardmoonchild": "You put all of the thought's we've thought and are yet to think into words", "surdoll": "Beautifull 😊", "nishi4127": "❤️❤️", "imtiyaj4212": "❣️👌👌👌😘👌👌🌹❤️🌹❤️🌹🌹🌹❤️🌹❤️🌹❤️🌹🌹❤️🌹❣️❤️🌹❤️🌹❤️🌹🌹❤️👌🌹😘🌹🌹😘🌹😘🌹😘👌😘👌😘👌😘👌👌👌👌👌", "bhargavi_bhatt": "How much more I fall in love with this human!! This feels soo human.. Soo basic.. Soo much like home!! Soo much love to you.. You go girl! Hatsoff! 💕", "zck_d_souza_": "That's so eternal", "adharsh_xmokie__": "❤️", "arpita_0701": "Couldn't be more prouder. This is so daring.", "that_bohemian_": "Why do you make me love you more every time? @redheadwayfarer.. I mean WOW. I love your acceptance and the way you write. Hats off to you. I love you more now! Wish to meet you some day!", "ankitawale4": "inspiration😍😍", "jigs__3646": "#kadak_meri_JaaN_❤️❤️❤️❤️_😘😘😘__", "sweet__november99": "❤️❤️❤️❤️", "lovelyjain80": "It feels great to see women like you doing something for this country. Sometimes i feel how difficult it can be for you to choose a picture like this to post when you know people are very narrow minded here but then I realise ‘ we all are sent to this universe for some purpose’ may be this can be your purpose. I’m glad that actually someone is trying their level best. It also feels great to see people in other countries do support models without judging her/him. I’m so proud of you ma’am. One day this generation will be ❤️", "ad_itya4616": "🔥🔥🔥😍😍😍", "biebersgalx": "Best Wordssssss!!!!!!👏", "_mr.aman._": "The beauty of Women ....😍😍", "kartiklakra": "So adorable ❤️😍😍", "imohdnabeel": "Pretty soul 🌹", "vmartografy": "Excellent feed ✌️👌", "neheart__faizal": "Bra nahi pehenti ho aap why", "fambruh_saswat": "Verrry preetyy😍", "adiitiitii": "🧚‍♀️fly high❤️", "dead_5321": "🔥", "avdarth": "Exactly. Even if people think that we have reached a higher level of women empowerment we still have a long way to go. Feminism is helping women get that equality and respect which they always deserved.", "kujur_r": "😍", "ballack_nil": "🙌🙌🙌", "saivartika": "I can feel people zooming into this picture just to make sure their eyes see the nip. Issokay guys calm down. Make sure you read the caption too❤️ @redheadwayfarer", "cantnotprocrastinate": "I AM HIGHLY INSPIRED BY YOU, SALONI. 🌼❤️ keep writing, it really motivates and teaches so many of us here. Thank you. 💕"}