{"_mia_lynette_": "Love this💕", "lovelifejanell1": "❤️", "jessanotherday": "I love you! You’re awesome! 😍 thanks for continuing to educate the masses!", "alyssa_hohorst": "@renae_barry 🔥", "decolonizingtherapy": "Yassss sis 🔥⚡️", "ssaerbearr": "you are my heaven on earth ❤️", "xonayimaxo": "😍😍😍😍", "seejosiesmile": "Honor the body that got you where you are today 🖤🖤 it's a bit difficult with a degenerative illness, but it is achievable.", "gabrielwatson9": "🌚🌚🖤🌹😘😘😘🌹🌹🖤", "megawheeze": "#RaquelSavageForPresident", "stella_cmyk": "1. yeeeees 2.oooh definteely 3. both 4.It helps to communicate back to determine what works, honoring means wellness and longevity 5. anytime ignore either I'd regret it immediately or much much later", "based_facts": "Never disappointed 🔥📸", "gaiagraphy101": "This is so beautiful", "nox_solyn": "1. Yes 2. Yes, after lots of therapy I've had to learn to listen to it. If I don't, I end up dealing with my BPD making me suicidal af or manic lol. But it also helps even in every day situations. 3. I try to listen, but I'm not sure I know how to all the time/realise its trying to tell me something. like having chronic fatigue isn't normal and means there's something going on but because my health givers for a long time were shit, I honestly didn't realise for a literal decade that my body is suffering. 4. Yes. The more in tune with your body you are the more comfy you are with it and with general life situations. Like listening to your gut, listening to your body's needs etc etc. 5. Lol yup! The chronic fatigue I finally decided to listen to and get checked out and my body and brain has been wrecked to breaking point for damn near 30 yrs - all without me realising. I also learnt I have appendicitis for about a decade too. Apparently having organs jiggle and feel weird if you touch a specific spot is not normal lmao. And also stuff like my BPD acting up when I didn't realise I had it, not realised what my triggers were etc. There are plenty others lol it's been a learning process and I'm sure I've got plenty progress yet to make. 6. Definitely. Kept myself safe, whether listening to my gut, or learning my triggers and avoiding them as much as possible etc, realised stuff I was doing wasn't good for my body and what things were, etc etc. :)", "yassedge": "I have MPD or DID as others like to call it. For me, at times it is hard to connect with my body because each personality has a different relationship with it. When i am just Yasmine, level headed and neutral, my body is what leads me. It tells me when something is wrong externally and attempts as much as possible to circumvent me from anything that doesnt serve me. Now at the youthful age of 23, i am listening. I dont stop there. I listen, i hear, and i adjust as necessary. When i listen, things go smoothly. When i ignore, i quickly realize why i should have listened. It’s as if my body is 2 steps ahead at me at times, in a good way. The more spiritual i become, the more i walk my path, the more i hear my body. She is loud and feisty and blatant and even aggressive at times. Currently, i am silencing my body’s impulses and programmed reactions so i can officially dead old habits.", "o.g_jayplay": "🔥🔥🔥✌🏽", "realovecstasy": "Loved it", "edalston885": "💪🏽♠️🏁🏁🏁", "django_blax6": "Cute💯🔥🌻😍⚌💖💦💦", "mrfix_it_95": "Taller then them", "78hezton87": "💋💋💋", "warbenbig": "Beautiful baby 😍😘😘😘😘😘😘😘😘😘🌹🌹🙌", "mjblinkz_": "💯🍆💯", "southern_gentleman225": "Simply lovely🔥"}