{"diego_doesit": "🙌🏾😫", "acf1uid": "Yes, commitment for me becomes about honoring the space of vulnerability and transparency, and being able to look at together (key word!), the impact all the “what if’s” and the unknowns have on deeper levels of intimacy and healing. Thank you for pointing to this need as not “needy” but necessary to cultivate a sense of safety.", "quell87": "😍👑Goddess", "mrbigfreaky": "Damn , that's some good looking eating right there !!!!", "momentum8849": "🔥🌟🔥", "therealanomaly_": "Love the caption .. I'll stuff that ass up tho 💙🔥", "ryancartermedia.tv": "Cake🤟", "hustle.in.heels_": "Journaling is the most effective means for me to work through something, it's just not my go to when I'm experiencing something. Working on changing that though.", "leilalewisxx": "thank you for putting exactly what i’ve been feeling lately into words", "1089ad": "🎂 by the pound 💪🏾🔥", "p_a_t_r_i_o_t_a_br": "#QUEEN", "phatdon22": "😻😻😻😻😻😻😻😻", "dolla_onlyus": "Need a lap dance.. u too fire", "forever_king101": "Ass so phat ❤️", "thizbuckwheatyo": "💦💦", "iamkingmoscatoi": "I see something I want", "hellateaseapparel": "Amazing Azz❤️❤️❤️❤️", "phillyguy178": "cake 🎂🎂", "therealyungrev": "@realyungrev", "lordstoney": "sniffable", "handsomeman40": "Good read so far. Certainly quite thought provoking to someone who can relate. 👏🏾", "chriscrayzie253_": "Jelly cake", "lexdiamond64": "#nothingbutrespect 👑💦💦", "thebossprettyp": "Gotdamnnn you got a big ol juicy fat ass donkey shorty 🍑🍑💩💩👅💦", "rolandjclarke": "What's that taste like?", "s.q.2022": "🔥🔥🔥🔥", "sharkkpaniero": "😍😍😍😍😍", "gellygelz": "Girl🤤", "guztavo.999": "🍑🍑🍑🍑😋😋😋", "kweenkreole": "Raquel 🔥😳 oooof", "mz_harvey2u": "Mmmmmmmmm", "scholarkardashian": "This is really helpful to see laid out because I feel the same and often feel like I’m asking for too much in ‘casual dating’. Thanks Raquel ❤️", "dee__monte": "🤤", "jayrelic": "Basic", "hot_commodityy": "Love this. Done with the going with the flow BS. Clarity is necessary.", "mrdnatl81": "👀 Looking like two honey bake hams‼🍖😆😆😆", "lcrs_robotisthefuture": "💫 @raquelsavage", "thereal3gyptian": "Wtf that real or fake", "_dcarrie": "A word!!! Thank you for this", "sexninjaentertainment": "Simply beautiful insight on your healing and learning process...", "texasmade12th": "Baby got back ❤️❤️", "kieranblake": "So relatable phew", "bigreg71": "Oouu Raquel that ass is sweet", "not_typically": "These are some of the same feelings I am processing in a similar situation. There is so much cost to pay for free love. I am a person who values freedom for myself as well as any partner or romantic Interest I deal with. But “titles” as restrictive as they can be at least do define in a sense where you are at, and the privileges that come with said title. However when you are human things happen and at times not at the same pace or even that you ask them to happen. Im finding that im strengthening my inner monologue to be able to work through things that may come up emotionally for me that may contradict my personal ideals and philosophies about love and relationships. Allowing myself to be human and continue to grow an expand my mind by questioning myself regarding my emotional states without having to impose those uncertainties and confusion on my partner or love interest. It’s amazing being able to process and work through your feelings with out denying or feeling intense guilt and shame.", "lovelustlissa": "I need to work harder on expressing my feelings logically like this. I dont want to say good job because I feel that could be patronizing but I want to applaud you for thinking in this way. I'm not quite there yet.", "brilliantmindspros": "Yes lawd", "newamericantony_official": "💛", "_djesy_men_of_mayhem": "@aston_cldgs", "babyohso": "Delicious😰🍦🎂👅", "p_air_thegreat730": "Wifey 😘😘😘", "harmoniemarquise": "Oooh yes. Needed this today!", "the_essence511": "Bakery", "leonardorangejr": "Fatty❤️", "cihange": "💯", "joceirania": "😻😻", "alillyriver": "When I tell you shiva literally placed this in my path, going through these exact feelings. Extremely triggered rn, and your caption comes, thank you 💛", "phatty531": "😍😍😍", "ayeboogey_freecapitalfamily": "Ur smart and gorgeous you'll find someone who can match ur heart and mind", "_bigrobbo": "🔥", "pacolipse": "Nice angle 😍😍😍😍", "abhibanna765": "Teacher", "elegantlytasteless": "Mmmm this puts a lot of what I feel into words (also stealing this butt pic angle for future thirst traps)", "_iputthehoodon": "@raquelsavage Ass Phatter Than A Swamp Possum With The Mumps(teddy From ATL Voice) 😂😂🤣🤣", "vvvanavvv": "*sigh* This excerpt. Thank you for sharing.", "loyalsavag3": "Question. How can u feel any kind of way when you hv a fansonly site? A real man doesn't want what's his all over the net for random dudes. I'm sure he's jealous of that so he evened the odds.", "nefwill11": "You must taste good af"}