{"aisha_chey": "Also, i see some are concerned abour period poducts! I've been trying out different all natural products for about a year. I only use pads, but Target's brand is pretty good. Seventh Generation has good stuff, i heard honey pot co. Is great. JUST (period) is good. I tried the cup and failed lmao. But that honestly seems like one of the best options. I believe all of the those products come in tampon form as well.", "jay_c500": "Beautiful", "lemony747": "I'm in love🔥😍❤️💯", "bygbootybrit": "Hey baby girl", "footboylance": "Daddy", "medusaglare": "tbh mine was traumatic as hell cause i got it in india and in my family’s tradition, they make the period havers isolate for 7 days ✌🏽🥺", "hennyanredbull89": "SHEESH🔥🔥🔥", "eburnsprepjerks": "🔥", "305miamijae": "You wearing that!", "anneliejoy": "The first memory I have of my period was some time in middle school. I was on vacation with my dad and siblings. We were a very conservative family and never discussed hardly anything related to sexuality. I remember we were at our campsite and I just started feeling horrible cramps and I spent the next hour bent double while my dad and siblings just watched me in pain not knowing what to do. My dad offered me ibuprofen (which he would regularly do from then on if he ever thought I was on my period). It was so embarrassing 😬", "bitch_fuck_outta_here_idgaf": "Nice toes", "manuelle1234": "Te la puedo meter?", "1markowen": "The more openly this is discussed the better. Bravo to you Raquel", "_filthyanimal": "Yes ma’am 😍", "frreshman": "@raquelsavage what's mean sex coach?", "juancarlos_valenz": "😍😍😋😋😋🔥🔥🔥🔥🔥🔥🔥🔥", "mr.good_credit": "Pretty feet!!", "damodricharp": "Cute 😍😍😍😍😍", "leader_of_the_jets_": "Your killing that white nail polish damn you’ve got some pretty feet beautiful delicious sexy feet 😘😘❤️❤️😋😍😍😍😋😋❤️😘😘", "sadeeq_sly": "Damn U're fucking hot & sexy baby🔥", "iamleopardhead": "😍😍", "sniper_sean23": "😍", "alialleza": "👌", "desirebutwithane": "I was 10 years old. I woke up to get ready for school. Went to the bathroom and looked down and saw all the blood. Chonies and pj pants were covered in blood. I freaked. But I knew (kinda) what a period was so I had my sister grab me new chonies and a pair of pants. I yelled downstairs and told my mom to come upstairs. She handed me a pad and let me stay home from school and made me a tree’s before she left for work. Then that day/weekend told my whole family🙃", "kamran.pdf": "be my mother please i am obsessed with u", "da_vid5467": "Gorgeous", "nolahustla": "Sexy as a mfa", "goldmouth374": "Looking DELICIOUS!!!!", "drhighstepper06": "Period or not Just want to say you fine as good wine", "thankyounicky": "Love you ❤️❤️❤️❤️❤️❤️❤️", "periodmiami": "Yassss!!!! Thank you for sharing your #PERIODSTORY with us @raquelsavage we are so happy to have you! 🔴🔴🔴🔴🔴🔴", "caprice_classic_24": "❌⭕️❌⭕️", "sin4winn": "Sitting on the toilet at home screaming for my mom to come while she was screaming at me to come to the tv because 9/11 was happening. Yeaaah very clearly memorized.", "dogmin2007": "If juicy was a person 😍", "qpshizz": "Whole whore", "knightlyangel": "I was 11 & I woke up feeling normal then went to the bathroom and it was there! I was super happy because I had been waiting on it. This was right before school so I took a couple of my mom's panty liners and put one on after my shower. Was happy the whole day and even though my mom and I went to school/work together, I ended up telling her on the way home. It wasn't treated like a big deal but I did get a congrats👍", "hersheydomme": "Lmaooo omg I wish they threw me a period party, its a little embarrassing but hey, if there's cake I'm down! 😭😂", "mf_joshua": "😍", "bigreg71": "This is sexy. Nice picture.", "missperchay": "Alright so I was a whole ass tomboy prior to this shit 😂. It was the summer before 8th or 9th grade, can’t remember, I came in the house from rough housing outside and boom, there’s brown blood in my draws lol. I’m sitting on the toilet kinda scared but not really because my mom made me watch some vhs about my period and we had a assembly at school about it so I kinda had a idea but didn’t really know what to do. Anyway, I show my mom and she gave a liner because it was so light and barely red. A few hours later it kicked in full throttle and I bled everywhere 😩😩😩 she told me to use pads because tampons were hard (they weren’t and by 10th grade I was wearing them almost exclusively) and that was it. I dealt with excruciating cramps that led to me being on BC for regulation and 800 mg ibuprofen. And I’ve hated my period ever since 😂.", "fatimakojima": "Ooooooh 😍😍😍", "losangles_la": "I love your pretty skin baeeee🔥❤️", "broadsquiat": "🙌🏾✨", "only1jshea\nVerified": "Verified", "wightchocolate": "😍😍😍🔥🔥🔥", "vannajanna": "I totally knew everything about periods, I guess except that it's not always going to look like bright red blood. I honestly thought I was pooping and couldn't like feel it.... anyway I loved my school nurse and told her and she was like WELLLLL you might have phantom diarrhea, or you have your period. very embarrassing for sure.", "sabrinabier": "Stunning", "hannah.corinne": "My mom passed along the same belief to me, and I now also exclusively use pads! I find them so much more comfortable/natural.", "knotkewlenuff": "I'm very jealous I never had a period party lol", "ssaerbearr": "why do you use pads now? usually it’s the opposite (from my experience, people are anti pads and pro tampons), so i’m curious to the change!", "hthr.mason": "Omg what a cute story. Love your mom", "hanakout": "Was taking a test for private high school enrollment 😒 I got in, but my period pretty much stayed on that difficult and unwelcome tip for a while", "tiagyrl": "What about diva cups their supposed to be safer , the cotton in pads and tampons are sprayed with horrible chemicals which is why they feel so many women are having female issues from cancer , endometriosis, andenomyosis, tumors, the list goes on not to mention all the hormone disruptors in our environment.", "sextherapistjen": "I swear black families always announce the day you get your period lol. I ended up starting my period when I was 10 years old. I was actually at my father's house for the weekend in the middle of a snowstorm when it started. I called my mom and ask her if this meant I started my period. She told me yes and my dad was he able to clear out enough of a snow path to take me home to her 😂. My mom sat me down and gave me a full-length talk about periods, pads, and tampons. She showed me all the different products and let me know that pads were probably going to be best fit for me since I was so young and so small. It was super embarrassing having my period at 10. I was only in the 5th grade and no other girls had their periods yet. So I very much felt awkward and out-of-place because I couldn't relate to anyone.", "nguemasalvadoresono": "Pussy", "rachelfishy": "I pulled my pants down to go to the restroom while shopping for a friend’s birthday present and saw a teeny tiny blood spot. Like your pinky nail. I went to my mom and said “either I have a cut somewhere on my vagina or I just got my period” lol. Wasn’t that exciting. I didn’t have another “period” for like 6 months... so it didn’t change my world very quickly.", "yorkiejill": "I think my mum had given me some book about what would happen and eventually it started when i was at a track meet and i was wearing white shorts 😭 i shoved toilet paper in there and just...dealt with it?! And did the same until i had money to go buy my own stuff 🤷‍♀️ never occurred to me to tell anyone.", "nickfury187": "\"So boom\" lol love it", "romi_chase": "I never told anyone. I just bought my own tampons and pads with whatever money my dad gave me for whatever reason", "toyax": "Miss your thought provoking thirst traps", "hellskells6": "Also that’s so fucking cute that y’all had a period party 😂😂🙌🏻🙌🏻", "53x_r0b0t": "I got mine one day while my homeless father was in town visiting me. I was 23 or so. We would just sit around in his weird old car all day and look at my school textbooks. This one day I think we went somewhere for dinner (like a pizza place) and I saw the 🩸. Used toilet paper as a pad, and never told my mom, until later when she noticed a drop of 🩸 in the bathroom.", "emilia__phillips": "my mom was in India at the time and i wasn’t 100% sure at the time that it really was my period and i was about twelve so i went pee and made my dad check if it was « enough blood » to be my period! I was so embarassed but my dad was super good about it and gave me a pad and said my mom would tell me more when she got home but i already had gotten the full talk before so i knew it was coming", "queenafronam": "I actually thought God was punishing me for masturbating by having me bleed. I didnt know what a period was. I got mine at the age of 8 or 9. I didnt tell anyone. My mom found a pair of draws with a bit of blood in them and told me about periods.", "benditlikelacy": "My first period was on valentines day in seventh grade 😂 i was at home thankfully. My mom only let me use pads for a long time but i was eventually sneaking tampons. Which really was an L bc i didn’t know what i was doing and it was uncomfortable affff. #PERIOD", "quell87": "😍👑Goddess", "tropichocolate": "So, I was the girl who shoved the whole ass tampon applicator up there the first time😂 I even remember asking myself why the push stick was so hard to pull out from the shell of the applicator🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️. I obviously need this info!❤", "beeyou64": "@chloemeowdavis", "erinannfam": "Girl! You should watch the @ilana comedy special on Prime and start a @thedivacup revolution. I’ll admit, having my hands all up in there during my period can be kinda gross but once you get it, you’ll never want to use pads or tamps again!", "lemmegetuhhhh": "Thank God for black women 🙏🏾", "cocomoe_compton_joe": "Gorgeous 💎💎💎💎💎💎💚💚💚💚💚", "caprice.g_": "I went to the bathroom saw a little spot of blood. Ran and changed right after. I told my mom something was wrong but didn’t get into details 😂. I didn’t know how to explain it. She thought I was lying then sent me to school. It got worse when I went to school. I started freaking out ran to the nurse. They called my mom to come pick me up. When she picked me up she had my older brother and my aunts with her 🤦🏾‍♀️. They explained everything to me gave me pads. I was confused how my brother knew about this stuff too. Then they took me shopping & out to eat 😩😂", "mrmiracleo": "I love u 💖💖", "giorgossparos": "❤️❤️❤️👌", "janaca_": "Hair 🔥😍♥️", "tank__grrl": "I would have loved a period party.. I was soooo scared I though I was dying, it started earlier than my friends so I didn't want to tell anybody and up to that point my mom never talked about it 😭", "reeducatehumanity": "I honestly don’t remember - how weird is that?", "breiabby": "That’s so interesting bc I literally had the opposite experience with pads v. tampons! I exclusively used pads bc I thought tampons were gross (and painful?) all of my life until like my junior year of college. I couldn’t even put a tampon in until college so I missed out on many water park trips and pool time bc of my period growing up. Now I use only tampons. Always, alway, alway, have a pad on me tho! Just in case! For me or a friend/stranger!", "nleshed": "Thick thighs make the 🍆 raise....", "sanhopeless": "I felt relieved because my 2 younger sisters already had it and I wanted it so bad at that point already", "noah_minustheark": "I got my period and shouted from the bathroom “MOM DAD IM A WOMAN NOW” 😂 fast forward to now when I’ve learned that tampons and pads aren’t my only options (I prefer period panties personally), and not only women get periods (I’m nonbinary)!", "thatssooopink67": "❤️ all I remember is I was a late bloomer 🥺 lol I wanted it so bad cuz all my other friends had it 😅", "gigilarsen": "I got mine randomly one morning before school and panicked; I used a giant wad of toilet paper. That was my go-to trick for about 5 months before I got the courage to tell my mom I had my period 🤦🏼‍♀️", "ladybananaaa": "I remember being in class in sixth grade and I honestly did NOT notice what was happening or that I was even bleeding and when I got out of the seat the kids next to me go \"Eeww! Whats on your seat!?\" and the whole class started freaking out.", "g.r.a.p.e87": "🙌🏽🙌🏽🙌🏽❤️😍", "mello_timothy": "My firs time happened while I was home. It was during the holidays and when I went to the loo, there was blood in my underwear. I didn't freak out that much because there'd been people from @always_brand who'd been coming to my school to teach us about our periods and how to react to our first time. So I went and told my mom and I think she was kinda shocked because I was so young (10) but she tried to conceal it and drew me a bath and we had a talk about it. It was a good experience for me thankfully.", "fatfuzzyfrankly": "Oooo mine wasn't that good. I got it while we were in the grocery store. My mom was in one of her monster moods and she had my cousin along with me and my brother. I tried to tell her what happened but she was so pissed and harried she wasn't tryna hear it. I tried to tell her again at home - she was legit like \"do not talk to me just watch these assholes.\" Thankfully they'd already had the class about periods in school so I just grabbed a pad and went about my evening helping her out. I finally told her the next day. I can't remember her reaction so I guess it wasn't a bad one. 😐", "kapital_kay": "I was 10 when my period started & my mama was pregnant so there were no pads in the house so we went to Kroger to get some pads & snacks & we watched the golden girls all night & she let me skip school the next day 😂😂😂", "jjones07065": "Looking like lunch😍🔥", "brownsistabasics": "I’m currently bleeding as I tell this story. I started my period when I was 8. I went to the bathroom and seen blood in my panties. So my homie who lived directly across the street gave me a pad from her mama bathroom. When I got home I called my mom like I always did and told her I had my period. She told me to grab a pad from underneath her sink and that was that. My mom also got her period at 8.", "serenity_says": "Literally the exact same...went to pee, saw blood, thought i was dying and then my mom announced it to everyone 😂🤦🏽‍♀️", "iamactressnik": "lmao embarrassing lol. I remember crying my ASS OFF in the bed talmbout now I’m gonna get pregnant and have babies... Mind you, I was a whole ass virgin. 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️ Looking back, Imma assume it was my first case of pms. Lol and to this day, I’m still a weepy ass hot ass mess right before my period comes 😂😂😂😂", "team_adw2": "Damn", "_illadelph": "First international trip with my mom and little sister to Paris. Felt shitty and was too embarrassed to say anything to my mom the whole time until my sister yelled out loudly that I was bleeding. I need some new memories of Paris lmao", "bonesvreux": "Lmaooo, my mom took me out to dinner and my dad came into my room and congratulated me on my “ongoing journey in womenhood,” Ima def throw my daughter a period party!! Normalize periods!!!!!", "ricrahk": "Damn you so damn bomb", "prorambles": "I remember getting out the shower at night and putting on my underwear, looking down and thinking that there was an overwhelming amount of blood. We’d had the talk about 4 months prior but that didn’t stop me from panic running to bang down her door. I remember showing her the amount and her laughing, then helping me put a pad on. I didn’t do tamps til about 10 months later, but I figured it out solo.", "elysiaamarie": "I just remember crying and saying “I don’t want it”", "remembersmile": "Mine is completely different than yours. I was also in MS and home from school for whatever reason. I go to the bathroom and saw that I was bleeding and patted my vagina with tp and go on with my day💁🏿‍♀️. My mom finds out that I bleeding and gives me THE TALK and tells me that I can die using tampons. That’s it"}