{"godofcurves": "🔥🔥🍑🍑🔥🔥", "luvonwax": "Unrelated question, do you have any tips for how you handled the healing process for your nipple piercings?? I got mine pierced last year, but unfortunately they started to migrate so I had to take them out 😭😭", "ozman694": "You're such a and perfect work of art!", "i_hart_nerds": "IUD for the win! I don't get periods anymore and I couldn't be happier! 😁", "herculoy28": "You're an amazing intelligent beautiful golden goddess honeyglazeskin💘🔥🔥🔥🍰🍦🍰🍦👍🏾👌❤️💖❤️💖❤️💖❤️💯🙏", "kaquariusgirl79": "✋🏽✋🏽✋🏽✋🏽", "dilmersaavedrafit": "😍😘", "mcreeboiyaya_x": "BADDIE", "7snsr": "😘😻😻🍓🍓🍉🍉🍇🍒❤️🍎🍎🍎😘😘😘", "krushnaa.458": "Stay home stay safe", "detroit1981": "😍", "giorgio_mbha": "🍆", "youngty84": "🔥🔥🔥🔥", "j2thevero": "🔥😍", "mr.a_the_chef": "Gorgeous 😘", "justraycarson1": "😍", "jgreer1942": "Nice!!", "darookiefilmzltd": "😍❤️🔥", "brewster_projects_mack_ave_": "@raquelsavage 👅👅👅", "tiagosilva7027": "🤤🤤🤤😍😍", "cartier_boy_youngboy48203hp": "😍😍😍😍😍😍", "big_dezzz": "🥵🥵😍", "_roachdiddy": "🔥🔥🔥", "clutch_g5": "Love the birthmark", "hollywood_known": "😍", "blazux": "🔥🔥🔥 Wonderful mind 💪💪💪", "jessanotherday": "This is definitely something I am happy to donate to!", "tan_jib": "Menstrual cups are a great product to reduce the long term cost of period products. Washable, reusable, longlasting easy to store etc etc could be something that could be useful for the shelter", "here2entertain717": "Nipple rings.. always a plus👍👍👍👅👅", "scot.tea": "me rn ,,, I have been on birth control since June 2019 and went off in December so I’ve forgotten how much,,, blood there is 😭ITS TOO MUCH. I NEED LIKE 3 PADS AT ONCE I feel so bad for people who need supplies. I’ll talk to my mom about donating now that I’ve realized how high maintenance I am personally 😂", "jacqueerose": "I'm in cape canaveral but miami is my home and yes 420 delivered my fuckin moon and I just wanna help some other femmes✊🏽", "thickrissa_official": "🔥🔥Girl you hot", "kingdavid_thebarber": "Hello😘", "nguemasalvadoresono": "Gorgeous", "reality114": "Wow u are dope", "ballye30": "@kaydoebilly__sb", "audiobrownie": "Know of any in Los Angeles or Cali? Not that I won’t donate to the Miami one. Just want to know where else I can donate to! :)", "kaydoebilly__sb": "😍❤️", "jujuski1": "😍😍😍😍 So sexy", "sharkkpaniero": "💙", "tev.10k": "@raquelsavage ✨💎💎✨🌹💚", "thankyounicky": "❤️❤️❤️", "egeezy__": "😋", "jessicannabinoid": "Thank you for what you do, you are an icon to every community, even if they don’t realize it 🤙", "foxyleo28": "Now", "lavish_abundance": "Love ur flawless toes and great Piercings!🔥❤️", "dino_barde": "Hello", "ms_galicia": "Not all can afford them either but if you have an extra 30-40 bucks the menstrual cup is a great investment. It saves your vagina from any toxic chemicals that are in the products. Just a little information for those who don’t want, like the products. The menstrual cup eliminates that blood spell. It can be a little messy at first until you get familiar with it. Also, if you are one that isn’t comfortable with touching yourself or having blood on your fingers, this product would not be a good option for you. I could not go back to sanitary products that are on the market. I hope this information helps someone.", "lyfe_iz_good1630": "😍", "gaiagraphy101": "Legit on my period right now 🥂 and this is a vibe.", "zealyenairezealots": "💕cute💕", "kingmushu888": "Ya skin popppin like shit but if i ever buy u shoes they prolly a 13 in men", "madtaz5791": "Damn I wanna meet you 😉😉😉😉", "2ks1m87": "Damn You So Fine 😂😂😂", "_lolarific_": "Girl same here!! Mine came with a vengeance on 4/20! This is a great initiative, I’ll definitely donate", "smitty7853": "Relaxed and sexy.", "largerthanlifemo": "off topic but have you ever considered contraception? or what are your thought personally?", "dx_prod": "Ur feet 😍❤️", "foyupdate": "Oh man, I saw a sign at our local grocery limiting the amount of feminine hygiene products to 2 per customer. I am grateful to have the privilege to have switched to a menstrual cup and period panties years ago. If you can, reusable period products are 💚🌀🙌", "mrmiracleo": "Love 💓 so much sweetheart @raquelsavage 😘", "morzii3030": "🤤🤤🤤", "benditlikelacy": "You are such a fuckin geeeem 💙💙💙", "septemberkuush_": "Has anyone tried the diva cup or something like it? I breastfeed which makes tampons super uncomfortable. And I hate pads... someone lmk if the diva cup works!!!", "theladylatte": "Yup. The bitch was early too. 4/7. Surprisingly it wasn’t as bad as it normally is. I’ll definitely be supporting @periodmiami", "llhardimanishardthrob": "Yessss🔥🔥🔥❤️", "_perfectlyporcia": "Unblock me in Twitter MAAM 🗣🗣🗣", "__breez": "😋😋😋", "mr_wavy007": "Sexy 😍", "rickey_poppa_poet": "Great message @raquelsavage for a great cause, I'm sure most people dont think about basic needs like this for those less fortunate. Last winter I donated packs of new socks & underwear to a local mens shelter here in Baltimore MD. 👍👍👍", "aggressive_intelligence22": "Bad muthafuka", "c.j.1981": "😲🤭😍", "1111monet": "More afraid of pregnancy than covid😂😂", "crazy.coco.mama": "I donated! I am a person with an undiagnosed illness (maybe autoimmune) and I noticed that the week before I literally feel like my body is shutting down! Everything that can flare up, does. Then when it comes it is so heavy I have to double up (pad and tampons). I couldn’t imagine going through what I go through AND not having the resources to get what I need. I dealt with that as a teenager living in property and while I’m not financially where I want to be, I am grateful I am able to buy what I need and not even think twice about it. Thank you for bringing awareness.", "kfriasrn": "I absolutely love this post.😇 We don’t bring enough awareness to how many people have periods (literal in escapable bleeding!!!!!) with ZERO access to products!! Homelessness and incarceration are disgusting reason to allow women to feel uncomfortable and dehumanized because they have no tampons or pads. Stop the fucking tax on women!!", "mediamuscleproductions": "She IS the ocean 🌊", "papismoove3": "😍😍", "prttylilmonster": "❣️🩸", "cookiemunsterjd": "Very encouraging", "yobitchmysideho": "I’m on my period right now", "lvstlilith": "I literally just got my period today out of nowhere and this shit is just wow, I’ve cried twice already lmfaoooo", "samiagrand": "🙌🏾", "banking_jr": "Thick and so beautiful 😍😍", "nativenyvideo": "Thank you for the way you cropped this.", "lauv_sabharwal": "So sexy🔥🔥", "pixlhearts": "thanks now i wanna pierce my nipples", "queenbekimse": "Mine has came twice this month. I woke up surprised and fed up this morning.", "lifeaccordingtokeeks": "I had mine the other day and with my IUD- it makes my cramps 30x’s worse for me but I’m done in like 3 days. 🤷🏾‍♀️", "howdopeishe": "🖤🖤🖤", "tafari034": "Natural beauty 😍😍😍", "thelexbestthing": "I’m so glad you said this because I was just thinking wow, I have to deal with this shit on top of every other struggle right now? gah damn! 😩 deffo gonna donate!", "mifi_media": "Damn😍😍", "jajauneriley": "Your hold body is sexy and beautiful.😘😍", "zicokingc": "Look good", "simplyme2020": "Freakin’ sexy 😍😍", "larry.armstrong.7169": "So damn beautiful🔥🔥😍", "wildflower_dreamer": "I'm on my period now and idk why but this shit hit different during a pandemic", "themakeupgangster": "Mine 💕", "sellingkatie": "Such an impt message!", "royston025": "Nipples are talking 🔥🔥", "mad__houseent": "You be slangin that strap", "joneexo": "Mine came early and took me by damn surprise.", "minnietripperton": "I’m on my period right now and even though I’ve have over 250 in my lifetime, this month seems so hard, so much more emotional and painful than any I can recall. Thankfully I’m stocked up on pads and my fave snacks", "thatsmrsjenn": "I finally got my first period since 12/9 on Thursday. I was THRILLED cuz I actually had to go to the doctor for this shit. And when I say the crampub and bleed is REAL....OMG!", "nobodythatimportant_": "Currently dying from my period and it’s so bad and I’m just like “really”?! 😭"}