{"dubnun": "@lovelyl611 😍😏 LBuggy sexy 🥰", "shaunda_rona": "#Facts Body hair is our first line of immune defense. That’s why we pit hair (lymph nodes) and hair at damn near every orifice: ears, nose, anus, pubic area. Our other one is mucus. That’s why men and women who think dry panties without any discharge is normal are ridiculous. It’s shameful that the things that are meant to protect us from illness are considered nasty. Preach sis! 🤗", "onlyscopeiknow": "Thank you for unpacking.🤩", "juacarlos1997": "Natural", "7thirtyallday": "I want your WHOLE FOOT in my mouth!!!", "resetrefocus": "Hairy hoe solidarity 💪 When I first started out I was afraid my clients wouldn’t fuck with my hairy legs but a lotta of em be INTO INTO IT 💦", "michellejmarion": "The world needs more of where that came from!", "rechelcamille": "Preach", "giggling_gamboni": "I've only shaved once in 2 years.. (*immediately wished i hadn't the SAME day since ya know, hair kinda does that, but i was \"wearing a dress & didn't want to be self conscious* cough #unpackingtakestime). I recently was admitted for 4 days in ICU... and as i sat in ER watching for some unknown gotforsaken reason how incredibly attractive the men & women working there were.. i thought.. alright.. this is it. EKG & next chest xray coming.. they gonna see it. And a bitch felt like she needed to warn the dude. I joked and said someth about how earthy i am & no shame. Surprisingly...he said we all earthy in here. Wasn't phased a bit. I felt my heart pitter patter. Like i was hearing rejoice! Reclamation to what SEXY is. What a woman is & is not. Should & should not be. I felt the ever so present \"Amerikkkan standards\" in a shift. At least body hair wise. I know Hollywood ain't going anywhere. I know patriarchy is still grappling for its deathening control. I know i'm still gonna accidentally fall into old thought patterns. But this post, you words, are continuing to spiral us forward! Thank you!! Thank you. Thank!You! You are what beauty is. 💕🙏🏻", "00_scorpioo_00": "Prettytoes", "marieskou": "Ily😍😍😍", "simplesymone": "I rarely shave my legs. I’m 6’1. I cannot waste that time everyday trying to fit in society’s little box. My legs are almost 3’ long. Tf I look like. Femininity is yours to define.", "thecookup__": "Bulky af😍🔥🔥🔥🔥🔥🔥", "muggy__junior": "Finally somebody knows and its sexy", "jayywuzhea": "Women that don’t shave down there I think it’s attractive I like it I love natural women", "khaleesi_danvers": "P R E A C H 🙌🏽🔥🔥🔥🔥🔥", "war_1570": "Beautiful", "bigwill2016": "Perfection", "ms_consentida": "I never shave I will trim (rarely) bc my shit dont stop growing but I've been natural all over for over 5 years", "joybelou": "Havent shaved since quarantine and I have alot of body hair becos pcos. I used to feel self conscious till I realized that I'm sexy regardless. And nobody cares.😂", "tayloritright": "I like to shave 👀🙄regardless", "__shalili": "😍😍😍 I love every bit of this!! ❤️ I’ve been fightin the patriarchy with my pits for like 2 years now 😭 I love seeing more fems embrace their body hair 🙌🏾", "ozman694": "😍🔥", "iamnotmaya": "Yesss!! Love this 😍 long live that good-smelling, fuzzy pussy", "peacehood": "Literally!!!! Some chicks be shaving their pussies every day and are like omg i have BV , yeast, a rash, etc i’m like well honey... god gave u a protective cover to shield all that... i don’t know what to tell you 😂", "blacktherapist_": "You had me at feminine is a social construct!!! 👏🏾👏🏾👏🏾", "lordstoney": "🔥", "anomalyalice": "I knock mine down with an electric razor to keep it trimmed bc thats what *I* think feels best on me myself & my body. Whatever anyone else wants to do with theirs is 🔥🔥🔥", "pleasureactive": "Preach. Having the hair follicles there helps our body express its natural chemistry through pheromones which signal the brain at the most perfect appropriate time to get ready for what’s coming next. It literally adds to our physiological excitement/arousal", "basicmuva": "My hair flourishes always 💅🏽🙌🏽💖", "baraqueenbee": "💪💪💪💪", "veronicaspictures": "🙌🏼🙌🏼❤️❤️🌟🌟", "eped09": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "fuckradical": "i LOVE you", "shawarmamba": "I feel so exposed and vulnerable without hair. Yes to all of this.", "meals4heels": "👏🏿👏🏿🙌🏿take them to school", "babewiththepwr": "Thank you🖤🙌", "_milluminate": "Yessss!! Fuck these social standards!! Pussy smells like pussy and hair gonna grow when and where it grows!!!", "lp999": "And niggas STILL gon holla @ ya, @raquelsavage ! I'm niggas btw; nice meeting you. *cyber handshake 🤝🏽", "holyb4sil": "Those that remove body hair are more prone to infection 🙃 ill keep a lil fuzz on my peach,pits and legs tyyy", "that_half_a_smile": "👏👏👏💖💖💖", "auriaofficial": "Period!!!!!!!! You are so stunning!!!!!!💘💘💘💘", "balticmoonlight": "You are gorgeous and phenomenal 😍❤️", "dollhouselucy": "I love the positivity in these comments! Makes me feel more ok about my body hair. 💓", "thetherapycollection": "Periodt Pooh! Spread to the church.", "africabrooke": "Isn’t it mind-blowing that it’s a ‘hygiene’ issue when the hair growing on a female body?😏 LOVE YOUUUU✨", "mrmiracleo": "I can’t wait for ur show 😘💖😘", "kendalldior": "Yes cuz my little baby wolfing woofing right now", "pepper_ron_chini": "You are THE QUEEN . all that you do is VALUABLE, and BEAUTIFUL, important and INSPIRATIONAL I know if anyone knows this, it is you, but I just want to say itt 🙏", "backpage26": "Damn they look like my ex feets🔥", "blair_warner_": "You are a total girl crash 😍of mine 😆", "iamroolis": "The quarantine message this very Indian girl neeeeeeeded 😭😭😭❤️❤️❤️", "ssadspice": "i......fucking love you", "fdjphotography": "Yassss😍!", "braidsby_cassie": "Love your authenticity 💕👏", "langa.thulo": "PREACH 🙌🏾🌸💗", "mr._pat_her_cake2": "I wouldn't give a damn if U didn't shave... It always feels nice to cuddle in a bush... That hair let's me know Ur a Woman 🤤😈😘... Shyt we can cuddle & chill & I'll stroke them pretty curly @ss hairs while we vibe... #Areal1👌🏾💯👑", "mizzzpiggyy": "Thanks for this Raquel! I’m a huge fan of your posts!! this one came at the perfect time as I was just telling myself I felt gross for not being bare ! I’m letting her BE", "daisy.forrest": "Once l started asking myself \"what do I do for myself ? What do I do for men?\" It was revolutionary!! I haven't shaved my legs in 2 years even though I present as mostly femme (clothes, makeup) and I love it I feel so much freer 🙌 because makeup genuinely makes me feel hotter but I feel just as sexy with hairy calves so.. I'd just always been told that \"women shave their legs\". Deconstruct 💜", "manongascar": "@arabysmyth ugh always the best 🙏🏼", "yourfavspaprofessional": "I'm an esthetician with access and ability to wax myself and my hair is on full everywhere! Just taking a vreak. Love the post!!", "hersheydomme": "I haven’t shaved in months too and this just gave me the courage to make a post about my hairy legs and bikini line cause my body hair is flourishing and I’m embracing every single follicle. Body hair is normal, what isn’t normal is how women (and society at large) have been conditioned for decades to believe that there’s somehow a correlation btwn hair and personal hygiene and that having body hair makes a women less attractive and favorable. Now let’s unlearn THAT! 👏🏾", "sashas_empire": "When I read “let’s unpack” I get excited 🤓", "ricrahk": "Such a sexy woman 😍", "jajauneriley": "Your feet are beautiful mama😍😘👁️👁️", "risque.playhaus": "😍🙌", "pauldcosta_______": "Hairy pussy the best", "erinmgraham": "👏🏼👏🏼👏🏼", "chris_mmonks": "That is one fine ass.", "youngyellow_rudeboy": "Nah fuck your legs post that Bush", "manti_manthata": "I love this picture❤️", "vera34h": "Sexy ass😩😩😩😩😩 we don’t shave over here uh UH!🗣🤷🏽‍♀️💅🏽💅🏽🥰", "lateshiachilds": "They don’t look bad I couldn’t even tell", "overdose_grower1991": "However youare comfy 👍", "_paulyd": "Big facts‼️#MaturePuss", "big_geesy": "🍆💦💦", "moeniica12": "💕🙌 always coming through with the facts and gems! Thank you!!!", "dee__monte": "I love you!", "wellworx80": "U look great!🔥🔥🔥🔥", "instant_britt": "THATS RIGHT 😭🌟🔥", "mandolinhart": "It was FUCKING DEVASTATING to a hairy teen. The 90’s really hated hair on a woman. I was told my treasure trail was disgusting, that I needed to pluck my unibrow, general laughing at my moustache. I still get twinges of shame every now an again and it sucks. But then I remember I’m fucking awesome and part of my awesomeness is all my hair. ❤️", "takara_chan98": "Preach 👏. It helps keep the vagine safe. It's there for a reason totally natural.", "jsavage.11": "That ass is sitting 🤒", "neroyarrum": "👅💦😘 scrumptious mama", "xjlr50": "😍😍😍😍", "pnkcadycourtney": "I legit had to scroll back three times because I thought you were me. I’m in my pigtails and bikini today too. 🧐", "pacangaa": "Ouuuu yesss❤️", "_kdsc": "⚡️", "ssaerbearr": "ooooh your legs look lovely boo!", "mr_a.i.p_": "I love u I swear", "only1jshea\nVerified": "Verified", "vandee3": "👏👏👏 yes! I recently decided I’m not shaving my legs anymore because it literally serves no purpose for me. May bother other people but that’s a them problem 🤷‍♀️", "kellylabanco": "👏👏👏👏 @raquelsavage", "chicityscummy": "Gross", "wickedsundae": "I used to curse my father for being so hairy and my mom sweetly said “i’m hairy too, hija”. but it didn’t help that I got teased by boys growing up about my hairiness. I became obsessed with being clean shaven and just until recently stopped being sexually active and thus had no reason to shave. I recently shaved for fun and the process of hair growing back was so uncomfortable...plus hair intensfies sensation which has been fun to play with solo and I can be played w that way w a lover too ^_^", "aisha_chey": "Get into ittttt. Yes. I remember meeting this girl at a park and she was utterly disgusted because I had armpit hair. She decided to cover it with her hand everytime I had my arms up...I found it hilarious. That's when I knew my feelings about body hair had shifted a lot since childhood.", "masc.dandy.llc": "🔥🔥🔥🔥", "luckyleftb3": "Tell em!", "photophiction": "Thank you for talking about this!! Its been about 10 years for me and my armpits are soft and healthy, junk looks and feels great, legs look wild but I live in Alaska so it's never really short season anyway...when ya stop giving fucks, you give the best fucks.", "t_r_i_l_l___": "🎂", "shea_khalifa": "Can I just say, I’M CRUSHING ON YOU😍💜🙈", "slutofthemonth": "Team hairy legs and white toes over here!!", "dollathebarber": "Pretty toes!", "cutenhung69": "Hairy legs are soooooo hot😢🔥😍❤️", "euphorliyah": "i’ll go so long without shaving it honestly feels so good caring about and spending more time than on other thing 😭💖", "senpainatalia": "okaaaaay but how are those toes still looking immaculate!", "royal_flyness_nails": "Facts 🤷🏽‍♀️", "myraxoxo": "And that’s on menstruation 😍", "hey_yo_michelle": "Me today at Walmart lol. I didn’t even notice that I hadn’t shaved in Idk how long. 🤷🏽‍♀️ Oh well.. I ain’t lookin’ for anybody lol idgaf.", "chelseus": "I wasn’t aware of this until relatively recently and I like to post it on things about female body hair: the reason most women shave is because in 1915, Gillette (the man 🙄) realized he could increase his profits if he could recruit women as customers. He did this by starting an advertising campaign to shame women for their body hair. It was wildly successful. That’s why women shave TO THIS DAY. Also, mammals have hair. Human females are mammals. Welcome to my TED Talk 😹", "chubby.brown.kink": "YES. 😍 MOOD. 😍", "losangles_la": "Beast 💪🏿💪🏿💪🏿💪🏿", "yellowcake28": "Like a women with hair", "exorpiona": "I havent shaved my armpits in over two years, I've learned to accept it 💕🙏🏽", "larry.armstrong.7169": "Wow your so beautiful😍", "theladylatte": "I hate shaving. I only do it if I feel like feeling skin or I keep it trimmed. Being comfortable with hair at my grown age is the best thing that could’ve happened to me.", "sanhopeless": "All my tricks love the bush I could never get rid of it, my money maker lol", "ti_jo_ht": "🌳🌳🌳 🙏🏾🙏🏾", "giveafoxamuffin": "Yaaasss!!! Gave up shaving my legs a few years ago tbh. It was a task that brought me no happiness and the end result wasnt worth the effort. I don't even use razors anymore. I trim the pits and the bush as I feel comfortable with them and go about life 🙌🏾🙌🏾🙌🏾 it's really freeing not being worried or self-conscious about body hair. It literally grows out of my body like this sooo 🤷🏾‍♀️", "ricothedon710": "in love", "faithwilliams38": "This body pic is amazing!", "hoelivia_newtonjohn": "From the highlight to the cellulite to the appetite this picture is so fuckin bomb 🔥🔥🔥😻", "53x_r0b0t": "I went to jail for 3 week a decade ago. One of the first things I wanted to do when I got out was get waxed. My first time. Legs & Brazilian. Worst fucking pain ever, lol", "jamariaaa": "I fucking love you.", "htebmorse": "HELL YEAAAHHHH!!!! LOVE THIS", "crazy.coco.mama": "Yes! The only reason I do my armpits is because I have a skin condition and it doesn’t feel as bad when I’m shaved but everything else 🤷🏾‍♀️", "paget_ross": "👏🏼👏🏼👏🏼👏🏼", "inmadopicouroz": "😍🤤🍑🍑🍑", "lavenderamethyzt": "THIS. I was just talking about my body hair today and how I’m kinda into it. Shit I’m not unless EYE want to.", "psyberjam": "fuck, you’re delicious.", "iamicedude": "Yo shit look like mines damn near.... congratulations", "dato9746": "👅", "doye_doye_": "🐯 reowwwwwwwwwwwwww", "jessanotherday": "LOVE IT!!! 👏🏾👏🏾👏🏾👏🏾 So powerful!", "spreeisms": "It actually hurts when I dont shave my legs.. but im with it nonetheless.. my man know", "h.pache": "Yasssssssssss!!! Natural of all naturals! I’m loving this!", "odan_dru": "Heaven in your eyes @raquelsavage", "kingnasirxx": "Have your way with me", "egeezy__": "im still eatin that ass 🤤", "animetittiiiies": "Your legs after 2 months is mine after 2 weeks 😩😭 but yuhh get into it 😍", "mkwmullen": "So that’s that on THAT 💥✨💕", "the.art.of.ash": "🔥🔥❣️", "blklove4lyfe": "Yesss👏👏 love it😘", "george.44": "😍💋💋", "just.the.bomb": "👏😍", "emilyvannn": "I haven't shaved in 6 weeks and it's the best thing I could've done for my body!", "familyfirstpsych": "This is true, pubic hair is there for protection! Glad you posted this, women need to be less worried about their natural.", "derick.steven23": "Asss by kingnasirrrrr", "mizz.tiff": "🗣speak!", "mean_janine": "🔥🔥🔥🔥Embracing my hair has changed my life, I’m not bumpy and itchy and I am 100% percent comfortable fucking anywhere anytime🔥🔥🔥🔥", "youlooklike__no": "👏🏾👏🏾👏🏾", "cityofgods": "👀👀😮😮😛💖💕😍💞🚿🪒🧽🛁🛀🏾", "perashay": "I haven’t shaved in forever and it’s so amazing lol I really don’t ever think about the hair but older black women loooovvveee telling me to shave and I tell em to go to hell every time cause why", "trevmarley420_": "🤤🤤", "nappyjj": "I ain’t gon lie the caption is kinda ??? but I’m a nigga so who am I to judge you feel me🤷🏿‍♂️", "thatssooopink67": "🤩🤤🔥I’m here for this! 💪🏽💗", "maloney_09": "I seriously love you!!!! ❤️🔥👑", "miss.sag2": "😍😍😍😍", "handtalker40": "Yessssss. 👏🏾👏🏾👏🏾 I'm in the flourishing bush camp myself. 😋😋❤️", "emperormaine": "yessss indeed", "ivybgreen": "Love this message! I always feel women are made to feel bad about having body hair or like they’re not womanly enough as well. Always love the knowledge behind your “thirst” traps 🙌🏽😘", "bigbuffaxaj": "1st things 1st I gotta say that use of the word “CUNT” got me in Ahhhhhhhhh with admiration. And though I like bush trim as a person of my profession I support the statements/facts about the importance of public hair. Stay #NaturalState #HairySexxy", "dr_gee216": "Them toes tho!!! 🙌", "gabi.ayad": "lmao this is what my legs looks like after a week of not shaving", "sterlingnoelle": "👏🏽👏🏽👏🏽👏🏽", "sarkastik_denominator": "✋🏼🤤🤚🏼", "100mrtaylor": "All I saw was white toes .", "kinkyblackeducator": "Yasss caption. 🤩", "ivansventnickas": "Delicious", "miaflamesoflove": "What are some things that bought you to such a divine juicy Goddessy body positive mindset?", "thuggishruggishbonnie": "Caption!!! I’ve stopped months ago, I am unsure of it everyday!", "__purplereign92": "Those toesssss 😍😍😍🤤🤤🤤", "money_hungry_eny": "😛😘😛", "c.j.1981": "😍", "donceaser": "Stacked", "rashelle.2813": "GIRLLLL!!! 🙌🙌😍😍🔥🔥", "j2thevero": "🔥🔥", "c.bvbyy": "MY PUSSY GOOD WITH OR WITHOUT THE HAIR🗣", "half.queen": "PERIODDDDDD🗣🗣🗣🗣🗣🗣", "monedontlie": "🤾🏾‍♂️🤸🏾‍♂️🤰🏽", "driftlxrd": "Brazy💕", "jessmessrainbow7": "Very important convo that every woman should recognize and have💯", "rb.1804": "Not tryna play Tarzan in that jungle. Keep the 🐱 clean", "santosman12": "thissssss", "aquariuntay": "YESSS love this caption❤️", "damodricharp": "So sexy", "bvrluv": "So fine...And Smart too 😘🔥💦💥💦truly appreciate your insight and instruction.", "cocomoe_compton_joe": "Magnificent 💎💎💎💎🍑🍑💛💛💛💛💛💛💛💛💛💛💛💛💛💛", "daleymax": "Yes niece!", "samanthaliftsyouup": "Love your messages!!", "dmathis94": "🔥", "_mia_lynette_": "Gorgeous 💕😻", "tsoulstar": "🙌🏽", "dfkawah": "🔥🔥🔥", "vancenzo_rigatoni": "U looking goood", "le.mack": "Love this for you and for all of us. Hey legs 😍", "dannylamango": "💧 ❤️❤️ mad", "lobavaga": "✨👏🏽✨👏🏽✨", "decolonizingtherapy": "🔥🔥🔥🔥", "vulvalini": "Wow okay go off 🥵", "mf_joshua": "😍", "quell87": "😍👑Goddess", "basiony880": "You are the best❤️❤️", "nobodythatimportant_": "Caption! I wish everyone felt this way about their bodies. It’s so freeing once you gain this mindset. 🤝😍", "king__keylo": "🗣get the strap🗣🥵🥵🥵", "gaiapatra": "Honestly when you stop shaving, it feels ridiculous to go back to it."}