{"_cierraaaaaaaa": "Therapy was the beginning but now you have to do the rest of the work! I love you more today than ever before. You’re not that same broken little girl. You are a woman who has accepted everything that the world didn’t love about you. Please continue to write, write until you publish your book, and then continue to write! I’m going to love and hug myself tighter today and give myself a big orgasm lol", "g_lady02": "I am fucking amazing nobody else can finese a $42K grad school scholarship like me on their first try! I am fucking brilliant, intelligent, and spiritual that bodhisattvas pay me to fuck their brains. On top of that I got an ass that wont quit, my pussy clench game is 💯, my dick sucking skills is in the guiness book of world records, my face was sculpted by the gods and is an inheritance of my ancestors, and my baking skills be stealing everyone's bae. Soy maravillosa❤️", "gemcookies_": "Raquel I just wanna eat you 😛", "jilliansnk7": "i am worthy of life. i am worthy of love. i care so deeply for the people i love and that makes me awesome!", "quell87": "😍👑", "gwnscr": "I love writing and I love me, here’s a little note to myself from myself..... - Whom is this negativity benefiting? She asks to the mirror. - Not you. Not her. Not him. Not them. How silly! Look at your magnificent self and tell me you’re not enthusiastic about existence! She cups her breasts and tweaks the nipples and brings them to her own mouth. She strains to lick them lightly for a moment, then lets them fall back with a bounce. - Tell me you aren’t in the mood to live a thousand joys! Tell me you’ve turned your back on creating! And she looks into her reflection, a projection of her self, her vessel of expression, straight in the eyes burning. - Your thoughts are just smothering you in this moment. Carve out some space around them, leave them room to expand, to wiggle. Focus on sensing your limbs. She jiggles her own body, rides the waves of flesh, trembling like a tree, she takes a deep breath. - This is here, this is now. Have a scream, have a growl. She curls her lips and bares her teeth, gets on her hands and knees, her boiling blood crawling underneath. From the depths of her throat grows an otherworldly note that pops like a bubble at the end of her nose. She stands back up and does a whole spin. - The question is not to lose or to win.", "faux4foe": "Dear ‘THAT B*TCH SR’ , There will never be another. YOU in all your fat, queer, resilient, ethereal, heart-healing, soul-shaking, mind-blowing, BLACK a** glory will forever reign supreme. We in this sh*t together until we all get free. I love you, b*tch. I ain’t ever gone stop loving you, b*tch. Xo💕", "darnthatspud": "... Pussy poppin’, skin poppin, confidence rising. MAMA RAISED A HOE, NOT A QUITTER! It hurts to hold oneself accountable sometimes but you’re a sadomasochist for a reason!! Make yourself happy, make yourself rich, make yourself cum. you deserve peace. don’t let people take your peace away. sit down, enjoy your food, and rest sometimes bb. ily.", "_tracedat": "I love me in my entirety! I’m doing SO good for my age and getting shit ducking handled. The only thing in my way is me, and I refuse to let self sabotage, sadness, learned helplessness or any bullshit ass Nigga stop my drive. I’m the best me I can be in this moment and continuously working towards infinite better versions 💕💕💕 NOBDOY FW ME LIKE I FW ME. PERIOD", "_beyondit": "Today, and every other day, I will give myself the love that I want from others. I will give myself the confirmation I want from others. I will accept nothing less than that. I will exude the energy that I want from my surrounding. Whatever I want will come to me because I AM what I need and want. A better me.", "alexandra.cicero": "I'm a work in progress but shit i make it work", "jaynieves193": "I know I’m probably out of place here lol but I’ve always been a strong believer in self love especially for women. Most of the strong independent women that I know have taught me that self love is number 1. You have to learn how to love and accept yourself before you try to do it for anybody else", "_annyma": "@josie.edan", "sticki_minaj": "I finally dumped my toxic ex, picked up and moved across the country to be closer to my support system - and I’m fucking proud of myself for doing so. This past few months has been all about figuring myself out & taking things SLOW as far as love goes. Unfortunately I couldn’t bring much w me when I moved so I had to abandon my beloved sex toy collection that I spent the past 10+ yrs curating😭I want thissss!", "carterorlandosmart": "I am a handsome, valid pre t trans man that despite having crazy dysphoria I am THAT bitch and I deserve the pleasure that society says is wrong for me to indulge in. I am growing and learning and I have the potential to be aligned with the world - mind, body, and soul 💛", "jesslalove_": "I am amazing, I am smart, I am determined and I can handle everything in spite of what my mental illness tells me. I WILL get through this like the bad bitch I know I can be 👌🏽", "lonewolfonhunt": "Sexy", "nobody4u2fx": "I so want to sit across the table from you and totally act like I have no clue.", "keepyoustill": "Honestly, I'm learning to love myself. My body & mind filled with so much wealth. Outside forces clawing to knock me down. I realized they'll never take my crown. I am of the sky & the earth, reclaiming what is mine since birth.", "blizzywomack33": "❤️Beautiful 💜", "kira_melita": "Hahaha bitch I’m hella glad I found you I been following your twitter since I was 12 💕", "manuelalfonsogonzalezgarzon": "Rico alla bb", "delency_": "Hi", "r0chir": "@brookealvess", "cher.sse": "I’m extremely intelligent, always have been and always will be. I am the realest bitch and it’s undeniable.", "smobarak": "I’m a chingona and also an A+ cat mama! I can always rely on myself and I’m a reliable, kind and generous spouse, friend, sibling, and daughter. My booty is super squeezable and my big eyes are stunning. I’m so happy to be me.", "brwnbutterbabe": "I am beautiful and worthy. My voice is important. I deserve to take up space. I am the baddest of all bitches and women like me cannot be contained.", "jadorejamilla": "i am hard working, ambitious, strategic, and caring. every day i am learning both in the classroom and out. i am a true leo- the BADDEST of bitches- who still knows there are many many others alongside me. i shine bright and want others to gleam just the same. every day i work hard to love and accept myself and make those around me feel accepted, supported, and driven to be their best selves. i have the body of a goddess 🏋🏾‍♀️ but also i make some bomb ass fried chicken and mac & cheese 😋", "grigorijpotjomin": "chic💕💕💕💕💕👌👌👌👌👌", "dkliston": "I’m learning to love myself again after the end of a 20 year relationship ship.....it’s not until I learn to completely love myself and be happy in my own body that I will be able to let another love into my life....however a little self joy 😜😉 along the way is always good!!", "gorditagurl": "My determination, my intelligence, my strength, my capacity for empathy and ability to love are all things which shape me into the beautiful person I am. Knowing and acknowledging my value allows me to navigate life in ways that support self priority. And that's okay. I deserve to be the most important person in my life. I deserve to thrive. I deserve to feel my love.", "mnytso_": "I am such a divine creation of light and beauty. Existing in a thousand forms all beautiful in their own way. Possessing both divine feminine and masculine energy that collided to create astounding perfection. wow I'm fucking amazing", "raging_natural": "I'm one of the best teachers I WISH I had growing up, I am a great daughter, sister, and friend. I know that people are fortunate to come into my life and even better when they're allowed to stay forever! Some of my soul mates are my best friends!", "idkyoupplattal": "I worry so much about my mental illnesses making me into someone I don't want to be, but I AM someone who has survived this long. Someone who has persevered & kept moving forward even when the steps felt empty & the ice felt thin. I am beautiful. I am so smart. I am learning to unlock my confidence & to connect with my spiritual strength. I have my family of friends & pets & myself, & that's all that I need. I will hold me up & I will hold me down. I got this.", "tpowerhouse1": "👏👏👏👏 I can’t even attempt forming words to attempt to do better than that! Fucking killing it and blazing a mother fucking trail girl... 🔥I see the light from it and am gratefully trying to feed off of it from a miles back. Nothing but love and admiration for women such as yourself ♥️", "sparklin_rozay": "Learning to love myself more everyday regardless how things are. This is my life and nobody can live it better than me. I am beautiful inside and out, my imperfections are my perfections, I’m unmatched, magnificent, a blessing in any and everybody’s life! I’m truly a badass bitch 😂 and I know it and the world needs to see 💖", "bornrxbel": "I'm strong. I'm passion. My standards are high & they're gonna stay that way. I will not settle for less. I'm beautiful no matter what anybody has to say about it. I'm a boss bitch, a bad bitch, & I am a womanist !", "milo.pdf": "I need to stop giving so much of a fuck about what complete strangers might think of me and just live in the moment and enjoy myself.", "katymaeeeee": "I am a combination of my strengths and weaknesses, my successes and my losses. No matter how many times things go wrong I learn and I start again. My greatest strength is my ability to love myself and others.", "deannima": "my resilience and determination are as strong as my thighs... my personality is as soft as my skin... my V gets as hotter and wetter than waiting on line in DisneyWorld on a midsummer day...and I still use silly phrases like righty tighty lefty Loosey to remember how to unscrew things", "bad_for_your_health23": "What A savage 😂", "nofakefucksgiven": "I’m enough. I am worthy and deserving of love. Mental illness is hard, but it’s a part of me, and always will be. Not everyday will be happy, but everyday will get easier. And one day I will look back and be happy I decided to live.", "wheelchairbobby": "Litteraly bought sum similar today...", "capribaby___": "*likes everyone else's comments bc you are all amazing and deserve great orgasms*", "tsukikomumai": "My hair grows as wild as jungle vines and as tall as the most ancient of trees. My skin is as soft as silk, clear as the most cleanest waters and as brown as black tea with a touch of cream. My tits sit pretty on good days and sag to get comfy on off days. My rolls keep me warm in the winter and make me look great in my clothes in the summer and gentlemen friends have told me that the scent of my juices drive them to an animalistic hunger.", "kingrico_____": "🤦🏾‍♂️", "sophadelicc": "honestly, i’m learning to love myself still. i’ve struggled in the past, and i struggle now but it’s gotten easier. but every single day i wake up, i look in the mirror and remind myself; i’m beautiful, i’m strong minded, i’m willful and i’m fucking worth it. my hair, even though it’s not exactly the length i’d want right now is beautiful. my brown eyes that i’ve conditioned myself to hate are beautiful. my small booty and big hips are beautiful even though they aren’t perfectly proportional. my B cup titties are still fucking beautiful even though they’re small and sag a little bit. my mind, even with my mental illness, it’s beautiful. during a depressive state, i’m still beautiful. a manic state, i’m still beautiful. i tell myself every single fucking morning that my bipolar disorder does not define the women i am or the women i will become. i get to chose my destiny, and i chose to be great. I may not love myself as much as i should right now, but i still know that I. Am. That. Bitch. I love myself. it may be in spurts, and i may have to give myself daily reminders, but damn do i love myself.", "_erihca": "\"I am a gorgeous woman. That's not me being egotistical or narcissistic. It's just a fact, I'm a knockout. I have confidence and je ne sais quoi. That is unmistakable. My pheromones and my chemistry and the way I walk—I am divine feminine energy.\" - not my words but definitely how I feel about myself. & hope you guys do too ✨✨", "summer.maurie": "I'm extremely brilliant, I'm resilient, I brighten the room, I'm the best hype man, I can make anyone smile, I work hard, I'm everything and I beat the offs everytime", "davidthewolf44": "I am the Daddy Wolf of your dreams, except I am very real. I will earn your trust, your lust. I will violate you in every way but one, your trust will never be violated. I am perfect in my imperfrction and fuck anyone who wants more than that. I can cook like an Iron Chef, Dominante with and Iron Fist, and cuddle like the Wolf I am. I am loyal protective, and the best pussy eater on Earth... Male, Female, or In between!", "odbw55": "😋😘", "itsbosslady": "I am more than enough. My titties have healing powers and you can drown in my love. I’m hard working, empathetic, and funny. I love me 💜", "hgrey1994": "🤷‍♀️", "sagittarius_jay_1": "You do not need a toy if you have me I can do all the work that toy can do", "__virghoe": "I am a goddess. A force of nature. I am so self assured and confident that no one can disturb my peace💕", "lilybellevedere": "I am the strongest woman I know. No, fuck that, I’m the strongest person, full stop. I create beauty every single day, in a dozen different ways. I’m gorgeous to look at, my skin feels like the softest silk and my body is a wonderland. If you’re lucky enough to be my lover, you should get down on your knees and give thanks to Aphrodite for blessing you with the opportunity to experience such pleasure.", "nolahustla": "“WOW” simply amazing lookn on that bed😍😍", "nikkibandssx": "I am smart. I am beautiful. I am important. 😂 But really, one day I will make a difference whether it be to 5 people or 5,000,000.", "lavish_abundance": "Magnific!", "b.anneedwards": "I love myself so much more than my mental illness wants me to. I’m a kind person, I love my friends and will ALWAYS be there for advice, listening, or even just taking care of your basic needs when your brain chemistry won’t let you. IN ADDITION to being a fun and kind person, I’m also cute as fuck!!! I have an amazing jawline, awesome eyebrows, and gorgeous hair!! and my anxiety won’t win because she can’t fw this!!", "thefuriousnubian": "I AM whole, perfect, strong, powerful, loving, harmonious and happy.💫", "ch.e.ne": "My voice is important, I take up space, my thighs squeeze the soul out of you, and I deserve all the good things, including good d/p 💖😇", "cbgxo": "I am truly beautiful inside and out. I carry such good energy like I literally glow without the sun. I am the sun. I am so generous I was put in this world to help others, speak up for others, and love others as much as I love myself (and that's a lot). I have an amazing voice that commands attention even in my most quiet, turned down days. I truly am a force and I use that force for the utmost good. Wow. I truly am amazing and this feeling is amazing bc I did not feel this way last year. My personality is as big as my hair and I cherish that. 💗💗✨ wishing everyone the confidence to big up yourself, even if it's just a sentence 💕", "69chocobunny": "I am important, I am strong and I will continue to thrive in life even when the going gets tough, cause I’m a bad bitch periooood.", "nanettehanks": "I can do hard things.", "yourboxbox": "I love you and this!", "karekarebee": "I am an accumulation of the bad bitches that came before me. There is nothing that I cannot handle because I was created to shine. My light lights the candle of others. I am greater than I know and more resilient than everything that tries to bring me down. I cook good, eat good and fuck good. My pussy deserves this vibrator and all the orgasms that are to come & that’s that on that.", "elliottsprggs": "i work so hard to overcome the barriers my brain sets me. i’ve been making such progress this year and achieving some amazing stuff. i’ve been on a massive journey of self discovery re: gender, sexuality etc over the last couple years. its been a hard time but i’m trying really hard and it’s starting to pay off. i’m spending my valentine’s visiting a friend who i don’t see v often and just spending some time relaxing and not being anxious for once (if i manage). i’m rly proud of myself for everything i’ve done, getting through uni and working and getting to know and love myself. u honestly always make me feel so self confident 💖", "actually.ray.charles": "Honestly and truly: I’ve always seen the best in others,and always placed focus on that, but recently I’ve fallen in love with me. And I mean ALL of me. I fckn love how I’m able to look at myself naked and KNOW I’m the finest thing walking, how I compliment other beautiful women without feeling like we’re in competition, and I adore how (non-arrogantly, if that’s possible) into myself I’ve gotten. I can say with full confidence that I am THAT b*tch. PERIODT.", "femininewilds": "I am a work in progress, blooming. kindness is my instinct and Dat ass doe 🍑", "murdergram__": "Me: *steals caption because honest to God same* @laconeja_delbloque lol", "tessaxellex": "I am the baddest bitch, the kindest bitch, the most “Why yes, I AM the MANAGER” bitch. I am the most sarcastic, empathic, I love Jesus but I will pack you in a suitcase and hide your body ass bitch EVERRR", "theologynerd97": "I am my here, I am my now / I will be fierce, I will be proud / I hold the peace for which I search / I am my god, I am my church", "emdottie": "First of all, I have the fattest ass, I’m the hardest/smartest working Black woman I know, I’m a hustler AND my skin pops!", "anorthcountrygirl": "Girl you are doing so cute, just taking care of your shit, making sure you’re fed & watered. Your mind is brilliant - people can’t fathom you? Bless them and don’t worry! You are surrounded by loving forces who SEE you. Write the world you want to see - you’re the only one who can. & you CAN.", "introducing_elle_illy": "My pussy is gold, my mind is platinum, my confidence is titanium. Whatever happens, I will steel be that bitch.", "isabellaajones_": "I am a fierce, feminine and successful entrepreneur. I am an amazing mother and wife, and i give the best blowjobs- I mean come on my adorable son is living proof.", "yasmine_montes": "even if u dont go as hard as u want to at first, doesnt mean u arent as valuable", "amberejj": "Where is your bed set from??❤️🔥", "the_crownholder": "I am a boss ..self love on 1000.. kitty pretty as if it was painted with fenty... I give birth to young Gods.. I stay tru to me💚 (I hope i win🤞)", "southern_gentleman225": "Looking fantastic @raquelsavage 🌹🌹"}