{"emcearcee": "“do you have the awareness to recognize how your privileged identity informs your (political) interests” HARD STOP 👏sitting on this one for awhile.", "odessablackdebutant": "🍵👀", "tashaaaa_mackkkk": "Yeeeeeeeessss🔥", "cp76pimpin": "Just beautiful", "jinxyoure.it": "What lashes are you wearing here? 😍", "oxtail_tiddiess": "🙌🏾🙌🏾🙌🏾🙌🏾", "hkozak93": "oh wow okay, gonna read this after my boner goes away whewww 😍😍😍", "nohugspls": "😍", "toddrmitchell2000": "You be saying some real stuff", "ashfromtheh_": "You’re my spirit animal 😍", "byrdiieb_": "😍😍", "rogmar_": "Pretty Gyal.", "tony_vassell": "You are absolutely beautiful", "deebo1912": "Gorgeous", "thecradleofn1n": "A word was spoken", "brickreddfoxx": "I love your TPTTS", "auntielaurenn": "Your face and this lewk and this robe(?) yesssssss", "dick.roulette": "ur NAILS!!! 💖💖💖", "litt.social": "#YouAreLitt 😍🔥😍", "the_tv_takeover_studios": "I love the blend of sexy and brillance. Yes, there's a vast difference between brilliant and intelligent. The game changer (in my opinion) that one has in abundance over the other, is common sense and spiritual awareness. I'm sensing a rebel with a cause kind of vibe from you. #iloveit #teachus 👀", "sunnispeaks": "FFFAAAACCCEEE", "shaemarietheartist": "Worrrrkkkk", "therealdoronlamb\nVerified": "Verified", "seeyalatersimulator": "*pours tea and sips* *waits for the opposition* 👀👀🧔🏽", "sduck1227": "You special @raquelsavage", "dynomack": "Flawless beauty 🔥", "la_mangifera_indica": "I’m glad you pointed this out. I saw a post today that a good friend of mine who identifies as a CHBM commented on with gay bashing hate speech and it struck a nerve with me, how can you have so many homosexual-identifying people in your life that you say you have love for but still find the wherewithal to bash said community?", "perlita_applebum88": "@iluvkialee", "rachelcroonquist": "You look so good", "drinksonant_": "I’ve recognized and acknowledged this for myself. Because of that I put a lot of my energy into defending BW and holding BM accountable. It’s incredibly difficult to step down from an embiggened (created word) sense of authority to the point where I am capable of identifying that privilege and even more difficult to act against the monster that is fragile, toxic masculinity."}