{"b_jamese": "Welp, the wolf pussy is finally gonna be a real thing. Guess we gone find out who the real dogs and carnivores are. Masculinity in general is gonna get fuckedand end up looking a Kodak Black mess. I can't wait. 😭😭😭", "dannydarkspace": "I support this movement 💪🏽", "iamchefrykard": "🙌🏾🙌🏾🙌🏾🙌🏾💯💯💯💯", "woww_ash": "This is the absolute best thing I’ve ever read. Thank you for putting it in words", "you_think_im_arab": "I love this and pretty much every other post you make!! People need to wake the fuck up because honestly beauty shouldn't even be determined by what we see! Beauty should solely be based on what we CAN'T see!! I've known some \"Beautiful\" people in my life and they had some very UGLY insides!! I know this isn't exactly what you were getting at with this post, however, I thought I'd piggyback off of the topic a bit lol", "maniilovee": "This!! I had my friend tell me that I was unhygienic because of the hair on my armpits but I quickly put that to rest because her insecurities with her own body hair wasn't about to be minesss", "rmblrose": "This is awesome! As I grow older, I want to shave less (and have less time to do so), have resorted to laser hair removal and waxing as a way to mitigate the task... the other day, I floated the idea of not shaving my pits to my boyfriend and he argued in disgust how badly he wanted me to keep up my mindless route. Of course, I continue to do it for me, not him.... but your post has me seeing this as so much bigger then just between us. Lol", "alainabcyr": "We stan a hairy legend", "1stborndread": "Never understood the Brazilian. I want a grown woman, not a child. Children are are pubeless.", "karoshinyc": "My wife likes my newfound manscaping and now insists I go as bare as possible below. It’s really a pain to maintain every other day not knowing if there’ll be sex or not. I always thought it was crazy that women were forced to do all that work. And hats off to the effort because I’m now experiencing some of what you’ve had to deal with.", "willisxii": "YAY PUBES!!!!", "fulltimeangel_": "Love u", "amkeitala_": "I don’t shave my legs or my pits. But a girl is going to Miami in a week or so, and I’ve def been on the fence. The path of resistance is already so hard. This was very inspiring I may not shave my legs.", "saintelliot_": "Finding the strength to find my own confidence in this. I’m usually not bothered about my legs but my armpit hair gets really thick. I’m trying to not be so bothered by it myself. Working progress", "sammie_luvv": "I 👏🏾 am 👏🏾 so 👏🏾 here 👏🏾 for 👏🏾 this 👏🏾 post 👏🏾", "cyber.hex": "my ex had LITERAL ACTUAL FUNGUS growing in his pits that he thought deodorant had caused years ago, so he never used it. he also had ringworm in his beard.....", "theepurpleonion": "I wish I could hug you for this post.", "madeforsteviemovie": "Didn’t even know what my body hair looked like until I got a wild hair 🙃 to try natural in college. Sometimes I remove my hair but it is because I feel like it now, instead of societal expectation or shame. Everyone should feel as free. 🙌", "thetriiinitytafari": "I haven’t shaved my armpits/pubes in like 3 years & I only shave from the knee down sometimes when the hair gets annoying to smush in leggings 😂", "__eight.nine": "Son what !!! I ode love you #InmyBronxvoice", "enyaallupinya": "@grumpy_plant_boi @speed_nugget_", "philyyy741": "👑👑👑", "hailsatan420": "I haven’t shaved my legs or anything in 18 months. I’m going to Miami in May for XBIZ & have been on the fence about shaving for it. Thanks for inspiring me to stay natural🔥", "prttylilmonster": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "ikarikutu": "I never stan but I stan", "fuck.quinn": "THANK YOU!!! 💖", "nicoletracyosborn": "@nassssimas read the caption !!!", "alwaysangel": "I never understood how something that naturally grows out of your body is unhygienic 😕", "laithdaniels": "Beautiful", "boyimhighmove": "Big facts.", "alex_grapejuice": "Yes ma’am. Here for the revolution. #wolfseason #wolfseasonyearround", "cestlag": "🗣🗣🗣", "dollhouselucy": "The other day my mom was giving me a hard time for my underarm hair talking bout what people would say and I thought ??? They gon kick my ass...no!", "nnefaye": "Teach them 👏👏👏", "aheadstone": "Ms. Savage I concur 100%...never bothered me and for sure I am so in tune with pheromones...Much more alluring than any other fragrance", "samanthaliftsyouup": "@lil.bruisie one of my favorite accounts", "oooooh_na_na": "BOOM BISHES!!! I just personally prefer to be hairless and don't care what people do.", "melissanathalia_": "💖💖💖💖💖💖💖", "bigbeardlittlearms": "Do y’all. What we gone do not like women anymore", "oxtail_tiddiess": "🙌🏾🙌🏾🙌🏾🙌🏾", "amiiiritafari": "4 years shave free on the legs + pits and counting! As for the puss I sometimes do my bikini line or trims here n there but I let her stay furry✨ super overrrrr years of excessively shaving everything in my early pubescent years! Letting the fur fly freeeeee 💫", "pink_zeppelin_": "i just really truly adore you in every way.", "quell87": "😍👑", "futurewinedad": "Queen 🙏🏼", "shaemarietheartist": "Yes ma’am", "folafolafola": "8 yrs yo #noshaveever 🙌🏾", "marilyn.mia": "🙌🏼🙌🏼👏🏼👏🏼", "kiranspirations": "I thank you. 👏🏾👏🏾", "bigga_dondada": "I wouldn’t care about some hair on ya body your a fuckin human being!! We could trim our shits tho I don’t want no hair n my teeth n I know u wouldn’t either but live ya life babygirl!! That ain’t stoppin a nigga from bussin u down lookin like a 3 course meal BigFacts 💯", "konji_sen": "Way ahead of ya. Figured out that 10/10 niggas WILL STILL FUCK 🤣😂🤣 saved so much money on razors 😂 eye brows be BUSTED af. STILL FUCKED.", "emiliecakes": "YESSSSSS!!!", "sanhopeless": "I put conditioner in my pubes 😆", "shaunda_rona": "Wolf season bih! LOLOLOLOLOL!!! 🐺 This post is legit, tho! This fixation on hairless women is too much. And real talk grooming =/= proper or even adequate hygiene. I’ve heard too many stories of bald pussies and balls that smell like the fuck of 40,000 years. And yes, hair actually does protect the coochie cat, urethra and bootyhole from infections", "vvvanavvv": "LOUDER. FOR. THE. BACK.", "weirdocity": "I haven’t shaved my puss in months either i don’t CARE ! Gives it extra flavor 🤤💦🤫", "destinispaeth": "@amilijoy I love my soft fur and we’re making 2019 the year others join us", "lizgraham28": "👏👏👏👏👏", "m.trouvaille": "💯💯💯🙌🏽🙌🏽🙌🏽", "paget_ross": "🙏🏼🙏🏼👏🏼👏🏼", "badaz_precious": "😏🖖 already started.", "sosa.813": "👏👏👏", "abuggslyfe": "I wore my legs hairy all last summer without a second thought.", "rocstarvisuals": "💪🏾💯", "southern_gentleman225": "Looking fantastic"}