{"jevonneri": "😘", "cruzfelix_01": "😝", "therianshaw": "This is how I feel about JCole", "bbsmith___": "Read it all and 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 This was perfection!!!! 🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤", "p4pammy": "Wow", "a.marylli.s": "I’m always so inspired you, thank you 💛", "kingsherrm": "i miss you", "williamvcrouch": "So young and yet so insightful.", "samiagrand": "Too many women regurgitate values and opinions they believe to be “right” not realizing that they are themselves complicit to systemic sexism and patriarchy.Keep doing your thing sis 🙏🏾", "tutumarion": "We love and appreciate you and the work you do Raquel💙💙💙", "mercury.j971": "Savage 😍😍😍😍😍🔥", "michaelduslar": "sexy", "fromajesty_uncutt": "Did she say something new?? Or is this about the interview?? (Ps. I agree lol)", "carbon.elektra": "What’s your sign?", "queenelizabethdenise": "As I told my homie the other day. If you feel like looking outside of your relationship for validation from any man, you are in the wrong relationship! It starts with self love and self esteem.", "sugarcainx": "I actually plan on making a video about this this week", "pepperwitakickmotley": "I totally agree @raquelsavage, I feel the same way", "lupe.space": "I definitely thought the tree was part of your hair", "shopuntamedflowers": "I love this. ❤️❤️", "sagittarius_jay_1": "oh my God girl you can't be doing that I want to make a whole lot of kids with you damn", "llacsahuangacampoverde": "Rica bombon", "feelyourmind888": "Your page is full of truths", "teacopeulous_photography": "🔥🤯", "falkwittkowski": "🤩🤩", "worshipsirking": "I looove this picture btw...", "clickmybic": "“I’ll go out screaming if it means I can influence one woman to live authentically, however that looks for her.”✊🏾👏🏾✊🏾 @raquelsavage", "ummmmhello33": "I love you.", "tuturamlady": "@00the_enigma00", "johnrobotfilm": "Call the police I just witnessed a murder your killing the game!🔥🍾🌪☄️⚡️", "rachelcroonquist": "Really, profoundly well written. You are gifted in so many ways. I follow you on twitter as well, and you continue to inspire, educate, and encourage me. I am so proud of you, and I love supporting you.", "starshond": "@raquelsavage I followed you because someone told me about you. I was very judgmental regarding you, until I started to read more about you. I found you to be very open and free and I admire that about YOU. All I'm saying is to each it's own WITHOUT JUDGMENT AND BEING RESPECTFUL OF EVERYONE, even if we have different views, perceptions, beliefs etc...", "_yayaannise": "Whewwww! Great perspective!", "foxc_fine9": "Wait did she come out and say something new? I don’t ever recall her forcing anything on anyone- she just stated how preferences for herself. Now the raggedy ass bs respectability men were toting her as goals but I never took any of her comments as talking down on folks. I could’ve missed something though too.", "_kdsc": "🔥❤️🕊👀🙏🏿", "noorsworldtour": "What did she do", "ricothedon710": "🔥🔥🔥", "se7enthepoet": "Ummm mam", "half.queen": "you’re incredible", "soup_da_coupe": "🔥🔥🔥🔥💙💙💙💙💙", "hernameisrocio": "This is my favourite pic of you 😍😍", "comediankeishahunt": "O", "you_think_im_arab": "This pic though!!!!😍😍😍", "naomi110493": "❤️", "tay.buff": "100% YES 🥺💞", "__purplereign92": "I love you so much and just following you has changed my life 💕😍", "kingwoo62": "Oh my!!!!", "iamking_rob": "Nice post, much respect", "nicollette1111": "👏🏽 Thank you 🙏🏽❤️😘", "thehumblehelper_": "🌹🕊", "dreaaa_g": "You have definitely influenced me to live more authentically! Thank you", "fagansjonas": "🔥🔥🔥🔥😍😍😍😍", "jazzyledeuce": "😭😭😭😭😭😭😭wow thank you 💪🏽💪🏽💪🏽", "artreject": "My opinion on Ayesha Curry is she has the right to have an opinion but she does not have the right to enforce her belief system on others.", "chrishaunsweet": "This is why I love you (as always)", "daisyjfernandez": "I was born to be a whore, and you inspire me so much!! Living disobediently and unapologetically and full of rage (and cum) is the way to go ❤️ thank you Raquel!! 😭", "arihooks": "Also I thought the plant to the left of your head was part of your hair and was suuuper impressed for a moment.", "ssaerbearr": "@nishi_fatima", "najibayasmina": "Say all of the things! 🗣🗣"}