{"jazzlikejupiter": "hey. love your content and your vibe and what you do. also just wanted to be a voice here on this post~ i’m one of the people who got pregnant using this method. i love the destigmatization on this post- you’re right, it’s not just for lazy or irresponsible folks. but the risk is very very real and i have the abortion experience to prove it. not advocating against this method, just here to remind folks that, as described in the statistics you mentioned, it’s not the most effective. thanks for the discussion opportunity!", "sierritanevada": "@charliefarber lol this is us!!!", "itleee.bich": "@livdexperience @wombpod", "danical1fornia": "This is the kind of education we need 👍👍👍", "jevonneri": "😘", "crown2_crowns": "💪🏾👍🏿", "impeacelikethat": "I kept hearing the term “Rhythm Method” on Whoreible Decisions but had no idea what they were talking about. This adds some perspective", "tea1000": "Gets my vote! But hey, no problems nowadays after my vasectomy 💦 💦 💦", "mercury.j971": "😍😍🔥🔥❤❤", "feelmypaint": "Thanks for explaining!!so many have a misunderstanding", "_sanglish": "@kreole_khaleesi LISTEN!!! Read this here.", "_psychi": "OMG i used to date a guy that would always ask me “you like how wet i am?” And i just dndhudb", "notoriousnichie": "I need to recreate this look... what’s the size of this mirror 😍😍😍", "antokamash": "I've used this in all my long-term relationships never had any scares. Thank you for speaking on this. It a great technique if your disciplined", "meenoocat": "@weilla_", "sunshine.so.bright": "Sooo happy I found you page!", "the_essence511": "😍", "emma.sadie": "V", "my_cs_up3": "🖤😋🤙🏽😋🖤", "kelerriverssmith": "@kalepaki", "ryanrudd30": "Beautiful 😘😘😘😘😘😘😘", "sadiewoodson": "Love love love this!!", "ac_denzel_g1": "Very beautiful pic 😍😍👅💦💦😻", "kinggbo": "True. I've perfected it", "elcajunny": "THANK YOU💜", "tiakeyaira": "Didn't know any of this", "sanhopeless": "There’s apps to track fertility ❤️ I use “life”", "vivaslasvivas": "This the shit they don’t teach you in sex ed", "rata.thompson": "Yes 👏🏼👏🏼👏🏼", "dockkmusic": "This is so fucking irresponsible.", "erraticallyliving": "THANK YOU! as someone who is highly sensitive to the chemicals in condoms, hates single use items, and just hates condoms in general, thank you so so much. It is so nice to see people speaking this truth.😍🙏", "king_tra1n_419": "Lunch", "lowkeymeena": "Sharing the good word 🖤", "tvnyx": "this is v informative and important", "lu_lyndsylu": "The pull out method has work for the past 5 years with my partner... still no kids. Thanks!", "soul___full": "-AKA- \"FAM\" fertility awareness method. 👌🏾", "kremedelakitty": "Frisky Business", "syndrome_air": "Thank you for this education! My partner and I have been together a long time, had two kids, and I’ve never been on BC. Every once in a while we like to do it without condoms and I’m so thankful for this method. This and becoming more comfortable with period s*x!", "d.anthony1": "Beautiful 🏆", "coloredskeptic": "10 years+ of this and zero unexpected pregnancies 🤷🏽‍♀️ .... 👏🏾", "mr._.insensitive": "Informative 👍", "sheknowsthebody": "Very nicely explained", "queenafronam": "So funny you post about this because I just heard a convincing about not realizing they can or get someone pregnant while using this method. Even though pre cum usually don't have sperms many people are unaware they can. I believe 1 in 5 women get pregnant while using this method.", "laurs.dunlop": "That keyboard smash though 😏 skkgdjubfvhk 👏🏼💦", "danger5940": "😍nice", "phillenne": "Sexyyyyy as fuck.", "templeaura": "Wow beautiful ❤️", "phoneman623": "👏🏽👏🏽👏🏽 Thank you for the knowledge", "airyuh51": "Love telling my nigga he wet 😂 it’s helluh a turn on too.", "the_muscle_whisperermia": "This method works very well for me.", "thefirstjamal": "I love you", "_mia_lynette_": "@tatyerra_ what a coincidence. Btw I love her", "sunnispeaks": "Got to watch that period tracker too", "based_facts": "🔥📸", "whodatniners22": "Oh my have a good weekend boo 😎😉🔥", "xonayimaxo": "💦💦💦💦💦", "rrmo3": "Let’s shoot a video"}