{"hkl1117": "@__skhan______", "harikak98": "Hey I hope she is doing great cause I see numbers rising in NJ and your sister is more inspirational than you to me (med student actually ) . I can understand how you must be feeling cause I have my family in that same state and we are not near them , that is more frustrating . I hope your doing just fine as like some of us .", "moontales.beauty": "A huge heartfelt thank-you ♥️♥️ Sending so much love! ♥️♥️", "shrimarai\nVerified": "Verified", "maryammm___01": "💕💕💕💕", "mehndii": "🙏🏼", "myfashio9diary": "I wish I was near to her to give hug and say you are real super hero!! Kudos sis ❤️ please take care !!", "christinavargas93": "Yes please stay home! Wash your hands.. drink lots of water....no huging of others..... No kissing.......if you feel a thing take it to the Dr. or hospital", "drratikagu": "Love that you guys are posting this! Huge thank you from doctors in NY!!", "subbucooks": "Thanks Monica Akka .. you are true superhero and salute 🙏🙏", "anitasoni": "#weapplaud", "chickencherrychopstick": "Gown wearing heroes!!! 🙌 Kudos to all medical staff & professionals for showing up... 🙏 @imranamirrahaman", "fusioneats": "Agreed . Staying home and taking it seriously . Thankyou to your sis and all the healthcare people around the world who are doing all that they do for the rest of us ...", "pannapantry": "Is this akka??@deepica 🙄God!can she pls not excuse herself....", "common.assembly": "A special solute to all the healthcare workers today on National Doctors’ Day ✨✨✨ Lots of love and gratitude 🧡🧡🧡", "kcmn00": "She looks like Lilly Singh with her mask on!", "iij4": "Salute!! Prayers for all of you guys #COVID19Fighters #COVID19MedicalStaff especially for that little dumpling growing in you ❤️... Stay safe!", "romabuendia": "💕💕❤️", "pushp_4u": "Great🙏👍", "sarah_asif_ali": "Don't make a mess n plz tie up your hair. Dont spread germs.", "christendominique\nVerified": "Verified", "zulekhamulla": "Beautiful soul inside and out . God bless her . ♥️", "browngirlfinsta1111": "@sarashakeel use your magic on this video please 🤩", "selfkind": "💛💛💛", "in_gal": "She is a true hero !! God bless her and the little one immensely ❤️", "ksanusha": "Omg.. this is just too powerful! Stay safe everyone! God bless ur sis n everyone risking their life to fight this virus. ❤️", "sejali": "❤️❤️❤️", "sansaar__kaur": "Bless her and that baby in the belly 🙏💕", "rezwanders": "@ayesha43", "mykitsch\nVerified": "Verified", "theluxurybelle": "❤️❤️❤️❤️❤️❤️", "anitha_munivenkatappa": "I hope she is fine I will pray for her & all the doctors who are taking care of public without thinking about them & Deepica please convey my gratitude to your sister & brother-in-laws 🙏", "sindhura_thuvvara": "Monica please stay safe", "mamtamohan\nVerified": "Verified", "positive_next98": "🙏🙏🙏", "chathaamy": "🙏🙌", "amruthaharsharao": "Jus wow! The world needs more caring doctors like this! Thank you @monicamutyalareddy for setting such an amazing example for the next generation! Praying for you and Baby Pandu’s health and safety! 💕", "disc0gal": "😭😭😭", "imamandeepnagra": "👍🏻👍🏻❤️❤️", "navya_naidu": "No words❤️", "leelarathan": "❤️❤️❤️❤️👏👏👏👏👏", "harley_art": "Congrats 💐", "mangoms": "💕", "earlydawn1996": "My cousin is a resident in NYC she is tested her results will be back in 3 days she has a terrible cough and is extremely sick I hope my kashmala baji gets better 😪", "passivedrifters": "❤️❤️❤️", "sirishanandini": "🙏 I’m staying home. Deepica, I’m hoping our sisters and all medical professionals can stay safe and healthy during this time! Thanks to your sister for still keeping her oath even while she’s pregnant!", "muffyshaikh": "❤️❤️❤️", "vsaisahithi": "Praying that your sister stays safe and keep others safe too ❤️", "gloriann_ortiz": "😍😭😷", "luxeisle": "Bless her 💗", "niranjanramesh": "Stay safe sis..! Please wear a N95 mask. This mask isn’t enough.. 🙏 Thank you for your service. Hats off", "divya.arora.5036": "God bless her", "charanya0907": "Bless your amazing sis and all her colleagues! ❤️", "jasmindaceleste": "❤️❤️❤️❤️", "sarahelamin_": "Thank you truly ❤️🙏🏽", "coffee._and._books": "@lindsey.e.villarreal @gabriella_dwyer", "skinsociety_": "#flattenthecurve", "artistncrafter": "This is awesome!!! Super similar to our latest scrub cap quote!", "have_faith18": "🙏🏿🙏🏿❤️❤️", "life_is_vertigo": "@deepica Sending prayers for your sister, family, and everyone to be safe. She is Wonder woman for being there to help all of those in need. So much respect and admiration for her.", "chrissymetz\nVerified": "Verified", "gauriiis": "💗", "chasingbinaries": "Sending love and strength to your sister @deepica! 💕", "navkaur.co": "Real life superhero! Thank you for everything you do and take care💕", "jasmineandmarigold": "❤️❤️❤️", "wholisticpharmacist": "👏🏽👏🏽", "sandaspotlight": "❤️❤️❤️", "manj_bassan": "🙏🙏🙏🙏🙏🙏", "deeshbedi": "❤️❤️❤️", "iconaccidental\nVerified": "Verified", "ahashbrown": "❤️❤️❤️", "saripalace": "Our hero👏", "rashi.brahmbhatt": "@deepica as a front line worker myself this just got me emotional like never before... to see your sister still at the go w being heavily pregnant salute to her and mama Pandus message is what I’m balling my eyes out at @padmasrimutyala 😭😭 you are too cute mama pandu 😍❤️ and Monica said it right due to our jobs me and her can’t stay at home so people for us STAY YO ASS AT HOME!!!! Think about all of us essential workers who can’t and do it for us🙏🏼🙏🏼", "iamjennifermagana": "sending much love 🤍🤍🤍🤍", "love_thy_red": "Respect ♥️", "farziazaman": "❤️❤️❤️❤️", "shahana.ck": "❤️❤️❤️❤️❤️", "reshma_kallem": "Superwoman🙏🏼", "ashlie_kristin": "Tell that to our local golf course that has been deemed essential. #richwhitemen #thanksmikedewine", "blushandglowbyvee": "💕", "sharlenegrover": "❤️❤️❤️", "vitamincaffeine": "My brother is a doctor too and I'm so proud of all the healthcare professionals. I'm def staying home 👩‍💻 since we don't know how else to fight this ! Blessings from Seattle , wa", "empoweredkitchen": "I hope people are staying home and truly social distancing for your sister's sake and all of the amazing healthcare workers. Thanks for sharing and lots of love and protection to her! 💕🙏💕", "simsagoo": "💜💜💜", "makeupaddictioncosmetics\nVerified": "Verified", "sruthimadhu": "Chills", "sugar_plum_jam": "❤️❤️❤️❤️❤️❤️❤️❤️ staying home proudly. I have a cousin who is an infectious disease MD and my sister is an ICU RN. God keep all the healthcare staff, janitors, first responders, sanitation, social services, postal workers, grocers, delivery staff and the willing volunteers.", "suespinich": "You are our hero. Thank your 🙏", "finujimmy": "Proud of you..God bless you..😘", "blancahvelez": "Monica you Rock!!💗", "beautyproductsaremycardio": "🙏🏼🙏🏼🙏🏼", "dimplekumar": "Stay safe🙏🏽🙏🏽", "gurpreetk423": "❤️❤️❤️", "jess.prakash": "I only wish people were smart enough to follow all of these requirement. It is shocking how reckless and complacent some human can be.", "jenmichellebaird": "❤️❤️❤️❤️❤️", "sherryshroff\nVerified": "Verified", "sakshib_18": "I hope she’s safe! Praying for every single person who is helping us at this point they’re all so strong 😭", "cravi3034": "Hhi", "dilshanweddings": "Powerful message and much needed! Thank you doc for all that you doing!", "sher_dauphin": "❤️❤️❤️❤️❤️ Ahh your sis is a HERO prayers for her, her husband and her baby boy🙏🏾🙏🏾 thank you for all she does to keep us safe👸🏽👏🏾👏🏾👏🏾", "nehalia": "This gave me chills. I hope she stays safe ♥️", "juliedbw": "Sending healthy hugs to your dedicated sister🤗", "redefined._beauty": "Thank you to all the doctors, nurses, paramedics, keyworkers around the world for doing everything they can to save and help people", "autumncomm": "❤️❤️", "shellcharan": "Hey Deepica , When's Monica's baby due?????", "kdn_07": "Staying home. Thank you to your sister and all other healthcare workers.", "imnnoyed_365": "💕", "kamanabhaskaran": "🙏🏽🙏🏽🙏🏽", "magic_taimania": "She’s ❤️🙏", "indyk_06": "@monicamutyalareddy is a hero! 👩🏽‍⚕️💙 stay safe, mama! And big hugs to all the health care providers! 🤗", "sandhyachoprakumar": "🙏🏻🙏🏻🙏🏻", "kscottweddings": "She’s amazing! 🙌🏾 Praying for her and little baby to be safe.", "mitalee_m": "Thank your sister for us🙏🏽 hope she stays safe🧡🧡🧡", "hufflepuffinallday": "What a fighter! Stay Safe ❤️", "shrayani_dutta03": "Hero!💖🙌 God bless her!❤️❤️💕💕💕", "itzmonnn": "❤️🙏", "ooshchawla24": "🙏🙏", "dadamilic": "I am gonna scream HOW LONG WE JUST BE TEACH ABOUT CORONA,WASHING OUARS BRAIN TO DEATH", "somaayurvedic": "🙏🏽💖👩🏾‍⚕️", "rameshsri18": "🙌🏻🙏🏻🙏🏻", "sannsimmi": "😍", "leena_bul": "😍", "affirmationaddict": "Omg real life superhero 🙏🏽✨", "niida26": "❤️", "sheebu462": "Thank you, sis. Be well. 😢🙏🏽", "swathi.kusuma": "🙌🏻🙌🏻👏🏻👏🏻👏🏻", "elavandrahirmez": "💖May God protect you always, thank you and am praying for you and the baby!🙏🏼", "moun_reddy": "🙌🙌🙌🙌🙌🙌", "thesmilingsweetheart": "Sending her and you lots and lots of love ♥️", "schaefer.wu": "I'm tearing up. Thank you Monica for being on the front line. Please stay healthy and safe. ❤️", "radhikagupta14": "💪🏽❤️", "sharonsds": "Monica.. YOU AND YOUR BROTHERS AND SISTERS IN SCRUBS ARE THE REAL MVPs! (In my you are amazing voice) Thank you thank you thank you 😘😘😘😘😘", "indramanikadiyala": "Bless you😍,stay safe and strong💪@monicamutyalareddy", "meerashakira": "💕", "justanothermuslimmom": "Praying for all of the people on the frontlines. Wishing Monica continued health. Doctor’s are badass, women are badass and mamas are badass! That makes Monica the ultimate b@d@$$! 💖", "feefstagram_": "❤️", "sandychood": "Thank you to your super hero sis and all the other heroes out there. We are so grateful and are doing our bit by staying home.", "shivaanibaghel": "Much love to your sister and everyone on the Frontline ❤️✨ universe protects those who protect the collective 💚✨🙏", "goldenglowla": "Yasssss ❤️❤️", "anjran": "🙏🏼❤️🙏🏼", "jarevathi": "❤️❤️❤️❤️❤️", "neha.kotecha.photography": "🙏🙏", "sravanikarthik12": "Huge Respect🙏🏻🙌🏻", "mells_musings": "Warmed my heart. I hope people pay heed.", "d_happy_soul_19": "Hats off to these angels who are here to protect us...❤️ such a selfless service ur sister is doing deepica ❤️ Proud of your sister and proud of you for having her as your sister 😘😘😘", "vilekharizo": "So much gratitude!!!!! 🙏🏼 Prayers & Love ❤️", "srilalitha_rankireddy": "Salute🙏🏻👏🏻", "mermaidzareforreal": "🙌🙌🙌", "styledevotee": "Yes! Everyone should stay home. We need to save our superhero’s who are fighting for us. 👏🏽❤️🙏🏽", "stephaniefernandessouza": "Take care of yourself and the baby", "kangamrit12": "🙌🏽❤️", "preethiprasad": "🙏🙏 respect", "amiralamia": "Love from Italy🇮🇹 ...stay safe and stay home!! 🤲🏼❤️❤️❤️", "aman.kandhola": "🙏🏼🙏🏼🙏🏼", "moninooo": "She and everyone else in the medical field is so brave!! We appreciate them so very much!! Thank you Monica for taking care of the sick during these tough times.", "paigelizabeth88": "Love you @monicamutyalareddy praying for you and so grateful for what you do✨❤️", "jignapatelartstudio": "❤️❤️❤️", "valerievanessa.hair": "💖💖The last part put me in tears 😭😭", "poooja21": "🙏🏽🙏🏽🙏🏽", "divividivi_san": "👏👏👏", "chloemorello\nVerified": "Verified", "s_d_1805": "Bless her @monicamutyalareddy 🥺💛", "diane.a.k": "A real superhero!!!!! This is so amazing", "mehekmehndi_by_dee": "Awwww 😍😍😍😍 I hope she is staying safe as much as possible and thank you 🙏🤗", "hunterbellnyc\nVerified": "Verified", "teach_nikitaparshu": "Powerful ❤️", "jayshetty\nVerified": "Verified", "padmasrimutyala": "She is my Girl & my baby Pandu (inside of her). She is My Hero. 🤗😘. Since she is 81/2 month’s pregnant... I asked her stop working... she said “Mom if all Pregnent ladies stop working , who will takes care of sick 😷 patients ? I don’t have answer for that. ☹️. I can’t talk more than that. 😭. My Shiridi Baba is giving strength to her. God please take care of my Hero & my angel. 🙏🙏🙏.", "geshie88": "Hero 🙌", "youngstersgala": "❤️❤️❤️ Be safe and thank you!", "honest_beauty\nVerified": "Verified", "rinadhalla": "👏👏", "sybilrosedr": "This has me choked up, thankful for people like your sister and I just wish everyone would STAY HOME! 🙏🏽🙏🏽🙏🏽 Sending love and prayers", "theprettymadscientist": "💗💗💗💗", "deepapeshavariasandhu": "🥺 amazing woman. May god protect her and her unborn child 🙏🏽🙏🏽🙏🏽", "sher925": "🙏🏽Stay safe!", "tarajaay3": "❤️", "mirthu.a": "🙏 Thank you and God bless you.. may God keep you healthy and safe..", "jigstagram4": "So much respect for her! ❤️ 🙏 Prayers for her, baby and family's safety! STAYING HOME for dedicated doctors and healthcare workers like her so they can help those in need!", "nomadicroyalty": "😩 tell her we thank her and all like her, doctors, nurses pretty much everyone in the frontlines right now fighting this virus @deepica", "aimee_nezhukumatathil": "💖omg she is a superhero!", "keepingupwithnabila": "❤️❤️❤️", "anapsingh": "I am doing my bit for you and your community sistaaaa. Sending best wishes and good health to you, your baby, your family. ❤️", "jsturby": "Love to you and all of your family, Deepica. May everyone stay home if they can and stay healthy during this time 💕", "preets9": "🙌", "poojimooji": "🙏🏼", "farahfashionsnyc": "Prayers for her and her baby’s heartbeat ❤️❤️❤️", "keerthisha_tumati": "Love you Monica akka. N respect you alot.", "swashamak": "💕❤️thank you for your hard work!!", "praty411": "She is a super hero ....all the very best to her for her future", "peppykeerti": "Such a superstar. More power to your sister ❤️", "docsarina": "Thank you for spreading the word ! #stayhome Does your sis have an IG account we can follow :)👩‍⚕️❤️🙌", "dhabhashree": "Huge respect to ur sister.. God bless her.❤️", "jalajav19": "Huge respect to Monica and all medical professionals around the world !! Stay safe !!", "mathusa.x": "🙌❤️", "duquesadelrio": "🙏🙏🙏", "alejandradlc05": "God bless her and her baby! 💕", "saisravanthi_kilari": "🙌🙏", "hijabilife": "Prayers for your sister and little nephew!", "thanmaisudha": "She is a super hero. Will pray for ur sister and her baby's sound health. God always be with her. Take care", "shazandkiks": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽 thank you to your sister and all healthcare providers out there ♥️", "ofwhimsandwords": "God bless her and the others who are putting their life on the line ❤️❤️❤️", "keerthimogli": "Deepica.. whats d update on vaccine for covid-19 ? How many months it may take ?", "punita1028": "She is in infectious diseases, right? Hope she and the family all stay safe.", "suzanghodasara": "❤️", "view_from_the_afternoon": "💕💕💕💕", "yumobento": "Praying your sister and family keep safe! She is a superhero!", "betosa940": "Superheroes ** love u deepica!!", "cassiemeade83": "I'm poor are you all going to sen me a check for 10k?! Hmmm no omay then", "bhanavi": "@durga_ilav", "nurse.tulsi": "Oof! She is so right!!! Sending strength & positive vibes — Stay safe ❤️ 🙏🏽 #thankyou @monicamutyalareddy @deepica", "justdeo": "Shero✨🧡🧡🧡🧡", "shyanjali_04": "❤️❤️❤️❤️🙏🏻", "_.shicha._": "Thank you ❤️😘🙏🏼", "lathabedre": "❤️", "sneha.nalla": "💕", "pinkshergill": "@p.k1980s @rajishergill", "dominiquecosmetics\nVerified": "Verified", "eatprerlove": "I just sobbed 😢. Praying for your sister and her little one! I hope we all continue to stay home until it’s absolutely and 100% safe to step out!", "rashmigillphotography": "🙏🏽", "chelle_bu": "❤️", "shilpagoklani": "God bless your sister and the little one:))", "02bobita": "❤️❤️❤️", "surs.patel": "My sister too @sandhyasamp", "vikkiramdin": "The real heroes🎉 thank you for all that you do!", "shhhboom": "❤️❤️❤️❤️😭😭😭😭", "poovandhree": "💕💕💕", "angie_moments": "May God bless you, thank you 🙏🏻🙏🏻🙏🏻🙏🏻", "rooshyroy": "♥️", "nitu.mehta": "❤️❤️", "shabanas0": "God bless her and the families on the front line caring for everyone 🙏🏽🤗", "kinsheth": "Lots of love ❤️ and respect! She’s truly super mom and super hero! 🦸🏻‍♀️", "eshnahira": "❤️❤️❤️", "badassvibes__": "😭♥️", "joyceplans": "❤️❤️❤️", "preeti.s.gandhi": "🙏🏻🙏🏻", "seemajashn": "🙏🙏🙏Respect and Salute", "funnyproton18": "Deepika, your sister is goals 💕💕", "you_sruthi": "@deepica remember to tell your nephew his mom is a combination of （wonder+super）woman", "alexandrawaetjen": "When is she due?? I am so sorry she’s having to work right now 💗", "lucindaleila": "🙌🙌🙌", "hemavangimalla": "Really great", "nidhi.254": "♥️♥️♥️", "makeupbyshruthi": "🙌🏽🙌🏽", "rpat44": "Bless her and she’s pregnant what an amazing lady", "karishma_desai_": "♥️🙏🏽", "jmilagrosplus\nVerified": "Verified", "ms_chantel_nyc": "Awww the belly took me out! Praying she stays safe! 💕 and thanks for still keeping your oath! ❤️", "reshmamakeupartist": "😩 ❤️❤️❤️", "diptis_eatreat": "❤️❤️❤️", "renukaseshabattar": "❤️🙏", "ninrao": "🙏", "mparry14": "💙", "rajadhyaxketki": "Aww. My blessings are with her and her kiddo😘", "dr.ravali10": "💖😍👩🏻‍⚕️👏🏻😄let's stay safe together @deepica", "iampiyudhami": "❤️❤️❤️", "thealoochaats": "❤️❤️❤️❤️❤️", "santhoshinikannan": "Tons of love, hugs & prayers for the selfless service 😘", "sushupti": "💕👏🏽🙏🏽", "mani1020": "🧡🧡🧡", "theawakenedmama": "Lots of love ❤️", "nagabhavp93x": "🙌🙌", "srij221": "💕", "madhuraspandana": "💖", "daryaaccessories": "💗💗💗", "tarafromearth": "So much love to you and your family ❤️ stay safe. & your sister is a hero!!", "tenipanosian\nVerified": "Verified", "sazan\nVerified": "Verified", "the.aristochic": "Pregnant & working in these testing times.. Respect!!!", "doctor.veena": "Hey @deepica , if Monica’s pregnant - she falls under the HIGH risk category and technically should only be doing remote consultations via phone or video. She should not be on the wards coming into contact with any patients at all... That’s what UK guidelines say and that’s what we are doing for our pregnant colleagues .. would have thought that USA rules would be stricter? Wishing you all the best of health! Love your family and all your work x", "christine___2": "♥️", "divyabgoel": "Deepica will she be answering questions due to the carona virus?", "fatzos": "God bless her and her baby", "janusha_sr": "❤️", "anousshkaa": "Bless her!!! 🙏🏽💕❤️", "sawlmp": "God bless and cover her and her baby with grace", "poojadesaishah": "thank you to her 🙏🏼 stay safe", "sharifaeasmin\nVerified": "Verified", "makeupby_ummay": "💖💖💖", "sandra.hernandez127": "🙏🙏🙏", "alekhyab": "💜💜💜", "wish.wardrobe": "Very heart wrenching ❤️❤️❤️", "purvidave007": "Stay safe n healthy 💙🙏and thank you for all your hard work in caring for your patients", "shwethaviswam": "❤️❤️❤️❤️", "arshiamoorjani\nVerified": "Verified", "amita_marykay_beautyconsultant": "❤❤❤❤", "ka512": "Go @monicamutyalareddy! Thinking of you and bebe ♥️ thank you for being at the frontlines!", "shaktinaran": "God Bless you and all the heroes who work along side you. Stay safe and healthy. @monicamutyalareddy ❤️🙏🏽", "dharpooja": "Awwww @monicamutyalareddy this is so sweet 😭❤️", "divvrr": "❤️", "selfcarebysafia": "👏🏼", "hausofbrilliance": "sending her so much love ❤️❤️", "zeetrainme": "💯", "sndhurella": "❤️ this!", "anu777": "❤️🙏🏽", "debflows": "💚💚💚💚", "biossance\nVerified": "Verified", "sabliminalmsgs": "It must be so difficult for your sister. Hearing the stories of my friends in healthcare is scary and alarming. It's unfortunate and apalling that people aren't following the social distancing guidelines. Much love and respect to everyone on the front lines. 💙", "erikarazzaque": "👏🏾👏🏾🙏🏾🙏🏾🙏🏾", "doseofshivs": "💙💙💙💙", "ankitasanawar": "Amazing work 😘", "zenai0730": "God bless you, your little one & your family. Thank you for all you do. Stay safe♥", "happyeverafter_xo": "❤️❤️❤️❤️❤️", "kyliecasaly": "What an incredible person you are @monicamutyalareddy praying for you ❤️", "__konstantinia__": "😍👏❤️", "lakshmiwarad": "@monicamutyalareddy - Please take care of yourself ! ❤️ praying for you! And thank you so much!❤️", "rohita.rajkumar": "❤️❤️❤️", "nikithamasineni": "❤️❤️", "sahitha.bade": "💯💜💗", "nextwithnita\nVerified": "Verified", "nsanth": "❤️❤️❤️", "suneethanagesh": "❤️❤️❤️", "rs868": "❤️❤️", "karenharmon360": "🙏🏾🙏🏾🙏🏾❤️❤️❤️", "andreia.ribastaborda": "💞", "iam.terenced": "@monicamutyalareddy look at you being a true hero out here!", "vibsfromwonderland": "🙏🏽🙏🏽❤️❤️", "tanejasbride": "Stay safe and healthy! Stay at home! ❤️", "nikita_newalkar_": "So much respect towards her for doing what she is doing🙏", "honeywhatscooking": "🙏🏼🙏🏼🙏🏼", "ibarthwal": "💖💖💖", "kismaa": "🙌🏾🙌🏾😷", "rashmikishore16": "Yes! Please stay at home everyone !", "_lil_mysterious_": "🙌", "journeywithcompassion": "This is next level dedication! Your sister is truly a superhero 💝", "desainedwithlove": "Aw! ❤️", "kinjal_as_angel": "We proud of you 🙌🏼🙌🏼 stay safe ❤️❤️", "pariheart": "💕", "reeltoruna": "❤️❤️❤️", "thediariesofdiana": "Thank you to your sis and all medical professions! ♥️♥️"}