{"candiceragoo": "Is this the deep dark shade?", "ciaracairns1": "What’s the name of this please?", "rocketeer_gohi_": "This is the best investment I have made so far , earning money so without stress nor hard work ?? Ma’am you are too good. You have never failed in paying my profits so I will never fail investing with you . God bless the day I found you. Am proud to have trusted you. Thanks Ma’am Annie Emilia for always been legit from day 1 till now Contact Mr Annie via link below and get your successful trade started @annie_binary_trade", "aparna1218": "Love you 🙏🏽", "elitebusiness360": "Yes anyone that wants to have a million dollar business that runs itself contact us elitebusiness360.com @elitebusiness360", "priminmypumps": "I love your work and what you are doing! Im just a bit confused about this post. You are acknowledging that you are not perfect, you work on it and you have a team who helps you achieve this perfection. You are promoting self love. However, the confusion for me is where you are promoting a product that clearly promotes the idea of attaining perfection. If the post had said Im not perfect. Here is the imperfection and this is what I use to make it perfect, I would have understood it better but the part where you are clearly promoting another product is where the confusion arises for me. This is just my understanding and interpretion of it. I may have totally go it wrong though xo.", "_sebastian.russo_": "Benchode", "makeupbygeedha": "Love you and your realness @deepica ❤️❤️❤️", "ururajdev": "@shraddhapandude the kind of skin care you haven't even thought about 😂😮😮", "tammiejustin": "@prabhajdhanoop", "all.things.beautifull": "Need this product! @deepica does it get on furniture / clothes ?", "phaven_b": "@nayantara11_11", "charanya.s": "👏 👍, well inspired", "shreyatigress": "Love you for this❤️", "diana.manianchira": "@sonu___ i need this omg", "afroza_khan": "That's how my legs look like! You're amazing for posting this @deepica 💕💕💕", "simita_sambyal": "Love it... thank you so much for saying this because there are many out there seeking perfection which puts them in an unhappy state with how they are..", "ushavinodsharma": "@prero_sharma", "melaninmally24": "My legs look like your natural legs; thank you for sharing. I have been made fun of since I was a kid, because of my eczema. I cannot emphasize enough, just how refreshing it is that there are women promoting self love and acceptance not only on the inside but outside, too! Thank you.", "eleeannee": "Get that money sis 😂", "adrismari23": "Bravo👏👏", "shibani.93": "Did u use the KKW brush to apply it? Or just a beauty blender ?", "oanh.hong1991": "Wow you’re really the most authentic woman I ever seen. So happy to know you here ❤️", "kulture_khazana": "You are so amazing!!! And perfect 💕💕💕", "swatilifeisgood": "#respect 💯", "charisse.kenion": "It’s so cool that you’re so open and honest - and also, not being judgemental about a little enhancement💁🏽", "jayaaaaaaaaaa": "THIS is why you are #goals 😍", "raisafathimasiddiqua": "You are amazing💕😍 Growing up I enjoyed being outdoors and have always enjoyed sports. I never minded the tan and scars tha sun and sports caused. But as I grew up, people have always \"advised\" me by giving me remedies and concoctions to \"become fair\" because\"dark hued girls are not attractive and Indian boys only want to marry fair girls\". Your work is so amazing, inspiring and empowering. You make me want to flaunt myself with pride. Love you😘 Love your work @deepica 😍", "anjula_acharia\nVerified": "Verified", "pizzalover5679": "Does anyone know if this would cover tattos.", "the_berni": "Wow fantastic 💖", "missrivera_": "@mandaaaarose", "harikakaki": "I would b really happy if i could b a part of ur team nd in anyway i could contribute to enhance LIVETINTED.", "ruknayyar": "As a brown girl, I would never have to do this but damn, this looks amazing!", "vahinethel": "😱😱😱", "thefashionisha": "Favorite post of yours to date", "manilovesu": "Girl I have the same foot scab and dotty legs! It comes with brown girl territory. Well done for highlighting the illusion though 👏 I remember growing up and seeing porcelain white smooth legs in the media and hating my black ashy knees and prickly black hair on my legs so much- posts like these will show our next generation of brown girls that perfection doesnt exist and to embrace what we have", "shante_allday": "Feel perfect in your flaws.. such a great message!", "davesperandio": "Well this is horrifying", "tashxfash": "Get a pedicure ew", "imamandeepnagra": "👍🏻👍🏻👍🏻👍🏻👍🏻", "colleeningeorgia": "I am today years old finding out the people use full leg make up. I thought body make up with just for covering up a scar or a tattoo when you go to a wedding or something . the more you know!", "someofanum": "Love this so much ❤️", "iamvenusstar": "Soooooooo, when i wear some shorts..... will this skin foundation get on my clothes????", "kinareee": "@kavilove *this is what we were talking about that other day * ❤️💯", "dioryummyfactor": "Uhmmm this post is #EVERYTHING 🙌🏾", "shazia.happycakes": "Brown people knees man... it’s taken years to get used to it.. 💕", "ex_plorer0": "Love this and Kim Kardashian reposted it! 🙌", "soumyakansa": "Check out our KANSA WANDS! They're the most ergonomically designed wands for practitioner. www.soumya.info @soumyakansa Video: https://youtu.be/K-ODhkXf-1s", "shazzajanno": "You are a great role model.", "mmmkokay": "Your legs look super Telugu if you know what I mean lol", "rohitha_ar": "You can never fail in making me fall in love with you💕😘", "mykitsch\nVerified": "Verified", "naidupooja92": "@deepica kim reposted ur post on her story 🔥", "chicmom2011": "Girl I love you and this is so legit! I always wish I had the confidence I have now in my 20s 😁", "lxra.003": "@llisarr29 das brauchst du haha", "v_albara": "💛💛💛", "shannon.earnest": "I love this ❤️❤️❤️", "mcarrasco73": "❤️❤️", "deepika_nand": "I'm so grateful that you shared this. Not everyone is bold enough to do this. ♥️♥️ I love the message you are passing, even though your skin is not perfect but you believe you are perfect as you are then no one can doubt that. Love you @deepica", "shwethavadapalli": "@ndinavahi do u think I should get it ? It looks so good", "christinajademusic": "@saydz180", "queencitytrends": "Just got mine in the mail too!!!", "bec_tania": "@ikas_im i need this for my yucky🦵🏻 🙄", "froberrypie": "Omg I finally got what you mean by strawberry legs- I have it too! I always thought it was weird and like I grown hairs or something! 😳", "theannakaiser\nVerified": "Verified", "mybeautyandfashiondiary": "It does gives a nice coverage at glow isn’t it😍", "fiend_like_queen": "Omg our legs look the exact same , same dark knees and dark patches, we are leg twins @deepica 😂😂and the shape is also same 😘", "svenothene": "❤️❤️So true", "rockyleeart": "I drew kim ✏️✏️✏️", "tmaster11": "Nice legs😍", "iipocah_4174ii": "What color are you using? Omg it looks great!!!", "montano_jenni": "Que asco", "anjanaanja": "Wow.. I always thought and wondered how these actresses have no marks and got those amazing legs.. haven't they ever taken a fall at some point in their life or do they have these amazing healing power?? Then I thought it's probably good genes or expensive treatments. Now I think I know.. ha ha.. thank you for educating us and showing the very simple human side. . Its refreshing!", "glendaly_llenas": "😍😍😍😍😍 Love you more now", "saumyapremchand": "💕💕💕💕💕", "mrslkor": "@deepica i so want it now but is it called deep dark? Cos that looks way darker than you and I’m pretty sure we’re the same color 😬", "faiza1730": "So amazing you're sharing this. Maybe it's a generational thing or just the community I grew up I, but the brown girls I knew growing up never shared these things. It was always hush-hush and when these 'secrets' did come out it was shame someone for not being perfect. I see a huge change in this attitude in the newer generation and so glad its finally happening.", "reneebarnettmakeup": "Wow! Ok now thats amazing...ok kimmy @kimkardashian I see you girlll 🙌🏽🙌🏽🙌🏽", "kaytcast": "@ellie_71188 @melsylvester wow!!!", "squ4dmom": "Wow that is seriously awesome!!! I never thought brown girls needed this stuff but here it is🙌🏽", "namratadadlani": "The left to the right is incredible!!!!!", "skb.ontherun": "🙌🏽 🙌🏽 🙌🏽", "kan.i.ka": "Love that you’re keeping it real. What a great role@model you are to us ladies out there cxx", "oneoceanbeauty\nVerified": "Verified", "zinniasiddiqui": "Wowwwwww, might need to get!", "trushaka": "Really loved reading this. 💜", "_kochchimiris_": "Thank you for sharing this ❤️❤️❤️", "marwaatik\nVerified": "Verified", "ramzieh95s": "@baraasimhat98 wow", "aiswarya9": "Congrats Deepica!! KimK shared this post on her stories 😍", "alishacee": "Thank you for sharing 🙏🏼", "ericamdann": "Love this! Thank you for sharing this super important and real message. Beautiful is glam, and beautiful is natural. xx", "sazan\nVerified": "Verified", "vidya19": "@hnat2610 thoughts? 🤔", "zimwayyy": "@ms.okany did u know there’s a foundation for body? Today I learned something new", "ashwininarayanamurti": "Thank you for sharing this.", "harryjoshhair\nVerified": "Verified", "rinnie_o": "@brighteyes85x I think i was telling you about this @kkwbeauty product. Like magic!", "cassandrajpatterson": "Your transparency is so refreshing! Thank you!", "chaitraammangi": "Ur great 😘, i have become your fan from now", "thesilvasmith": "This is the first time I’ve seen legs om anything remotely beauty related, that looks like mine. Those are my knees. My knees! I’m getting a real kick outta this @amylovenath", "splendidposh": "👌", "tarnjhalli": "Kudos ❤️", "amanda.schauer": "@jazzybhoolove", "noircoreen": "I hope you got paid for this, because you’ve def convinced me to buy it!", "bmistry73": "Looooool 🤣🤣😂 @ ashy af! What you like! 🤦🏽‍♀️Thanks for doing this review as I was wondering what it would look like on ashy skin too! 🤣🤣🤣", "rainbhodash": "@deepica Is it possible for you to add tags which products you used to get this gorgeous looking legs please???? Which brands you used... 1. Setting powder. 2. Loose highlighter. 3. Body scrub 💗 I’m an Indian woman myself and have the same issue, but would love to do this for when I go out on date night with my husband. xo 💋", "zuri.ki": "Strawberry legs 😂 I always wondered what to call the dots on my legs lol. Now I’ve gotta try this stuff!!", "mrsadriennebosh\nVerified": "Verified", "ivonne.dtorres": "Honesty is a great quality in a person, thank you for sharing 🙌🏻", "archnapendyala": "There is no stock available to get one 😢", "jasmin_angelicaa": "Thank you for this!! What we see on internet defitnely isn’t always the reality. ❤️✨", "simmers79": "not to put any girl down that uses body foundation but my imperfect legs can be slightly stubbley at times and ashy af without cream but never in my wildest dreams do I imagine anyone applying body foundation, didnt know there was such a thing with the common use of online filters...who cares is my first thought but glamorous models or movie stars lol. Maybe its coz I just turned 40 that idgaf about makeup. or maybe I just need a personal makeup tutorial from you! #farfromperfectlegs #cantevenputoneyeliner", "nishabalsara": "😱 OMG IM SHOOK!!! Thank you for this reminder!! Needed it ❤️ i have ashy scarred strawberry legs too 🔥🔥🔥", "thatkhasigirl": "❤️❤️❤️honest", "tanzina_ela": "Real AF😍", "meerasanimaltribe": "❤️", "pree_theeventplanner": "You’re soooooo right. I love this. And soooo needed to hear it. ❤️", "bhoda8": "@deepica thanks for this post ... so you mind sharing which setting powder you used? Sorry if it’s in the comments above already 🙈", "toniamattu_yuology": "Gosh, I remember the days of putting my Johnson’s baby oil all over my legs to get them to shine like my lighter skinned friends legs seemed to 🙈🤷🏽‍♀️. We’ve come a long way and thanks for sharing our reality with this post.", "catherinecerrillo": "So rare to see reality esp on the gram! I applaud you over and over!", "nchhim": "wow 😍", "makeupby_ankita": "I need this is my life!", "kirnpit": "Thanks for sharing! This product is amazing! You great with or without it. I love that you show the “truth.” Us Desi girls do look like this!!! #represent 🙌🏾", "banglez_jewelry": "@imantdot", "kaminidhanjee": "@nisha.narotam thoughts? Think it's cool but mixed feelings about putting foundation on my body 😂", "ajohnston0721": "Natural skin.. Love it!!!", "nadjielise": "Wow. Looks good", "malinisarathi": "Thank you for this. You constantly bring awareness to these kind of issues .", "milliecruise": "🙌👏Brilliant post for all to read and digest , thank you for keeping it real and so good to see a woman having such genuine contentment and confidence in her own body , so refreshing ! More of this please ❤️", "sarah__sabeen": "😍", "mrsshanker46": "That’s why I love this gal @deepica", "archanaeyer": "Which setting powder? I’m a similar brown with sweaty legs", "aditiseeu": "❤️", "mslucky7": "Your words just sold me on this!", "iffathnaaz": "YOU ARE THE REALEST! ❤️", "salmaelsaadanyofficial": "@anavolkmakeup omg", "qvashti": "We love u girl! Thanks for the amazing tip! 💋💋💋💋💋", "reshmaphotography": "So intrigued! Growing up I refused to wear shorts bc I was so self conscious of my scars! I may just have to try this! Thanks for sharing", "sonia_heer": "@shreebee96", "_bre.t_": "Strawberry legs over here too so happy that you reviewed this. Thank you!!! 💕", "dhrumishah_": "@_rishalix", "cartagena_bee": "💖💖💖", "the_rvk_lifestyle": "Such a lovely post. Although I feel you should try the shade Tan", "yvo_masih": "👍🏼", "glamourdollsstudio": "Love this! You are so real and you are a perfection mentor for the young kids out there who believe everything they are told on social media #bigrespect #mentor #loveyour ❤️❤️", "jeffrey.hair": "That looks like great natural tone and coverage", "sheynellenumberfive": "Love your honesty! 😍", "ahsanactive": "Amazing!!", "shivone88": "I love how real you are 💕", "byellapu": "Try sally hansen's airbrush makeup for legs. Drugstore brand but awesome. If u like shimmer go for the spray and if u prefer a more matt look opt for the lotion", "jiannaangeliek": "WOW! So cool💗. Thanks for sharing #beautifullytinted #tinted", "drpunamkrishan": "I used to feel so insecure about my strawberry legs but as a doctor I’ve seen a bug trend in Asian girls with this. It’s frustrating as there is no treatment and there’s only so much you can exfoliate! Thank you for this honest post. We need to embrace and accept our flaws, as hard as it can be sometimes. Going to check this product out... 😘😘", "peplumnbubblegum": "Need so bad!!!!!", "natashaia": "Have you tried the Charlotte tilbury body glow stuff? It’s on sale at Nordstrom and I’m debating buying it", "luxeisle": "Thanks for sharing I’ve been seeing posts for this and want to try, is it only sold online?", "axshoe": "How do know what shade to order ???? Any tricks?", "saxenaradhika": "You're amazing! Thank you so much for this. ❤️", "lynnirizarry": "👏🏼", "tutifruti2001": "This is so great of you to share. Young women especially need to know women have scars, flaws stretch marks. Natural and inherited. Be proud🙌🏼", "aslowwinterrun": "Strawberry legs are real! I always hated my legs and would scrub and exfoliate until I finally learned to accept them. I never knew anyone else with skin like mine so I always felt self conscious. Keep it real Deeps!", "mazzellabella": "@deepica As a mom, I applaud you for this post (and many others) that show and teach our girls to embrace both natural beauty and glam beauty! #respect", "leerisha": "Thank you for always showing us you! We appreciate it😘❤️👌🏼", "curldomination": "Need more bloggers like you. Thanks.👏👏👏", "sellybee1": "@poppyqbert", "preetiartistry": "Look at ‘dem legs 😍", "meganpooran": "You are beautiful as you are! Thank you for sharing this post with this message v. important.", "msbachchan": "👍🏼", "leharrcollection": "LOVE this post!", "yolandapataki": "Damn.. Great product. I have strawberry legs too 🍓", "anudayhascome": "Does it get on your clothes? And how is it with sweat?", "shaanmu\nVerified": "Verified", "m.j.syed": "I love it when captions hit two birds with one stone! Promote a product that requires women to hide huge parts of their natural skin to look airbrushed WHILE preaching self love.", "manishasurjith": "Appreciate you... 💐💐💐💐 U r incredible", "nikita_s_karim": "@genita96 this is what I was talking about", "snflwr2121": "Does it cover scars or dark spots well?", "miss_nazlie": "❤️❤️❤️", "pixel_princess": "Wow. I never knew. Thank you for being so honest and sharing", "lidy250": "👍🏼👍🏼", "mspele7": "Thanks for sharing your beauty tips and keeping it real. ❤️", "mostlymeera": "@msbachchan", "idayasree": "Right but you’re promoting a product that literally asks women to cover every remaining part of their body for an “even tone”. Adding to the laundry list of body parts for them to feel self-conscious about. I’m sure it’s difficult to promote natural beauty while pushing products. Everyday folks can’t access the same unnatural rituals to achieve flawless, natural looks. Cuz that’s what they are.", "spiritofbabylon73": "Thanks for sharing sweetie😍 also this helps others to decide on whether to get certain products or not ❤️❤️ I’ve been looking for something like this for 2 years", "cneetu09": "That’s the way to be a true influencer....congratulations to you and may your tribe grow!! :)", "gracellamahabier": "👏👏", "dancing_devi": "Oooh I love this! Thank you for sharing! 😍", "nishoo85": "Thank you fur being so honest! One question.. what setting powder did you use?", "annthaone": "Skrawberry Legz Squad!!! 🤘🏽🍓🦵🏽🍓", "shilpa_hegde": "More power to being us ♥️ @deepica ! Lots of love", "itsallmaya": "@_ptam_", "laurenhealthylifecoach": "Yessss 💕😘", "sharastevenson": "@deepica Have you tried @gleam_melaniemills? It’s been around forever...long before other brands did body bronzer. Also, the owner used it on Dancing with the Stars contestants. I swear by it! Transfer and sweat resistant. I don’t bother with other stuff. 💁🏽‍♀️👌🏽", "nany.leon": "Te amo. Lol 🍉😘", "drjanicepowis": "I just love this so much.", "umnia": "I love this! Thank you for sharing. I totally feel this", "kikimiller82": "@deepica I used to use a tan lotion in college and my friends would laugh but I tried to explain that while I have dark skin tone (similar to yours) a tan gives me even skin tone that has a sheen and just looks healthy and hydrated.", "hufreeshart": "You are dope...WOMAN! Awesome! I salute your perfection to bare it all! 👍👍👍", "amritaps": "❤️", "petitenpretty\nVerified": "Verified", "shabana_arun": "🤝🤝🤝🤝", "iamreyhanag": "👏🏾👏🏾👏🏾👏🏾", "vamsee_123": "Thank you for this post! You are always so true to the concept of beauty inside and out! Love U❣️😘🥰", "_sirinity": "I think both legs look beautiful 😊. The older I get the more I own my looks, my ideas and my opinions. One of the best parts of aging hahaha 😂", "kendra.amazing": "Wow! This is so authentic. Thank you for sharing. 😍😍😍 You’re inspiring me!", "just.lexie__": "Thank you for teaching me that there's such a thing as body foundation!!! Need!", "bombshellbeautybychetna": "Haha the joy of desi legs! Just like our faces, mulitoned!", "ellarie\nVerified": "Verified", "sdyfl_love": "Love this post♥️Thanks for Always being super real🌷", "sidd_chahal_mtl514": "Ugly legs", "thechaimommas": "💛💛💛💛", "farhfromordinary": "Need to try this!!!", "sari.ri.kuhn": "Love this post! Thank you for your honesty! ❤️❤️❤️ Also can you recommend any other good sunless tanning lotions that ACTUALLY WORK for brown women?! 😁", "swatiale_official": "You are such an amazing person....i mean I just love the way u r...so real...so simple n so alive ..love you😘", "tonififi": "That’s amazing!!! And I love that you show your bare face. Though I will admit I think it’s sooo bloody beautiful that it doesn’t make me feel any better in mine 😆😆", "sjl.x__": "I have strawberry legs too, but don’t have the confidence to show them in public 😔", "rambleonann": "@its_an_asha", "macdenr": "Thanks for sharing? What setting powder and highlight do you use/recommend?", "geethab90": "Wow", "houseofnaveda": "LOVE this post @deepica !!!! Well said! 🙌🏽🙌🏽", "deeb77": "Exactly how my legs look. Thanks for always being you and teaching us to be comfortable in our skin! 😘💋", "demetrianewman": "✨💛✨", "bibinoir": "This message is so imp! Thank you for sharing and being you!", "ch_div": "Woow you are incredible @deepica ❤️❤️", "sincerelyshreya": "WE LOVE A SUCCESSFUL AND TRANSPARENT WOMAN💕", "beautybyfana": "This is so true!! Thanks for always being super real 🙏🏼❤️", "thesumairagirl": "You are amazing! 🖤 I love your posts!!!", "angeliqgoddess": "Love this. I try to post bare faced often too both in my stories and feed. Natural beauty is real beauty within its natural form. x Natasha", "mgo_81": "😍👌🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "sshobi": "@prav3.0 embrace your legs women! ♥️", "tissamessafi": "Keeping it real as usual! You are the best example for young girls! @deepica Love you girl ❤️", "keshitawithadollarsign": "I’m indian and I don’t strive to have perfect legs. My legs are the way they are", "tammysuethomas_": "🙌🙌🙌 Thank you, that color is going to be perfect for me too!", "beautystylelist": "Wow!! Love the way you share Deepica!", "stephanieandrea__": "Love your authenticity 🔥", "urbanitemedia": "More young girls need such role models who are genuine and proud of themselves. Perfection is simply a mirage. Kudos... and mad respect! 🙏🏻", "deepica\nVerified": "Verified", "celesteteresa_": "This is incredible! You are real influencer 😊✨", "drama_mamaaa_": "You are our inspiration @deepica love youuu 💕", "ashamoosai": "I been waiting sooo long to ask you if this transfers! Thank you 😂 @deepica", "saimaghaffar": "Queen", "therealgingerbread": "This post has convinced me I need this @kkwbeauty product. 😆", "melaniechandra\nVerified": "Verified", "moona_pie": "I love this ! Thank you. I have strawberry legs too and used to hate it but Ive grown more comfortable with it 🤷🏾‍♀️", "ritzzz367": "You are an inspiration", "heykarishma": "respect ❤️", "thecurrymommy": "💜 real AF", "welcometotheguyfamily": "Love this ❤️", "padmapriya1996": "lovely... well said ..nd i appreciate ur statement", "nirosha___": "💯❤", "devanshigariba": "🙌🏻🙌🏻🙌🏻"}