{"reetudg": "I meannnnnn", "zays.days": "My nose matches my personality, BIG!", "thesunshinestranger": "My natural eyebrows!! ❤️ I have a soft spot for them. It’s trendy now to “never leave the house without your brows done” and that made me self-conscious about my brows - specifically how they were so sparse. I dont mind them anymore and have embraced them as they are instead. 👊", "aishwarya5724": "I love my stretch marks. Tells me how much I have evolved as a person ❤️", "goelhimani91": "I love my body. 😘 Some days I feel like flaunting my curves , and some days I feel like like keeping it warm.", "justt_anu_": "I am kind of living my skin texture these days. It feels supple and radiant ❤️", "shoovashivani": "I love my receding hairline. Makes me look wiser haha", "reya57": "I have been following you for a while, but just realizing now how much i find you relatable from skin tone to hyperpigmentation - I kinda like it that i don't look pale when I don't have makeup on (which is majority of the time), and have natural contour look, and dark lips. I'm totally flattering myself, something I don't do often or ever, but thanks to you, I'm starting to feel beautiful. Thank you for sharing such raw and real pics of you, I think they are absolutely beautiful. 💕", "indeedlabs": "LOVE this idea!!🙌🏼☺️", "sparkeule": "I like my eyes, I would hate them when I was little but not anymore, they are so gorgeous! I can’t believe all the hours I’ve spend crying for blue eyes, what the hell was I thinking?", "katherinevaldivieso_": "Just flawless 😍😍😍", "gkj02": "@s_u_k_i_e", "tricky_tripy": "👌😍", "ungumuda": "I love my check bone !! And my uneven lips 😍", "urirathore": "I love my eyes and try to keep them bare of any makeup on almost every day. Kajal the most basic makeup item, I rarely use it now. It feels good to not have to rely on beauty products to look beautiful❤️🙌", "gold_hourglass": "My full lips! 💙 And my slightly crooked teeth that in my opinion adds character to my smile ❤️", "thegoldpower19": "You're the best of the best.", "shazia.happycakes": "Omg yes I love my natural eye shadow! Though I don’t love the extra colour on my chin... or under my eye. But it all comes together I guess", "jetsetdhruvi": "I love the gap in my teeth! 😁", "azkaashafiq": "my nose ive grown to love 💓", "myvegetarianroots": "I got big butt and I cannot lie lol I am done hiding it under dad’s long shirts that I used to wear. Now floating it proudly!! 🍑", "radhaupa": "I love my bigggg eyes. When I was younger people made fun of them for looking like a praying mantis. But I’ve come to think they’re the best part of my face :))", "tara_heartart": "I love my chin dimples. But this year I want to be able to accept and love my body type. 💗", "izzarenee": "As a kid, I grew up hating my colored skin. I longed to be lighter skinned like my older sisters or my youngest brother. When girls/women pay to hundred to be tan- I was already that. Literally learning how to love my skin wasn’t easy but I grew to love my naturally tanned skin.", "merian_das": "So preety with natural beauty😘😘", "saltedchai": "🔥🔥🔥🔥🔥🔥🔥", "ahimsasydney": "Gorgeous! ⭐", "shennellrodriguez": "This right here is truly unspirational. My dark pigmentation around my eyes have always been a struggle for me to except. The older I become, I have grown to except it for what it is.", "digitalisdiana": "@yarashahidi is this you?!", "gregoryw_sr": "Beautiful Picture 😊😊😊", "_jennyp": "❤️", "nurhankagitofficial": "I love my freckles 😍 when growing up ppl were giving advises how to get rid of them. I never was thinking of it. Always felt it was part of me, which made me ME❤️ thank you for reminding 🙏", "jannatkabir60": "I love my hair", "will_edit_later": "I love the extra nipple on my face! Have to photoshop it out for insta censorship rules but it’s my favorite part about me ♥️♥️", "anonymouse2000": "I like how I don’t need foundation and my face looks better without it.", "rowhiyniy": "Wart on my face, which used to be an embarrassment for me earlier. I owned it now. ♥️", "navyug__sandhuu": "😍❤️", "maryam.husaim": "Your ugly", "beingbykasia": "My eyes 😘🌈🦄❤️", "monicabagona": "Slayin’ it. ❤️", "vaaridhibagrodia": "I love my skin tone. Hated the brown hue for the longest time but I’ve embraced it thanks to @diipakhosla and you @deepica and I can’t thank you enough😘😘😘", "alongcamejay": "❤️", "_ecoaaraby": "I love my curves and skin complexion!!! ❤️", "rabiahhhg": "There are days I don’t wear eyeshadow because it looks like I have a pretty brown eyeshadow 💕", "goofy_monk": "😍😍 oh my God you're so beautiful", "keshhh_xo": "@ks_x3 natuurlijke oogschaduw ayee", "shilpashetty": "1. I love my saddlebags. Gives me a natural hourglass body shape. I’m lucky I didn’t have to spend lakhs to get this body 💃 2. I love my frizzy curls. I don’t have to comb my hair. They always looks frizzy, and I totally own that look 😬", "dameondeshawn": "Born2Shine Sista", "accessoryfreaks": "You look stunning! What hyperpigmentation? All I see is beauty! I love my bent smile! It always just wants to go to the left 😭", "wspamssboo": "😍😍😍💞", "iqrakansari": "The things i used to hate was my big forehead,two tone lips and the fact that my face is slightly darker than my body,ppl around me have played a big role to make me hate the way i look but as i have grown up i have realized that these things are unique and these differences in my look make me who i am i dont have to fit in society's general standards of beauty to be considered beautiful,and i am happy that i have realized this early in my life.", "nxtsisterduo": "Beautiful 😍😍", "_i_spoiled_november_rain_07_": "Beautiful😍😍😍❤️❤️❤️❤️", "facesbyaditi": "I love my deep dark set of circles around my eyes. 💖", "siddarya9": "😍😍", "karkera_sushmita": "I love my chubby cheeks ,my big eyes, my fuller lips, my dusky skin tone in short I love myself allot 🥰🥰", "bhanucpl": "I like my white natural color of my face", "shaswati_das22": "I love my eyebrows. I don't need to do them. They are naturally thick although i used to be ashamed of them back in school. I just love them now.😊", "jaguarkaur": "Your skin is beautiful ♥️", "facadesbyfarhat": "I love my flabby untoned body. It’s carried my three children and nourished them and provided a safe environment to grow and be born happy and healthy. It’s full of stretched skin and marks and scars but my body allows me to live life to the fullest. It allows me to run walk play dance hear feel . It took me 35 years to love it, but I finally do .", "_keerthanamohan_": "I am so really in love with my body hair. It's quite dense and makes me feel warmer when it's pitch cold and my friends are shivering. I do wax at times but have never wanted it to not grow back again to the same old form.💚", "urooba221": "@sayyedah11 love this so much", "aashchy": "You've got such a beautiful skin ... 😍", "apoemforyourheart": "After many years of fighting it, I’m embracing my prominent dimples. I looked 25 on my 40th and it’s all good.", "stellasimona\nVerified": "Verified", "minniepalak": "I LOVE me. My consistent and constant no make up face. My naturally oily scalp. My oily wheaty pink cheeks with a dash of heat rash. My full lips with no lipstick ever. It's taken me years to feel this..and I'm happily here , now. Thankyou for giving us the chance to share here 😀💕", "sravanthie_1416": "I love my eyes and lips..to be honest I love everything about me..atleast iam in the process of self love..because..i realised iam unique n special...no one can replace me and my facial features...i found dt iam beautiful just the way iam.", "saleemaalihairmakeup": "😍😍😍😍 Love this ❤️", "according2cathy": "I love my Joker face because I always look like I'm smiling and happy.", "afskinssss": "My bone structure", "tinywaves12": "Have the same thing on my eyes looks like brown eyeshadow 😸❤️❤️❤️", "waniaaa____": "I love her so much @dollface395", "weekendswithheather": "Hi Deepica!! I LOVE YOU AND WHAT YOU STAND FOR!!!! I’m trying to travel around the world to meet 3,000 in 3 years and host a huge spaghetti party afterwards!  If you’re interested I would LOVE to meet you and collaborate! In the meantime feel free to check out my YouTube channel (link in bio) for more details and to prove this is legit!  https://m.youtube.com/watch?feature=youtu.be&v=-aOn5q9f5Io", "jaivirdi": "My deafness. I used to be so ashamed, believing that I was broken somehow. Now I perceive it as an unique perspective of the world and a reason for me to advocate for inclusiveness.", "mrs.nilpa.modha": "I love the natural glow on my face #nomakeuplook", "dipali_dey": "Great message! 💜", "livelawless": "I love my acne scars 🙌❤️", "frmheadtotoe\nVerified": "Verified", "amrikag": "Congrats on what you’re doing. Sent you an email, would love to hear your thoughts back!", "kranthi_vemula": "This sounds really crazy.. But love my dark circles..😍😍", "rdhivya05": "👌👌", "beeeyearr": "Team pigmented eyelid!", "eden.cosmetics": "Love this!", "bionic_baby15": "I love my eyebrows, they're full and dark and I never have to do anything to them 😂💕", "indiabtc": "omggg your so pretty you look just like my mom. 😍😍😍😍😩", "savrinagounden": "First of all I am just in love with my skin color. Then, my big lips (they are naturally big) and sometimes people tease me for it, my thick and dark black eyebrows, my eyelashes ( they are quite long and curly naturally), my hyperpigmentation, my dark circles. Actually, I just love everything about my face even though I don't admire myself as I used to in the past. 💛💛 thank you for inspiring us always. You are such an amazing person.", "nabeeramerchant": "I was so sad rn bcz of my acne. You motivated me ❤thanks", "jediinheels": "My boobs. For a long time especially in college post all girls school I felt very conscious about them. Some people can be petty and call you slutty or be even more condescending and try and give you their scarves. It took a while and age for me to love them. Now I look at my curves ans thank both of my grandmas for them. It’s a part of who I am, and we need to stop judging women by their body types or how they dress.", "goldfleckss": "I love how flushed my cheeks and nose get when I have no makeup on. I used to be teased about being an Indian Rudolf but hey I can save on blush hahaha", "riogoda": "I love my shoulders 😍😍", "rhea_chitte": "My little black dot near eyes and slightly tilted nose", "ppatel1105": "My thick brows. When I was younger, my mom would get mad at me because she thought I used a pencil to darken them and I had to convince her I had not! They’re thick, black, and beautiful and even though I have paid my threading lady a lot over the years, I love them lots. 😍", "heygorjess\nVerified": "Verified", "akanksha_marwaha": "Definitely my eyelashes and i think my nose is pretty great too! 💯🎉", "vijethakarthik": "Thick eyebrows and translucent skin veins on the cheeks.. used to think it’s bad now I’m cool 😶", "beverlydudley24": "I love my skin. Rarely got zits even as a teenager which was eons ago. I do have some darker zones but it’s still pretty smooth for an old chick.", "anushka_sh": "Lately, there has been so much body positivity and so many powerful women are creating media to empower girls and women that I FEEL SO DAMN BEAUTIFUL. I'm so grateful that we're heading this direction.", "b.a.v.a.n.i": "🙌 built-in eyeshadows too", "redpandastitchery": "My shoulders. The pupper would cuddle on my chest as a little one and now she loves to be carried around on my shoulders. At 35 lbs, it's a struggle sometimes for me to do so- I've dislocated one twice for separate reasons, but with appropriate bracing, I love letting her have the opportunity to see everyone.", "selfcare_pinnk": "Gorgeous", "usha_sravanthi_rayasam": "Definitely my bigggggggg nose....❤️❤️❤️ N then wide eyes n long eyelashes...😘😘😘😘 Last but not least my too much tiny chin...🤗🤗🤗", "shadowdancercosplay": "My nose. I’ve had people poke fun of my nose since I was a teenager but I love it and the bump it has. It’s more prominent than most, especially from the side, but I wouldn’t trade it for the world because it a unique feature that I would imagine the author of my book took time describing so that the readers notice it. It’s witchy 😂", "disha_nandu": "I love my face it glows without makeup", "beyondthelbd": "💖💖💖💖", "morgancarrollmakeup": "Beautiful ♥️", "rita.miles.rm": "My eyes!!! I love my eyes because they can say al lot without me talking!", "mishtikumra": "Yes! I refuse to call them imperfections, faults, or anything negative. I call them for what it is without negative connotations attached. It’s hyperpigmentation. Dark circles. It’s one eye a little lazier than the other. One side of my face hangs bigger or is bigger. It’s all unique together. And it’s all what makes me, me.", "timmrush": "⭐️⭐️⭐️⭐️⭐️⭐️", "pdarsi": "I love my dark skin! I used to be so conscious of getting tan in the summer and would be scared of what my family and friends would say about my skin getting darker. At one point, I even considered quitting Tennis (literally my favorite hobby) to avoid a tan. But now, I’m like fuck it. I love summer, I love the sun and I love being active. All of that comes with a nice dark tan and now I just embrace it. The darker the better - this has given me the opportunity to pull off different looks and colors! 👸🏽👸🏾👸🏿", "ambermariefaith": "I love my sun spots and I love my cellulite on my thighs because this body is all NATURAL. @deepica 🤸🏻‍♂️😩🍑", "sannsimmi": "My hair, natural curls with frizz. I wake up looking like a lioness each morning. Love it! People pay money to get that big, lol", "rubys.organics": "It’s beautiful 😍", "lanapatelxoxo": "Absolutely gorgeous Deeps! Challenge Accepted! 😍", "saks_nyc_2020": "My dark circles around my eyes are constant 🙈", "cosmic_crochet_creations": "As weird as this sounds I love my little mustache. Other people still tease me about it but it’s a part of who I am and I’m not ashamed about it.", "nikonithya": "Jessica Alba replied u", "brownbeautysimor": "Pretty pretty 💓", "birrya": "👍", "heena.patel_": "I love my freckles! It reminds me of my Mom 💞", "ericamichaelson": "My nose. I think it is cute.", "dianatakesflight": "My full👄! When I was a kid, I was ridiculed for them. Now I dress them up in the most awesome lippie colors including @livetinted. Ive got 👄 that people spend good money attempting to recreate. ❤️", "shanedeal": "I love my brown eyes.", "shirene_2017": "You pretty", "annapetrosian_\nVerified": "Verified", "candiceayala": "Your post is a god send today. I had a moment in the mirror this morning. Cursing the shape of my eyes, and my hyper pigmentation. This made me realize most times ones attitude depends on perspective. Thank you for that! 💕 So I’d like to change my voice and say, I’m learning to love my eyes more. 😊", "radhidevlukia": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍 YAS GIRL panda eyes 🙋🏽‍♀️", "toobrown2care": "So excited to use your products!!", "shy_sandy": "So for some reason I just never cover my eyelids w concealer, and the other day my friend goes “omg! I love your eyeshadow look” and I was like “??? I don’t have anything on? My eyes are just naturally this color” Sometimes things can be a blessing in disguise haha", "anoohyaaaaa": "I love it when my frnds say that I apply eyeshadow daily...But the actual truth is they are my dark circles😂..and I also have dark lips..So people think that I smoke..so the darkness on my lips...I just tell them proudly...that’s my natural lip colour man got it from my mum..I think which u didn’t !!!!🤷‍♀️😄", "corischerer": "I love my eyes! And you are STUNNING 😍", "anapsingh": "My eyebrows, they are naturally curved and i dont get threading or plucking or waxing done for months as i feel i am blessed with a real s**y one naturally.", "beauty_and_the_dentist": "So this is something I have in my gene and that's a big fat nose on my small face but I still love it cause it just makes me, Me! (Hope I made sense😝)", "raeesaxxr": "I love my big boobs although most clothes are tight on me because of them, and I used to conscious of them before so I ALWAYS wore tank tops with everything. I’m learning to confidently embrace them now and show them off a little without feeling too provocative.", "win_e": "So beautiful 😍", "sketchplusng": "I love my thick lips, it gives me an obvious facial representation, maybe that's why I'm a natural marketer. Check me out @juicebreed", "snehadhanawade24": "I love my eyes,eye lashes,eye brows,my nose,my lips ,my long wavy hairs ,my skin color,my pear shape body i love .", "meher1133": "Awesome Deepica. Hope you do more such work in India where colour is the deciding factor of beauty. It is so sad.", "eva.quilty": "You look the most stunning I’ve ever seen you here - so beautiful x", "im_the_hero_of_my_life": "My hair, my smile, my stretch marks and all of me", "rachelolach": "I love my eyes!!", "nim_rah94": "Flawless 😍", "marysol_moooon": "You are so BEAUTIFUL ❤️❤️❤️", "nid67": "You are beautiful!! 🥰🥰", "amrahunedited": "love my moles! they are uniquely mine ✨", "night_sky_201700": "I love my skin colour, it is a healthy tan that I have never ever wanted to make lighter nor darker.", "sumamjurczak": "My Mallu girl curly hair.", "curly_jaimee": "I love my big curly hair! I stopped straightening it and have no regrets!", "missnaseer": "My eyes. I forget how big/beautiful they are and noticed them last night before bed. I love them ❤️", "moodsandviews": "My bushy brows! I hope the thin brow trend never comes back", "rizdaud": "My tanned glowing skin even sans makeup looks good!", "thelifeofthiswife": "I love my high cheek bones! It always looks like I’ve contoured my face, when in reality.. I woke up like this 🙈🤗", "laxmisambaraju": "Wow you look so so beautiful in this picture", "apksandhu": "i love my eyebrows. They are thick and dark, exactly what I want ♥️", "sentha_tamil_": "👌😍", "sinha.subham09": "I love my dusky complexion and my smile 😀", "deeps724": "I also have hyperpigmentation around my eyes and love the natural eyeshadow look. I’ve grown to love it actually. I go bare faced quite often and it feels great!", "marijakorolija": "My very small boobs that got even smaller after two kids but they did great job breasfeeding 😁", "funesseatl": "I love the way my dark skin makes vibrant colors pop on me!", "artfulanika": "Love you and this 🙌🏾", "christaylor_nyc": "❤️❤️❤️", "lav_1031": "I love the shape of my eyes and the few freckles on my nose and I have a long nose but it’s pretty the shape of it", "narsobsession": "😍", "sogona.sacko": "Since i suck at makeup thank God for natural jawline!", "ajadeinjuly": "Mine’s same as yours, a little darker (I call it tinted 😇) eyelids. I never had the need to do eye makeup. Just a dab of lipstick and I’m always party ready!", "curlsandcouture": "Gorgeous", "summirz": "💗💗💗", "yoli_830": "I like my two big front teeth that stick out and are a little crooked. I used to want braces so badly and would try and hide my teeth when I smiled. But now at almost 34 years old I have come to embrace my teeth and I think they give my face some character. Bonus for the fact they push my upper lip out a little bit so I get that filler look without the filler needles and the filler coin 😂😂😂", "shrividhyaiyer": "I never used to like my hair type but being a brown girl I just realized I’m born with best curly/wavy hair that is most sought for. Yay, i never have to worry for beach curls as I already have them 😀😀", "jothisorthat": "I love my stretch marks!!! Wherever! ❤️", "sunniasays": "Absolutely beautiful inside and out ❤️", "umasteinhauer": "When I was little I used to ask my dad why he had red freckles. He chuckled and told me it was because he was old. Now I get them, too, and they make me smile when I see them in the mirror. We live on the opposite sides of the world but carrying his freckles with me makes him feel a smidge closer.", "amy_parekh": "Love my big almond shaped eyes, thick eyebrows and beautiful white teeth!! Not as happy with my body, but I'm on a fitness journey to help change that😊 figured I can't be loved until I try loving myself- so I'm working on it💕", "codeadress": "💕💕💕", "channingm19": "Everyday I look at my tiny 🍑 and say zayaaaam zaddy", "rashmisood": "Wow, I never thought it that way. My hyperpigmentation is exactly like yours. And now that’s what I am going to call it😊", "juena_laa": "I love my natural hair, been natural for 5 years. My full lips and dark skin ❤️", "xvogue.vibesx": "Hate my hyperpigmentation it doesn't want to go away", "sumaiyastyle": "I love my skin tone. I have grown fond of the caramel color, the spots, the scars & the moles. It took awhile but I’m getting there ❤️", "michigan.blonde": "Same! The skin around my eyes and eyelids is darker than the rest of my skin and it’s totally natural eyeshadow lol! I also have lots of moles and freckles, but I love them all now. I used to dislike it, but then I realized I always thought my mom was beautiful and she has the same uneven pigmentation - so why would I think she’s beautiful and not me?", "vaidikaaaa": "Love my eczema at times because it has made me very conscious about taking care of my skin and body. It reminds to explore options that can bring relief and nourishment to my skin without topical steroids. Not to mention, I don’t breakout bc my skin is too dry!", "mariadelgado.md975": "❤️", "flaunting.smiles": "Positivity 😘 @deepica", "nizsmusings": "My eyes!! Speaks a thousand words!", "anu_rese": "Glowing and owning it!! Beautiful both ways ❤️💗❤️", "just_chimera": "I used to hate my face every time I have dark circles... And my bunny teeth. but the time when I started thinking positively about my negatives .. I fell in love with my eyes and smile positively❤", "swetarani.pradhan": "I love my dimples on both my cheeks😍 .i inherited them from my mom❤️.", "aftab.nizamani13": "So beautiful", "creepybyron": "I love my hair! In all it’s big, wavy, poofy, frizzy glory. It’s been a journey from viciously straightening it and wishing for sleek, smooth hair. To now wanting it to be as wild and poofy and natural as possible.", "aistea311": "My nose! It has a little dip in the center that is perfect for booping", "diamond.pee": "I love my brown skin 👸🏽", "shelikesyouuuu": "@manvy_b youuu look like her😍", "shaanmu\nVerified": "Verified", "yusraams": "@cakestop.lhr @marryyam.m", "luxpriyachitturi": "I love my overall dusky complexion.", "coachingbyhaniya": "👏🏽", "farah_k07": "I love everything about myself, God has made everyone beautiful ❤️", "mihaela_dzuric": "Same here, hyperpigmentation around my eyes. I don’t know if I got in the point of loving it, but it doesn’t bother me like when I was younger. Maybe I just gotten matured 😂😂😂 😘😘😘 kisses", "cydbee\nVerified": "Verified", "jessicaalba\nVerified": "Verified", "michigangirl2001": "I have never said this because most days I hate them, but I love my freckles.... @deepica thank you for the inspiration this morning to think about what I love about myself", "malinisarma": "I love my eyes..some say they can read what I am thinking by looking at my eyes..as a dancer almost a requirement. @deepica ..thank you for the putting it out there. ❤️ your work. Continue to do what you are doing.", "layla_sshz": "I love my eyes and lashes😍", "patrice_eleisa": "I love my eyebrows! They are a little bushy, and \"editorial\" looking😂", "j_luv1": "My oily skin 🤭 😂 hopefully this slows down the winkles (I still blot some days but since my skin regimen has changed I don’t do it so often, when my skin is glowing it’s like an extra subtle glow) and my curves‼️ lol I was just told I was a whole meal 🤣. BTW this pic is 🔥", "beyondmusings": "I love the pigmentation at the edges and the outer corners of my lips. They make my lips look more pouty💋", "bhagwatria": "My nose!!! It’s a sweet lil Indian nose that’s been passed down to me and I feel grateful to have it!", "aartibhags": "Built in eye shadow for the win! ❤️👏", "sachi_narangoda": "My nose, teeth, eyes and butt haha! Actually there’s nothing I don’t love about myself except for the few acne scars and hyperpigmentation that I got but now I’m learning to not care about them so much ❤️", "jessy_labroy": "My smile", "hanalei_a": "I love my dimples!", "nikkish83": "I love my brown/dark skin!!!🥰🙋🏽‍♀️", "poojaschallapalli": "I absolutely love the lines I have on my neck. People often ask me what has happened to you and I tell them that's my beauty mark that sets me apart from all.😊", "thelifeof_my": "@rjpaskanthi this was the reminder I needed today", "boseroyradhika": ",$", "sanjana.t_4s": "I love my big eyes because it makes feel confident and happy about myself. they help me look bright and awake in the morning. I love myself because thats who I am!", "mainlymanisha": "Literally same! I usually never touch my lids because it’s like natural eyeshadow!", "inakuqo": "@deepica I love my freckles!!! I used to hate them growing up, and then everyone started painting them on their faces 🤭 I feel blessed of having all natural freckles. I appreciate every part of my skin. Makes me feel me 😍", "theworldisflat24x7": "You are awesome ! I love my natural beauty spot above my lip .. sort of get annoyed when it gets covered by my makeup 😂", "__ramyaraj": "You’re so beautiful ❤️❤️ One thing I love about myself is my lips and my long eyelashes!!", "thelizgaines": "My husband says the same thing \"natural eyeshadow\" is his favorite on me!", "jiannaangeliek": "I love what having Scoliosis has taught me! Just because my spine is a little curvy doesn't mean I can't reach for my dreams..it just means I have to work a little harder and that's ok! Learning and growing every day!", "globe_trotting_girl": "My eyes !", "therealkamie\nVerified": "Verified", "justagirlwithmessybun6": "love my lips and my dark circles and my potato face thanks for the challenge", "sethiomrita": "Dont forget your stunning cheek-bones and dazzling smile !😍💫", "karts_u": "I too have built in eyeshadow and cheek contour 😍", "kani_goyal": "You are resembling so much to papa pandu in this pic ❤️", "jenmichellebaird": "The lines around my small almond shaped eyes, those lines represent 41yrs of me being able to express emotion happy and sad. (Thankfully I laugh a lot lol) 💖", "l_l_e_n_a_": "Eyes got it from my momma german Palestinian mix comes thru ☺️", "ajoysignatureproducts": "I love my full lips. Hated them in high school. But hey, people paying for these lovelies now! 💋", "margol": "@deepica I am learning to love my wrinkles... (50 years old this year!h but I have always loved my lips. Thanks for sharing... 💋", "mv55559": "Beautiful Eyes 💗", "sanjulaaaaa": "I absolutely love my thin eyebrows because I realised I can make them thick for a glam look if I wish or just go with a light fill in and leave them natural 💃🙈", "shravyaks__": "My eyes and lashes", "christeen.23": "My eyelashes bc they’re long & curl out nicely 😊", "mohinisim": "💗💗💗", "kash.raghu": "I also use the hyperpigmentation hack around my eyes to give the impression of depth and contour 😂🧡", "dharasworld": "My acne scars it add personality and character to my overlook look! 😍🙌🏾 @deepica", "nik_eeez": "Brows and upper lip beauty mark ❤️", "uzmaamlani": "My hair- my mom says her mom had the same hair so it’s one thing I have to remember her by.", "fremabrenyah": "My mother always used to say this about the pigmentation. Inborn makeup. I’ve never heard anyone else refer to it like that. 🙏🏿", "bhav_ritz": "My eyes🧡", "mommadesai": "I cannot believe I am putting it out there, MY BIG BUTT, Back in India, I used to be so ashamed of it. used to wear my dad's long shirts so no one would notice. But now, it the part of my body that I love and am proud! I got big butt and I cannot lie ;)", "ashley_tibbits": "Okay gorgeous skin ✨", "fercha_332": "I love my eyes and eyelashes. I have hyperpigmentation around eyes too, but has been hard for me to accept it because is not common in my country 😔, but I'm learning to accept and love myself little by little.", "shoptimascloset": "You’re beautiful 😍", "meghna_makeup": "😍", "themahams": "My eyebrows and nose for sure", "cyndewatson": "Stunning 👸🏽", "ushamdoshi": "I too have builtin eye shadow on my face😉😃", "manjupriya_radha": "😍", "humairaxahmed": "My spots", "franchescablaize": "I love my eyes. They’re big and brown and the song ‘Brown Eyed Girl’ always starts playing in my head when I do my eye makeup 😂", "itssokate": "Glowinggggg🔥🔥", "tirzahvhee": "Absolutely beautiful 😍", "manucounseling": "My eyes!", "runitwithrobin": "I love my teeth....never had braces or a cavity yet🙏🏽 I used to gargle coconut oil for 10 minutes and then spit it out for a natural whitening too...gotta get back on that!", "boldandblended": "Such fresh skin😍✨", "iamthebabz": "🔥", "angiemikaelian": "Love love love! Freckles 🤓", "yashodhara_kundra": "That’s such a positive way to look at it!! Love it ❤️", "sindhumerugu": "I love my dark spots! It’s like a beauty mark on my face and makes me feel unique 💕💕", "saints.soi": "the hyperpigmentation on my under eyes and eyelids 🤪 ❤️ the scars from my acne as well, it gives me some personality 😁", "zulakha.sheikh": "My eyelashes! 😆", "love__vina": "Yes!! I feel the same about mine 😍. I love my cheeks because they came directly from my momma and remind me of her every time I see a photo of me laughing/smiling.", "theessenceof_\nVerified": "Verified", "eye.lee.yah": "Beautiful 😍✨", "aneeshajethwani": "I love my baby hands, My niece at 5 has almost the same palm size 😁"}