{"drdivderm": "Love a good full coverage! 👏", "ritikas_drishti": "Beauty blenders are too much for my germophobia 😂 brushes all the way!", "lvndrgms3": "I find a brush works better for me when applying foundation otherwise I end up using more product if I use a blender. I prefer to use the beauty blender for applying concealer.", "samyvinzz": "I prefer blender over brush.. but most often I fall back to using my finger tips 😂😂", "monpatel815": "BB! 👏🏽", "artlikeher": "Depends on the product type I’m using but I use both 😅💁‍♀️💕", "anjum.ahad": "Beauty sponge all the wayyyy", "kokobeaute": "I use both! 🔥", "neha.mudda": "Beauty blender any day!!", "theranireddy": "Blender for liquid/cream face products, brush for powder foundation/extra contour.", "sannakhursheed": "A brush!!! Gives more coverage and a beautyblender on the end to get some deweness♥️♥️", "diaryofaprdiva": "Your eyebrows are so frigging DOPE!!", "dap9900": "Beauty Blender and my fingers!!", "diyachawlaofficial": "Relaxation so was anzuschauen 😊 @hit_chawla", "s.angel1992": "When they said be somebody they were talking figuratively... and you started painting your face and shit.", "jothisorthat": "I prefer a brush. I use the @beautyblender to blend my concealer", "_eme789_": "Looks like @thelifeofyoungash", "mkglife": "😍", "iluvgoodespresso": "@beautyblender all day, the brushes never work out for me!!!!", "andreaflexishoes": "What shade you wear?", "ananyadmenon": "@deepica I have been following you for some time now. You make all of us so proud. I want to purchase a Huestick but not sure which one. I have similar skin tone as you. Which one do you use the most for color correction? I am guessing Rise but not sure.", "cynteeuh": "Brush...lasts longer ;)", "sexifeet": "Both 😂", "mika_ana07": "I prefer beauty blenders", "shadesbyshradha": "Dense brush!", "mich_elle_60": "Brush", "themahams": "Definitely a brush since I go for medium to low coverage!", "tealalps": "IS YOUR NEW PRODUCT A BRUSH OR A BLENDER", "lind_sho": "Oh and one more thing,I wanted to ask you ,can you please recommend me a good moisturizer ,I have a lot of freckles now and I am out of moisturizers,so I wanted to.try a new one. Please recommend me a good moisturizer that you like.Oh and one more thing,I wanted to ask you ,can you please recommend me a good moisturizer ,I have a lot of freckles now and I am out of moisturizers,so I wanted to.try a new one. Please recommend me a good moisturizer that you like.Oh and one more thing,I wanted to ask you ,can you please recommend me a good moisturizer ,I have a lot of freckles now and I am out of moisturizers,so I wanted to.try a new one. Please recommend me a good moisturizer that you like.", "sukriti_saini": "Depends on how much time I have. Fingers when no time , blender when I have some time and brush when I need to get ready ready. 😂", "monika__vachhani": "Is there a way to combine the two to get the best of both a brush and blender?", "beautyblender\nVerified": "Verified", "nisha.kaur_": "You skin is amazing ! What foundation and shade is that your using ? ❤️", "rohini9": "For natural coverage-beauty blender. If I want a full thick layer- brush. I mostly use a beauty blender just because I have a hard time applying liquid foundation without the cake look. Even the Sephora artist (twice) used a brush and made me look cakey but with full glam and coverage. With the hue stick I need to use my fingers or beauty blender because it doesn’t blend easily for me.", "lindsay_nunya83": "Beauty blender always! Brushes leave too many streaks", "michelle.casson": "Have you tried the “velvet sponge” by @elciecosmetics? IT IS LIFE CHANGING!!!!!", "sgross18": "I use brush mostly, but use a BB to even out/smooth/blend any lines, streaks, etc.", "chitamita": "Depends on if I have an extra 8 seconds to go to the bathroom and wet the blender...usually I don’t have my life THAT together 🤣", "hennafly": "Brush!", "ms_leialeann": "I used a beauty blender up until 2 weeks ago. I love using a brush way more now", "jenmichellebaird": "I love the sponges but no matter how well I clean them I break out when I use them. I had to go back to brushes. I love the way sponges make the fountain look but alas my face didn’t lol.", "pinkchakra2019": "I sooo prefer a blender just cause I think it really blends everything really well.💕💕", "dcliz82": "I’m a hybrid girl- I like the blending brushes with the paddle like look to them! They blend better than regular brushes and don’t take as much time as a beauty blender. An extra minute means a lot to a working Mum!", "sairanikhatimam": "Deepica, Greetings from Hyderabad! It always make me wonder, these best makeup tricks, this full face coverage, the exorbitant product range all makes us look what we are not, end of the day it isn't me it isn't real. The only thing which remains real is I wash my face before I go to bed, that's me that's real.", "vijaya_naidu5": "I like brush better than blenders. I would rather use my warm fingers to blend then a blender..😉", "jbmotley": "Beauty blender all the way 🙌🏼", "emilysmodernlife": "Always end up going back to the blender 🤷🏻‍♀️", "simplyabout": "Brush always, I’ve never used a blender, have never felt the need to try it.", "stina742": "Beauty blender", "anj779": "Brush for foundation and beauty blender for concealer and everything else", "makeupbymario\nVerified": "Verified", "themonoclemuse": "Blender baby", "thetableofspice": "Blenders 😩. I seem to think I’m good without but let’s be real I turn to the blender before I even put a drop of make on. It just helps to seemly blend everything without feeling Cake and gives it a much natural look.", "annthaone": "I love when you do GRWMs!!! 😭😭😭😭😭", "imzadi_tiu": "Blender or sponge", "melissaaakall": "what foundation is this? It's so skin-like!!", "stylenbeautydoc\nVerified": "Verified", "rav3nq": "I prefer a mix between clean fingers and a blender. I find the brush doesn’t blend or provide full coverage", "rociomtz": "I love my Beautyblender!", "raisa.steffy": "I still haven't been able to get used to a brush. Keep going back to my blender!", "ceeneal": "Brush first then beauty blender 😊", "mukks80": "With the Huesticks, I use a brush to blend using “strokes.” For foundation, I also use a brush, but I use the type with dense bristles in order to “tap in” the product. This is likely similar to the concept of the tapping involved with a blender.", "vaishnasupra": "Beauty blender always !! I find using brushes gives me some sort of reaction :( used to use the Mac foundation brush previously", "kasthu.ravi": "Brush! Feel like I have to use more product when using blender as it gets absorbed more than the brush 🤷🏽‍♀️", "missnataliee_": "Blender! I hate using a brush, i just feel i get smoother application with a damp blender", "x_nikiniki_x": "Stippling brush. Something about the sponge grossed me out.", "njuarez84": "I go back and forth, but lately I’ve been using the bb.", "apconcep": "Brush. I don’t have time for blender but prefer the way the blender applied foundation", "alwysluschious": "A brush, I feel a beauty blender absorbs too much makeup", "makeupbyanna20": "Both for different uses", "raprachel": "Buffing brush then go over it with a beauty blender!", "melissadweber": "Depends on the product. Sometimes one, both or my fingers.", "deepa.vali": "Spongeeeeee", "ashamoosai": "Brush! Beauty blenders are product suckers 🙈", "sassy.striking.stunning": "Beauty blender. Anytime 🤷🏻‍♀️", "jayshawty": "Brush", "jay_jayaraj": "A @beautyblender or my fingers. Brush, doesn’t quite even out the product properly.", "l01167b": "Brush doesn’t work over my hue stick", "beauty_by_fatima_": "Usually a brush for foundation. Always a beauty blender for concealer..", "emilydaiellsnider": "I use two different brushes for foundation. One to apply and one to make sure everything is blended. I find that beauty sponges take too long to build the coverage I want and to blend.", "life.managed": "@beautyblender , I tried brushes too and it's just not the same!", "faiza1730": "Sponges and fingers!", "_giggl_es": "Brush all the day.. beauty blenders r way too hard to clean . Do not at me", "chocodoc": "Brush first then finish with blender for a seamless look.", "liveshiv": "Beauty blenderrrrr", "hafsah_hijam": "Both actually... first I’ll use brush to to evenly spread the product then I’ll use blender to blend everything for flawless look", "kiran_ladva_mua": "Love me a beauty blender! I just love the finish it gives me! So flawless!! Are you tinted huesticks available in the uk?? I would love to try them! Xxx", "a.n.j.e.n.i.e": "Def brush!", "yvonne.cairns": "🙌🙌🙌🙌🙌♥️♥️♥️👏👏👏😍😍", "mindofzainab": "usually both, i first spread and blend with a brush and then continue blending with a beauty blender", "deejaa_h": "Beauty blender!", "sindhu.jay": "Stippling brush anyday! It's easier and fuss free compared to beauty blenders in terms of cleaning and stuff", "ruby.g16": "A blender is easier but I use/lose a lot of product.", "apoorvip": "Brush!!!", "darina.naidu": "Beauty blender always", "talkglamtome": "Brush all the way. You can just rub it all over with it but blender is bouncing for hours lol wrists be like no thanks 🤷🏽‍♀️", "shamika_h": "Omg same same ditto @ always tempted to use a brush thanks to watching @katiejanehughes weave her magic. But I always crawl back to a beauty blender coz it’s just works better. I honestly think a brush works on a complexion which isn’t as dry and which has less texture. I have dry skin so a wet beauty blender just works best for me, for that airbrushed feel.", "rhulth": "To be honest, I use my fingers a lot. But otherwise brushes I'd say. I'm too lazy to prep the blender in water and all that 😂", "deekshabantwal": "Brush + blender for a soft finish. Brush helps with spreading better and blender helps in picking up excess product and blurring out the look.", "sofianwz": "Brush and then a blender", "hopelessrahmantics": "beauty blender has been working really well for me (both for foundation and huesticks!)", "mua_samantha2020": "I actually prefer both..I first like to use a buffing brush or a flat top kabuki brush and then use a beauty blender..been using this technique since a while now n I love the finish...", "venkatagunturu": "hi what foundations do you use?? i find that everything’s so orange and i really need a super yellow one :)", "sultanahoang": "Brushes!", "tiffbytiffany": "Over huestick - I like to blend it with my fingers :) ✨✨ other than that- I love a sponge ♥️", "prettyheritagelondon": "👌🏼👌🏼👌🏼", "kaur_jass2": "I use both but prefer Beautty blender more because it's easier 🙌", "moolanadia": "I can't get used to using a brush or anything else, I use my fingers every time 😅", "devirawal": "My fingers are my fav blending tool tbh", "lisgo08": "100% blender application with anything creamy or liquid. Brush leaves uneven streaks and pickups all the product.", "laradsz": "I go through phases! Sometimes I go straight for my blender but then realise it picks up way too much product to properly blend and then I go back to my trusty brushes - there's nothing a blender can do that my good old Sigma can't!", "natasshapatel": "Brush and/or my fingers!", "kruinspired": "I’m a blender girl 🤷‍♀️", "nawrinislam": "I don’t have the huestick yet but I for my foundation and concealer I use a beauty blender. I only use a brush if I find that the sponge absorbs too much product but I always blender over that with a beauty blender.", "i_a_m_free": "Wow😍", "shilpams1": "Depends what the product recommends. Finger (Nars), blender (Laura mercier), brush (Chanel spray) are my most recent. & I switched to a foundation stick bc bare necessities is cruelty-free/vegan.", "nadmirz": "Kinda both?? depending on my skins mood", "simplyrayea": "I’m a brush girl 😩", "jessie_guru": "Beauty blender and finger tips always 👌🏽☺️", "trendybytyanablogs": "I prefer a brush to apply foundation and sponge to apply concealer.", "anniglitters": "Bb gives Matt effect", "curvyvegangall": "I always use a brush for foundation. Only use a sponge for concealer and setting powder", "manali_vy": "Beauty blender!!", "jiyachowdhary": "Flawless ! ❤️❤️😍😍", "ksophie87": "Brush! Used to use the beauty blender but you have to replace them fairly frequently, plus it soaks up a lot of product. I do like the finish with a beauty blender but not worth it in the long run", "k00lkavii": "I prefer a blender and I apply product with my fingers.", "razjazz88": "Brush", "handbagdivas": "Beauty blender! I feel like brushes eat up half the product and don’t even out as well as the @beautyblender #HandbagDivasLove", "shreyakolluri": "Blenders all the way!", "imamandeepnagra": "😍😍😍", "niviparth": "Beauty Blender for sure!", "sarahzhara": "Brush! 😊", "mrsgurublog": "Pretty! (I love the beauty blender but most of the time in a rush so use a brush lol..)", "namrathamohanakrishnan": "@themakeupbullet", "leilamahalia": "Beauty blender", "_timoune": "Both to get it flawless!!!", "sumanbeing": "Brush anytime!", "wearingwednesdays": "I use both!!! But blender is great for finishing touches !!!", "priyajbeauty": "Beauty blenders all the way😍", "bo11ywood": "Fingers and breath blender. Easier to clean and i think It gives me a dewy finish. I also don’t like using too much product and i feel as tho with a brush It need more products", "daft_poop": "For hue stick and foundation I always use my fingers. I rarely do full coverage, so fingers work best for a light coverage", "kedia.meenakshi": "So pretty❤️🔥💕🔥❤️", "mehndii": "When I want full coverage, I use my Dior makeup brush. When I want light to medium, I use my BB. Even when I use the brush, I use the BB over it at the end to absorb any excess product", "maryrachana": "Pls do videos in Telugu....", "annyyamourxo": "beauty blender forever💗", "mehaks_diary": "Love love love u with makeup on ❤️", "prernanaa": "If I’m in a rush or for everyday use I use a brush just cos I don’t have to wet it 😂 but if I’m going somewhere important I get up and wet my beauty blender 🥺✨", "bollygrooves": "Eyebrows on point. ❤️ them beautiful lady", "sophileh": "Lately I’ve just applied everything with the elf duo fiber brush and I go over it with a beauty blender before and after setting spray (but I don’t have your hue stick yet I’m sorry)", "franchescablaize": "I use the @diormakeup Forever Glow foundation and I find that using a brush is WAY better for me. I have used a beauty blender for my concealer for a while now but I find it really breaks me out in my t zone area. So now I’m on the hunt for the perfect concealer brush. So if you or any of your lovely followers have any suggestions please let me know! @deepica", "mariasinstaglam": "I use the fenty foundation brush which is literally the best and then use a damp blender to perfect it 💖", "gill.t.beautease": "Brush all the way..", "kassarenna": "Beauty Blender ASMR👏🏽", "krishi824": "Blending sponge but not a Beauty Blender", "bebe_agapi": "Brush!", "jovanni_cd": "I use a brush, the Morphe M439 is pure magic, I’ve used it with several different consistencies and it blends so beautifully", "vaishali_anand_vishu": "@deepica I really love your confidence & the way you speak, your voice is impeccable 😍 I usually love to use brush over beauty blender coz I'm not really good at using it 😂 But I'd like to learn some times how to use a beauty blender in a correct manner without accumulating lot of products on it, hope you'll make a video on it someday 😊 Have a great day, love from your Indian sister 😘", "sumanbeauty": "I always go in with a brush and the a BB ❤️", "catchmeeksifyoucan": "Makeup queen 💚😍", "akankshamalik20": "Sponges all the way. I prefer a dewy/less coverage look which is easiest with a damp sponge", "anushkaabraham": "Brush but I’ve started using a blender because you do!!", "missdreamfaactory": "Which shade on MAC are you? NC 43 I’m guessing? @deepica", "rachcm95": "I love brushes!!", "kerrirhea89": "Beauty blender", "makeuphippie": "I use both tbh. I use a brush first followed by a beauty blender to really blend it in more.", "ahddarhs": "Blender!!", "aubrey.kyung": "Damp blender is always my go to!", "rabbits4lyf": "I used to use a beauty blender, then exclusively a brush, and now I apply foundation with a brush and smooth with the beauty blender. 🙌🏾", "daliayasser": "My hands 😂", "_sdhillon_": "Sadly, I suck at using both so I just use my fingers😢", "breapairrett": "I don’t think it matters if you’re a professional makeup artist or not. I think a lot of times it depends on skin texture, finish you’re looking for (sometimes beauty blenders can make it look more dewy), the foundation and/or concealer itself sometimes apply weird depending on if you use a brush or beauty blender. I love that we have options now bc I remember putting makeup on as a young teen and it was rough 😂 the access to quality/inexpensive makeup tools were not really a thing in 2006-2008. At least not for me. Now I feel lucky to have multiple options! I love using both for so many different reasons. But most of the time I like buffing in with a brush and then using a beauty blender for my concealer. 😊", "anu987": "Brush", "makeupbydenise\nVerified": "Verified", "amitamishra": "Beauty blender hands down", "jijikinz": "I prefer using my hands. Second choice is beauty blender. Never brush for creamy products.", "gurpreetk423": "Honestly, I use both- the original beauty blender (I’ve dried dupes but the original is the best) and I use a foundation brush. I feel it depends on the type of foundation- if its matte or more hydrating... the tool helps the product set different. These days I apply foundation (pro filter by @fentybeauty) with a stippling brush and concealer (@toofaced born this way mixed with @maccosmetics with @beautyblender.", "koatha": "Brush bc blenders are too much maintenance and work for me. Plus my application looks wayyy better with brush.", "em.jay.hunt": "My fingers then whatever’s easiest to access at the moment", "taniabudhwani": "Always a brush - sponge only when I’m using a super heavy, thick foundation, which happens like once every 3 years lol", "daarinap": "Do u dampen your blender", "tinatales": "Brushes do a good job and so do blenders. But beauty blender uses lot more product", "smkh_july3": "Brush. I worry about getting those blenders clean enough", "deepskris": "Beauty blender 🙌", "sabrinapriya": "Blender!!", "sharese_reynolds": "Brush gal for life", "lysskrisla": "Beauty blender. Brushes ALWAYS leave me looking streaky, no matter what foundation/concealer formula I’m using. Also, I’ve never found the right size brush. I have a smaller face and the concealer brushes are just way too big. It never looks like real skin either and always feels heavier to me. I’m not a pro, but I don’t even like the way my makeup comes out when pros use a brush on my face.", "kodhai14": "Brush! It just takes so long with the blender and I feel like it soaks up so much foundation", "frau.deutschland": "Blender blender n blender... it makes me feel like pro n confident doing my makeup...@deepica", "beauty_nomad": "Brush!! Way faster!! Sometimes I just use a blender at the very end to blend things in, like a few bops and then I’m good to go!!", "xenia.ranae": "If I’m using a full coverage product I want a beauty blender but if it’s sheer, I like a brush (maybe because I’ll end up with medium coverage every time lol)", "jomeng": "I always end up back with a beauty blender", "rararabia": "Brush", "glammbydeme": "You need a different foundation brush, that’s the problem.", "sourpatchkids_resses": "Real techniques sponge is a great dup for beautyblender, that gets my vote", "nanditab": "Blender!", "sophia_farah": "I love blenders!!!", "mangobungalow": "Brush for me 🙌🏼💕", "reaannsilva\nVerified": "Verified", "alwaysbeautyy": "The only brushes that arent better than beauty blenders are dirty brushes.", "koco_travels": "I swear by my beauty blender or use good old fashioned fingers", "gold_hourglass": "Both! I use a brush at first and then go over with a beauty blender for a smooth look.", "nxtelz": "Is there an option for both? I normally use both mostly sponge for my under eyes and I’ve been loving applying my foundation with a fluffy brush. My real techniques contour brush blends in my foundation like a dream", "thequeenchristine": "@beautyblender always 🙌🏼", "resharti": "Beauty blender.", "sabringill": "Not hating. Asking🙏🏽", "anujabhawalkar": "Blender definately , I am so so bad with brush", "evaaaa16": "With the hue stick I use my finger to blend because it works the best", "henna47": "Hands! 🖐", "rajinisrisha_makeup": "Brush of course for me❤️", "lailazubair": "Beauty blender 100%", "thisisdamarispierce": "Hands anyone? Maybe a brush, maybe a sponge. Just depends on the day really", "sofia.j.h": "Beauty blender", "palluuza": "Beauty blender always!", "vaishcantsingh": "Depends on the coverage and foundation I am using. For a full glam look I use a brush and lighter days I use a sponge or even my fingers. But no matter what, I always end up going over everything with a sponge anyways! Feels like it gives me an airbrushed effect and also really pushes the product in 😊", "douglas.maina": "I think it really depends with the foundation and also the finish I’m going for", "cynthia_freckleface": "Blender", "bebu24": "Brush then go over with a beauty blender where I need more coverage", "d__o__n__n__a": "Blender always", "theluxurybelle": "Beauty blender!", "iamcaroldz": "A blender", "edisamar": "Depends on how fluid the foundation is. In my case, if Im at home, blender. If Im on the run, brush.", "eshveli": "Beauty blender!! Cuz it gives me a more natural look", "dorababu.maddukuri": "Def a damped blender fam 🙌🏽", "luckypinto2591": "Beauty blender!", "roosterlyn": "Brush ❤️", "amikal03": "@deepica blender!!", "ramyashankar": "Brushes! Just because I have more of them than blenders and the thought of an unclean beauty blender is just more off-putting than an unclean brush.", "rachelolach": "Typically a sponge, but maybe I should really compare the two", "evsinha": "Brush! blender uses too much product", "tanv_s": "I don't do makeup first of alll.. 😁😂 But when I start doing.. It will be the blender for suree 😁", "cheekybillo": "I use my fingers. I feel like that’s the cleanest way to do it, but definitely doesn’t look as flawless as it does with a beauty blender!", "vallyshabaichu": "Brush first then I go over with a sponge", "michigangirl2001": "My fingers..... easier to clean my hands....🤷🏻‍♀️ guess I’m just an amateur", "palkigrewal": "I use a brush everywhere that I don’t use my huestick, for those spots I use my beauty blender cause I feel like it helps it absorb both the foundation and huestick rather than spread it", "anusha.yedla": "Stippling brush!", "munnidivya": "Blender of course😍💃", "arshia.shaik.ars": "I use both", "basicallyree": "I kinda honestly use a bit of both, I feel like using a good brush first spreads out the product well and the blender blends it well to give it a very airbrushed effect. Overall I feel like blenders by themselves do great and more affordable obviously 👌🏽", "princessnayaam": "I use the blender for foundation over my hue sticks and it never mixes with the foundation and both products stay separate", "honiha_": "❤️❤️❤️❤️❤️❤️❤️", "roshiness": "Blender is too much work! Buffing Brush for me", "kellicameron": "Beauty blender when I’m not in a hurry.", "legally_hijabi": "Brushes for me!! Personally, I think it’s more hygienic and it does not suck up a lot of product. I am also almost always in a rush and i always forget to wet my beauty blender. So I just abandon that ship lol.", "radhaupa": "Ugh sponge only girl!! I suck with brushes", "luxpriyachitturi": "Always a blender for me", "nina_onthego": "Start with a brush & then finish with a beauty blender!", "rayannsiewnarine": "Sponge regardless!", "supreetaa": "Brush!", "anarodriguez19": "I always start with the brush and then wet the beauty blender and tap over everything thing again 😂 just for extra security 😂❤️", "julied38": "I like both. But with the huesticks I found using a brush (concealer type) easier. TBH I always use brushes when putting on concealer and eyeshadows and beauty blenders for foundations 🤷🏻‍♀️", "theaartikumar": "i use brushes! i use liquid foundation so it works best for me. i find beauty blenders are harder to blend out for me", "nishuuu__": "Blender! I can apply with a brush and make it look good but I feel like foundation/complexion products just don’t sit the same on the skin and feels weird", "mamatrinii": "She’s on here @arlenegrace22", "rena.jepg": "Blender all the way", "zt.beauty": "Depends on the foundation!", "brunster25": "Both! Usually brush first then blender to give it a finished look @livetinted @deepica", "sobiqazi": "Beauty blender", "eromanoski28": "#truth❤️", "snflwr2121": "Beauty blender", "hennabyprii": "I like a more natural look and the beauty blender does the best job", "dancing_devi": "Went through this today 😂 I usually use the bb but saw a mua tutorial using a brush. Tried the brush and... nope. Right back to the bb.", "glambyshivani": "Beauty Blender always ❤️", "anchalavasthi": "Beauty Blender alllll the way for the dewy finish!", "ankinayak_": "blender but only if it’s clean!!", "mariasaleem8": "Stick products-I use a brush and buff it out. Liquid foundation- use a beauty blender 💗", "brookebackus": "Brush 100%. I used to use a beauty blender and, personally, didn’t like how it made my skin look.", "4ever_aj": "I use both. Depends on the foundation. For @bareminerals Pro I use the brush. For @hudabeauty I use a beauty blender", "monikaranu": "Beauty blender for sure!", "jyotigohil": "Beauty blender! Idk even how to get a smooth finish with a brush 😅", "ananyapati": "beauty blender all the way", "sumirawr": "Blender! I have the same issue with brushes- I feel like I’m not doing something right and I see streaks or lines- then I quit and go back to the blender 🤷🏽‍♀️", "ja.ne.ssa": "Blender! 😍", "higherstraits": "After I apply the #huestick to color-correct, I like a brush to press it in and then use a beauty blender for my foundation !!", "sudarini": "Blenderrrr", "beautybyarooj": "Blender for me Always !", "janinelamachine": "Blender! I can’t use brushes properly either 😭", "upagya": "Beauty blender always", "rachelista": "@beautyblender for life. 💕", "yazzyb": "Blender", "pamehhlalala": "Both! It depends on the amount of coverage I need and how much of a tan or hyperpigment I have going on.", "keshitawithadollarsign": "Brush", "merissa.b": "Blender for sure! 🤗", "_anaventures": "Blender but brush when I'm too lazy to clean the blender 🤣", "liahgoyal": "what brush is that? (that you use in the first clip)", "sonam_kumar99": "Blender for me ☺️", "shinjinisur": "Beauty blender!", "katiejanehughes\nVerified": "Verified", "michellekeswani": "Blender", "mrinmayis": "Brush for me!!", "pbs20": "I use a brush to apply my foundation and blend with a blender!!", "jessedoddi": "Blender! Soo easy to use"}