{"tatia_o_niani": "😮😮😮", "priti7128": "Got found and origin and loving it !! 😍😍", "ayan7399": "Prettiest gorgeous stunning beauty", "orin.tgn": "Your face gives me life deepica ughhhh 😩😩😭😭😭💘💘💘💘💘", "community.ampandgo": "⭐️⭐️ Check your DM!", "lwagnac": "What advice would you give other women who are interested in starting a business in the beauty industry?", "saphiquelife": "Gorgeous 🌹", "beingsaarsarsabh": "Can you will be my girlfriend", "iampriska": "Beauty 🤩", "iremixcetinor": "Do you love and honour yourself?", "adibabe19": "What would be your advice to someone that you wished someone gave you when you were younger?", "livelawless": "When will you launch LiveTinted in India ma'am? 😍", "riyapatel_": "SO POWERFUL 😩", "jeewaraninaidoo": "Will you bring your products to South Africa?", "merica_tf": "You r soo beautiful, how to prevent our makeup from caking up ?", "islam_travel": "🍀", "t.seabourne_hl": "Are u in the market for a go to creative mind that can make art and graphics and engagivjnv story content as your artistic advertiser ? I see you do make up as well and I would very much like to build and become a dynamic duo creatively with beauty influencers and within the art world 🙌🏾❤️ Travis Seabourne here hoping there is room on the team for another kreative mind", "neenalakhani": "Best skin care routine before bed that you swear by?", "s_kondragunta7": "Is your dad a doc too? @deepica", "xdontjhajmex": "What did/does your mom do for a living? @deepica", "heeraa_beauty": "What gave you the idea to colour correct with a lipstick?❤️", "iamkamantha": "This smile 😍", "mykitsch\nVerified": "Verified", "rajalakshmi.papu": "😍😍😍ummmmaaa lots of luv...", "beauty_care_zone": "Hey new follower here!💞♥️ And I’m already in love with you and your work♥️", "nerusumownika": "I am so happy for you 😍", "aarikas_closet": "Also, would love to meet you? 😁", "eclat.lueur": "Deepica, what is one thing you would tell your younger self? ❤️❤️❤️", "diptipastakia": "Do you have any tutorials for applying eye shadow to hooded eyes?", "deepa_dangelova": "Stunning pic 😍💖", "desieverafter": "How to collab with you?!", "nnehhaa": "What’s your shade in the patmcgrath foundation?", "ashamadhukar": "Can you recommend a sunscreen? I know you’ve given reccs before but can’t find the post😩 would love a tab on livetinted’s website that featured products you use on your skin type (which is the same as mine 💕) for easier finding and shopping ✨✨✨ keep killing it 🔥", "sarina23_": "Why are so amazing and gorgeous?! 🧐😍", "ric_oh_la": "Pop up in South Africa please? 🇿🇦😁", "nerak_kjsp": "Congratulations on your success 🙌 I can’ wait to try Tinted!", "shravhanymogili": "When are we getting Livetinted to Indiaaa?? Can't wait to have all of them!!🙈❤️ Love from Hyderabad.. Deepica❤️", "keerthana__08": "Best suncreen for indian skin", "krishnaarval": "Depica? Do u have any plans visiting Michigan;", "anna.banana.1117": "Loving the necklaces! Where can I snag those?", "ranjithasundaram": "No ques, wanna tell u onething You are truly inspiring deepica lots of love to u💜", "mrsadriennebosh\nVerified": "Verified", "follow_puji": "Not a question but I feel awesome seeing second generation Indians doing great things in America while keeping the Indian culture at the core. The fact that you include your Desi parents in your videos is SOOO cool. Best wishes to you!!", "pavethra_rao": "Not a question but @deepica Thank you for bringing a better change in this world.You are one of the greatest woman power we got ❤️Keep on inspiring 💛", "deekshabantwal": "Any plans to launch in the UAE? 😍", "kripzchips": "How is Mama and Papa Pandu doing?? Along with Monica and Dinesh?? @deepica", "srilassya.yalavarti1": "Ur literally sooo freaking gorgeous and ily❣️", "sidd_sarah": "SO PRETTY", "mrstiaraindiasupratalented2018": "I love those eye brows..... Suggeatvme something pls... And I love you", "dqwithglam": "What would you tell someone who is scared to leave their corporate job (good pay, all the benefits, seniority) to follow their passion & possibly become self employed?", "jinas_travel_diaries": "How do you make your self so happy 😃?? @deepica", "farziazaman": "What would you advise a young entrepreneur about failure? Btw- you're one of my inspirations. Love you! 💕@deepica", "lanapatelxoxo": "What's your most favorite place in the world?", "sahara_jaiz": "Why don’t you ever talk about Pakistan? Visiting it or even launching or anything? Do you hate Pakistan", "janetfelixmakeupartist": "When is @livetinted launching in India ..", "vaishali_anand_vishu": "It's a request from you to make a video on your mental health struggles & how you handled racism in foreign country. Everyone knows that you're a fabulous you tuber & rising entrepreneur. But only few people know how you overcome your fears, I wanna know about them & want to learn much more from you. Lots of love @deepica 😘", "pramitac.rns_": "How are your teeth soooooo white!", "sboovari": "@deepica how can I get this in Canada?", "babymommatojorelandella": "Do you send out samples of your lipsticks? Any stores I can try them at?", "anamhakim": "How much investment did you put in your company Livetinted ??and btw.. what are your educational qualifications??? Love from India❤️", "chandani523r": "GORGE-OUSSSSSS 🔥🔥🔥", "ngash34": "I❤️u can you please send me something", "geethahahaha": "Why LOL is your most used word for every emotion?😂💕", "rashmi_bhosale": "Love the community you have built @deepica! ❤️ Do you guys need volunteers ? I just moved to San Diego from India to be with my husband and I am new to the States. 😊", "meena0808": "What’s your why ? And how does that get you going everyday ?", "silenevespertina": "Live Tinted Pop Up in the San Francisco Bay Area pretty please!", "kamanigengen": "Can you come do a launch in South Africa 🇿🇦", "americandesimsm": "Biggest advice to aspiring bloggers??", "mamajotes": "What’s next LiveTinted?", "payalgpatel_": "So inspired by you 🧡🧡🙌🏻🙏🏻 @deepica", "jess_tapia_91": "What is your biggest fear?", "sleiman.sl": "💖", "yamini_mutyala": "@deepica when are huesticks coming to India?😍😍", "vannamwithvinu": "When huestick is coming India❤️", "rychilin": "When are you getting married my dear!?", "jayadarshini": "Please ship huesticks to Singapore!!!!!!", "kusumwarsi": "Don’t you miss doing my make up @deepica", "karishhmatic": "Can you be my mentor?? 🙂", "sanika_govekar": "Last night I had a dream where I FOUND out that I won the huestick in a giveaway. Sigh, just a dream 😂😍♥️", "sandhyab14": "Are you working on to getting this product at beauty stores like Sephora and Ulta?", "hyundai_me_curry": "Do you have your own website so we can buy your products?", "symphonyofcolour": "You are amazing and inspiring! Not a question but I mean it ♥️", "anum444": "So cute, may you keep smiling like this Always😘", "deeps724": "Are there any plans for a pop up in Chicago? I would help promote!!!", "ananthaya09": "When will you be doing worldwide shipping? I am from Malaysia n I can't purchase huestick 😭😭😭😭", "pramospr2": "So, what do you think of L.A. now, is it one year later since moving from the East Coast?", "kabitapariyar21": "Why r u so cute deeps?? And i love u so much ur such an inspiring person for me .u inspired me alot.thanks for that.😍❤️❤️❤️😢", "thulz.v": "What’s your night time/ morning skin care routine/products? 💕", "anitasoni": "I need attention! ❤️😘❤️", "skstarburst": "How do you push through your work, even when you’re exhausted?", "ndurv": "Congratulations @deepica on all your successes! Love seeing an Indian woman (and that too a Telugu sister) making it big! Do you find it intimidating or challenging to take a step back from your professional focus to make time for personal development and commitments?", "rajigops": "I'm mama pandu's greatest fan for her innocence.Stay blessed.Good luck with your projects!", "ind1983": "Would you possibly make a huestick type of concealer for legs? Or liquify the huestick recipe to make a body concealer? So love the amount of coverage huesticks provide! And p.s. you're awesome from a Malayalee sista to a fellow Telugu sista 😍", "jannatc716": "Have you considered having the huesticks sold in retail stores?", "sejalpatil03": "One big advice for a teen entrepreneur?!", "ayushiayushibanerjee": "Will you ever make other makeup products like bronzer, foundation, etc.?", "sincerely__sneha": "Who sponsors all these popup trips, and how much of your profit do you donate?", "geraldinebates": "I’m fair skinned and suffer with dark purple/blue under eye circles would Livetinted have any products that would cover this? Or is my skin tone too light? 😊", "houseofnaveda": "Wishing you endless success lady!!! 🌹", "cosmic_crochet_creations": "Are you going to have an pop up events in Florida?", "kajalg04": "Can you do a pop up in Dallas? 🤷🏽‍♀️", "kinly_20": "You are extremely inspiring and love your products, your take on life, your bubbliness... Will you open up an office in New York? What positions will you be hiring for? Would love to work for/with you", "aftab.nizamani13": "So beautiful", "amoscookies": "How did you curl your hair in this photo?!", "niki0416": "When are you coming back to nyc for another pop up", "kanteliajones": "Need it in the shops in the UK ❤️ congrats looks like an amazing and unique product 🙌🏼", "alogossai": "Pop up in Houston??", "efig2k": "You look great", "angeliqgoddess": "I love your smile", "shevaitha007": "What’s your Taco Bell order?!", "nids_88": "What is a limiting thought/weakness that you’ve identified for yourself that you want to overcome? 😊😊", "gingerturleymakeup": "So beautiful! I would love to see you come out with a concealer next!!", "anjdesai96": "@deepica how can you use the huestick to color correct casually but without foundation?", "luxoxu": "@deepica I love ur lipsticks! When r u coming to the UK!? We are all so proud of u girl! #browngirlmagic 👏🏽💪🏾 @jaineex86", "miraoffthewall": "Also I love your line. are you opening a pop-up in Boston?", "elkachowdhury": "Hi Deepica! I love Live Tinted’s mission and everything you are striving for. How are you reaching new communities and are you ever looking to expand your team? 🌻", "mace__hindu": "You’re amazing at networking. What do you think you do differently from others when making connections?", "kusala.v": "how did you overcome fear and doubt and finally decide to put live tinted out there?", "sakshi.sharma18": "Hey Deepica! Love what you're doing. Would you be open to talking about your entrepreneurial journey on a podcast I will be launching soon?", "sonikkalogan": "Will you consider making found a permanent huestick?", "radhaupa": "Ur from Texas!! Pls do a pop up store here!!", "shefali281": "What’s your favorite foundation?? Shade?", "sonal9229": "How do you sell your idea to investors without the website to order products in order to get seed money? How do you fund a software developer to create the website and process the shipment ? Does this come from VC / investments or is it initially out of pocket ?", "jazzy0027": "Stunning 😍🙌", "chubby_krishna": "You are the best ❤️I hope one day to meet you in person 😍 boss lady", "palsi.rao": "What do you do for workout routinely", "withlove_sara": "Would you support a small brand of ours ? Coz I heard really good things about you that you have a good heart for new female entrepreneurs ♥️", "officiallyquigley\nVerified": "Verified", "tashasha001": "Best under eye cream??(For long term Care) dark circles, good skin, reduce wrinkles etc Also would love tutorials on how to apply eye makeup like a professional! :)", "manali_vy": "Which product are you working on currently 🤪", "dim0ndrex": "Can you come to Wales please we need tinted help yaar 😘🏴󠁧󠁢󠁷󠁬󠁳󠁿", "vaishumarreddy": "What’s the best part of being able to have your own line of products? What advice would you give to people trying to start up their own business/brand? 💕", "shanna_zia": "What advice would you give to your teenage self? Also you’re incredible 💕", "srinisblog": "What was your favorite part about attending UT? I’m a senior at UT rn🤘🏽 Love your brand so much🧡", "themahams": "I want to meet you so badly! Are you ever going to come to Detroit?", "definitelycarla": "Haiiiiii!!!! 🖤 I’ve followed you before tinted before all this blow up and just want to know what keeps you going? I get so discouraged sometimes when I share my thoughts through blogging/instagram and don’t get the response I’m looking for.", "tulshi19": "Please have a livetinted popup in Chicago !", "karishmakenadis": "When will the huesticks be available on nykaa India ?", "arananewyork": "When did you know you had the right idea? Also, when can we see you in one of our pieces?! 🙂 Emailed you, when you get a chance! ❤️", "keerthanasattiraju": "would you ever consider learning how to read and write telugu?", "rheally.jpg": "Have you heard of @abcdgen?", "samiam_897": "I love everything you’ve been doing for brown girls out there! It’s so nice to see someone like me make it big in the makeup industry. Go to songs at the moment? :)", "iris.artistry": "@deepica Who is your biggest entrepreneur inspiration?", "rimib1": "Can you plese make \"found\" permanent?! That color is amazing, and I feel thats an understatement.", "anjali816": "your theme song is so catchy. where is it from", "yashodhara_kundra": "Is Live Tinted hiring for any position soon/currently? It gives me hope to see what you’re doing for women who look like me 💕", "charmingchanda": "I would love the opportunity to work with you @deepica I'm a graphic designer", "legit_rbs": "Hello, can men use the hue sticks too or will you be introducing a men’s product line? Thanks in advance.", "sujkumar96": "@deepica dreaming of starting my own complexion line (specifically for south Asian women) in the future. Any advice you have for people who wanna make it in the makeup industry? :)", "meghanadeodhar_": "How does color correction w red make sense ? Can you provide a color wheel and give me a 101 on this? Wanting to try it out but not sure what red will do for my dark circles and blemishes !", "estelle.aro": "It's not a question but I think you are such a Beautiful woman, inside and outside. I love the love and happiness you spread around you. I am Indian too and by every action you make, you show me that anything is possible in this world. And I'm sure you know how hard it unfortunately still is for our community to believe in that. So I just want to thank you for everything. I will always support you. Big love and lots of kisses. Love you my dear @deepica 💜💜💜", "prasani_h": "Will you ship your products to Paris ? 😘", "madhuriraju": "Any plans for pop up in London ? 🤗", "hair_and_skin_diaries": "How did you get the confidence just to get infron of the camera? I’m still so nervous with my blog- always chickening out 😂", "aliya_z_91": "Beautiful ❤️❤️❤️", "raniakaur_": "Hi @deepica - been watching your journey since the very beginning! Any tips on growing your social media community and getting your face out there?", "tharasavio": "Can we expect any major offers during Boxing Day?", "bhumippatel96": "What keeps you going when there’s so many other makeup brands out there? How do you recommend small brands to get more recognition/marketing strategically when you don’t have many followers?", "jeena55555": "Is your product available in New Zealand?? Or Amazon?", "beautybyarooj": "😍😍😍😍", "poonam.c.shah": "Nothing to ask your so pretty keep hustling and creating magic x", "excellenceisbest": "Can we meet up in nyc someday? Genuinely need friends 😂", "maishaxchow": "Would you consider checking out @browngirlanonymous ?", "revajaan": "Will the huesticks be EWG certified in the near future?", "isweetsapna": "Hi deepica..I wanted to buy Livetinted Huesticks. But just wanted to check with you. Are these chemical free Huesticks?", "nehaltenany": "Will you be on our podcast @thewokedesi ❣️‼️💕", "tawana10": "Have u been able to raise capital for your company", "umanaralkar": "I love everything you are doing sista! Are you opening a live tinted store in LA?", "_rramesh": "Have you had any profound mindset/lifestyle/priority shifts that have enabled you to better move past set backs? I get so down and it can be hard to find the energy to get back up.", "iamshivanaamritachauhan": "Beauty Xxxxx", "thindikaur": "Live tinted pop up in the UK 💜 would love to help out", "rupali_who": "Meet up in MUMBAI pls", "fatgirlpri": "HOW are you so wonderful!!!!", "nishacherian": "Love your family vlogs esp with your parents 👍. How can I try your products? Is it available only in US?", "_kparmar": "Will you be hiring soon? Id love to know so I can apply. :)", "alexbowie940": "What advice would you give someone if I wanted to build brand on what I want people know what I am working on and how will it change their life. 🙂", "sra.glmr": "Do you ever feel and how do you deal with entrepreneur-induced anxiety?", "aparnabolla": "@deepica do you have any near by plans to sell hue sticks in store. Just to check which shade looks good before we buy it 😊", "amrutabhatt_": "@deepica would you be able to give some tips on my blog about entrepreneurship + mental health tips/tricks? My mission is to empower people on their entrepreneurship journey to stay positive and mentally healthy. Oh, and you’ll get some free merch in return ❤️😊", "krish19999": "I would love to try the Hue stick!", "xshayshayxo": "How are you feeling about the grand success of live tinted? 💓", "shireenwin": "Do you think the Huestick will come to the land down under (Australia) 😍", "jet_setter_life": "When are you coming to Miami? 🚀", "srikunchapu": "How do u maintain clear skin and avoid acne?? I love u sm btw 😍😩", "sueransl": "What does “pandu” means 😑 sorry,mama pandu I mean...I am lost 💐", "handbagdivas": "Did you change the huestick formula for Found? #HandbagDivasLove", "petitenpretty\nVerified": "Verified", "msbav": "It was nice meeting you at the Chandon Winery in Napa! You were lovely and my niece was excited to meet you as well! @smithadepak", "abhisha.x": "Is tinted ever gonna collaborate with anyone", "navie_96": "How do you stay so motivated sis?..I am your fan💓💓💓..", "letstalkaboutmeforaminute": "What are your favorite places to buy jewelry?", "dee_vn": "How desi is Dee? 🙈✨", "neenzie": "Will live tinted be doing more pop ups! (Detroit 🤗)", "ahsanactive": "Biggest advice for young entrepreneurs", "shreyamaha": "How do you stay so motivated? ❤️", "__pkg_": "How did you bring your live tinted idea to fruitation ? Did you trademark live tinted and then go to labs to create your product?", "swetam05": "Hi! I would love to try one of your hue sticks, but how do I know which color is best for me? Plan to use it for dark circles under my eyes.", "xxjleen": "Would you consider making highlighter sticks?? 👀 ly btw 🧡", "sumayyah.zarinah": "No question, just wanna let you know you are so fun, totally a friend in my head. Keep being real!", "dharasworld": "So what’s your vision for Livetinted In 2020 more product launch, beauty change movement or both? You know I’m ready to join your team and represent from Houston 😍", "shivanipatel98": "Can I get a FOUND huestick?", "autumncomm": "🤩✨", "nazbeborta": "will you visit savannah?!", "penjin": "Is there gonna be a livetinted popup in Atlanta in the future?", "lazpaz__1001": "Not a question, but I am so proud of what you’ve done as a fellow Desi. Kudos to you, girl! You are an inspiration to so many. When you’re having a bad day, just remember that!", "thenikkiwindisch": "Can u put hue sticks in @boxycharm Tysm @yflmartin", "hopelessrahmantics": "where do you get all of your energy from?! you’re always so hype and so happy and kind to everyone 🙌🏽", "deepikasobti": "Why don’t you reply to my messages?", "saganaa_4": "Any future plans for nude lip products universally flattering for all skin tones?", "rosh2779": "Can I have your earrings?!? 😬 (Where are those from..so cute!)", "sohineeee": "What’s the next hue stick shade??", "samhitha.vundi": "What was the hardest challenge you faced while making your company?", "vpxphotos": "How did you overcome the hardships of growing a brand as a south asian?? I’ve tried starting my blog so many times but ended up deleting it bc I was told that I should just focus on my career and not waste on things like this which led me to pick a “typical” Indian career path", "roshiness": "Any beauty advice for South Indian girls with darker lips? Most lipsticks don’t work for us. Any tips? Or lipstick launch?", "jelisha_patel": "What do you do when you have time to just be with yourself? because you're always on the go! 🥰🧡 PS: I love Found, it's my first huestick but not my last 😍", "saii0s": "How do you manage your schedule?", "trehanmonica": "Will you ever come to Dallas??❤️", "meghanapatnana": "Any chance you’re hiring interns? 😊", "dougkamin": "My bff @theritualofme will kill me... but can I take you to dinner? 🥰", "harshikapramod_": "When’s the next video coming with mama pandu??☺️☺️", "annatzzx": "what’s one advice you would tell your 16 year old self? 💕💕", "mitisippi": "What drives ya in life?", "dinidips": "How do you stay positive when things aren't going perfectly??? 💕", "alicevarghese17": "How are you so perfect?! What's your secret to being such an inspiration? 😍💜", "angelrose5191": "Can we become friends from other nations?", "styledbysanjana": "What was the first big challenge you faced when establishing Live Tinted as a brand with a product line? 🙏🏼", "sugglet36": "Is there any way to color fix a foundation that is just too ashy for Indian skin?? Xx 😢", "belenmargarita91": "Love your skin! I wish I was so tan and beautiful! (I got a very pale skin hajaja) ❤️", "ujjkrishna": "Meeru baagunnara? 💕", "lolasandra1": "What type of skin do you have - oily/dry/combo? And what products do you use to remedy & maintain it? 💖🙌", "komalmidha_": "@deepica hello from jaipur.. can I be part of tinted community..", "azkaay": "You’re so inspiring. Your journey is literally the example of how hard work pays off. No questions really but just wanted to let you know that you are an inspiration to SO MANY new bloggers. ❤️", "sheena1519p": "I love your content ❤️", "behencode": "How long did it take for your blog to get noticed after you started?", "myvegetarianroots": "Can we be BFFs?!?! 🤗🤗🤗"}