{"phborra": "OMG @monicamutyalareddy and Dinesh.... Sooooo happy for you both 😍🤗😘🎈👶🏻", "aditi_h": "@javendren", "luckydacorgi": "God bless you both.", "sonalidasc": "So cute", "ninacherian": "You seem more happy than yet actual parents. It’s so adorable ! 💕", "elizabeth_ggomez": "@gabriela_ggutierrez yo soy la tía de rojo 😂😂", "sequins.damour": "@24.10__ @mb.45a Je veux ça!!!", "rindha.dsj": "Now you have missed doing a makeup tutorial video with your niece!! Hope you see a video soon with your nephew 😝", "purvidave007": "Aww Sooo cute congrats to the whole family", "shawlsbysonika": "Too cute😍", "naziaeadally_": "@_hoorshah", "rajf1p": "😲😲😲😲😲😲", "ladytitan925": "💙 Congratulations future aunt! And to the proud parents to be! 👶🏽", "laharimikkilineni": "Lol...I’m getting the med books no matter what gender my daughter has sort of look", "shabana786ca": "Congrats!!!🎉", "ferozaesmail_": "@afrah_amin__", "anousshkaa": "Congratulations 💓💓💓", "axellefuentes": "@christine_fuentes29 C'est long viiiiiiiiiite 😍💖💙", "rithikam3": "@roshm22 @rjaikishen I’m doing this when you guys have kids get ready", "shamoothunda": "😊❤️", "indigrowkids": "Oh wow! We’re going to send you some goodies for the little one to come!!!!!", "pixieme138": "Congrats to the parents to be and baby boy. The set up look fabulous", "onkamal": "Awe!! So excited for you and your family!! Having a baby in the house is everything!!! 💕 Congratulations!", "sherana___": "Aww this makes me happy. Congratz and bless your beautiful family💙", "imamandeepnagra": "Congratulations 😍😍😍😍😍😍 @deepica your face reaction is too good omg 😆", "amandapillay65": "Very happy for you all. Much love from South Africa", "anita.mua": "Congratulations ❤️", "anotherfashionbl0g": "Omgggggg so cute", "replyginnie": "Congratulations to the beautiful family", "taniaschouschi": "😃", "naimi.kodali": "YOUR DAD’S REACTION >>>", "priyanka_whoelse": "How blessed is your family. Congratulations!!!", "poojaschallapalli": "Just look at your brother in law jumping with joy. It's overwhelming to see that sight 🤩 He is going to be one amazing father for sure. Congratulations 🎉🎉", "beeker1021": "Awww!! Congrats!!! So happy for u guys!!!! 💙", "notsoperfectinscottsdale": "Who doesn’t like a gender reveal! Congratulations!!", "priyajha_89": "Oh my god your brother in law looked so happy and excited. May your sister and baby stay healthy and happy forever 💕", "thegoldpower19": "My MOTHER says such disgusting things to me and acts like she is a virgin or something even though she has had two kids and my controlling father is 30 years her senior and he already has 6 kids from a previous marriage a half english, half Jamaican woman - they pass as white/english and even to this day, they continue to control, stifle, manipulate,abuse,mock & downright bully my sister, mother & I. I am a British, Gujarati Indian but have no freedom and am very isolated, damaged, and a victim of many hardships including racist attacks even from police who of course face no consequences. I am 24,but not developed, not graduates, not employed, not driving, not free, not married, not active, not travelled, not clued up, not on par eitj ym peers, especially successful Indians. I'm oversharing all this because if any indian girl or woman sees this and complains about their stereotypical Indian upbringing, and complains about petty things, I want them to be grateful that they have working, helpful, caring, skilled, well rounded, parents and big supportive families and you get to go to all those cool weddinga, samaj meetings etc. I was given an english name by my uneducated, pathetic father who is now 90 and so abusive still, and I recently changed it to a stereotypical indian womans name by deed poll and getting it signed by a solicitor after years of torment and being challenged in rude manners about why some 'ugly indian' as me has such a 'pretty english name'.Post like this on social media make me smile so much like you wouldn't believe but also bittersweet as in reality, I'll never be able to relate & my life is world's apart however I adore Deepica and her products look incredible and I genuinely do love the expressions shown here & the aesthetics of the whole gender reveal setup. I'm not sharing to be a negative nancy. I just want t educate peopel hether theyre Gujaratis like me or lucky white folk, that not all Indians have the same upbringings and privileges. It's really Anywsy enough about me. Let's all look forward to another royal prince joining the globe soon. Babies Are Adorable! 🌌🍀", "vinita97": "Congratulations! This is so adorable 😍", "reetzw": "Ahhhh @monicamutyalareddy so excited for y’all!! Congrats! Boys are soooo sweet! You’re gonna be an awesome Pinni Deepica!", "priyadarshinijayakumar": "Congratulations Deepica!! Boys are fun!! Mine are 8 & 2 😍", "sharonhalli": "Congrats Deeps", "itzangel100": "When you announced that your sister was pregnant I thought it would be a girl, Congrats on your baby nephew ❤️😁", "saruml2302": "Congratulation for going to be Pinni 😍", "shanta_lovesmakeup": "Congratulations", "tniquejhair": "Yaaaaaaaay!!!!!!! Awwww congratulations to your family!!!!!😍", "life_is_vertigo": "Omg! Congrats to your family @deepica! Welcome to the club! I'm an auntie to 2 nephews.", "rakel.inha": "OMG your face is everything ☺️...congratulations to your family 🎉", "soosanthomas728": "Boys are the best 💖 😍", "reshme_24": "AAAAHHHH congrats!! 😍😍😍😍", "nigellatherapy": "Adorable! Congrats!", "kaveshree25": "Love it💗", "asharmax": "❤️❤️❤️", "rayr9224": "👍🏾👍🏾❤️❤️", "oregongirl76": "So your sister knew she was having a boy....Before her gender reveal??", "stylenbeautydoc\nVerified": "Verified", "kinu26": "Congratulations!!!! Let the haters hate! Do you boo 😊", "ameera_safdar": "Mubarak!!! 💙", "yodelheyheehoo": "❤️🎉so much love", "da_crazy_trini": "💖💖", "coltables": "Congrats!!", "zehraq": "I feel like we are right there with you. Thank you for making us part of the Mutyala Family.", "a_butler5": "Congratulations to your Sister and Brother in law and entire family!!!🎉🎉🎉", "indubadhesha_gill": "Congratulations ❤️", "amelia_mariah": "I love the “we’re having a boy”. Every time my sister has a baby it feels like I am too 😂❤️ #SisterBond", "urs.create": "❤️", "iamnabilaaslam": "Yaaaayyyyyy congratulations... Congrats congrats congrats. This reminds me of my gender reveal. That excitement is a different level😍", "nelledias": "Congratulations to you and your family😘😘", "glamourshimmer": "Haha love it. Congrats to you all 😘", "saraf_njh": "The dad look so happy😭💕", "veganricha": "Congrats!!", "nitikachopra": "I AM SO HAPPY FOR YOU!!!!!!! This is such beautiful news congrats to your beautiful family 💗💗💗", "anuradha_sagi": "Congratulations ♥️♥️", "normaangelica.rocha": "Felicidades a los papás 👏👏👏👏", "loveforbalance": "Thank you for sharing this beautiful joy in your family with us ❤️ so much love to all of you ❤️", "heeraa_beauty": "This is everything. Love you guys and Congratulations🤗💗🤗", "bhamini76": "God bless", "queensincic": "Lol your face", "stephalajba_rn": "Congratulations!!!! Gender reveal parties are the best! She looks stunning!!! Thank you sharing your most private moments with us!! I adore this video!", "skb.ontherun": "Such an exciting time for you all!! Congratulations 💙💙💙", "deleted.xoooobub": "so cute ♥️", "honeywhatscooking": "Congrats to your sister and family. So exciting!!! 💙", "houseofyala": "@monicamutyalareddy omg congrats and soo love this!!!", "whitelotus01": "So sweet. I love it all!", "radbose": "Congrats! So excited for your entire family", "nicole_groskreutz": "Congrats!! She is glowing!!! 💙💙💙💙", "miz_fabulos": "WOW congratulations 🙏😍💕", "salagalasailaja": "Congratulations to you all🎊 The last sentence made me laugh so much; I’m getting the med books ready ❤️", "thatsbiancatoyou": "Papa looks so proud and you all look so thrilled! You are finally becoming a Masi 😊", "mia_qo": "💙💙💙💙💙💙", "nadine_veeren": "She looks so amazing ❤️", "betigrewup": "Your family is the CUTEST", "thebabygirl82": "Congratulations 🎉💙", "girlactik": "Exciting", "sulycader": "❤️", "jellybean617": "I used to be against gender reveals and “unnecessary” parties. However I have grown to believe that life is so trying and so short that we need to celebrate as much as we can, in as much or as little fanfare as we want! Congrats to your family on this happy occasion! God knows we all need more of those! 💕", "thearaedit": "❤️😍❤️😍", "magss67": "Love it 😘 ♥️ Congratulations 🎉❤️", "sonyreddym": "This is so purree ❤️", "iisamhii": "@nishka_vipul I’m not crying, you’re crying 🥺😭", "spicedupworld": "Congratulations aunty 🎉 what a great surprise 😱❤️❤️❤️", "luxeisle": "Congratulations 🎉🍾 🥳", "skhurrami": "Congratulations 🎊🎉🎈", "mcheddie": "Love this and gender reveal parties. It’s such a special time for the whole family filled with so much joy. Enjoy every moment and Congrats!", "jjenn10": "Congratulations babies are a blessing!👏🏼", "regina_phalange62": "I can't stop watching ❤️ God bless the mother, child & all the family 💞", "mscindy_hue": "Your dad looks like those rookie football players on draft day like I GOT THE NUMBER ONE PICK PLAYA!! I GOT THE BLUE CHIP!!! WE GOING TO THE SUPER BOWL!🤣😂", "picnik83": "That’s awesome! Congrats to your sister and your family! Boys are the best!", "shrutiveeranki": "❤️", "jasminegmehta": "Congrats Masi!!", "jilliancecilia": "Congratulations!! It is so fun being an aunt 💕", "kdn_07": "Awww. Congrats to your sis and brother in law!", "shwetaaaaa": "Congrats!!!💕 LOL at the “I’m getting the med books ready” face😂", "makeupbyfateh": "I love this and your dad look so happy. Congratulations 😍", "sehrishsiraj_1988": "Aww so cute lovinggg", "poshaymadno": "Your brother-in-law is as surprised as rest of the gang. This video is priceless, congratulations 💙💙", "shevatwin": "💙💙💙💙💙💙💙", "simsagoo": "This is the sweetest video!!! Congratulations to your family! ❤️", "sugar_plum_jam": "❤❤❤❤❤ baby boy is already so blessed to be arriving in a supportive and loving family.", "sachhedaesq": "Congratulations Deepika Pinny! Too funny...I used to always say I was having boys and my little sister was having girls . I do have the boy ( and a little girl)and my little sister does have the girls ...", "_candyyw_": "Yay congratulations to your family! Your sister and brother in law will be great parents and you will be a fabulous aunt. Your family has so much love!! god bless ❤️", "dailyn.aquino": "💙💙💙", "charitin_divah": "Felicidades 🎉🎉🎉🎉🎉🎉🎉", "smilieempowerment": "Congratulations!! Many blessings to you, your sister, brother in law and family. It was so nice to see everyone's happiness and excitement. 💯🤗😍", "sujataroashan": "Congratulations to you all", "savidagovindasami": "Congratulations to you all! I hope her pregnancy is going on great. all the very best! and it looks to be a beautiful party. 😍😍", "esmee_kris": "😊😘", "vpriyag": "@gowri2889", "makeupbynaveen": "Love this 💗", "malniganesh366": "Congratulations to your family #mamapandu#papapandu🤗❤️❤️happiness being grandparents love ❤️ 😍🙏🏻", "itsmerbear": "Boys are sooooo wonderful!! Congrats to your sister!!!💙💙💙💙", "deepa.rad": "I’m so excited for your family! ❤️", "makeupby.farah": "💙💙💙💙", "dee_qandar": "💙", "meganpooran": "Omg yay!!!!! 🎉🎉🎉🎉🎉 You’re dad is so proud and happy!!!", "lisa_bunz": "Congrats!!!!", "omelliotcarter": "Congratulations on the baby ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "suziekins6": "Congratulations to your entire family! 🎉💐", "cosmic_crochet_creations": "I loved this so much! I’ve literally watched it several times! I love everyone’s reaction. I was wondering if they knew as well. My husband responded this same way with our last kid when we find out it was boy after having two girls. I’m just as excited for you! You are going to be an amazing aunt!!", "my_limon_life": "😂😍 CONGRATULATIONS!", "divmtr": "Aw how sweet...baby boy!!!! 💙💙💙💙💙", "andreafenise": "Your dad was overjoyed and so proud already!!", "manusinghverma": "Congratulations to ur sister and whole family. Your dad is cutest 🎉🎉", "ashikab02": "Wishing them all the best and God's blessings over a health happy baby boy ❤️🙌🙏", "lincythomas": "Boys are a lot of fun 💙💙", "edithv89": "Congratulations OMG Papa Pandu is so happy!!! 💙 I am a mom of two boys and absolutely love it. Boys r mommas boys", "karishma_desai_": "Yayyyyy 🤗!!! Congrats to your whole fam 💙💙💙💙!!!!", "the_realroseal": "'We're havibg a boy?' Hehhehe does your sister and bro in law know what an hands auntie you going to be? Lols🤣 congrats", "yashodia": "How cute! Congratulations", "bally_hayer": "Congratulations 😊", "symphonyofcolour": "Congratulations!!! To your family and of course cool auntie Deepica!!!! ♥️", "always_shanamarie": "I could watch this all day. Such joy and love. 💙", "ksub155": "Congrats to you and the fam!!!", "shubhangi_pai": "You are going to be the most amazing Auntie ever! Spoil that child! ❤️ ఉత్తమ ఆంటీ (from google translate as I don’t know Telugu)", "snflwr2121": "Cute!", "kareshmah27": "congratulations", "astoldbyanam": "Also your sister looks amazing and I hope she has a smooth and easy delivery and enjoys every moment of meeting her baby boy ❤️", "hassancaterers.ca": "Congratulations deepica and mutyala family", "jessicasannermakeup": "Congratulations! I love how your dad popped his collar. Ha!", "ilenova": "Awww how beautiful and all the joy! Your face and your dad so proud💙 I can attest that being a #boymom rocks ✨", "nivi_ashley": "@lifeless_geek", "ankitasanawar": "Congratulations to your family 💙💙💙💙💙💙💙💙", "krupali_govind": "Awww this is so adorable! So excited for your sister & family!", "secretofdd\nVerified": "Verified", "amarzybeauty": "Congratulations 👏", "suryadeviworld": "❤️❤️❤️❤️❤️", "raniiiiiiii": "So cuteee!! Congratulations to the whole family!!💙💙", "jana_suja": "Congratulations. All the very best to the parents to be .", "kyliecasaly": "Yeyyyy boys are the best 💙 I can finally teach you sports with a purpose now 😂🙌🏼", "francescacescaa": "This is so beautiful 😭😭❤️❤️ congratz", "annthaone": "Lmfaooooooo!!! She got you Bro! You got GOT!! 💕🤣👏", "violetdiamond87": "That was awesome", "anisha.dave.patel": "Congratulations to the whole family! Everyone looks so happy!", "prasanna_ratnakar": "I wish both mom and baby good health 😊", "ucheokon": "This is awesome!!", "chloemorello\nVerified": "Verified", "itzs_me_priya": "Where's mama pandu we wanna see her reaction too❤️ @deepica", "swathn": "@monicamutyalareddy you look radiant!! Congrats!!!!", "amikkamara": "You having all girls 👏🏾👏🏾", "samiam_897": "CONGRATS!!! Also “I’m getting the med books ready” 😂😂😂", "tweepika": "Congratulations!!! ❤️", "minde_z_here": "Congratulations ❤️❤️", "leilah0529": "Congratulations Auntie!!!!!", "dorababu.maddukuri": "Lmao, gender reveal parties are so stupid!!! Like why they make it so big deal I don’t get it!!", "therealhamzy": "Love the dress!", "jaimeschmidt\nVerified": "Verified", "shreya_choudary_meduri": "Awee so cute ❤️", "_maitryee__": "So happy for you", "vidheesha_setty": "🤣🤣 \"I'm getting the med books ready\" face!! So cute! 💕", "deepdeeperndee": "So happy for your family 💙💙💙💙", "sra.glmr": "This is the best news! 💕💕", "raisingmaisha": "Aww congratulations!!! Love the last bit 😂😂😂", "tollywoodfashioncops": "Didn't they literally just get married in April...", "thesmalltowngirl": "Congratulations 💜💜💜", "simplysupritha": "\"Med book ready face\" classic!😁", "leemahadeva": "Congratulations 🙌🙌🙌🙌🙌", "frmtherootsbyks": "Congratulations to you all...wish her a safe delivery and a happy and healthy baby ❤️❤️", "zoherakarim": "Congrats 💙", "ydrv_style": "Such a beautiful moment filled with so much love and happiness! 💙💙 Congratulations on this amazing news!!", "aman_dev_hans": "Aweee..m crying with happiness..", "sincerely_osa": "Your face is priceless in this lol.. Congrats to your wonderful family! Babies are blessings", "howshespendsit": "Baby Pandu!!!!!!", "zinatdhunny": "❤️❤️", "dermpa23": "Congrats!🎉🎉🎉", "rockmom2008": "Congratulations to your family! Babies are a blessing & Auntie duties are the best!💕💕🎉🎉", "perceptionofgrowth_": "Omg congratulations to your sister and your family! May god continue to bless each of you and now little baby! ❤️❤️", "diipakhosla\nVerified": "Verified", "geeta1995": "Congratulations to you all ❤️❤️❤️❤️", "sonambeautie": "Yay!!!", "47kmonica": "Congratulations 😃", "ileoneill": "Congrats to your family!!!!! 💗💗💗💗💗💗💗💗", "prettydarnunique": "Welcome to auntie life!✨", "chawlachaps": "Congrats!", "fablihanz": "❤️❤️❤️❤️❤️", "dianamadison\nVerified": "Verified", "gigithe1": "✨Congratulations!!🍾", "munnysanghera": "“I’m getting the med books ready” 😂😂😂 Congratulations to you and your beautiful family! 💙", "tija.thomas": "That's so super super cute.god bless the new parents to be and the new grand parents and aunt to be.❤️", "skeetazfunllc": "So many things to be thankful for. Your family is so lovely❤ Congratulations to you Aunty and of course to your Sissy and brother. You guys make me smile😍☺", "mahathiduggirala": "DR REDDY ON THE WAYYY", "ariendsouza": "❤️", "glistenpearl_": "Awww 😍❤", "elkinnicole": "Congratulations to your family! Love this. Your sister is beautiful", "peplumnbubblegum": "Congrats so exciting!!!!!", "littlewestst": "Omg so cute! Congrats ✨🎈", "amna_k": "Love, love this! Especially your dads face at the end! Congratulations to you and your family! 💕", "frenchistaa": "Congrats to ur family", "ornella.rayan": "Congratulations!! ❤️❤️❤️", "narath.un": "👍😍❤️", "lisamarie650": "Absolutely thrill for the entire family! Your sis and BIL will be fantastic parents, yes I can tell just by looking at them! Lol 😘 seeing all the support from the rest of family, this kid is one lucky little fellow. Cheers to another chapter in life!", "monikapalle": "This is adorable 😍", "artofhennas": "Congrats! Being a Masi to baby boys is the best 🥰😍🥰", "jasmindaceleste": "Aww congrats to your family! 💙 ✨", "nazica": "Congratulations to your family. Little boys have the most precious relationships with their mama and aunts 🤗", "luxsa.sarvan": "This is so adorable 😍❤️", "therealkamie\nVerified": "Verified", "sannsimmi": "So happy for all of you. You are going to the best masi ever!", "maryamishtiaq": "Congratulations to your whole family!! 💕💕💕", "chaitrascreations": "Omg this decor is so gorgeous! I especially love that pink and blue cake! Congrats to all of you! 💙", "farahrnajem": "So cute congratulations to them", "drmadkan": "This is tooo cute! Love to see such joy!", "jbeautifymakeup": "Yayyy congrats masi-to-be!!! 😊😊💕", "iamgigimuse": "So cute! Love your dad at end of video! Yes 💙🙏 Blessings", "tink8_8_8": "Med books ready face 😂😂😂😂😂", "poojadreams": "This is so sweet and yes your face is priceless ❤️❤️❤️", "malaika8607": "Papa Pandu’s joy is the best part!! Congrats to your growing family!!", "rainbowplantlife\nVerified": "Verified", "shyamillionaire": "Yay! Excited for Sahil to have another playmate!!! 😍", "sudeth": "You have the most beautiful family ever😍", "jasmineandmarigold": "Sooo sweet. Congrats 😍😍", "thefobandi": "love this! congrats to the fam!", "drmarmolani": "Lol!! This made me so so happy!! Congrats!", "momerrific": "Congratulations!!", "theuglyduckling.biz": "❤️❤️❤️", "catrina.rae": "That's adorable. Congrats to your growing family! ❤️", "mrsaraheem": "@deepica your sister looks so beautiful! Congrats! 🥳", "gsheni": "That's crazy", "luciebfink\nVerified": "Verified", "gayatrim9": "what a wonderful moment captured forever ❤️❤️", "tinaestesfamily": "I LOVE this whole journey you've shared so far Deepica!!! Thank you for sharing", "thepluckyduck": "Soooo sooo happy for you and your family! Thanks for sharing such a fun moment with the tint fam!", "steffiandrews88": "Love your dress @deepica", "sapana": "Haha your dad would have had the Med books ready if it was a girl too! Congratulations!", "hina_ifthkar": "@deepica This is the Cutest and Congrats to you all 💙", "ramyarangarajuashwin": "Congratulations!! Want to see mama pandus reaction 😂", "lovekhamilah": "So awesome..congratulations!!! 💙", "imaiolino": "Congratulations!!!! 🙏🏻", "andiconti": "“I’m getting the med books ready” 😭😭😭", "colbynatasha": "So cute!! Congratulations to them 😍💕", "thecurriedcook": "Awww love this!! Your face once again is priceless! ♥️", "lifewithravii": "😱😱😱❤️", "nymisha_medicharla": "“Im getting the med book ready” LMAO 🤣🤣🤣 Congratulations to you and your family ❤️", "__ms.suarez__": "Your face 😂", "vedapeapully": "this is the CUTEST THING EVER", "sabrinamolu": "Aww I love this!!! Congrats Deepica to you and your family!!! Yayayyayay", "princessmayali": "❤️❤️❤️😍😍", "jill_adelphia": "this was a triple comment post I’m sorry 😂", "houseofbargello": "Aww! This is amazing ❤️🌹", "the_ak_way": "This is too cute congratulations to your sister and your whole family! 💕", "oneloveonecr7": "I'm gonna cryyyyyyy! This is precious💕💕💕", "arshiyask_7": "😍😍", "soundaryakonatham": "It's so heart warming to see this! God bless your beautiful family ❤️", "mximena87": "Amazing 🎉💙", "kavithaaviram": "😍❤️❤️❤️❤️❤️", "dhrups1222": "Congrats to your beautiful family!", "nikitaupadhyay\nVerified": "Verified", "fuchz_": "Haha your last line 😉😉", "maheen_kahlon": "Ahhhh I’m soo happy for youuu ♥️♥️♥️", "rychilin": "Lol! like Pops won the championship 🏆 👏🏼"}