{"ayur_ras": "@deepica - Happy New Year!", "ohemdee1228": "Lmao everyone is making \"homemade\" come to my house I'll feed you options", "alwayspinterested": "Fresh n Lean 💃🏻", "zaddyybusta": "💕", "iamharish_naidu": "Calmness❤️😊❤️", "yoga_with_eve": "❤️❤️❤️", "caarrrinnaaa": "So happy and proud of you for this!!! 💚 🌱 good luck on your journey!", "paruly13": "@deepica love your Kaftan! Can you tell the brand?", "jahnavi_harrison": "@cookingwithom", "sumavarsha.k": "@cookingwithom", "runjeeta": "I love this!", "ikandiulife": "PRETTY", "iamsonez": "I’ve been transitioning to vegan and there are actually a lot of great YouTubers with easy recipes if you’re looking to cook. My fav is @pickuplimes! 🌱", "monap1122": "@veestrofood", "mehmoodsaqib119": "Hi", "me.veganeli": "Sage!!! @deepica", "z_rux": "I’m feeling more and more inclined to becoming vegetarian too. I especially find it gross cooking meat lately. And there are so many good meat substitutes nowadays that taste pretty much exactly like meat, if you crave the taste. I think I’ll slowly start to transition too..", "rhiankaila": "🧚🏽‍♀️🧚🏽‍♀️🧚🏽‍♀️🧚🏽‍♀️🧚🏽‍♀️🥳", "layla_naak_nala": "That's amazing I went vegan a couple years ago. Best thing I did. But yes it better to move in slowly for sure. Good luck on your journey. Many blessings", "meera_n": "What meal delivery did you end up choosing ?", "roshnimehta": "@cateredfit", "intelligenth00dlum": "#beautiful pic", "shelinat": "I've heard good things about Sakara!", "shortpunam": "Protein shakes help in the transition too. Garden of Life or Vega are the two brands I've used. Best excuse to have a chocolate \"shake\" daily.", "dramypatel": "Thistle!", "yashi_krishnaa": "❤️", "sxint.lizee": "so beautiful.❤", "princess_priya10": "@hellofresh", "fathma_r": "@hellofresh", "andrea_the_esq": "You are gorgeous!!! 😍🦄", "shashikumar007": "Beautiful 🤩", "xviii_xi": "@ayur_ras", "jdalfeen": "@deepica do methodology!", "aftab.nizamani13": "So beautiful", "veganmom65": "❤️❤️❤️❤️", "devijags": "@sambarkitchen on our website or Amazon!!!", "insha.gram": "You can try Green Chef! It’s a meal kit delivery program like Hello Fresh but strictly vegan. There’s a list of other meal kit programs you can try too. Just search for vegan or plant-based meal kits ✨ good luck!", "raytrilochan258": "😍😍💋💋", "isbella_cox": "You look so cute without makeup😘😘😘😘", "zardozimagazine": "So many yummy vegan restaurants in LA", "jannatasif1": "@raminasif hun ligner på deg", "alavia": "@purplecarrotxo is entirely plant based!", "rawvida": "Thistle is the best", "the.aristochic": "Bingo..taking baby steps to become vegan this yr primarily for all the health reasons being quoted everywhere!", "sona_life21": "You could try @sakaralife I use them and it’s good", "karishhmatic": "🙌 for going vegetarian! I have lived as a vegetarian all my life. My dietitian self read this post just now and I just wanna make sure your diet has all the nutrients you need! If you ever have any questions, feel free to reach out :) (vegetarian is the way to be!)", "asvora": "I'm sure someone has already suggested @sakaralife? Plant based meals that are already prepared + yummy + fresh.", "z.e.e.n.a.l": "Purple carrot! @purplecarrotxo", "claineinthebay": "Omg twinsies! I went veg too this year 😍", "pwr.soul": "I honestly think @radhidevlukia needs to start a company for this service 🤣", "pooja_harah": "Yes girl ❤️❤️❤️❤️ It’s been a week since I’ve become Vegetarian and let me tell you I feel so much better 🙏", "shuvya23": "@pickuplimes and @rainbowplantlife have been super helpful resources!", "aartiruparell": "@plantable", "sburmy": "This is amazing! This is going to be an amazing journey physically, mentally and spiritually! Greenchef and Sakara have great plant based vegetarian and vegan options.", "ihateninja": "💪💪", "rohinibajekal": "@deepica so incredible you are thinking about adopting a more plant-based way of eating. I'm a nutritionist in London but let me know if you ever have any qus and I can help 💛", "ktz912": "Great going girl. Positive vibes on your way 😍", "kayfernandezsmith": "Check-out @healingkitchensf and see if our Afro-Vegan meal prep friends have recommendations for SoCal...also love supporting women of color owned business. @bryantterry might also know of folks in LA.", "sushmithareddyphotography": "🙌", "jayshetty\nVerified": "Verified", "dravidianqween": "Congrats so happy for you!!", "nikitasha9": "👏🏾👏🏾👏🏾", "la.vegane": "That is great move !!!", "shilpa.15": "I love how the whole Indian-origin vegan scene is here supporting you!", "msp__16": "Definitely eat at veggie grill! and hello fresh has vegetarian meals!!", "apple_why": "Also on a similar journey, going plant-based rather than full vegetarian or vegan (main goal is to cut out processed food, simple carbs and as much meat as possible). I’ve tried many delivery services and get bored within 1 month as they tend to repeat. The best solution that was sustainable for me is Whole Foods 2 hour delivery with prime. Their frozen stuff is so high quality, I buy frozen root vegetables, vegetable mixes, Gardein fake meat protein. Trader Joe’s is my go-to if I have time to go to the store. I make it a point to tell people I’m plant based (and NOT vegan). I’ve found many vegans are on the hunt for products to replace regular products (vegan cheese, vegan sour cream)- but I worry about the processed nature of these. Cheers :)", "sarvanim": "This is amazing! Good luck with the journey!! 👏🏽", "srilekharayavarapu": "You've sooo many Indian veg food recipes to try out...", "rooperstar": "@deepica Try @thistleco I’ve tried them and they deliver locally in LA. Food was delicious.", "thechutneylife": "@purplecarrotxo is SO GOOD ! You make the meal yourself, but everything is incredibly fresh and the flavors are always on point ! You won’t get bored or feel like you’re missing out on delicious food. Everything is plant based !", "nithiya_0113": "Yasssss🔥🔥🔥🔥", "raynashah": "Yessss!!! @sunbasket @purplecarrotxo @hellofresh @hungryroot to make just a few!!!", "veenacara": "Hi I can cook 👩‍🍳 for you unfortunately I’m located in Florida.", "princess_divs": "@greenchef it’s so damn good", "rachel_roy\nVerified": "Verified", "the_mirror_image_sa": "🤗🤗🤗 Welcome to the vegetarian club 💗", "jordansandrini": "@gomethodology so amazing!", "vegan_kaur": "Thank you Deepica. Welcome to the guilt free side. You will never look back.", "linds_say": "Sakara", "ielenarod75": "@doomies_home_cookin_official", "divya73342": "I appreciate.. It akka.. 😘 being a vegan is the best thing u can do for urself...", "sayranb": "GLOW GIRL", "poojanakoidooja": "@splendid.spoon!", "cutechic85": "@deepica I’ve been vegetarian my whole life but I live for pizza and pasta if I can give that up I may be able to lose an inch or two off of my waist but it it’s happening anytime soon good luck on your new adventure", "tnvee_kale": "Try @cookingwithom", "dionna55": "I like Daily Harvest. They have a lot of vegan variety but I love the smoothies and the harvest bowls! Yum! 🍲", "ariendsouza": "❤️", "drartithangudu": "Lady! I’m a plant-based MD in San Antonio. I will keep my eyes peeled for a vegetarian meal prep service in LA - I’ve heard Sakara is good for some. Please let me know if you need any advice or tips on plant-based diet or you can check out patient resources on my website www.sacomplete.com", "thehautevegan": "@sakaralife", "ankitha.reddi": "Bravo !! ❤️", "drvisha": "Made the switch 5 years ago, never looked back. It’s not just the right thing to do for the universe, but also for your body. 👏🏽", "_sam.kumar_": "Omg I am so so happy for you. It's been 7 months of vegetarianism for me 🙌 soon to turn vegan. Let me tell you it is not easy when you start but with the right people and a strong mindset (why you are doing it) everything will fall into place eventually. Once you pass 1 month you will never want to eat meat again as it becomes more of a lifestyle/habit. All the best @deepica I am sure you will do it 👍 much love ❤️", "oh.so.resh": "That’s amazing!!! So excited for you!! 🙌💕", "jsavla": "Purple Carrot has great recipes and reliable service", "mariansoleyn07": "You can do this!...fellow Vegetarian here is rooting for you. 👏🏼👏🏼👏🏼", "mariahsutt": "I’m not veg, but my half-Indian boyfriend is and we’ve been using Blue Apron and Hello Fresh boxes for a couple years. I like Blue Apron best, more complicated recipes but much more delicious!!! If you do make time to go to the store — @halfbakedharvest has some fantastic veg recipes!", "_mewsagi_": "No food service, but reddit is full of subreddits for yummy recipes!", "luckydacorgi": "Wow you look skinny good job😘😘😘", "metaphysical_goddess": "Hello Fresh!!", "emilayamei": "@gomethodology - you will not find better tasting or more unique food in a delivery service!!", "sarreu": "Also Amazon meal kits.", "rollaway.thedew": "I’m also on the same journey! 💕 Best of luck to you", "elenajatia": "If it wasn’t for Indian cuisine (and meeting my Indian and vegetarian husband), making the transition to vegetarianism would have been difficult 15 years ago. But I fell in love with food and cooking because of vegetarianism! I would suggest getting a lot of these pantry basics to start off with: https://theglobalpantry.com/products/indian-pantry-label-package. Hope this helps!! ❤️ You can also search on forums like Nextdoor looking for a cook/chef to cook veg meals too. That’s how I got into catering 😉", "itscjfranco\nVerified": "Verified", "preetilit": "Green chef is great!", "sabs76543": "Online farmer’s market: @grubmarket Food delivery services: @realhomechef @oatbox @greenchef @purplecarrotxo @getfreshly @dailyharvest @sunbasket @hellofresh", "vkitty1": "@bryciemarie @val_iqbal @tracycatolico", "srinisblog": "This is amazing!!", "mishahathi": "Maybe try creating cuisine menus of what you’d like to eat and are craving and try door dash and Grubhub. There’s tons of veggie options in LA. Pick and restaurant and see if deliverable and you’re all set 😊 good luck", "sashabaker": "This makes my heart happy. Blessings to you on an absolutely wonderful journey to veganism 💛🙏🏽 #GotNoBeefCosiDontEatNoBeef #Mooooveoverdrama 😚", "v.ugarte": "@hellofresh ******************", "swoods7": "Thistle. I have found them super reliable and delicious.", "touristsinresidence": "@onepotatobox from @weelicious has vegetarian options! And Catherine McCord is so conscious of taste and balance.", "mayarc": "@deepica sunbasket and thistle are veggie friendly", "soniapateljain": "I’m doing the same! It’s been pretty easy so far with lentils, proteins, and products similar to Beyond meat. Feel like it may get harder as time goes on. Good luck!!", "bhavi1401": "@hungryroot", "kphoul": "When you have time, some great accounts for recipes are @pinchofyum @ambitiouskitchen @eatingbirdfood @minimalistbaker", "anitapatelmd": "I like @thistleco for plant based meals and @sakaralife for the bars 💚", "reetalad": "💜💜💜💜", "shainoffools": "Baaaaaabe.", "ohheyitsmattiek": "@hungryroot made it much simpler to cut back/take out meat", "jennyraja": "Check out @cookingwithjaromy", "ktata13": "@purplecarrotxo @veestrofood @sakaralife alllllll amazing", "thegabrielleturner": "I love it!!!!", "charmi__k": "Hey girl, check Veestro out 💕", "shefshef19": "Would love if you shared ur going vegetarian/vegan journey with us!!!", "iamsahararose\nVerified": "Verified", "beautybynikichawla": "This is so awesome omg!!! So proud of you!! I went vegetarian for 9 months, and it was one of the best decisions I made!!! Hoping to become vegetarian full time soon 💕", "jessicaknack": "@factormeals food is BOMB.COM and is always consistent", "swatis07": "I’ve heard great things about @thistleco It’s the way to go!", "bri_cabs": "Gracias Madre is the best LA vegan restaurant!!!! This message is approved by a Mexican 💕🤪💕🤪 sorry no recs for a delivery service...", "natasha_hussein": "Proud of you! Try thistle or foodflo", "wholisticpharmacist": "Sunbasket and Plated are great and tasty!!!", "purvidave007": "I'm a vegetarian but def looking into more vegan options after watching @radhidevlukia and sadia @pickuplimes recipes which look so divine and appear easy to make so I'm definitely going to give it a try. Best of luck to you", "theveganmaven": "Good for you beautiful!💕🌱💚(unfortunately I don’t live in LA)", "trishahuddar": "Sweetgreen!", "amplitude_fitness": "I cut out meat, dairy and eggs from my diet but I still eat fish every now and then. I replaced burger pattties and stuff with plant based ones and I even switched my pasta from regular to green pasta. I don't eat a lot as I use to and I dont miss the meat tbh.", "glowngreen": "Best luck! I’m vegan and gluten free for past few months... it’s totally worth it", "iconaccidental\nVerified": "Verified", "katiesturino\nVerified": "Verified", "meredith.bedi": "@sakaralife 🌸💕", "kinderlivingbyarati": "Love reading post like this. 👏🏽 I don’t love food delivery but it’s a good way to start. Try this link: https://www.top10.com/meal-delivery. I share a bunch of options and ideas on page (more in my stories and highlights). Wishing you much success w this very kind life change.", "poojakobawala": "@thesonaloption", "ronniekalra\nVerified": "Verified", "thelaoandbengali": "Green Chef has vegetarian/vegan options.", "lil_brwn_grl43000": "No more mama pandus chicken curry 😔", "boo_radley_oo": "@sprinly", "sushmaraghu": "Once you stop mentally to eat meat it’s not hard for you to find alternatives. Don’t ever be hungry:) always have a bar in your purse just in case! Good luck", "jeegisha_panchal": "Purple Carrot and Green Chef! Excellent choices! Food is tasty and healthy!", "reshma619": "Purple carrot", "allisonrtravis": "I know you said not necessarily vegan but Purple Carrot has been so great for us!", "gopiskirts": "So great!! I think once your moms on board with the veggie cooking you’ll be fine 🤣 she’s always cooking up a storm", "jocelyn_biga": "Your so beautiful 🙏🏽", "johanna426": "My husband and I are trying to do this so good luck with your journey! He has an easier time but I’m so picky and I don’t like cooked vegetables, but I think I will make it work.", "divadevu": "@deepica not a delivery service, but definitely look into @koracommunity", "daniellembalsara": "Check out @nishabalsara and @theveganview for tips and friendly advice on veganism! Purplecarrot.com is a great food delivery service with simple recipe with ingredients pre measured and ready to put together and you get to keep the recipe! Good luck and enjoy the great vegan food in LA, it’s just amazing , and Houston for dosas 😉!", "eromanoski28": "#truth❤️", "priyashikasethi": "Yay ❤️", "miss_savu": "My husband and I had Plant Power fast food when we visited Long Beach, I believe it’s a chain. We friggin’ loved it!", "kulture_khazana": "Good luck! I was raised a vegetarian and fortunately Indian cuisine has several options. Definitely turned a carb eater in the US though. Need to get back into more protein based diet. Wish you the best and please keep sharing your journey", "notaleaf": "Purple Carrot I’ve heard is great. The nutritional aspects of it are why I don’t use it, but I’ve heard positive things from folks who use it. If you want or need vegetarian/vegan recipes I have many I can recommend! ☺️☺️", "drsinheels": "I am vegetarian not vegan .. wish you the best in your journey .. i think the biggest thing would be to make sure your flavor needs are being met in your new food .. so if you generally eat a lot of spice /heat then to have similar style .. Don’t know any meal service but will suggest thugz kitchen book .. also check out Gujarati recipes (log of veggie options ).. !!", "roshniko": "Thistle is great and they delivery to LA. I’ve been using them for a year and I love it", "reemaleila": "Not sure if it’s out there, but maybe Purple Carrot? It’s plant based", "aanchalroy": "I’m actually thinking about doing this too!! Good luck!", "mizroseyb": "Hey @deepica Gurl! I love your kaftan and you are seriously beautiful hunni! 🙏🏾", "mlandm": "👏🏽👏🏽👏🏽", "divyaramireddygari": "Messaged you!", "nehabeauty": "I can’t tell if my comment actually posted lol.but! I went veggie in 2017 and now am whole food plant based most of the time, have never felt better! (I don’t call myself vegan since I have leather bags and stuff).", "totesnbeyond": "Yay! You go girl! Great initiative for the next decade . Try to incorporate Millets in your diet while going vegetarian.", "mummyinthebay": "Omg yess!! You won’t regret it! ❤️", "rishivinny": "I think hello fresh has a way to customize your boxes that you only get vegetarian or vegan", "christendominique\nVerified": "Verified", "serafemabeauty": "You look stunning 😍😍😍", "courtteresa": "@sakaralife", "hairluvbytiffany": "😍", "anamhakim": "So!!@deepica you won't eat non-veg at any of your family functions also??", "jabberfoodwocky": "I’m a vegetarian, though I don’t live in LA I haven’t found any delivery services that cater to my needs. I have heard Blue Apron and Hello Fresh do have options. I would suggest Target or Walmart pickup where you can plan ahead, get your groceries delivered to your car. It’s cheaper too!", "tajhg10": "I don’t have any recommendations but I do have some encouragement: going vegan saved my skin. Dairy and gluten triggered the most horrific cystic acne on my face. Beside the skin benefits (which of course will be a huge business advantage for you!) veganism is one of the best ways you can lower your carbon footprint. And given all the natural destruction we’re seeing these days, I hope more people will be inspired to try it after seeing your post 🌱😘", "lekhavnv": "I don’t find delivery services filling or economic. Also, they don’t have the type of cooking that works best for my body. Rather, learn how to cook some easy, ~15 min dishes. @sortedfood and @thebodycoach have some great videos and cookbooks. Also, in traditional Asian sense, buy/get from home podis (Telugu for powders for cooking) and masala mixes that can be easily added to veg. Build a good pantry of items, and easy cooking will follow.", "jhanvimotla": "Oh I totally misunderstood and gave you restaurants. So far the vegetarian menu of hello fresh has been the best. It does involve you putting in around 30 mins of cook time but could be cool for the weekends or evenings that you have off? As far as daily deliveries go I know methodology is also good? They give you juice, parfait, chia puddings and two minute lunches. Might be worth a shot x", "jaypea3": "I love Hello Fresh and Purple Carrot is pretty good too! I used Hello Fresh all throughout med school, and it's been a life saver!", "spunia": "I really love the flexibility of the service and the diversity of food @gomethodology", "sundusudnus": "Imperfect Foods! Lots of fresh produce and vegetarian grocery options", "pmoney139": "i don’t have any recommendations, but one of my 2020 goals is to be vegetarian as well! similar reasons as you noted. good luck! 💜", "poornagraphy_\nVerified": "Verified", "docsarina": "This is awesome !!!! Congrats !! As a #plantbaseddoctor I congratulate you on this journey. Best thing you can do for your #guthealth !!", "mitritz": "@gomethodology is great!!", "trishaaocampo": "🙏🏽🌱🌱🌱🌱", "gggraciee": "Looking so much like mama Pandu!!! So much beauty❤️", "lux96": "I think in LA all the eat is avacado toast and celery juice tough. 🤷 (I'm kidding, please don't attack!)", "noorvimrajj": "Yayýy!! Deepica you heard me somehow. I KNOW you have work to doin the world!♥️", "tayleib": "I’ve used Green Chef before and currently use Martha & Marley Spoon. @marleyspoon", "nessahopee": "@sweetpotatosoul recipes & @edgyveg recipes are sooo good", "eco_akila": "@deepica kudos to you! Good luck😊", "krishnauthakker": "Sakara Life is hands down the best! A little pricey but worth it.", "sai4357": "https://mylaporeexpress.com/ I have heard great reviews about them and I believe they deliver anywhere in USA on request", "uma_naynay": "@deepica I really recommend @meerasodha ‘s cook books for simple, tasty, quick veg and vegan meals for when you have time to cook! Fresh India is my fave, I’ve lost count of the amount people I’ve gifted it to xxx", "sighsofly": "@rainbowplantlife", "nicoletjahns": "Not vegetarian, but plant based - heard great things about @sakaralife ❤️", "amyks07": "Purple carrot is a great option!!!", "joycevanseters": "🙌🏾💫👏🏽", "impactlensphoto": "Amazing!! I hope people following you will take baby steps toward being cruelty free! (Now I like you even more) 😁🙏🏾", "lilrere26": "I'd check out @thugkitchen they're great with vegan options and makes the recipes fun too!", "i.am.nams": "Greenchef and purple carrot- both have vegan and are pretty good", "deevers12": "@thistleco ! Vegan and organic. Super flexible delivery schedule too", "jainmet": "Kudos! Recommend Blue Apron and also if you get instapot it’s an easy way to make variety of vegetarian stuff. Good luck! I have been a vegetarian all my life :)", "daljit_": "@sakaralife @thistleco @gomethodology", "doseofshivs": "Good luck with your journey!! 🙌🏽", "meriabazyan": "I heard @zenfoods is really good. Check them out", "ksinghalong": "@aayisha97 There are many vegan natural supplements to obtain the nutrients you might miss by simply eating a vegan diet (ex. B12 vitamins). The human body is much healthier on a vegan diet!", "lanapatelxoxo": "Deeps you look amazing! Congrats! I'm so happy for you! Veggie grill is good for fast food but honestly LA has so many vegan places and options. I used to do meal prep for someone who could make vegetarian and vegan options that might be an option. But once you get the hang of things you'll be great! I love morning star for plant based alternative options and Indian food is so easy to have vegetarian. Deeps you're going to feel and look amazing! Best thing to do for yourself! Stay on top of your vitamins. Vitamin D and B are big ones but you'll do great!", "suvasinilakshmanan": "@thistleco Tried It at my friends...looks good! I subscribed as well. 🙌🏽 same goals..starting 2020 right!", "jguiggs": "Hello Fresh has very good vegetarian options.", "molliechen": "@sakaralife of course! cc: @freyums ❤️", "roy_disha": "❤️❤️❤️❤️❤️❤️❤️", "aarticouture": "Territory and Thistle are great, reliable food delivery services for vegetarians :)", "s_rassuli": "Ur so gorgeous deepika, love what your doing & lurvvve mamma panda ❤️#livetinted", "callangreen": "You're going to love it! Going Vegan was actually a lot easier than I thought it would be and most meal delivery programs these days have vegan options. From our research, the main thing we found is the importance of ensuring you're getting your whole foods (eg leafy greens, veggies, fruit, seeds, nuts etc.) Because this is where all the nutrient live. So whatever meal delivery you choose, look out for ones that favor that sort of menu :)", "deema_mauladad": "No but please share if you find a good one!!! 😍", "swetha_vv": "I’ve heard a lot about @hellofresh maybe you should try it ? @deepica", "nishabalsara": "That is so awesome!! @purplecarrotxo has some awesome meals if you want to cook yourself!", "mira_chotalia": "Hungry root & splendid spoon & daily harvest are all great for veg!", "plantedpriyanka": "Yasss gooo deepica!! Going vegan has truly been one of the best decisions I’ve ever made. Purple Carrot, Green Chef, Sun Basket are all great options! Good luck on your journey 💕 you got this!", "artby15il": "I have used home chef for a year now and the vegetarian options are amazing!!", "radhidevlukia": "You tha best! So excited for u ❤️❤️❤️", "nladharbeats": "I believe WholeFoods has a program delivered by Prime", "astridpineda": "@purplecarrotxo is what my doctor recommended me when I decided to go plant based! I have not tried it because your girl is broke, but their recipes look yummy!!", "priyaanita": "@unveil_nutrition", "divya.shakti.27": "Hi Deepica as a lifelong vegetarian I can tell you I use the website called happy cow and it's an absolute life saver ! It shows the vegetarian options you can get in literally any part of the world.", "brendabhansali": "We do hello fresh and we love it! You can pick from 4 options and we do a Monday delivery so we are set for the week! Super easy and healthy.", "reshmako": "Try Thistle! It’s vegan and delivers reliably at your doorstep. LA and neighboring cities. My sister had it delivered to our office in dtla and now I’m having it delivered to my home in the outskirts. The food is fresh and creative.", "shrugarwal": "Eyebrows! EYEBROWS.", "whereismyseamripper": "No chicken vepudu???? Or mutton biryani?? More power to you, girl!", "lark_adventurewear": "@purplecarrotxo if you are looking for vegan - they actually are super filling and nutrient dense. You could supplement with your own non-vegan food.", "sdpatel86": "Sunbasket has great veg options! The plus is it’s all organic. We tried blue apron but it wasn’t organic and we were not getting veggie proteins such as tofu or tempeh- I felt like we were mainly eating pasta and cheese so we switched to Sun Basket - it’s a bit more money but it’s much healthier and better :)", "neha_chheda": "Cool. Morally how do you feel about the violence that is happening in India re CAA and NRC?", "alhaiyaah": "You 🌹 are 🌹 gorgeous 😍", "kia.vibes": "Same as you! Became a vegetarian because I don’t crave meat and for moral reasons. Oh and you look soooo pretty ❤️😍", "sacha.strebe": "@sakaralife is great and @the_rasa_life too", "pujapatelshah": "Purple carrot is an amazing delicious plant based meal delivery company. They are reliable and the meals are soo good, simple and easy to make!", "vrndanovowels": "Purple carrot!", "niveda108": "Yayyyyyy baby steps 🌱🐔❤️ so happy for you!! You'll feel amazing! Try @purplecarrotxo for delivery service!", "hennazaidi": "@gomethodology is the best food delivery service with lots of plant based options. Their food is healthy and taste great - and they give you lots of flexibility in terms of how much you want and what you to order. Check them out!", "iamhemlee": "I feel exactly the same. 🙏🏽🙌🏽", "rummylevels": "Sun basket. @sunbasket. Organic. Fresh. Farm to table.", "nitap25": "🙌🏽🙌🏽 Green chef is great!", "kaaysingh": "Yessss lets go! I’m here for it! 👏🏽✨", "hennabynatasha": "When you’re vegan or looking for yummy restaurants in LA try @krimseys @veggiehouseca or @thekindsage 💕 fast food @plantpowerfastfood :)", "kirbiejohnson\nVerified": "Verified", "librasign1211": "So natural i like this shade", "gabrielaaahhh": "@deepica SEXY LUNCH CLUB!!! @sexylunchclub their food is amazing and the owners are wonderful people.", "thenewyorkmom": "Omg I soooo love this natural look! These Indian queeeen genes!", "susanaearellano": "Ok not delivery but Trader Joe’s has the best ready to go vegetarian meals/salads/just heat and eat options that are super easy, affordable and portioned great. (Very little cooking required lol)", "diipakhosla\nVerified": "Verified", "aayisha97": "Going vegan isn’t that simple...cutting out animal byproducts cuts out a nutrient profile that can cause you to eventually become sick.", "swaytrash": "love youuu deepica ❤️", "masserata": "I know a great place in Texas that makes homemade dosas 😉", "helen_deo": "You go girl.... .... I wean myself off meat and it is the best decision ever👍🙌🙏", "mykitsch\nVerified": "Verified", "smv1101": "Blue apron etc usually have vegetarian options! Hungryroot is vegan I believe", "pritanna": "I’ve tried Hello Fresh and enjoyed it!", "anushree.528": "Love it 🙌🏼", "missmimidebona": "Omg! Same here.😍 I wish you all the best. Hope you have an amazing journey in trying yourself out. Pls share your inside along the way ♥️", "inayat.jain43": "We used blue apron for a few years, would highly recommend!!!", "rosy_._mona": "Lifelong vegetarian but not a vegan. Most grocery delivery services have a vegetarian or vegan option. You have to shop around a little to find one that fits your taste. I tried blue Apron for a while and was unimpressed. I loved plated but they went out of business. I'm on Marley Spoon now and it's pretty good but they use quite a bit of pasta. In your own grocery shopping, invest in lentil flour pastas. Trader Joe's has an excellent lentil spaghetti. Talk to a nutritionist because they are largely under utilized resource for recipes and strategies like journaling. Remember in this journey, your satisfaction and fulfillment are a priority. If you don't feel satisfied or fulfilled, you need to pay attention to this and question it. This is when a journal can aid your journey. Good luck.", "pineapplefull": "Awsome", "jchadha": "Freshly", "sanbhups": "Vegan delivery services- Veestro or Thistle ❤️. Used both and can pick and choose options.", "chameetman8": "💘💘💘💘💘💘💘💘💘💘💘💘", "bigbanglestheory": "Hi Deepica, Check your blood type and foods that go with it before deciding one way or the other. Blue apron is good", "evieramirez": "Not sure if @sakaralife have an LA presence as they’re NYC based, but worth checking out for inspo nonetheless!", "nsa107": "Purple carrot is one service ships nationally I think", "gomezcynthiaa": "Congratulations ✨💕🤩😘", "tlapsia26": "Purple carrot!", "emilyacobb_": "Being a vegetarian is actually shown to be more sustainable, and better for the environment than being vegan. There are so many non-meat friendly options around the world, and in stores. Best of luck on your journey! 💞", "yriyat": "I went veggie for 2020 too... 😕", "talzthessal": "Stunning 😍😍😍", "decade47": "Make up is def fun! But you look so pretty without it (too)!", "_jenasophia": "You are amazing!!!!", "sindhukunchala": "Sweet tomatoes", "ncginnyc": "Good for you! Try HungryRoot, DailyHarvest, SplendidSpoon", "akelkar11": "Love it!", "directlieber115": "@hellofresh Thank me later 😂❤️❤️❤️", "myvegetarianroots": "How about I come cook for you?!?! 🥰🥰🥰", "longtimecoming81": "Mcafe", "pramitac.rns_": "Without a doubt @radhidevlukia cuz you both are bffs and we love you both ❤️❤️❤️❤️❤️❤️", "iamsrijita": "🔥", "rainbowplantlife\nVerified": "Verified", "margerita.afom": "Yay! You won't regret it! 🙌🙌", "mary_bus": "@cookingwithom", "edwinasasha": "Beautiful picture!! 👌🏽❤️", "nikita_vankudre": "🔥🔥🔥🔥🔥🔥🔥", "iamdavinaofficial": "You look beautiful ❤️", "anjuak": "@sakaralife @urbanremedy I’ve used both of these, and they are both good", "divsk7": "@cookingwithom ! Never had it but food looks amazing 😍 this is my goal too! Also for South Indian, woodlands in the valley is vegan", "reddy4rhea": "But what about your moms chicken curry?? @siriously_siri"}