{"charmingchanda": "I’m a graphic designer and copywriter that has done work for a variety of clients including fashion, commercial, and beauty. @charmingchanda", "nocturnalpaper": "@nocturnalpaper", "deepthiachutuni": "@anusreesattaluri", "avonardsley": "#lovethat thanks 🙏", "santhoshinikannan": "@santhoshinikannan I’m passionate about brown girl friendly makeup - It would be a dream come true to collaborate with tin fam. I can create makeup content & posts !", "apoorva.k": "Graphic designer, illustrator and UI/UX designer!! I'm a self taught artist but I do freelance work and worked on multiple projects through my University. It would be an honor to do some work for @livetinted @deepica 💓💘", "rasikat_": "@byrasika_ really late to this but hoping it’s not too late🤞🏽", "honestlykhace": "@writingbygrace LA based writer/blogger who does graphic design work and marketing in the travel industry!", "rikhiroy": "@katybellotte", "notanakt": "@illustratedculture", "nisaxyz": "@anjalichandrashekar for her amazing art (that I recently discovered)", "sara_sherwani8": "@sarakartistry", "iswarya_prabakar": "@iswarya_prabakar @perfectportraits4u CHECK THIS OUT!!!", "artbykimberley": "I'm an artist! I paint everything from abstract to portraits. If you want abstract design on your packaging I can create something for you😊", "makeupbypiru": "Based in Australia and would love to @makeupbypiru 🧡", "thedoodlelover": "@deepica.. this is vinaya, a freelance designer actually, love handmade art, that adds a lot of emotion to what you do I feel. Would love to try my hand at packaging , banners and business card with art. #livetinted", "filmybelly": "Check me out @filmybelly. I can help you with product marketing using illustrations. We could work together to promote your work ❤️", "createdbysherin": "@digitally_aesthetic", "hi_style_withanna": "@hi_style_withanna", "jerwinkoseph": "@digitally_aesthetic", "tasteofgulistan": "🙌🏼", "rachana_reddoni": "I’m an illustrator and into character creation,though my page is not open but I can send my portfolio if you are interested in seeing my work! 😊", "eatwithchrissy": "Myself! I do free lance web design, logo design, I’m a vegan chef— id love to collab on a vegan recipe or something! ❤️🌱", "nitha08": "I‘ve seen the journey @mjey_muah went through to become the woman she is today - a confident, independent, and passionate female who thrives to make other women understand the importance of self love and ensuring that every person she comes across feels comfortable in their own skin and stays true to themselves. Her passion for makeup started young and now it’s her way of expressing herself!", "iamsonez": "Hi! I’m a musician writing & producing songs for myself and others (artists, brands, etc). Lmk if you need music :) @deepica @livetinted", "tamannathelabel": "Always always always happy to dress your fab self!! @deepica 💁🏽‍♀️💁🏽‍♀️💁🏽‍♀️💁🏽‍♀️💁🏽‍♀️", "mehekmehndi_by_dee": "I love a good challenge and I know working with you and your team would bring some new creativity in my work and challenge me daily. So I would like to tag myself 😁@mehekmehndi_by_dee 🤗", "hennabykajal": "@hennabykajal Ooh I would love to work with you. Doing henna designs on makeup bags or packaging. Also doing henna designs for a photoshoot. I would love to use henna differently ❤️❤️", "aishh629": "@artsyaishh", "the.doodle.dome": "I draw pretty girls with bright colors + glitter! 💕 Check out my work pls 🙏🏽✨", "mayasdesiboutique": "❤️❤️❤️", "pshah118": "@kalakar !!", "jewelshinds": "👏🏽👏🏽👏🏽", "myfeatherscarlet": "@myfeatherscarlet", "kabir.kandola": "@madebyharu_", "art_inesse": "@art_inesse 🍃🌿", "kandolaharleen": "@madebyharu_ for makeup and beauty!", "ahalya_m": "@glittergalxx for awesome words and works of art! 💖", "rashidaudaipur": "@rashidaudaipur", "pandavilli": "Hi Deepica! So proud of your game and success. Even relatives in India have heard of you!! Can't believe we went to college together. I can do voiceovers, cinematography, and can act decent enough. Also abstract art and writing really long winded comments. Thanks!", "loopingletters": "Lettering and calligraphy artist here! Started @loopingletters a year ago. Have done few interesting projects like Invites for prestigious brand events, customized personalised notes and frame art and creating signature nameplates. Trying to revive this dying art of hand writing and personalization in this digital age, with a quirky and fresh take.🙂🙏🏼", "throughherveganlenses": "@deepica @keyavadgama !! She’s a typeface designer who can make custom fonts🧡seriously check out her page😍", "ishaapatell24": "@pleasant_penmanship", "sham_herao": "@pleasant_penmanship", "pleasant_penmanship": "@pleasant_penmanship Haha! I’m tagging myself because why not?? I’m a junior in high school and I sell greeting cards along with some other things on my online website. All the money I make goes towards UNICEF’s efforts to ensure children globally have access to safe drinking water and sanitation!", "amritha_thaliyil": "@ninu_chinnuz", "living.with.lexi": "@dayswithrose @karendmorales.mov 💜", "knee_ya13": "@kalakar !!", "cinnamonsandhu": "I really think you should consider @itsgurnaz she’s multitalented and she will always has creative ideas. She’s great at makeup but she can also sing, dance, act, you name it!", "ruchikakarnani": "@birdidraws all the way! 🙌🏼", "sofiikassam": "@birdidraws is very talented! She’s done design work my company and a lot of other companies that I know! 🙌🏼", "13guri": "@rohan.das_", "tinahoq": "@jahanara.hoque", "dumbodoodledesigns": "Hey @deepica. I'm an illustrator and caricature artist based out of michigan. When some of my Texan friends from college told me to start using huestick, I was more than thrilled to use it and learn more about @livetinted community. I would be delighted to be part of this community and contribute my part for its growth!", "momina_ad": "@mominarts", "adjustwithpuneet": "@birdidraws 🙌👏", "vlasta": "@vlasta", "theoriginalglamguru": "@thonnsharad twocats01@comcast.net", "kellymanikoth": "@birdidraws has a beautiful and unique portfolio with a wonderful personality to match - she would be an amazing choice for freelance pieces 🌼❤️🖌", "hellorebeccagill": "No brainer: @birdidraws", "rohinilovespizza": "@artbyvina @love__vina is an amazing graphic illustrated and digital maker of all things wonderful! Her page is full of passion projects and she even did a @livetinted piece! She turned my boring engineering resume into a graphic masterpiece that I still get comments on to this day! Added plus: she is a sweet sweet human 💜 Check out her page!", "rheally.jpg": "@abcdgen", "magnoliacrafts": "@birdidraws is your gal!!!!!!! 🙌🏼🙌🏼🙌🏼💜💜💜", "becapozzi": "@paperfashion 🎨", "hiral.patel.10": "@bybadal @adara_paper", "healthywith_hana": "Love this initiative!🔥", "gobiga_rajiv": "@mjey_muah Before I start talking about how great of a makeup artist she is, I would like to take a second to talk about what kind of person Malathy is. She has been my role model and my inspiration. She has a strong work-ethic and never gives up on anything she puts her mind to! Knowing her and having her be apart of my life is truly a blessing. I can definitely say that knowing her will change your life. She has always supported women empowerment and has inspired me to be my own person. She is someone who does not judge others and listens to everyone. Malathy is a very talented makeup artist/influencer who has an eye for enhancing a person’s natural beauty. @livetinted and @mjey_muah would be an awesome collaboration, because it would all be about beauty and culture!", "leahvail": "Love working with @studionoodles and her illustrations are gorgeous!", "hellomynameiscandyce": "I’m a freelancer!!! I’m a motion designer and animator 🙋🏽‍♀️😊", "lady_bhuvaneshwari": "Pleasant Greetings @deepica thank you for this lovely opportunity, I'm @lady_bhuvaneshwari a creative professional; I'm a fashion designer and a stylist, I'd be a great addition to your team. I'm also tagging my art account @artist.lady_bhuvaneshwari best regards ☺", "nayaknanditha": "@radhika_h_k check this", "dayswithrose": "@living.with.lexi", "vithu.i": "@mjey_muah is a very artistic and creative makeup artist/influencer who has a way with enhancing a person’s natural beauty so they are comfortable in their own skin. She is great with working on women of colour and because @livetinted is such a diverse and universal brand that caters to all skin types, that would be an amazing collab!", "thespicerum": "@deepica I am Satya and based in Berlin from Hyd! I am a freelancer and support customer experience and Digital content creation. I would also love to help you with marketing in Hyd/India if that’s a part of your upcoming plan!", "birdidraws": "I’m a Canadian illustrator and designer based in Toronto! I run my freelance business @birdidraws and work as a design strategist for one of the big banks in Canada. I create commissions, murals, teach a variety of creative workshops and I’ve also designed for @greenranger14 during the NBA playoffs last year! Would love the opportunity to work with you 🥰", "keyavadgama": "Also tagging myself, I do typeface design and typographic work 😊", "shuttersaund": "@birdidraws! she is amazing at illustrations and design!", "skinoasisstudio": "@birdidraws", "inkscrpt": "@birdidraws !!!", "tinazguez_": "@tinazguez_ me me me", "emanza_art": "@emanza_art 😊😊 always up for something new and edgy! ❤️❤️❤️", "payalparekh9": "Me, myself... Totally interested 💜💜💜", "hooeydooey": "Also tagging my homegirls: @houseofsona.co - BOMB Indian Fashion Designer 👗  @amritha.shakti - Fantastic vocalist 🎤  @thelifeofasocialbutterfly - Creative AF Content Creator 💻  @ragavi.ragavan of @bindibosses - dope dancer 🧡💃🏻 bringing so much representation to Desi & coloured representation", "rachpoova": "@katybellotte", "_imonmylevel": "@mjey_muah 💯🔥An upcoming beautiful makeup artist who is very talented, skillful and has a lot more potential to go further in this field. Very dedicated and has always showed positive attitude. Don’t miss out!!!! @mjey_muah", "_clieu": "I’m a graphic designer who’s traded in climbing the corporate ladder for climbing mountains around the world. 🙌 I help lifestyle & social impact businesses realize their vision & connect to the people most important to them through branding, web design, and social content creation through a holistic brand-360 approach.", "lorii.lin": "@syeda.c", "uhliuh": "I may be a crazy bird mama atm but I nominate myself for photography! I’ve worked with so many different beautiful creators and would love to work with more to create magic! My website in my bio has everything you need! 📸🙋🏽‍♀️🦜", "treshiquebeauty": "@treshiquebeauty 💕", "vianka_n": "@kishkanaidoo. She produces stunning visual graphics.", "thescriptwithin": "Hi Deepica! So amazing to see creatives collaborating and hope to play a part. Tagging myself and my favorite ig artists! @thescriptwithin @shesartsy @theinkbucket @truptikarjinni", "kumarrenuk": "Maybe Rinkal Soni shes a you tuber in India. 👍", "lamiathegreat": "@syeda.c @fablihanbar @manjitthapp !!", "llexarose": "@llexarose writing, editing, content! 🙏🏻💓", "gurleen.v": "Hi @deepica tagging myself 🙋‍♀️ I’m a freelance artist/painter and textile screen printer. Would love to get involved if possible! ❤️", "mjey_muah": "@mjey_muah I am a strong supporter of woman empowering woman and being a brown girl myself, I will be super excited to be apart of your company in helping other woman be more confident and comfortable in their skin. I am a makeup hardest and a beauty blogger ☺️", "aallmylifebynasra": "@calligra.fever is amazing artist , you must check out her page- I tag her for creative calligraphy designs!", "scartidy": "Meeeeeee 😘😘😘 messaging you hehe", "pixelpedia_pri": "@loopingletters @ritzmaz", "jaggaswag": "@sunsetsahil is a stellar young, POC who makes personalized and artsy videos! ✨", "mishtipantham": "Hi @deepica @livetinted I’m a designer and creative director with a background in fashion (yeah, all over the place). Originally from India, and I really enjoy working with cultural themes and interpreting them in a unusual, global style. I work with photography, styling, graphic design and also user experience for digital products. @mishtipantham", "tajjmirage": "Would love to work with you! @tajjmirage", "pmohan2": "@makeupbypallak talented and passionate! Watching your video about how to start your own project/business helped motivate her to “just start” as you said! @deepica", "manakoths": "I love that you’re trying to offer more people the opportunity to not only contribute more to this community, but also offer opportunities during such uncertain times! ❤️ I’m a freelance lettering artist and calligrapher, if you ever need something lettering related! You can find my work at @ko.lligraphy.hk 💜", "wthestudio": "@deepica let this tinted girl shoot you and your amazing products! I wear found so much!!! I’m proud of you and your platform!!!", "nikhitapai": "@riyacollective we rent designer South Asian wear for weddings - we outfit guests, and even brides/grooms ♥️ we would looove to outfit you for any upcoming events you have! And maybe even tone match to your different tints. We loooove all of your beautiful shades and we want to collaborate. 💯", "lalithapriyanka14": "Hey @deepica @livetinted my art is inspired from day to day life. I been designing from 8 year’s now I will be happy to work with you guys. You can check out my works @lallygunda and @lalithapriyanka14", "slaywithstylee": "I have been following you guys for a really long time and it’s commendable how you guys have build the brand and always ensuring including women of all colors in your brand ..I would love to collaborate with your brand by creating a special LIVE TINTED collection of handmade earrings ...coz I believe beauty and fashion go hand in hand 🧡🧡🧡", "kvw_dotnotfeather": "@kvw_dotnotfeather", "shantala_mermaid_actress": "I'm an Alchemy Therapist... basically a spiritual coach to corporate folks. I use medicine ceremony and Wicked Coaching amongst a variety of magickal techniques to break patterns, create boundaries and empower sovereignty in my clients. I show up as The Enchantress who tricks people out of their shame and pain.", "jellybean1528": "@artistarielb", "claire.extraodinaire": "@claire.extraodinaire", "gayatristyle": "Hi @deepica i’m @gayatristyle i’m a hair and makeup artist would love to collaborate with you 😘", "harbs.social": "🙋🏽‍♀️ Digital Marketer! Love you Deepica, been following your journey for a long time and the amazing community that you've made. Would love to contribute to your cause!", "iamfasholica": "Such a good idea!!!👏🏼 @mvtrends @katherinelizardip @jessicvillarreal", "violetpen7": "@pleasant_penmanship", "heyimlynn": "Me☺️ I just started a copywriting studio along with my sister (@roseandpaperstudio), and I can write for varied formats. I would love love to collaborate along with @livetinted, so let me know if I can be helpful to you💕", "mohsinsultan": "@livetinted @deepica I would recommend checking out @tazeenshadaan. She creates make up videos and also makes a variety of paintings, such as watercolor, pastel, and oil paintings. Her skills are versatile, she approaches all of the work that she is involved in with the utmost dedication and passion, which enhances her many talents. I think that she is someone that you guys should look into! 😊", "zoeharveenkaur": "Check out @zhkdesigns for inspirational and empowering south Asian art ❤️💕✨", "candice_foster8": "@karlierosin 🎨💄👌😍", "designsbysundari": "@designsbysundari for any graphic design needs! You name it! @deepica ❤️❤️ would be a dream", "thivmoney": "@perfectchai @fatimarbaig @murukku @ay.irani 💖💖💖", "ruchiadarji": "@ruchiadarji ♥️🙏🏼", "sanukorah": "Me! Youtuber here. Love creating makeup looks and would love to work with you @deepica! You are doing amazing work and I’m so proud of you!", "studioelements_": "You have been a global icon for millions of women across the globe. Your story has not just inspired me but made me a better person altogether. It would be a dream come true to work with you. Adore how you keep things so real which is therefore so easy to relate. 😊", "nidhipatel7": "@artbynidhi", "simillestrates": "@artbynidhi 💯🤍🤍", "sahrish7": "@allurebyjb 💜💜", "nicolemastrorocco": "@jocelyn_biga bc DUH!", "nayikhadesigns": "@deepica us! We are a vegan and cruelty free clothing line. We carry south asian collections from time to time as well. Our products are all handmade (handwoven) from northern Sri Lanka by single moms who are recovering from the war. This company provides them with a sustainable job to put food on their plates and raise their children.", "makeupwithramsha": "@yes.imakeup", "nvmikaa": "@nvmikaa female photography team", "faizeeeen": "@tazeenshadaan", "betsy.rn": "@des13n", "aryaana.khan": "@syeda.c is hands down one of my favorite digital artists & she'd be perfect for this; check her out!!! 🙌🏽", "sonalupurohit": "@ranisdesigns for mehndi-inspired artwork! 🤩", "imamandeepnagra": "❤️", "divdiv1": "@lawrul", "mstz_ladytin_tina": "Hey @deepica love this idea! Would be amazing to style you or any upcoming shoots of the brand for Indian wear by @madsamtinzin . We are a women owned brand that recreates age old hand embroideries while working with skilled artisans to keep the tradition alive:)", "keysofphiladelphia": "@keysofphiladelphia @nasyamarie for a music collab and @pbjtoo for a kids collab", "spatel713": "🙋🏽‍♀️ @adornmebridal", "ille6as": "Me 📩", "apoorvakrishna": "Hi @deepica ♥️ Apart from being one of your biggest fans, I’m an indian classical and contemporary fusion based violinist and composer blessed to have performed with legends such as Shankar Mahadevan, Zakir Hussain and John McLaughlin..would absolutely love to create and perform some meditative, innovative and versatile music for this loving brand of yours @livetinted", "singingeyedoc": "@singingeyedoc for promoting your products with singing!! I’m an Optometrist, and LOVE @livetinted and how gentle it is on my eye lids! Plus not only am I very well connected with the Indo-American musical community, I’m a singer/songwriter/performer and would love to add music to your beautiful products! ♥️", "maiazarov": "Omg i was looking for @livetinted job posts on LinkedIn the other day 🤓!!! I do content marketing! I have an entrepreneur’s mindset so I can wear many hats, I learn and adapt fast! And I’m chill and fun💃🏽Im super interested!🤚🏽", "aseesk": "@loveandleen @gurleenkaurbeauty is a phenomenal make up artist!", "bymudra": "Hey, @deepica ! I love this idea and I think it’s a great way to involve artists in the community and giving us the opportunity to showcase out talent. I just recently start my own art, my art showcases the desi culture and my inspiration from the people and community around me. Feel free to check out my work! 💕", "revanth_indra": "You are an inspiration mam", "priya_handa88": "@lesleyvyemua", "queen_dipali": "@allurebyjb", "nami.rana": "@diipal", "taishapaints": "This!! I think it would be so easy for you to take advantage of the brand you’ve built and keep going now that you’ve launched but reaching back out to collaborate with and give back to the community that made livetinted what it is SO AWESOME. Great work!", "ramyakirtana": "@aurawithwriting", "lovetocreateart": "@parmeetarorabori", "aayushi17": "@aayushi17", "binaypreetkaursingh": "👋🏽 Hi!! @binaypreetkaursingh I do personalized GIPHY sets for IG stickers, animation, illustration, lifestyle and product photography that’s bright and airy 🧑🏾‍🎨", "janice_manocha": "#jesuisjanice", "pinal_thakore08": "@lovemegzxo", "makeupby__chandni": "Would love to collab 🙌🏼🙌🏼", "pennzoe": "@pennykmakeup", "lippieonmyteeth": "@lippieonmyteeth", "modernmarigoldbooks": "@makeitmini_comics @the_blue_frenchhorn @culture_curry", "portia.sa": "Brown girl copywriter and strategist over here 🙋🏽‍♀️. Quadrupled revenue for our service area in sustainable materials this year and I also have a track record of doubling product sales at a start up!!! Plus I’m an INFJ (advocate) personality so you know you got the whole package!😁", "kirti_mistry": "@teaa.l94", "gurjinder_bhogal": "@rajkaurartist is amazing!", "parmita.choudhury": "@internet.alex", "nguyenadrienne": "@aworldofhurt livetinted tees and patches!! Product designs for labeling and website!! What else can you do Jos 🤩", "culture_curry": "Hi @deepica I'm an Illustator from NYC specializing in Caricatures and Illustrations! @culture_curry was started as a platform to bring different cultures together through ART!! Being a brown girl , a vegetarian and a lover of colors, I absolutely LOVE the Hue sticks... It's not just great for my skin but makes me feel so proud every single time I wear it ❤️ I would absolutely love to create illustrations/ caricatures highlighting our beautiful Hues for @livetinted ❣️🤗", "dolledup_eventmakeup": "@beauty.ndbeyond", "pluv721": "Love this!!! @padmagraphicdesign", "sawnumbb": "@allurebyjb", "noorieullala": "@allurebyjb 👈🏻💗", "alex_l0ve": "@muahbyalexlove", "chawlachaps": "@nehal_joshi !!!!!", "ritscracker": "@onein8billion_ I’m a photographer and graphic designer based in Mumbai India! Def let me know if you need any help :) love your products and your message!", "megankothari": "Love this 👏🏽👏🏽👏🏽👏🏽", "ashnaidu01": "Yes please! 🙋🏽‍♀️🙋🏽‍♀️", "ssansk": "@sanskrutis.creations is an amazing talented dancer, business women and growing makeup artist 💕💕", "premadonnna": "@akkathangi", "saragevorkyan": "Me @sweetsaramakeup", "freelancebyjack": "Would love to get involved. I'm a freelance developer in the UK. I have over 10 years experience in the web/digital industry. DM me if you'd like and you can find out more on my website jackwhiting.co.uk", "motherofthemind": "@beeumana", "mandykhunkhuna": "@deepica @freelancebyjack is an amazing freelancer web developer 😊", "amira_mo_96": "I have a question because you are my favourite 💜💜💜 how did you know yes this is my aim this what i love how ?! It's very hesitating 😭😭😭😭😭i am scared that i can't find it ?!", "shruga.b": "I don’t have any beauty industry background and neither do I know how to apply make up but I would like to be a part of tintfam.", "skulleranza": "@ehasskills", "fatimahussain": "Doing what I love everyday has set me free. But possibly closing my brow studio during this time is going to affect my mental health tremendously 😔", "kulture_khazana": "@culture_curry ❤️", "baks.j": "@glambybaks", "hunterbellnyc\nVerified": "Verified", "dcniha": "@nihabsketch", "aprilwilliamscollection": "This is great!👏🏽@aprilwilliamscollection", "sravani_ravindran": "Let me try 😊", "seherb5": "@ay3shagram", "kaykaysway92": "@livetinted I would love to send items from @kaykaysfashion for you to use in advertisements etc.", "jashy.singh": "@olivia_sangster", "vv_jewellery_collections": "@lasya_chittella", "shanae.92": "@trashtotreasured", "shagaanagiri": "@amirt_h8s 🧡🎨...best digital drawing artist I know!", "oshinanjum": "@aestheticsbynuha", "tinbitehaile": "🙋🏽‍♀️... I’m currently a freelance artist and working with @livetinted would be a DREAM. What you do there warms my heart. You’re on to big things and I would love it if I can help get you there.", "kimmyswags": "👋🏽👋🏽👋🏽 strategy & innovation consultant with an insights & analytics foundation and a ton of experience in digital/social. Forbes 30 under 30 finalist. Currently taking on contracts/coaching clients through @demeraramedia & building @tamarindbredren which celebrates & explores Indo-Caribbean culture, representation, & identity ✨ would loooove to work together 👀", "dearfatima_": "I’m here ready!!!!", "poovandhree": "@vithyahairandmakeup", "swetha_vv": "@deepica just checked her out and she’s from the same hometown as me!", "fit2frolic": "@thescriptwithin thought of you", "devijags": "@noangel_ bc she knows good makeup😍", "sony_uhh": "@allurebyjb ❤️❤️❤️❤️❤️", "redlotusartistry": "Would love love love to be a part of this new amaze idea you have rolling around in your beautiful mind!!!! @redlotusartistry @_vidstagram @getlotused 🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️", "adventuresbytheminute": "@deepica let me know if you are looking for someone for financial/accounting experience, over 10 years of experience with small businesses that have successfully grown. :) kind of hard to find a beauty job in finance as I transition", "0102_smz": "@allurebyjb love your work so much!!!!😘", "ramonamariaroberts": "@thoughtswithdyslexia", "poonam_____": "@deepica Would love to see a collab with your huesticks @pbyprety @prety81 new fun clothing line! 💗", "nikitaceedesign": "@nikitaceedesign I’m a Tanzanian illustrator keen on bringing together people of different cultures to care about our planet. As a fellow vegan, I absolutely love that @livetinted multisticks are free of Carmine and all the nasties and actually good for you! I’d love to create patterns from nature for your packaging and imagery for your newsletter and social channels! ✨", "theflukywordsmith": "🙋🏽‍♀️ @theflukywordsmith Have only doodled as a pastime but for someone like you, why not ?", "unmeii_": "@unmeii_ me 🔥🔥", "paaarmi_": "@praggasaha ♥️♥️", "spat0927": "@spat0927", "artnheart2912": "@minniesalhotraart", "childrenof1971": "@toriserazi @aestheticsbynuha @teres_art @artbynoshin @syeda.c", "neharika_t": "😍😍😍😍 @dress.atlas", "in_dooo": "@in_dooo", "div.fish": "@shilpams1 female filmmaker!", "nghani": "@allurebyjb", "ruchitharuchi": "I would love to work with you. I have mehendi and other Indian design art skills.", "annatzzx": "Graphic designer/illustrator —- @_carolinetran @_ro0oe", "makeupbysharuba": "@makeupbysharuba meeeee 😍❤️😇", "mufasa_unfiltered": "@aestheticsbynuha", "asna516": "@clancyfi", "fa.re.ha": "@syeda.c", "vijayacamillo": "@labyrinthdata impactful data visualisation & art 🙌🏽", "niithya.j": "@the.doodle.dome", "tarinifern": "@lushlashangeles", "meghaljhaveri": "Wohoooooo super excited for this one !! Im a freelance Makeup artist and hairstylist ... would love to try", "megthegirlonfire": "Meee🙌🙌 im in houston @megthegirlonfire", "rashmika_m_": "@caribbean_soil", "jeeenoooo": "@steffasteph !!!", "devanshiiiiiiii": "@inkbydev", "kash.tash": "@syeda.c", "shruthi_kashyap": "@jayanth.kashyap91", "heba_kazmi": "@allurebyjb", "samzee29": "@calligra.fever", "mishy627": "@tigersmark Super talented individual ! Logo, graphic design, web development, personalized custom filters and more! 😄! @deepica @livetinted !", "naureen_fasihi8": "@allurebyjb 🙌", "anjalivpatel": "@thesoharita 😩😩😤😤", "peravina_raji": "@sbscribbles", "ashleygarrels.art": "Absolutely love the work y'all do to promote and drive inclusivity in every sector of the beauty realm! Would love to work with you on some illustrations and creative projects ☺️⚡️ @livetinted @deepica", "cshah718": "🙋🏻‍♀️ @cshah718", "anilaaislam": "@aestheticsbynuha", "teres_art": "Hey Deepica! First, I just wanted to say that it is so awesome that you are reaching out to freelance artists. There is so much talent in this community that deserves to be showcased, so thank you! My name is Teresa and one of my majors in college was Fine Arts with a focus in oil and acrylic painting. I have recently also been doing digital art (I even drew a picture of you that you saw and reposted on your stories which was so cool! Lol). I would absolutely love the chance to work with Live Tinted 🧡 Also, some other amazing artists with diverse talents to check out are @aestheticktock @artbynoshin @madebyhajar @aestheticsbynuha", "sahelimotiani": "@sahelimotiani @designbyshirls @art.byandrea", "kanchanlota": "@artwhoring", "roses530": "@bymudra @moodz_98", "art.byandrea": "Hi Deepica! I'm a Canadian artist who celebrates the desi community and spreads awareness on social issues through art! I'd love to work with you, check out my page @art.byandrea ! plus, these lovely artists are so talented @sahelimotiani @amethystmoon15 @thecreativecub", "pjprachi": "@glambyprachi @pjprachi", "xchitrax": "@millyxmakeup Let Deepica know how you can work w/the Tint Fam! Xx", "mahi__manohar": "@lasya_chittella for sure", "shivy.studio": "@shivy.studio ✨", "allhealthyvibes": "Absolutely!✨", "mahira_ullah": "@allurebyjb 💄", "knotsbyjai": "Aani Kucher of @looks.mua is a creative makeup artist who uses products minimally and in many innovative ways. Her signature makeup look for clients/ models is skin that looks like glass, with monochromatic makeup. She creates amazing looks using minimal products. Based out of Toronto, she is an HR Leader who chose to switch lanes to this creative profession. She can be your spokesperson and brand ambassador in Toronto. Aani gives her honest reviews about products and services. She writes beautifully. She's a catch!", "zuaira_k": "@syeda.c @syeda.c @syeda.c 💙", "meenakshiduttmdm\nVerified": "Verified", "deejaycastro": "Brow threader, makeup artist and tinted sista! Love you deepica", "fablihanbar": "@syeda.c", "pupppylicious": "@sagittariusstories", "smushed": "@syeda.c !!!!!", "elly.makes.it": "@elly.makes.it I am a calligrapher and water colour artist based in India", "lagoonalondon": "Where ever you need me in London or india! I am a hair and makeup artist happy tocreate new things!", "prococoa": "@dea_dubai @priya2kanodia @sahelimotiani", "narath.un": "😍", "nadianazk": "@allurebyjb make up is a form of art, she’s does an exceptional work expressing that. 💄", "shaliniperpakaran": "@olya_gesheva 💜", "simsagoo": "Um meeee 🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️ 😂😘", "iamandreajohansson": "@imkattis check this out!!! Maybe you could make some graphics etc? 😍😍", "zoha576": "@allurebyjb", "s.kinhal": "@s.pandhi", "skincare.villa": "@a_good_skin she is above perfection when it comes to talkin researching on ingredients 🙌 Queen of Skincare ingredients", "stenistephan": "@steffasteph", "evalempert": "@evalempert I’m a photographer based out of SoCal! Love this shoutout, thank you!", "jessgiare": "@jessgiare this would be amazing 😭💓 this brand is such an inspiration and I love witnessing the growth of this company, so amazing, go deepica!", "desigayividesh": "@_dev_art_", "shivaanibaghel": "Honestly I am so so proud deepica! For this! At this time wWhen people are uncertain you're showing a kick-ass new way of being , like literally giving an opportunity for that new way, and that's pretty dope! 🔥🔥🔥🔥", "smile_kang_": "@sookham_singh - wonderful artist with wonderful illustrations", "kabi.jillu": "I m an Engineer 👩‍💻 by profession but would like to work with you Cz that’s my passion is even if I m not a best fit please provide roadway for those who want to travel in their passion than by profession ❤️🙌", "tarishiguptaa": "I’m a new york based photographer and I would love to work with Live Tinted in any capacity!! 😍🙌🏽", "a_good_skin": "Def @lasya_chittella is the perfect fit she is someone whom we all look upto in India", "kiimkirton": "I am a freelance growth marketer🚀!! This includes— brand, product and data analysis... my job essentially is to test things in order to find the perfect ingredients for repeatable process that will lead to growth!", "changeconstant_": "so true 🌟", "youareskyfullofstars": "Yeahh❤️🙌🙌", "bhavyatallapaneni": "@bhavyatallapaneni", "nuz.chow": "@teres_art @teresachoudhury ♥️", "kmahtani": "@brightandbluestudio does great work!", "ltrdance": "@ltrdance ❤️❤️❤️ for Tiktok videos 🤗", "chickofalltrade": "Me me me me me", "juliehirji": "@makeupbyjuliehirji - would love to work with you on any upcoming projects. I’m open to suggestions/possibilities! 🧡", "harini_jithendra": "@thepaperflowerstudiopdx for paper flowers", "minhaakbar": "@javeriaullah", "arina.chow": "@aestheticsbynuha", "abarna.kamal": "@sbscribbles", "supaloop88": "@happymonday @humai @atif", "asmauzubair16": "@allurebyjb 💕", "tina_luke": "🙋🏽‍♀️ I’m a full-time freelancer that specializes in Google Ads.", "ameaningngfullife": "Hi @deepica I am a qualified Exec Coach from London - specialising in Purpose and Vision. After 16 years in the corporate world where I worked with global organisations and senior leaders helping them to define their purpose, breathe life into it with a vision and then make it real with a strategy- I decided to break out on my own. Your business is inspiring and I would love to work together in any way that would be mutually helpful! Im Fahrah btw- coachingonpurpose.co.uk", "ridas_gram": "@allurebyjb", "arshia26": "@allurebyjb @javeriaullah", "loria91": "🙌🏻 love this so much @deepica!! @abigidea_", "flawlessbeautybypauline": "@flawlessbeautybypauline tagging myself if that’s okay 💄😊! I’ve been a freelance makeup artist for over 10 years! Well diverse with all skin tones. Thank you for your consideration ❤️. Stay safe everyone!", "shyamaldesigns": "@shyamaldesigns", "gaganaborra": "@teecaake", "teecaake": "Hi @deepica thank you SO much for this! I’m a British Bangladeshi freelance artist and I would absolutely be honoured to work with you! ❤️❤️", "maryrhymer": "@chickofalltrade is amazing!", "_a.num": "@allurebyjb", "sadiya5793": "@f1za", "zeelpatel": "@doodleplix you’d be a wonderful asset for @livetinted", "sookham_singh": "Hey @deepica!! Thankyou for supporting other artists by creating such opportunities! Would love to be a part of the amazing @livetinted community💜", "saborny": "@aestheticsbynuha for sureeee", "malika.ladha": "@sookham_singh creates incredible art in many forms! And I love that she uses her platform to encourage people to own their identities. She’s the powerhouse who made the recent Indian Disney princesses portraits that went viral!", "renzsha": "@monasangha", "apoorvabapat": "@aishwarya.mulmule.doshi", "theweddingmakeoverz": "@nandhnii 🌸🎊🎊🎊She is bomb!!🎊", "sindhu_manjunath_begane": "Love your makeover skills @shivani_begane", "cyrusveyssi": "You know I’m always D! 😍💕🥰", "sukrit_maan": "@sookham_singh best artist with oodles of talent and creativity !! 💕💕💕", "kimiarya": "I’m a wedding and event planner! Also available for travel 🙋🏽‍♀️", "cheekybillo": "Love this!!! And I’m tagging myself 🤷🏻‍♀️🙋🏻‍♀️😁 @cheekybillo", "marianacelest_21": "@vq.creative is a photographer and graphic designer in Puerto Rico. Amazing work", "snkve.ca": "@sbscribbles @sbscribbles @sbscribbles", "deyarcreations": "I’ll put a plug for myself @deyarcreations I sing, write captions, and draw cartoons to empower and uplift the desi diaspora 💕", "sohajoshi_illustrations": "@sohajoshi_illustrations ♥️", "themonoclemuse": "Love that you’re doing this! 🙌🏽", "benidevanshi": "@albarajanibala", "amandandelionnn": "@syeda.c", "suganyasaurus": "@suganyasaurus Hi Deepica! I'm a Tamil-American mixed media abstract artist and I create art experimenting with color and movement to explore the connection between my Tamil heritage and my current identity. I love seeing a fellow South Indian like yourself doing what you love while fighting colorism and inspiring brown women to love themselves. I would love to offer my art services to your brand because I love everything that you represent!", "medhasataluri": "@katambrose 💓💓", "sohajoshi": "@sohajoshi_illustrations I LOVE illustrating beauty I’ve worked with Bobbi Brown and I would loveeeeee to work with @livetinted @deepica", "iconicbeautymg": "@iconicbeautymg", "daughterofpoets": "@fatijafriart for illustration / art or creative direction / set and costume design", "parshahaq": "@aestheticsbynuha", "piapatwary": "@syeda.c is a great illustration artist, @piapatwary is a awesome freelance photographer", "handmadebykavya": "Handmade cards @handmadebykavya and hand lettering @letterpedia 🙃🙃", "jj3nn28": "@_colourmysoul", "aspicepalate": "Yessss @aspicepalate i am a formulation scientist maybe i can be some help?", "sravya.vatsavai": "@makeupbysravya", "prianka_np": "Give your sis my love. I'm a hospitalist terrified to go to work. And if she decides no work no shame in that!!", "alexandriaganesh": "@syeda.c does amazing work!!!", "pooj.01": "@allurebyjb ♥️♥️♥️", "chaitrasamara": "@chaitrasamara", "beyondmesnczg": "💜💜💜 wat u said!!", "rellabeautyofficial": "@sumidaydreams", "stephna_721": "@steffasteph", "bvisha": "@dovesandpeacocks they do incredible work! 💛❤️", "dolceandgabiana": "@syeda.c", "raeeeeesa": "@aestheticsbynuha", "nehaa1927": "@nehaa1927", "myuri.s": "@sbscribbles", "gingerturleymakeup": "I would love to be considered! As a #tintfam community member that uses the Huestick every day myself and on my clients❤🙏 I have always loved and supported what @livetinted stands for and would be honored to be considered for future projects🙏 @gingerturleymakeup", "shivthemistry": "@shivoodles !!", "teddyvcookies": "@kathyphantastic!!!", "asyed37": "@allurebyjb 🔥", "dolceroopa": "I do packaging, make up bags and have a background in bath&body and cosmetics before i launched my business. 😍♥️ @dolceroopa", "priyakahlon_": "@paperlilystudio", "deepika.n": "@aks.27 this is for you , get this 😄😄opportunity", "shweknowsbest": "@anja_the_cob", "lakshmi_kunnathuparambil": "@lakshmi_kunnathuparambil brown skin with curly head 🙂", "steffasteph": "@steffasteph", "pmodyy": "@modyxglam", "kshalalala": "@ashish.yamdagni", "makeupmendhimishka": "That's really nice.😁🤗 @makeupmendhimishka @edit_designandgraphics", "madihaullah": "@allurebyjb 💕", "aditijhota": "I really like @amethystmoon15 too! Check out their page! 💕", "syeda.c": "Hi! My name is Syeda and I’m a freelance digital artist based in NYC! I post my artwork on my Instagram @syeda.c and tag all my work with #ourdesicanvas My artwork revolves around the South Asian diaspora and I’m always looking to collaborate/work with other creatives of different mediums! I also really love the work of the following artists: @sleepysoymilk @perfectchai @sabah.noir @shaw.22 Would love this opportunity for me + all these wonderful creatives!!!", "sameeraqureshimtl": "@allurebyjb she does amazing work !!", "annlakh": "@allurebyjb", "tara_elmaleh": "@facesbytara. I’m a freelance makeup artist based in Toronto, Canada. Let’s work together and create more beautiful masterpieces ❤️", "ashish.yamdagni": "Hey! I’m a NY based video producer/designer. If you’re looking to market your new projects or people - let’s chat.", "_shangs1515": "@sbscribbles @sbscribbles @sbscribbles", "aestheticsbynuha": "Hi @deepica !! I love this and would absolutely love to work woth @livetinted ! Please check out my page. Thank you for giving artists in the community an opportunity love this! Lots of love 💕❤️", "_raeqa": "@aestheticsbynuha !!!!!!", "itssoxtina": "This is awesome. 👏👏👏👏", "vinnysoorcreates": "@vinnysoorcreates Please check out my work! Love your products! Would love to work with you! 🙏🏽🧡😊", "vartikachauhan_": "@vartikachauhan_ ✨", "selfcarebysafia": "@allurebyjb 🔥", "shmiiiii05": "@linesnpixels !!!!", "heyitsbeckiee": "@danielle_alecia", "aliyyaaa": "@allurebyjb", "alejagj19": "@rodrigojose_8 look!!!", "itsdivyap": "@itsjessica_designs makes amazing illustrations and gifs ❤️", "vasavya.penumetsa": "@vasavya.penumetsa", "diptimehra": "@diptimehra @diptimehra.makeup", "luckybmakeupartistry": "Yessss this is what all freelancers need right now.. Positivity!!! I Would LOVE to collab with you and your inclusive brand. I use the Hue Sticks personally and in my kit they are a firm favourite. 🧡🧡🧡", "_shahiqaa": "@allurebyjb", "kloeex3": "So true.", "makeupshaq": "@allurebyjb", "paopao80": "paopao80", "neenzie": "@allurebyjb ❤️❤️", "deepica\nVerified": "Verified", "malo_mali": "@allurebyjb (please check her out!!!!)", "monicachitre": "@bymonicachitre", "sana.munis": "@aikan_designs_ @marianurbhai", "payal.ramlall": "@deepica would love to be part of it from the other side of the globe 🙌🏼", "thatmutttuck": "@allurebyjb 😻", "sridewishalleni": "@makeupbygeedha @beautybykanit", "anchal_09": "@bhavismehndi @lagoonalondon hand crafted candles, tea lights, photo frames. Basically anything that can be personalised.", "nida_03": "@allurebyjb 💕", "siddhikodimela": "I would love to work with you guys! I do freelance work to brand beauty companies! Send me a DM :)", "jaweria81": "@allurebyjb", "motherofonemb": "Hi Deepica , I am not a freelancer but a professional looking forward to live my dreams of being part of fashion and makeup industry . I would love to be given an opportunity to be part of your amazing team and work . I am able to offer Human Resources as my skill with special talent in learning , development and recruitment areas . I am sure as the company is expanding, there’s a need to cover these roles . I am happy to begin as an Intern or work for whatever you are willing to pay . I see your work ethic , company values and Vision as a revolutionary and would want to be part of this . Even though I am located in Canada, work from home is achievable within my scope of work. I am a mother aged 34 and want to finally be able to follow my dreams to set a better example for 7 year old. I have understood to ask what you want might lead you to your goal. Thanks for today’s post and I am looking forward to hear from you . Mansi Batra", "labeltatva": "❤️", "perfectchai": "i (@perfectchai ) would love to work with you!! also love the work by @kiani.co @sleepysoymilk and @syeda.c", "mad_dieat": "@blink13 to do any kind of amazing doodling! 💜🤗🙌", "lasya_chittella": "Me me me ! @lasya_chittella", "hybridhues": "@simran modeling / writing", "amyyster": "@sonikohli", "aishwarya_sukesh": "Thank you for reposting my work!!!! This means the world!", "caryniev": "@caryniev 🙋🏻‍♀️ content creation, account management, media branding and strategy. I’m not a makeup artist but definitely a freelancer", "navya__reddy_": "@srinath.reddy_polu", "sumanullah": "@allurebyjb", "momina.q": "@allurebyjb", "meljasimie": "Would love to work with you guys:) this is so exciting ❤️", "dhevamaalini": "Me 🤗🤗🤗", "aamyaray.jpeg": "@raynovadesign", "pooreddy": "I love @brwngirldesign and @hafandhaf!", "artscapes_by_amita": "Hi! I'm tagging myself @artscapes_by_amita I'm a freelance illustrator from India and I love making art that resonates with and focuses today's woman, bold and motivated. I work digitally and with watercolor to make fun and colourful art. Looking forward to hear more about your new idea for tinted. You can get in touch with me on IG or mail on artscapesbyamita@gmail.com ✨", "priscilla.dsilva": "@elly.makes.it", "shindercheemajohal": "@blueroseartistry", "funnyproton18": "@lasya_chittella @fleek_makeup_artistry", "meagan.0401": "👌😍💙", "monica_vaswani": "@allurebyjb", "rovershiv": "Would love to pitch in and be a part of something so inclusive by someone so beautiful inside out.", "stephen.uthaya": "@_colourmysoul", "shanthiarumugam": "💛 @shanthiarumugam", "affirmationaddict": "Literalllly so amazing!!!! Aish is the most talented lady I know grateful she’s on my team @aishwarya_sukesh", "jelenarasic": "@zi_kriss 💕🎀", "deenuka": "@_colourmysoul", "nicki_n": "@simsta my sis the freelance makeup artist who also uses me as a muse, we used to do fun and creative looks and photoshoots using small limited spaces to see what we could come up with - the lockdown should see us doing more of this now. We love @livetinted.", "divyakumar": "@zacktzfilms for filming and editing!", "bindionfire": "Hii @deepica and @livetinted ! Thank you for giving us artists a chance to work with you amazing people! I would love to be a part of this. 💛✨", "tumblingtopsyturvy": "@avibanerjee", "chocolata.ca": "@chocolata.ca Hi! I'm a sweet table stylist but need to look my best when setting up parties. Now that we've been hit hard with tons of cancellations, I've decided to restart my lives showing people how to set up their own parties. I'd love to collaborate with you and your team!", "rocktheglow": "🙋🏽‍♀️ ME! I will DM my superpowers", "ileoneill": "I love this sooooo much!!!!💗💗💗", "raynaart.co": "🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️ Heck ya !", "nadiyaafzal": "I started @upperbrownsider to review food, talk about fashion and bring awareness to south Asian issues/stigmas. I come from an Indian/Pakistani, Hindu/Muslim household and would love to collaborate on diversity and acceptance within the south Asian community", "chels.fischer": "Totally @allurebyjb !!!!! ✨💛", "_kishore_": "idk if this counts as art but @anu777 has really nice handwriting in case you want to personalize notes to certain customers etc. 🙂", "sommer_areces": "@allurebyjb Really passionate and dedicated to her work 🙌🏽🖤", "bhimla": "@allurebyjb", "netraa_s": "Me! I can model for you ❤️❤️", "anisha_25": "Freelance copywriter that would love to work a brand like @livetinted !", "kavi.jey": "Heyyyy im so interested to work with youuu", "vinihazari": "@tanya_thanawa", "wiryhair130": "Hi Deepika! I really love what you've done with Tinted and of course your relatable and heartwarming videos!! My name is Pereni (I'm also Telugu!) and this is my art account @perpaints and I tag my art at #perpaints I love doing calligraphy and whimsical art works with concepts and I'd love to give that all-inclusive, accepting vibe of @livetinted a boost by designing any of your invites or packaging etc., If you'd be interested :)", "manpreetdhillon": "@deepica My company @vezacommunity focuses on leadership development for women with culturally diverse backgrounds especially through Connected Leadership Incubator and I would love to support the @livetinted team and community in some way. So I’m an in artist in coaching, strategy, diversity/inclusion, Human Resources and would love to support your mission.", "trush2110": "@deepica @p.leesh please check it out 😍", "artby15il": "@chacuri is an amazing artist you should check out her works. Such a beautiful use of figure and color!!", "monixx_mumbles": "@adreamersdesigns cute banners for launch@parties, and/or party favors! 😍", "jumani.mua": "@sookham_singh definitely get her on board!! 😘💗", "allurebyjb": "@allurebyjb ❤️", "lualmayen\nVerified": "Verified", "icmylifeinpinks": "@italia_iperspective 💞💕💖", "leah_r19": "@aestheticsbynuha girl you would be perfect for them", "richesforrags": "@richesforrags", "starstruckem": "@vivienne.lee best artist I know 🙌🏽💯", "adistaagram": "@bizarrekalaakar", "afreen95": "@afreensf_a_d does custom artworks!🌸", "laelanblog": "@laelanblog working with @livetinted would be like a dream come truee🤩", "suryadeviworld": "I’m a Vancouver based intuitive healer and musician with a history of working in the beauty industry... I create healing music and could help you create some beautiful music for a livetinted meditation! 💕", "solawless": "Heeeeey.... I know my stuff probably what you are looking for but I wanted to tag my art account @soapl.co I just printed some make-up bags and I am super proud of them. Maybe you would like some hand printed make-up bags? 😊😁😄", "lauriannn_": "@shell_makes_mess @kabutiart", "nadinearountheworld": "@nadinearountheworld 🙏🏼💕", "6sideprincess": "Love if you’re looking for an eccentric model I’m here. 💕 @6sideprincess", "saherjafriarts": "Hi @livetinted and @deepica, I create art infused with digital henna, and would love to design merch or product designs for you 😍😍😍", "blooming.lotus_": "@blooming.lotus_", "miya.palani": "@queenrubi.xo", "shomyab": "@sbscribbles @sbscribbles @sbscribbles", "drozario_rach": "@roseannerozario", "anusreesattaluri": "Adore Livetinted (just received Free and I love it) - @anusreesattaluri", "dimlitesnotwits": "I’m a LA based content creator doing photo and video for social media 💕😍", "dheekshaa": "@dheekshaa", "creative_beauty_boutique": "@creative_beauty_boutique", "ot.amma": "I would love to work with @livetinted", "anotherweekwithbella": "Yes 💕💕", "sindhumerugu": "@sindhumerugu", "tintedbeautea": "@hilary092", "sruti0105": "@artbyamalyah @amalyoren", "printmesomecolor": "@artscapes_by_amita", "accidentalmuggleborn": "Please check out the blogs of @unfolding_life_blog on society and life, if freelance writers are also being considered here. #livetinted", "em_teekay": "@em_teekay", "jothi_creative": "@jothi_creative @herspace_1 💕✨💕", "tnagar2392": "@tahsdraws", "jyothsnakrau": "@shravanirau", "suman3910": "Huestick customer, YouTube subscriber. I’m a really good writer with plenty of prof experience creating written content, copy, social media, etc. have been freelancing for 2 years. Need a writer? Let’s connect.", "ijamietaylor": "I need to order my @livetinted 😱😍. Because I love love love it on you.", "shabeena_00": "@shabeena_ferozz 😍😍😍", "sylviavelpula": "@sydneymoodyarts", "garlicmogo": "@garlicmogo 🙋🏽‍♀️", "redefined._beauty": "@redefined._beauty 💯", "kismaa": "@reee_pat", "remaneirma": "@remaneirma 🙋🏽‍♀️"}