{"gwapedwink": "It's amazing how we don't even see the beliefs we have. I just see flaws when I look at myself in the mirror, and I choose to ignore them. I still see them though, and it's funny how we all do. I'm happy btw, not sad.", "imsharmasanchita": "❤️❤️❤️❤️❤️", "sucks_to_": "❤️", "dalchanna": "Thanks @sukhojla for sharing - made me 😭😭😭😭😭 xxx", "pamchanna": "😢😢😢 unacceptable and look at those beautiful eyes and skin", "_the_alien_lad_": "❤️", "_waalid_": "👏👏👏👏", "ehusa": "She SMILES 🤗🤩😁so brightly! A beautiful young woman!", "itsnajeebaq7": "Awesome", "thenerdbugs": "seriously feeling all the things watching this ❤️🥰❤️ what a beautiful moment", "sirigowrii": "😍🙌", "ayb_03": "@harveenkd 😩 what we talked about last night!", "melsingh29": "❤️", "zaara_zaarz": "❤️", "justrob1n": "❤️", "travelingfro": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "roshniim": "Literally this is what I stand for!! All shades are beautiful!!! Why are we going backwards in life? I was there believe me I got made fun of for being dark and I don’t give a f", "aalia.j": "💔", "fatimahassannn": "Love this so much 😭❤️", "aapatel89": "@dove", "ega44173": "She is so cute ❤️. I wish my mom had this conversation with me when I was a kid. You are doing amazing❤️", "navya_sl": "This is beautiful ❤️🙌", "ibunny_pradeep": "How does internet find's these cuties yar😍😘😘", "_sanjeed__": "❤️❤️💯", "lovecnjd": "This is soooo gorgeous & I appreciate you sharing it with us!!!! The kind of love & kindness we should all speak into ourselves & our children!!!! 💞🙌🏻", "marzixo": "❤️", "ktherrienjanzen": "Xoxoxo 😭 👏👏👏💞💞💞", "_bluewave__": "Look at what society has done. Left me speechless at the thought of how evil a scar it left on that tiny heart.This touched me deeply. Those words from that little one. Dark skin is beautiful...elegant...graceful and everything else what light skin is. Dark or Light,we all bleed Red!", "jodysgirl0913": "So sweet!", "mehraankita": "♥️♥️♥️♥️", "that_one_hijabi_": "That kid is adorable", "shaheen_junge": "@rashidax", "sakshi_633": "She is so beautiful ! Her eye sparkles when she talks..she is so precious🌻", "conefit.kitchen": "Wow ❤️", "kontikisundayandpeggy": "@beebalakrishnan", "doctormiles": "This. This is so freaking amazing and incredible. Thank you so so so much. 🙏👏🙌. 🔥💯🎈🚀", "ravissoni8": "🖤🖤🖤", "xoronix": "😭😭😭", "yuktha.j": "❤️", "vivatusalud": "@khushi4u 😢", "lunaandnoon": "We’ve come across this so much in our Tamil culture 💔 Beauty perceptions have to change - love this 🧡", "_donutgirl_": "Love ❤❤", "longkumer_kika": "That boy is so sweet . It’s sad that many more adorable kids like this will b brought up or grow up with mentality like that. I hope we all can tgthr stop it! 💗💗", "guccigang1048": "So sweeeeet", "shwet.32": "@deepica this is so true !! Why are we creating this complex.. Look at Priyanka Chopra - dark skinned Indian who is so beautiful & making India 🇮🇳 proud with her work", "rimpa_das_1": "This is beautiful.. ❤️❤️ @imsuprava see this", "arshiya99": "❤️❤️❤️❤️", "lords_han": "My heart melted when she said that. She is innocent ❤️❤️", "anjuanne": "Beautiful message given to the child.. this should be taught to everyone to ensure that no one should be outcasted because of the skin colour. Beauty is not defined by colour of the skin but by a beautiful heart. ❤️", "itskhadijam": "I love this ❤️❤️❤️", "a_pabla": "This is beautiful❤️", "aariyamayuri": "Such a great message 🙏", "imichelletorres": "@jayciegrover", "thebrowngirlldn": "We need more fellow women like this mum! 👏🏽👏🏾👏🏿", "alyshabadiani": "Yess yes yesss", "roopajeevaji": "❤️❤️❤️", "jasperskies": "💕", "nastassia_queen_assassin": "Beautiful momma dark or light. we all bleed red.", "_niveethaa": "❤️❤️❤️❤️", "peonymagic": "❤️❤️❤️❤️❤️", "lifestyleglossary": "Thank you so much for this! I grew up most of my life hearing how unfit I am just because I was dark... it took me 10 years to embrace who I am.. Thanks for being a light and sharing this beautiful message 🙏", "laasyabonthu": "❤️", "trost_lena": "❤️", "vasuki_karan": "❤️❤️❤️❤️❤️", "hennabysrija": "@thelifeofasocialbutterfly is such an amazing human, I remember seeing this video when she first shared it and it warmed my heart 💗", "gopalancrazy": "@jeshcyril i couldnt help but cry! What are we teaching to the next generation😿😿😿😿", "vallari_sharma": "Queen sister💗", "sahal_____": "💯💯", "firooskhan": "🍏", "siddhanththonse": "❤️❤️", "sajla_anees": "@madhattersahlah", "sammiluvsmusic": "Bless this woman...I am from South India, and my skin to is considered dark. I never understood that because I thought dark skinned people had superpowers! Because we didn't get skin burnt when we were in the skin. We didn't get melanoma that easily, compared to the pale counterparts. However, my family (not my immediate family) made sure NY confidence went down. One time, my aunt took me to this beauty lady and she used this face mask...with slight traces of bleach in it. Luckily, nothing happened to my skin...idk what I would've done of something did happen. I was only a child. I had to have several years of growth to get to the fact that I am freaking awesome, and freaking gorgeous. This was a tough story to share...so I am glad this mother helped this little girl so early. I hope she grows up to be a well stabeled, balanced, confident woman who doesn't give a shit.", "juna_secret": "we are all beautiful, we all deceive attention and love ❤", "sahajanskincare": "This is everything 🔥", "keyaani_": "💕💕💕 need more positive messages like this", "witty_chandler": "🙌🏻", "max_is_wack_63": "All brides are beautiful, all women are beautiful, all men are beautiful, everyone is beautiful.", "aimibrueton123": "She is so beauitful ❤️ that smile x", "kavipriyasamuel": "💞💞💞", "d_p_d_i": "Truee ❤️", "tales_of_a_tamilian_transplant": "I can totally relate-growing up in India was a constant reminder of the color of my skin...never light enough according to the standards of many (many family members included). Thankfully, I grew to love the skin I was born with, and have learned to turn a deaf ear to the erstwhile hurtful and base comments.", "karthiiekeyan": "She is an angel!! Don't talk about marriage or related discussion, she is still a small kid!!", "sahana._.banana": "Yen ivlo sogam 😭.. Nee azhagu.. Ellorum azhagu eppudi irunthaalum ellorum azhagu ❤️", "kamanabhaskaran": "@thelifeofasocialbutterfly 🙏🏽🙏🏽🙏🏽", "januka_shan": "@thelifeofasocialbutterfly ❤️🔥💯👌🏽🙌🏽", "gazalasoin___": "💖💖", "stina.constantine": "So good!! ❤️❤️👏", "dorothyredheels": "Guess what! in American culture people are bullied for being too pale. My husband was called all sorts of names from kids growing I’ll because he was so blond and pale. Just shows how stupid beauty standards are because EVERYONE is beautiful in their own way.", "biancanese": "😭", "ft.vxrxn": "Mom❤️👏🏾", "khwabeeda.rooh": "😭", "pottamavan.exe": "❤️", "sahil.r10": "@veshan_p", "howyoudoinxo": "💜💜💜", "simraaa.n": "Women need to be taught they’re beautiful and these beauty standards set by our society mean nothing. Skin color doesn’t define beauty.", "dravidianqween": "@thelifeofasocialbutterfly omg so proud of you!!!", "_dily00_": "❤️", "sandra_borrego": "You all are beautiful!!! ❤️❤️❤️", "maniaahmed": "This is just so beautiful! 💕", "ohjustria": "Breaks my heart! #relatable ❤️❤️❤️❤️", "izzah.nabila": "❤️❤️❤️", "almond2734": "❤️❤️❤️❤️", "tnikilove": "Such a good mom!", "bloo.ghost": "Beauty is not defined by the color of one’s skin, but the strength of their character and the kindness in their hearts 💙💙💙", "ar.una529": "👏👏👏👏", "__urbanascetic": "The look in her eyes 🥺", "gonoles1": "@iloveumii", "a_8_n": "Amazing message...our indian media has destroyed the minds of young people...she is still in disbelief that she will ever be beautiful. It kinda breaks my heart....because she will take so much time to realise her own worth... god bless them both. ❤️", "annie__bui": "light or dark we’re all human and beautiful 🥺❤️", "saketh_.p": "💞", "rishigang145": "Glad someone’s finally addressing colorism in other nations like India where it’s so bad. Thank you", "mariacd_08": "The first thing I thought when the video started was how beautiful the little girl was- I'm crying now after hearing here say that she cannot be beautiful because she is dark. We gotta stop doing this to our perfect and beautiful children", "warriorqueenmalaika": "She is beautiful and that smile is killa🌺🌺", "queenkellymac": "This breaks my heart. Where did this child hear that being “too dark” isn’t beautiful? Who is around her that’s saying this? That’s horrible. God bless this mom.", "misha_pipinpadaloxicopolis": "@keerthana_rajasekaran97 what we were talking about that one time. This made me sad and then light up hahaha", "siv.sha": "❤️🤧❤️I love this so much", "divaynbeatz": "🖤🖤🖤", "maria_itty": "❤", "sanath_ram": "❤️🙏", "jkanak9": "Talking to a child about the type of bride she will be based on her smiling? Sexualizing a child is so wrong in every way and so is teaching her she needs to smile. I know you meant well but this probably will keep perpetuating the oppression of women in South Asia, killing their self esteem. Dont use kids as a prop...", "janakvara": "🙌🏽🙌🏽🙌🏽🙌🏽", "dawn_m_rivers": "💕 She is beautiful 💕", "mishmoonasar": "@anushie71 @keishamoonasar 😢", "renfiltered": "Brown is beautiful no matter what shade! 🤎🤎🤎", "eman_danon": "😍😍😍😍 Ughhhhh I can’t believe this is still happening. Parents need to raise their kids by letting them know they are beautiful no matter what their weight, height, color. No matter what. I was told I was dark when I was in school and I never cared because 1) I’m beautiful the way I am because God made me 2) I’m beautiful no matter what and 3) I’m perfect the way I am. If I ever have kids they are going to know just how amazing they are. I owe it all to my mom and dad ♥️", "sibaqax93": "@writuale", "swetha_vv": "Loving the tamil representation 😫 @deepica", "deepti.12": "Gosh! To hear her say \"I won't look beautiful because I am dark\" literally broke my heart.... The woman did a great job helping her understand the meaning of real beauty ❤️.... That cute little girl though ❤️❤️❤️❤️💕", "dhruti_dd": "❤❤❤", "mukesh_.ravi": "👌💓", "africanviolet499": "🥰🥰She is beautiful!!!😍", "beautybymayak": "This made me cry because as a kid I was always bullied and made fun of because of how I looked I got called all the names in the book and my mom always told me I was pretty but I never really believed her because I always felt that I had to be lighter in order to be accepted but now I have learned to love and embrace my brown skin and my features", "rosypirani": "🙌🙌🙌", "medusahead0": "This is SO important. Thank you! 🙌", "fellykellyjelly": "So beautiful 💘", "cynthiapraveen": "This made me cry. I absolutely love these precious humans ❤️❤️❤️", "jayavanti_patel": "That’s great deepica apart from them u want us to buy makeup! 🙄", "khyati.8": ":\")❤️", "monicap283": "@_leahharris @stacym45", "maahinnnn": "❤️😍", "funesseatl": "She’s an absolute doll. The mom is 💯. I wish I had an adult like that growing up. Really shows how pervasive the colorism messaging is that this child’s beliefs were shaped so much outside the home", "dropsofthoughts_": "I too felt the same way growing up, I’m 31 years old and finally understand that my beauty is not defined by my outside! So beautiful to see this little girl has someone helping her change her narrative about her self ❤️❤️❤️", "manishakondapallimk": "DARK IS BEAUTIFUL! ❤️", "glennkiki": "✊🏾✊🏾✊🏾", "photography.bysu": "❤️❤️❤️❤️❤️❤️❤️❤️❤️@thelifeofasocialbutterfly 🔥🔥🔥🔥🔥🔥", "shrayani_dutta03": "All moms need to do this!!🙏🏻🙌 God bless the little & her mother!❤️ Made me all teary! Dark is beautiful..💕", "earlydawn1996": "Our cultures have done this to kids makes my heart cry out 😥", "bejlii": "💗💗💗", "reshmom": "I love this so much!!", "durka.muru": "Amazing 🙌🏾", "wkhan16": "@tasmiyaaaaaaaa", "smileyt20": "❤️❤️❤️❤️", "flora_floreins87": "When I lived in Indonesia I kept telling my friends to stop using the whitening cream because they are beautiful. Dark is beautiful.", "___mathuu26": "Every skin colour is beautiful and we should appreciate ourselves. I hope that this problem is going to change in south asia as well as in other countries. We dark skinned girl’s should feel blessed with our melanin!!🙃", "chandobar": "Thank you for sharing this @deepica! Everyone needs to see this! It brought tears to my eyes. I’ve dealt with my fair share of comments about being dark, especially when I go to India, but unfortunately also from friends in the States.", "neelu1987": "❤️❤️❤️", "thethriftinglemon": "i'm not crying i'm not crying.", "vithyahairandmakeup": "🙌🏽🙌🏽🙌🏽 Awesome that you shared this 🙌🏽🙌🏽🙌🏽", "aberbabe97": "LOVE", "akipog.315": "@nikshi_ranganathan this is so beautiful!", "_ninety3": "❤❤❤❤", "apzaraafernando": "❤️❤️❤️❤️❤️❤️", "kay__ray\nVerified": "Verified", "mhasnam": "Watch the documentary: “Fair or Not?: The Snow White Complex” on YouTube: https://youtu.be/xrd7SV5MAFw", "arthymurugaiyan": "@thebrownbeauty2708 @subashini4598", "shabi_1997": "Well said👏", "deshnie": "Breaks my heart 💔 she's so young and it's sad she feels this way.", "msjeannettek": "@maryjaji so cuteeee", "ashwini_vayyala": "@alekhyaajay", "chokkan65": "@seetha1510", "tiu_sarish": "❤️❤️❤️", "duchesspearlblack": "Lovely! Plus the Srilankan Tamil is just 😍.", "sthuray": "That was heartbreaking to watch! Glad you were able to let her know otherwise.", "feni_shawarma": "❤️❤️❤️", "jolettevaldez16": "😍😍😍", "yrsterrett": "So powerful! Thank you so much for posting ❤️", "pizzapasta2000": "Both are gorgeous girls.", "jennykpoe": "Hated even “liking” this video. This BREAKS my heart. Thanks for bringing more awareness Deepica! ❤️", "sanjay_cinque": "I cryin", "shwayda": "Awwwww love this😍❤️", "holisticswithin": "True self-worth. Beautiful girls ❤️", "pannapantry": "Nalupu narayanudu roopam antaru.and look at you deepica you are such a dusky dazzling beauty. Its so sad that dark is considered not beautiful. We need to change the paradigm🤗", "fridamaria_persson": "🕊Love🕊", "kalpana_thats_me": "❤️❤️❤️", "igotgame14": "♥️♥️♥️", "_.hijabi._.queen": "Masha allah🖤🖤🖤", "likgolden": "You are so beautiful!!! ❤️😘❤️", "beingyamiii": "❤️❤️❤️", "sharyhhx": "❤️❤️✨", "udhayinikalimi_.07uk": "❤❤", "essemasih": "This makes me so sad that the child even thought this was true. So lovely seeing true beauty being explained at this young age, especially in the Asian community. I always got compared to fairer members of my family and people don’t understand how toxic it can be to someone so young always being “the dark one”, especially when so many parts of the world literally fake tan to be darker. I love being dark now and embrace it every moment I can. I love love love this woman for planting the right seeds of confidence in this little girl and I can’t wait to see her blossom into a strong, dark BEAUTIFUL woman like the rest of us. 👏🏾👏🏾👏🏾", "miranda_gang": "Every color is beautiful 🧡", "worldrahmaniacs": "🔥🔥🔥 Beauty resides in heart...", "kanmani___": "awwwww ♥️♥️ This video made me so happy..!!", "luveshan_": "@kieran_govender", "the_ldza": "Wow 💔😭😞 this makes me so sad @von_lis2 - a narrative that’s very difficult to change", "i.rangesh": "Big hugs", "mamtasofat": "♥️♥️♥️♥️♥️", "bo_lefals": "♥️", "nurinbdrol": "@theellenshow", "nivedita_gopal": "That’s so true ♥️ Many ppl reject you for being dark 😔", "invincible_wini": "❤️❤️❤️❤️", "gsen27": "Awesome video! So important to get this message out there 😊", "suhani.gandhi": "Heartbreaking to see how engrained colorism is in society. Loved how the beautiful mother addressed this!", "temd11": "She's beautiful and so r u ❤️❤️❤️", "jackson_netto_": "❤️", "rynerj": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "akkash_james.p": "❤️❤️❤️", "geee_ri": "We need to stop this fair and lovely business and aunties with their horrendous ignorant comments. Love this video 🙏🙏", "vijay__vp": "🙌🙌🙌🙌", "senuri_yr": "💖💖💖👏", "karina_waldron": "Breaks my heart to hear a child say these words. I have small children and it’s so important to speak words of affirmation. Encourage and uplift them as much as you can.", "shamarasfernando": "❤️❤️❤️❤️", "bethatgirlygal": "❤️❤️", "princessgarima": "👏 Love this!!!", "epic_beaches": "💙", "11naina11": "beautiful ... she is beautiful ❤️", "aashni_singh": "Very pretty", "yogawithdisha": "❤️❤️💕❤️❤️ She is beautiful", "i.a.m.dewi": "This is so beautiful. Thank you @deepica 💟💟💟", "_samukam1422": "❤️❤️❤️", "amrit_so": "My heart ❤️", "ndhanar": "♥️", "kiranitajastine": "Beautiful comes in every colour, shape, race and religion.. 💗💗 💞💞", "mindykaling\nVerified": "Verified", "rhea.rr": "Everyone tag fair and lovely @fairandlovely_id", "princess.tezza": "Aww, I always felt like I wasn't beautiful because of my skin tone. Our society had fixed the idea of fair skin being prettier than dark skin. No wonder young girls feel this way 😢😊💜", "the_ressa_p": "This is EXACTLY what should be told to little girls who have darker skin tones all over the 🌏 There should be no more shame that equates color to beauty! Make sure the older relatives know this too.....and the guys when finding qualities in a wife 😊", "lil_sher": "😭 @murrzzz95", "goldengreen123": "She is a beautiful child MA, I cannot believe she’s been brainwashed not to see it, this is so sad! You are beautiful my dear!", "suchitak19": "THIS 👏🏾👏🏾👏🏾", "_anoop_sureshkumar": "💯💯💯", "ahrani.11": "Very important thanks for sharing❤️💛", "npatel_30": "My daughter likes to dress up everyday. When she wears pretty clothes she always ask me mummy do i look pretty? I don’t want to make her upset so i say yes, but every time i say her by wearing beautiful clothes one doesn’t look pretty. You always have to be GOOD by HEART ❤️, Help people in need!", "amigandhi215": "💕", "aditibagepalli": "SO IMPORTANT. I LOVE THIS!!!!!!", "murali_n_krishna": "Beauty is revealed not by the light that shines upon U but by the light that shines within U", "ramyasinsta": "Beautiful 💖💖", "gotcurry08": "❤️❤️❤️", "kinneraaaa": "🧡🧡", "fara_cabrera_": "An unfortunate truth to how society views beauty.... Suchhh a beauitfullll girl !!!", "kendrareidcreative": "😭😭😭😭♥️♥️♥️♥️♥️♥️", "madhavibandhineni": "❤️❤️😍😍😍😍😍 Love both of them and love you for sharing it here", "megthegirlonfire": "With Makeup they did that*^", "cbcookbook": "❤️❤️", "ru.kk.aiya": "💕💯👏", "shelinat": "Thank you for sharing this 💙", "joti_kaler": "❤️ so touching . I always hated I didn’t have fair skin growing up . But now i totally embrace whah skin colour 💙❤️💙", "mangi.ni": "Hey @deepica , just want to point out that that isn't the girl's mom, its @thelifeofasocialbutterfly herself. She's brilliant and amazing!!", "shivaniparepally": "This is so beautiful and true!!!", "jenypathak8": "❤️", "vedanune": "♥️♥️♥️", "aanandhin": "I can SO relate! ❤️🙏🏾", "__framehunter__": "@jameelajamilofficial repostt!! 😁😁", "aabhasingh": "Such an important message ❣️", "akankshaguptaa": "What a beautiful message. ❣️", "naazlif": "Breaks my heart 😞", "songbyrdlife": "This is awesome. One of the most painful things i heard from a relative as a child was that i have beautiful eyes only thing im dark. For years i used foundations that were lighter etc but 10 years ago i realized my worth, value and beauty..... and my white husband cant tell the difference when i get sunburnt😂😂😂", "thrivehigherdaily": "She made this video a while back. It broke my heart as I grew up hearing this from little happy smiling girls as to be their truth. Glad you are sharing this @deepica", "lovieee_voice": "This is amazing ❤️ Teaching kids at such a young age abt their self worth and beauty....imagine being able to change a persons whole life course!! This is what I live for😭", "nicolfernandesmusic": "This is really good, thank you for sharing ❤️🙌", "preyankaa": "That broke my heart when she said no I’m dark 😥 such a lovely message! They’re both beautiful 💕", "_unapologetic___": "I have been this kid for more than 20 years my life!! 😒", "meganpooran": "Honestly Bollywood needs the give the dark skinned girls a chance by now... I’m over it. We’re alllll beautiful", "patrichrisimon": "I'm not crying you're crying 🥺💖", "julesmanikoshy": "💯!!!!", "sarika88love": "It’s sad that she’s so young and have this idea. This breaks my heart, especially in the Indian community I was brought up being told only light skin was beautiful.", "curliciousshanan": "❤️❤️ this brought tears 😭", "elephlora": "Aww my little southie baby", "arjunsivanesan": "Im shock whn she said ths, sme stupid adults😤 hv injectd color discrimination, whr is she frm?? ❤️ ths is a huge remindr to al of us🙏🙏", "hearlywine": "YESSSS🔥🔥🔥", "j0jobi": "Dark is better🔥", "sukhyb_": "❤️❤️❤️❤️❤️ this girl is beyond beauty, just by being her authentic self. Love 🙏🏽", "madhuandamz": "So cute", "galzinha16": "Hey you are so beautiful and deserve to be happy and achieve all your goals. Beautiful princess when u smile the Universe smiles with you and I see in your eyes stars shining. Never let people get you down. Stay blessed!💕😘", "mellkavita": "You are so beautiful ✨❤️", "masuma_khan": "Ahhh love love this!! So important to eliminate colorism that’s been embedded into our community, starting from OUR generation. We are the change makers ❤️ hope more people can appreciate how beautiful every single skin tone is ❤️", "horti_hor_": "Our culture reinforces colourism. As a dark skin child in a light-skinned family, I feel the child's pain.", "anneofkolkata": "❤️❤️❤️❤️❤️❤️", "sravani_ravindran": "Every colour is beautiful 😍❤️ ... love thisss ..love to you Deepica akka 😊❤️", "_saagar_": "@arvind.m1 @suchay_gantla", "nitishdoss": "@siddy.titty @sidmajigud @aditya_chinta30 Chinta you’re beautiful", "michaniyas_anecdote": "To this day the most painful punishment growing up in Jamaica was being screamed at by my aunt and being called “black monkey” or “ugly monkey” in front of visitors/friends because of my dark complexion. I remember always crying privately wishing she’d beat me instead of throwing those painful words at me. It took a while to build up my self esteem from that. I’m so happy that this girl had someone to teach her otherwise.", "__e_r_u_m__": "@shaded 🥰", "rajinir42": "Wow! It is so sad that this is still going on in our country. And sadder yet, that it will continue as much as some of us try to change peoples perception of beauty! We are all beautiful!! What an amazing mother, bravo!!", "faraan_5840": "😍❤️", "ceeladyjanerun": "@livetinted", "hey.itsazj": "😭❤️ she is so precious", "tasneem_sheik_221": "💖💜💟", "music_loveher": "So thankful that she has a loving, affirming mother to offset such a hurtful message. ♥️", "ao_32": "@makeupby_quinta", "jyotiii_u": "❤️🙌🏾", "screammunki": "Colourism runs deep it’s so heartbreaking to see such a young beautiful sweetheart feel that way & you just know she didn’t just come up with that all by herself 😞", "nalla_neelima": "🙏🙏🙏", "sowandareya": "Made me so sad cause this was me as a kid too :(", "betterbeautyboston": "🙏🏻❤️❤️❤️ I love this message thank you for sharing tears in my eyes", "aluzmaa": "❤️❤️❤️", "ingridnatalie": "❤️❤️❤️♥️♥️", "smallbrownfemale": "😢😢", "kerinamoodliar": "Love ❤️❤️❤️", "600shreyas317": "I love this!! Thank u!! 💓💓💓", "ranimirzabeauty": "Beautifully said ❤️❤️❤️", "iamcreeikuko": "😢❤️❤️ she’s so beautiful it hurts me that young brown girls still going thru these horrible thoughts ❤️❤️❤️🙏🏽", "hsp2019": "🙌🏼", "chaganti_srilalitha": "Awesome 😍👏 after a long time I saw a positive post. Rombha beautiful pa ni colour and features will not help you in long run. Your character and behavior are extremely important. Dont lose your character and stay healthy and happy", "anjana.r.chandran": "The Devi in Hindu mythology is dark skinned and stunningly beautiful. Nobody should be telling Indian (or any dark skinned for that matter) girls that they’re any less gorgeous. Thanks @deepica for sharing this 💙🙏🏽", "bhavya.jenny": "I can see my self in her. I was the same little girl when I was about the age where I would be feeling the same insecurities of being dark and not finding someone to get married .😂. @deepica", "farinarenato_": "Love 💜", "sinishashetty": "I think they are sisters", "vickytsai\nVerified": "Verified", "masserata": "@deepica how is your sister? And your nephew? Been waiting anxiously for any news!", "allurebyjb": "I was once that little girl. I’m so happy there’s so much more awareness now. And mother’s actually take part in making sure their kids always feel secure no matter the color of their skin @deepica ❤️", "nunniehilton": "❤️", "mymafalda78": "Thank you! I know what it is, having fair colored sisters and being the only one who is “dark”. I have learned to be proud of me, proud of my skin color.And yes, she is beautiful, and we are beautiful! @deepica @noornoordin #colorism #darkindie #africanbeauty", "olegbuller": "🙏🏼 Amen", "sella_nyrealestate": "Beautiful ❤️❤️❤️❤️😍😍", "curlycaramel": "Melanin is magic!💫✨", "aditi_.suryavanshi19": "❤️", "alnewmum": "Beautiful girls with beautiful hearts 💜", "pranay_sonkar": "@cheyennejewelig", "nb___ab": "I’m not crying. You’re crying! 😢😍", "gutsygirlmd": "This! I've always heard from extended family about how dark I am. Had a lot of internalized trauma with it growing up. Glad to see this being discussed more and learning to love yourself no matter what color you are. 💕", "abhanjdeo": "🙌🏾🙌🏾🙌🏾", "eshidas_": "💓", "natashaduttartistry": "Love this so much ❤️", "kuvanya_naidoo": "This is beautiful ❤️", "msviji": "@dcook0627", "suedwiges": "👏👏👏", "saleelmh_indian_on_board": "Respect... 🙌🙌 Much amazing❤️", "py_payal": "❤️❤️👏🏻", "zaraeve": "When I was very young my aunt would visit from Europe and would always comment on the colour of my skin, how dark I was, how ugly I was, and unfortunately my mum never stood up or defended me or explained to me that skin colour didn’t matter. It took me decades to be able to let go of the insecurities associated with those comments. It wasn’t actually till just a couple of weeks ago that I day my mum down and told her how that affected me and how her not defending me made me feel like my aunt was right. I am determined to make sure that no kid in my life ever has to feel that way and that they all know how amazing and beautiful they are just as themselves.", "yshellemonet": "♥️♥️", "zaraa.faatima": "❤️❤️", "darkbrownbykeisha": "This is beautiful. I definitely had this thought process when I was a child. I'm dark, therefore I'm not beautiful. It's crazy how it's naturally instilled in our lives. It needs to change! Thank you for posting this ❤️❤️❤️", "sassychiclet": "💗💗💗", "karl_____marx": "❤️", "champakcollectives": "YES YES Thank you for sharing!! 💕 This hits home as a Bangalorean. The colourism especially prevalent in Southern parts of India is rampant. Cheers to this woman for changing that narrative!", "mauleetolia": "♥️♥️🙏🏽", "pravs08": "I absolutely love this... thanks for sharing❣️", "spookynorthodox": "This made me tear up", "msjomani": "Yeees!! This gives me the happy feels!", "spansnaps": "Absolutely! I wish we could tell more girls in India to not let the color of their skin define who they are. Growing up I always felt the same way and now I wish I saw more dark woman tell me the same thing. Kudos to the mom and you for sharing!", "dsingh01": "@farihahaa it’s cool, not like I’m here sobbing or anything", "ashumi.s": "❤️❤️❤️❤️❤️❤️❤️", "itsvanessa_x3": "My heartt 🥰🥰🥰🙌🏼🙌🏼", "apexfit9": "Amazinggg @thelifeofasocialbutterfly", "shreenu_king": "❤️🥺❤️😭❤️", "eatprayslaysis": "My heart ❤️❤️❤️", "kinjil": "This hits me so hard. I do not want the next gen dealing with the same limited beauty ideals we grew up with (and still face). 💔 Keep spreading all your light @deepica!", "nazishmona": "♥️♥️♥️♥️", "william_sharlin": "❤️❤️❤️", "thinkaholick": "❤️❤️❤️", "dramypatel": "Beautiful ❤️❤️❤️ this mom is beautiful!!", "tj_den": "Growing up in India having a mom n sister who had lighter skin , I had almost convinced myself that I was adopted. This video made me feel for that girl...kudos to her mom.", "nel.vv": "❤️", "qu33nvictoria": "BROWN GIRLS ARE BEAUTIFUL ❤️💚💛", "nik_thornton": "You are so beautiful 🦋", "vxranii": "Love this message ma🙌 keep spreading positivity and joy 💕", "kirnibee": "This is beautiful ❤️", "lisaaunaturale": "I love this.", "doctormenon": "Awwh 😭 Best mom right there!💙", "vidamomlife2": "I cried...brown girls are beautiful!!", "aludd_1207": "I’m sobbing😭❤️ I’ve felt how that little girl feels. I’ve been told a boy wouldn’t like ‘girls like me’ by bullies. I was the “different” one. I’m so happy her mom is planting that beautiful seed into her head early on", "the1_odav": "🧡🧡🧡", "farsalicare\nVerified": "Verified", "naligav": "👏👏👏👏👏👏", "hopeandcelebrate": "This is beautiful!", "sarahstewart.beauty": "This hit me HARD 😭💗", "sooallison_": "It’s so sad because it’s almost in every culture that being dark is bad and it’s not !", "mi_gudu": "Omg!! I don't know how many times I was told that I was dark or my features are not pretty when I was little. This is amazing!! What a mama", "youngcouture_": "My heart ! I love this ❤️❤️❤️", "mudrasanghvi": "I LOOOOOVE THIS!!!! 👏👏❤️", "kikiclassics": "this is both heart warming and heart breaking. that little girl is absolutely beautiful. I wish we were able to see that in ourselves at a young age rather than adults. it took me until I was in my twenties to fully embrace and highlight the color of my skin. thank you for sharing this @deepica ❤️", "radiorah": "❤️❤️❤️", "bristina_": "👏🏽👏🏽👏🏽👏🏽 @thelifeofasocialbutterfly ♥️", "mer_h12": "💛", "neeshas__world": "💗💗", "empressjasmyne": "Oh my. @jordan_game6", "fashionably_llate": "@laynilaypang @jaylajey_wanders", "canes2375": "This is some legit Indian truth right here. And kids recognize it so early. I don’t know if it come from our colonial past or it is from the remnants of the caste system, but kudos to the mom for letting her daughter know she is beautiful. 👏👏👏❤️❤️. This really made my day 😊😊", "thegrandtrunk_official": "Love it ❤️", "cherooona": "@deepica 👌🏽🙌🏽 hit the nail", "raheena_rahman": "♥️♥️♥️♥️💯", "michaelavarughese": "This is beautiful 💜", "_pharmartist_": "Omg my heart 🥺❤️🙌🏾", "zeyhash": "@samerthmalhotra you’re beautiful ❤️", "najafk": "Tears in my eyes. Bless this child. May she refuse to believe that her beauty is defined by her skin color", "ramonasworld\nVerified": "Verified", "shereenbairavi": "This is amazing @thelifeofasocialbutterfly", "ahddarhs": "Just showed this to my Pati, who smiled and agreed with the sentiment and also identified exactly what region this Tamil dialect is from 🤣", "missxlala": "♥️♥️♥️♥️♥️♥️", "tlapsia26": "Crying in the club 😭😭😭 thank you for this ❤️", "micaelaramsamy": "This made me cry , I’ve been struggling with this for my entire life , being made fun or or being called ‘dark dark ‘ , being asking if there will be foundation for my dark skin .. it made me look into skin whitening etc , so well done to this girls mum for making her feel beautiful because she is", "nehassawhney": "🙌🏼🙌🏼🙌🏼", "sher925": "🙏🏽👏💪🏽", "sanukorah": "❤️❤️❤️❤️❤️", "deepikapn": "@madhuwho sry just crying brb", "parisamirzaei__": "Awww this was so beautiful 🙌🏼✨💕", "poooja21": "Aww she is so cute 🥺♥️", "dancing_dimples": "🙌🏽", "vanessafox87": "It’s sad that cultures ingrain in us that dark is not beautiful. As a young child my mom would keep me out of the sun so I wouldn’t get dark. We have to change that mentality!", "meehswmer": "💕 ❤️ this. I wish more of my family would have this outlook in India", "nikkita_moodley": "♥️♥️♥️", "christabelle_bensam": "♥️", "rafiahhaque": "@hosnasalehi", "maquillajealamexicana": "🔥🔥🔥🔥 👏👏👏👏👏", "kukuroshu": "❤️❤️❤️", "kanika_ahujaa": "The society needs more of this reassurance!! Absolutely love this video 😍😍💕💕", "neisha.a.r": "An important message to all little girls! 💗", "vinkytinks": "Raw beauty ❤️", "sabrina.j.persaud": "❤️❤️❤️❤️❤️", "soumya_bethapudi9": "❤️❤️❤️❤️", "gg_lemoine": "I’m not crying 😭 ❤️❤️", "selfcarebysafia": "😢", "singhalpriya": "❤️ ❤️❤️", "mslebee": "💕", "rashmitha89": "True ❤️❤️❤️", "jasminegmehta": "♥️♥️♥️", "rupibawa": "Love this.. in tears!! && @deepica you’re so inspiring, love that you’re bringing light to this...we, as women need to remember we are goddesses🙏💕💕and truly uplift & support one another...", "vana_miller": "You keep telling that beautiful lil girl just how gorgeous she is!! ❤️❤️❤️", "allisternaidoo": "Damn. This really touched me❤️. Brought tears to my eyes, seeing this beautiful child thinking she isn't beautiful because of the colour of her skin.. so young and to have that sort of mind set.. my school life was absolutely miserable due to me being dark skinned and overweight and it destroyed every bit of confidence. No one should EVER feel low, not good enough, not beautiful because you dont meet societies BS standard of beauty. You are beautiful!", "subhashreeb97": "This is just too beautiful 👌. Though it is sad in some level that a girl that young feels conscious of her looks.", "jishaphilip1": "Yes yes! What an awesome message!!", "megan.dingler": "Beautiful ❤️❤️❤️", "daristarhk": "♥️😍💯", "hfer1": "@mandydante_", "aditidurgapal": "Thank you! Absolutely right. The little girl is already beautiful!", "alexandria.withlove": "This honestly made me cry. What is it about lighter skin that makes it the standard of beauty? Exactly nothing. Exactly nothing.", "debflows": "😭", "thechaimommas": "💛💛💛💛", "lifewithpooja": "@deepica omg broke my heart when she said no because I’m quite dark 😩🥺 she’s too young to be thinking like that.", "abykall": "😍", "drishti24_3": "You are beautiful lil girl 😍❤️", "thehoustonmarina": "👏🏾😭👏🏽", "ardilahadams": "love dis we all beautiful females regardless of race or colour 💜💙.", "farah_g_razvi": "You can just see this little girl soaking up her mother’s words and filling up with pride ❤️ and she really is a beautiful child", "getvithit": "❤️❤️❤️", "shannonhyatali17": "So so needed. Thank you @thelifeofasocialbutterfly for reassuring me, a now 24 year old still struggling at times! 🙏🏾❤️", "trickynik33": "Wow! What an amazing mom!!! I love her! ❤️❤️❤️❤️", "lamarr44": "This is amazing.... ❤️❤️🙏🏾🙏🏾", "notyourwife__": "❤️", "macupgeek": "@alinaabdool 😘😘😘💕", "bejeweleddesires": "That little girl is beautiful and her smile is infectious. Bothers me so much when people mention skin color. I've learned to somehow tune it out now but unfortunately many aren't able to ignore the negativity they get. I'd like to believe that progress has been made though with more representation of different skin colors/cultures/races in mainstream media and then thanks to you having more products available.", "kajubabe": "😭😍 This makes me so sad and also so very glad. Sad because not every girl will get this sort of validation and glad because there are women out there changing the game. Women like you. ❤️", "queenbee.patel": "🙏🏽 For posting this. Why is dark a negative “thing” in our culture? Where did this idea come from? They think it’s “OK” to make fun of it. Dark=ugly. “Oh...it will be so hard for her to find a good husband bc she’s dark” ...WTF", "roshnnnipatel": "❤️❤️❤️❤️", "its.priyaarora": "♥️😊", "nischay_jairaj": "@esai_serene", "model.pb": "Her complexion is beautiful! My boyfriend is the exact same color❤️", "whey2wellness": "This is beautiful in so many ways. Literally crying. Thanks for sharing! ❤️", "breamichellee": "@abidagrg ❤️", "sharu.sr": "👏🏾👏🏾👏🏾👏🏾😭❤️", "tejadb84": "Love this! Such an important message ❤️", "dilustag": "This made me emotional, such a sweet empowering mother reminding her child exactly what makes her beautiful ♥️ love this!!", "tkmullick84": "❤️❤️❤️", "_nikita3": "Love this @devm4", "anu.malihan": "i feel so sad.. My friend also used to say that, she wanted to exchange my color with hers. I felt so sad, had to keep reminding her how beautiful she is.", "anuprakashtv\nVerified": "Verified", "phoebe_leah_thomas": "@megan_rooyan", "jenira": "I love this so much 😭💕💕", "preshanti_c": "I really resonated with this video", "__riyaaah._": "💯🔥", "kulture_khazana": "Thank you for sharing this message. Growing up in India where “fair is lovely”, it’s great to see all shades celebrated.", "sheetalrpurohit": "Awesome😊💙💙", "ramila_khatri": "@smriti8964 @khatri_sabita5634", "pooja.rudra": "@shamitaaax3", "simplyskinluv": "♥️", "lo_v_inixious": "This is so beautiful🥺😭these r words I would’ve loved to hear as a lil kid 🙏 so much promise for the future tho love love love💗", "dasari6": "❤️❤️❤️", "ellelouisemcbride": "I love this so much xx", "viva_la_kamaura": "I hate that black and brown children have been taught to hate their skin and features. It’s so opposite of what is real. Look at her! She is beyond beautiful! And that skin is radiant honey! She has no idea the gift that she holds from God but thank you to this woman for mentoring this young queen ! 💕👑", "aishaxo": "❤️❤️❤️", "pripritri": "💗💗💗", "anushka_raves": "Ok I’m glad he’s learning this way but for a second he just looked at her like what did I do wrong", "jyotiparmar5": "Amazing! 🙏Thank you for sharing fair or dark! Skinny or fabulously phat! 😉 We all are amazing no matter how god made us! Coz god doesn't make mistakes 😊😊😊😊😊😊😊", "bbtavia": "Aweeeee this is gold..... love this.", "nina.pure.minds": "Love this. Thank you for sharing. 💙🙏🏽", "jahnavi_0619": "🙌🙌", "hey_lynnstagram": "❤️❤️❤️", "rachynana": "❤️", "shiwram_03": "This break my heart in pieces", "inspired_mika": "😍🙌💕", "nikitadas92": "@dipika02 @hizzad92 I felt this! Love this video", "_.sahii.__": "🙃😢❤❤❤", "catchingkattu": "@febasquires sounds like half Malayalam/Tamil maybe?", "rukeya321": "She is the most beautiful girl! Skin colour does not define your beauty! Dark is beautiful!!!", "nidhisunil\nVerified": "Verified", "nikhitha_rajanala": "Beautiful❤️", "all.things.beautifull": "💜This.. wish we can brainwash all the aunties !", "millennial_moma": "My sister is much lighter than me and I was always called the “other one” “dark one” or “beautiful girls sister” and honestly it made me laugh. My sister hated it but I took it lightly, it never hurt. I guess it would be good to share my mindset with other females to help them realise they’re beautiful and it really doesn’t matter what others say, it’s how you see yourself. ❤️❤️❤️❤️", "taarimaa": "More of this! Growing up the darker one who tanned too easily wasn’t fun. I love that the stigma of “dark” is starting to diminish 💗", "hetal_mabelle": "Love this to bits!! Always told I was so dark and why was I still dark if I moved to Canada. What a beautiful message that everyone needs to hear. ❤️💜", "indian_art": "I remember when I went to India to get married. People would say that oh she’s pretty. But she’s dark. And it was something I would always hear. And it made me feel so bad. Like I was defective. Despite so many Indians being dark. It’s just something that a lot of them don’t find beautiful. So it just made me more strong.", "div_d86": "This is such a great example of the grass is always greener. Dark people think fair is beautiful and fair people get tanned. You’re beautiful just the way you are! Embrace it!", "doratheotherxplorer": "❤️❤️❤️❤️", "nunukiinz": "She's fucking adorable !!!", "dayswithdev": "It’s breaks my heart brown and black babies around the world feel this, as I’ve felt it too... sending to so much love to this beauty ❤️❤️❤️", "haynikay": "❤️❤️❤️❤️❤️", "inesmirpuriamaral": "❤️", "drivenbypurpose85": "Thank you for posting! This is so beautiful ❗️😍😍👑👑", "celesteteresa_": "Awwwww !! Thanks for sharing 🙏🙏🙏🙏🙏", "snacksbysayed": "Yes, you are beautiful sweetheart❤️❤️❤️", "lcamorris1": "Please this gorgeous girl she is BEAUTIFUL!! I am very light skinned and look at your dark skin and wish I was dark...we always want what we dont have. Funny. She is beautiful and ensure she remembers this for her life and never let anyone tell her otherwise xx", "sapivijay": "❤️❤️❤️", "shavaejasmine": "Colonized thinking that plagues children everywhere. We need more adults like this. Plant that seed EARLY", "hellobrowneyedfox": "Homie be making me cry 😭😭😫😫 south Indian girl here feeling this so hard ❤️", "jkk3008": "Errrrr... Deepica, that’s not the child’s mother but a young woman. 😜😄", "tummydiaries3o5": "To be honest color does define a lotta beauty", "forquotesake": "This just breaks my heart I think a lot of us Asian girls have been told this all our lives that being fair is more beautiful. But this is simply not true. Why is a rainbow not one colour then? ❤️", "thisisprianca": "India has a long way to go! We have only started to address this. Big corporations are making money selling a promise of making both men and women fair because ‘fair is beautiful ‘ . I am dark skinned and I didn’t know it was a bad thing until women in the malls started asking me if I wanted a fairness product. They made me feel like I have a infection that will be cured with a ointment. Absolutely disgusting marketing techniques. Which is why I have a huge respect for @livetinted and the products you guys are getting out there for humans of all colors 🙌🏽🙏🏽", "vinziiz": "Thank you for sharing this. This is beautiful ❤️", "drvisha": "Was told I would not get married if I went outside and got any darker... skin bleaching creams with dangerous ingredients like hydroquinone have been used for decades. Colorism- This needs to change thanks for getting the message out.", "ruby.w.khan": "OMG🥺 This is what needs to be taught to all little girls. Specially when the desi community is always fixated on the most obnoxious things like skin colour and body images to define what beauty is!!! What a amazing mom", "ms.jaytee": "💕💕💕💕💕", "deepal_b": "❤️❤️❤️", "mydreamistotravelworld": "Wonderful story! 😍", "bee.jewel": "This is the sweetest! I love this. I’m glad this is how my day started.", "rishi_sawant__": "Beautiful 🦋💓", "walai134": "@madonna 🌸", "costa.aalessandra": "I can see change on this matter for the future generations. awareness has been growing and growing! 🙏❤️", "khushiguptaa18": "❤️", "lightful_23": "So true thank you deepica for sharing 😍🙏🏾", "rajesh_loganathan": "❤️❤️❤️", "stitchyourlife_": "Wow😍Check me out to more productive and become happy ❤️", "lnishal": "💯💯💯", "shimmy1shimmy2": "@sonia_sultana1501 @saminah_begum @mehwy89 @__akak06 ❤️", "goenkajewels": "What an absolutely incredible message for all the young girls! 💛", "farahfashionsnyc": "😭😭😭😭😭 So precious! We are all beautiful. ❤️❤️❤️", "cakesbyshanadanial": "What a beautiful message, I am truly touched. 😘", "dshana_raj": "❤️😭", "nsabm_p": "😭", "vidrohi_aatma": "Love thisssssssssss..... more power to all of us ....", "ann_singam": "Fuck all the aunties, uncles, cousins and random people telling me I wasn’t beautiful cause I am dark skinned. WE ARE GORGEOUS MVP’s!! 🙌🏾💜💜💜", "neeldatta": "@anand.1.9 you’re beautiful", "gayanisworld": "What a great message. Thank you . 👏👏👏👏👏", "erikarazzaque": "Love this. So so much. 🌈🌷", "_sinister777_": "Love this. Colorism is much alive in this country", "purvidave007": "Every skin type is beautiful and we should be teaching the youth to love themselves as they are. I love your mission deepica. Keep on going girl!", "deepikamoti": "@sharla.moti", "tamandrie": "Beautiful 💕", "costaelsa": "❤️❤️", "marcyj___": "🧡", "roksana_boldys": "💜💜💜💜💜💜", "marielaure_lovetherapy": "@gjwaf ❤️", "davinder_phullar": "🙏", "abeersharief": "@akshaya_rachan", "imamandeepnagra": "👍🏻👍🏻👍🏻👍🏻Yess", "niabheda": "❤️❤️❤️", "iamgigiiiii": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "diipakhosla\nVerified": "Verified", "sonisoniasingh": "@emmy.jeolina 💕💕", "_herisha": "I swear it makes me cry when I see people hating themselves because of their skin colour just because society made them believe it's something to be ashamed about!", "tharruniyakannaan": "Every shade is beautiful!", "ladinasingh": "🥺❤️", "misbahraomakeup": "We are all struggling to love our flaws but definitely teaching my daughters’ self love is paramount ❤️", "mahithakasturi": "❤️❤️❤️❤️", "rominaasray": "💯❤❤", "sabbyjeyxx": "@thelifeofasocialbutterfly I was like omg this voice sounds so familiar", "mohd___nishal": "❤️❤️💯💯", "ricksmaart1": "Thanks @deepica for sharing and @thelifeofasocialbutterfly for creating this. I can’t even express all the emotions going through my mind right now. My grandma would say: girls need to be fair. I’ll make you a face mask to help with that. Thank you for starting a powerful conversation. Change will happen slowly but surely. Until then, we’re in this together and we #LiveTinted #LoveTheSkinYouAreIn 🧡", "triciahon": "This made me tear up. Such great advice. Sharing 😊", "sansaar__kaur": "Oh my lord, in what world we live? How we program our little ones to have that belief systems about beauty. Shame. 😞", "susmithakanapala": "❤️", "harpreetbains": "♥️", "amazingpilla": "❤️❤️❤️", "sannakhursheed": "🥺🥺🥺", "yasreen89": "🥺❤", "pmehair": "I can’t believe people are still obsessed with skin colour. It sickens me. We are all beautiful no matter what our skin colour is. Attitudes towards skin colours need to change. I’m not surprised the little girl said what she said. In India they are obsessed with being fair skinned. The fairer, the more prettier. That’s why there’s a push to sell skin lightening products. Disgraceful.", "shanazpackeer": "💕💕💕💕", "dwestcoast1": "❤️", "sajeeranair": "You are so beautiful baby girl !!", "angeli.hope32": "She’s not the mum 😃. I think it’s a girl that she met in her holidays or relatives.", "danisha2909": "Love this and what u promote 💕 everyone is beautiful", "gul_sosan": "Love this so much!! She’s is so beautiful 😍 and kudos to this lovely mom teaching her baby she is beautiful regardless of her skin color 🥺♥️", "iam.papatiben": "❤️", "faithliu81": "Love this!!!🙌🏾💜", "nga_hine": "Oh sweetheart, you are beautiful just the way you are, a very beautiful little lady, who will grow into an amazing, strong woman, with a kind heart 💖", "vyaarii": "Love this! Heartbreaking to hear her make that comparison at the start (with a beautiful smile nonetheless!) ... What a relief to see that negative thought showered with words of confidence and empowerment to be her most beautiful inside out. We need more of this and less of \"yes...just try xyz to lighten the skin and you will be fine\" @beautyandthewifelife I know you will love this video too!", "lifeinsatiable": "This is so beautiful and being a mother of a little girl, it would break my heart if she even thought she wasn’t beautiful because of the colour of her skin. Every shade is beautiful and wonderous. 😩💚", "sai_harshitha": "❤️❤️❤️❤️❤️", "renuka_____": "@__mrsl my heart!!! Ik kan echt huilen😭", "bloomingalchemy25": "❤️", "desiboy.com.au": "THIS IS BEAUTIFUL! The exact MESSAGE MORE YOUNG DESI BOYS AND GIRLS NEED TO HEAR! Not the opposite bullshit we hear growing up! It’s SO EMPOWERING AND SO BEAUTIFUL to see the smile on her face when she is told she is beautiful and there is nothing to be ashamed of! THANKS deepica didi for posting this 😍😍😍😍😍", "freya_patel": "c", "linawilkins_": "As an apparently dark Indian girl.. this was so beautiful to see and hear.. and to know this still exists.. 🙈😅", "haridalankan": "Beautiful & kind mother 👑", "archie_mup": "My sister has lighter skin and i am dark. We are eight years apart. I am the baby of my house. Growing up everybody used to compare our skin tones and talk openly about how beautiful my sister is and how lucky she is for her lighter skin tone. I always thought i was the uggo of my house. When i was about 5 years old I remember My sister telling me that ‘people who are born dark become lighter after growing up and people who are born lighter get darker growing up’ just to make me happy. She used to fight with her friends and cut ties with anyone who compared our skin tones. She always used to protect me. At age 10 i was convinced that i could never be beautiful and i would rather be successful to have a chance in this society, so I studied hard and kept sailing through comments about my skin tone. I was told that i have really good features and if only my skin was lighter i had a chance in life. Imagine hearing these sort of comments at a tender age of 5 or 6. It sure is the worst trauma for a little girl. When i turned 18 i had a lot of boys following me around. I never understood what they saw in me because i was convinced that i was ugly. I moved to the US at 21 and white men asked me out for dates and i slowly started to realize that I wasn’t ugly and my color was not a barrier for my beauty. I has this sudden aura of realization that dark is beautiful too. That was my little story growing up. Watching this video brought back my childhood memories. Indian society is harsh on darker skin tones specially for women. When i was in India last summer i was looking to buy a simple moisturizer in a market. To my horror every product in the market including soaps were ‘fairness’ enhancing. Really frustrating to see that. Pretty sure there are thousands of little girls who are already convinced that they are ugly just because they are dark. This has to stop. I love how live tinted represents all shades of beauty. Big fan of the product and @deepica.", "roseanebflower": "💙", "petiote77": "❤️", "amanda.ygk": "Funny, just yesterday my mom was freaking out because I went to mow the lawn when it was still sunny out.", "shruthiyamajala": "This ❤️🙌🏼", "jackieakamaria": "@deepica love this and my dark skin, and dark circles! Proud South Indian mama! Thank you @livetinted for bringing this message to the brown skin community!", "pupski2014": "@deepica you just made my day and made me cry ALOT 🙏💕", "lizzymathis\nVerified": "Verified", "retro.und.ich": "Omg, I almost cried watching this. I’m biracial and in my childhood I felt so less beautiful than my blonde cousins. It means a lot having people like you in Instagram, to show the world how beautiful each of us are 🙂", "nikitadolivera": "Thanks for sharing this 💕💕", "m00nlight1432": "♥️♥️♥️", "sahithiireddy_": "❤️", "v1nu_sa": "This is so powerful. Being an Indian I know exactly how important this is", "akx.z": "So cute!", "sameold83": "I cried when she said no coz she is dark. Growing up with fair and lovely all around you makes one feel that including me. We need more people especially family members make little ones feel beautiful irrespective how dark or fair she is... hats off @thelifeofasocialbutterfly", "sonali.1702": "❤️❤️❤️", "78_lissette": "😍😍😍😍😍😍😍😍😍😍", "munnuparle": "Ask little girls about their future careers and talents instead of appearance", "ektaliscious": "Beautiful child ❤️", "apple_doctor_": "@deepica this is beautiful, I had a 1:1 make up lesson with the lovely @madeleinelovesthis yesterday and was so thrilled to see her use @livetinted I recognised it immediately. She had nothing but praise for how hard you work and this made my heart fill with joy ❤️", "brwngll": "❤️❤️", "ishadi_amanda": "😞😞😞", "shivashirani7": "❤️❤️", "hamsha.s05": "This girl is literally me when I was young. Now I understood that Dark skin is just stunning and there is no shame.", "dush81": "So beautiful! It’s an important message to keep communicating with our daughters that dark is beautiful 💕", "akansha_jha": "So beautiful", "lanapatelxoxo": "This is so beautiful", "trueloveconquersall": "❤️", "sandyytandy": "That is actually @thelifeofasocialbutterfly in the video! 🙂 Not the little girl’s mom.", "julsi3c": "😭😭😭😭❤️❤️😭😭😭❤️❤️", "ofwhimsandwords": "She is beautiful 💖💖💖", "foodie_nishi": "Omg that mom knows what's up 😍 so much respect ❤️❤️❤️❤️", "sincerely_rekha": "💗💗💗💗💗", "saznaz93": "@deepica thanks so much for sharing this! Just out of curiosity do you understand Tamil?", "jess326": "How sad that a girl that young thinks she is less beautiful because of her skin tone. She is beautiful! She has beautiful features, a bright smile, you can even see her heart shining through. Hopefully she starts talking to herself differently. I used to hate being as fair as I am, but I’ve embraced it and I don’t try to tan any more.", "akkinenianjali": "🧡🧡🧡🧡🧡", "ruchikabillo": "🤎 🤎 🤎", "shravbsty": "@thelifeofasocialbutterfly @thelifeofasocialbutterfly @thelifeofasocialbutterfly", "lissaleilani": "😭😭😭😭", "mithila0704": "❤️❤️❤️", "shhidaah": "@kash_notcash @rxmiyx.ee", "anjanee.dietitian": "I was not ready for this so early this morning 😭❤️ such a beautiful message to tell children from such a young age ❤️", "charishmaviswanadham": "I used to feel so insecure about my body and my colour! And people do bother about 'your' colour 🙄! Many diy tips , many names and many satires !! But, when I met the real people and read the real books, they made me realize that every one is beautiful in their own way!! And I did realize I am more beautiful 🙈😄... I will be beautiful !!love you Deepica and love that duo in that video for making my day❤️❤️", "bincy_baiju97": "I had tears watching this. Growing up with insecurities about your skin tone and people calling you out coz you have dark skin.. its tough at that age.. i grew up with this same insecurity. Trust me a majority of this issue is with our society. As a kid i had problems even choosing bright color dresses too thinking it might look even darker on me.I started realizing and loving my skintone after a random lady who ran to me on a mall while I was working there and she said I love your skintone.. you are so beautiful 😍. That was the spark.. I started realizing then..people spent money to get tans .. look we are born naturally tanned!!Now I don’t have any problem in saying am a brown damn beautiful girl. This is who Iam this is how i was born.. I feel like it’s important to appreciate others beauty no matter wht color they are.. I follow you Deeps u inspire a lot of brown girls like me to make ourselves feel proud of who we are. #letsbethechange lets appreciate the beauty.. maybe we can be like tht random lady who made me think about my skin tone. I loved the lady in the video.. and yes tge kido is beautiful ❤️❤️❤️❤️", "styledbykhatera": "Words 🙌🏻🙌🏻❤️", "thelifeofasocialbutterfly": "Oh my gosh I am truly lost for words right now. Firstly, from the bottom of my heart THANK YOU @deepica for reposting this and spreading the message. I have been following your work for countless years and truly appreciate all that you’ve done to create a space for inclusivity and diversity. Breaking barriers as a south Asian woman and just your hustle. You’re so cute hehe I’m not a mum yet hahah ♥️ but this little girl is like a little niece to me 💗. I really genuinely appreciate all the work you’ve done especially through @livetinted for people of colour and also unpacking the topic of shadeism and colourism. I truly hope we can work on something together in the future. Lots of love to you beautiful ♥️", "iamvandanasingh": "I’ve seen that those who have dusky skin have THE MOST BEAUTIFUL FEATURES 😭💕", "nishi_writes": "Great msg to train young minds helping them love themselves💕💕💕", "faiz_syed7259": "MashaALLAH:,) ♥️", "namithabeach": "❤️❤️❤️❤️❤️", "charsydney": "🙏🏾🙏🏾❤️❤️👑👑", "santhoshinikannan": "👌🏾", "tofficial__xx": "I admire this video ❤️❤️❤️❤️", "tinaben2691": "@benitanarayan somewhere in world this issue is addressed also just to put you in my thought as I watched the Jazbaat program", "briannadahlquistfox55": "I love this ❤️", "nasirshams": "🔥🔥🔥😍", "davina_2301": "People should really stop this color shaming. Everyone should be proud of his/her skin color and origins! I remember when i was a kid i found myself too dark but now i wouldn’t change anything. I love my tan skin 😊", "karina_nepalese": "🙌😍🔥 God bless this gorgeous mom with big heart ❤️ and her little beautiful girl 👧🏽 🙏🏽😍", "moe": "♥️🤎♥️", "susieesparks18": "❤️", "salmeenh": "I got all teary-eyed. Beautiful girls 💖", "pj5johnlewis": "Yessss🙌🏽❤️", "hansikabainsla18": "What an important message thank god ❤️❤️❤️❤️❤️", "ezzyelzi": "So so important😭 and she’s so so beautiful!", "sumayyah_khan": "❤️❤️❤️❤️❤️", "umisha.m": "I’m nearly 33 and always struggled deep down with this. I’m the darkest of all my siblings and always wished to be lighter so I could be as beautiful as them. The stereotype that only light can be beautiful so so damaging and although now I know better, it’s still something that is very difficult for me to shake off. Thanks for sharing this video, more needs to be done to show that every colour and shade is ‘acceptable’ and every single person is uniquely beautiful 🧡", "sai.surya.prasanna": "Dark is beautiful!!", "diarrhaxo": "Oooohhh 🥺🥺🥺🥺😔", "6lmonae": "She is absolutely gorgeous! They both are! You’re so right all women are beautiful no matter what shade! I hope she truly learns that she’s beautiful, feels beautiful and lives beautifully! Cheers to all the beautiful women and girls across the world!", "minni14": "So proud 🙌 of you ❤️ just makes me so emotional 😭..God bless sweetheart 😘", "vacation_s_a_vocation": "Its sad how we dark skinned girls have accepted, from very young age, this reality that we will never be as pretty or attractive as our fair siblings,its clearly conditioned..", "missusolivegreen": "❤️", "nightstylebnb": "Video makes me cry. I can’t stand the fair/dark foolishness that goes on.", "eesha.gulati": "💕👌🙏", "mirelle_kalesta": "This is heartbreaking to see! No child is born thinking that they're not beautiful 🙈 This is what people around her has said to her so much so that she's made it her identity. She's sooo young and no person deserves to believe that they're not beautiful. We, as a society, can do better!", "krisoninsta": "Beautiful ❤️❤️❤️❤️", "parimal_bakrola": "It's can't beleive how such a little girl got exposed to such ideas so early in her life. Very wise and sweet older sister 👏😁", "nikeeeets": "Aww ❤️ @shreyamaharana", "srilekharayavarapu": "😍😍😍", "makeup.bynami": "This is beautiful! ❤️❤️❤️", "ariendsouza": "Awesome!❤️", "romcom85": "I really needed this love ❤️", "beautycall": "Aww this is so beautiful! She is beautiful! ❤️❤️", "iisamhii": "Thank you for posting this :))", "smithaearl": "Thank you for sharing this post @deepica ♥️ this is a very strong message that all the little girls need to know... I used to be one of those little girls strongly assuming that my colour was the reason I wouldn't look beautiful... So grateful to women like you and a million others who are inspiring all the girls and women to stand up for who they are and to believe in themselves ♥️ Thank you... For continuosly working towards making this world a better place to live...", "mwapemiller": "It hurts seeing this because my niece used to wish to look like the white kids in her school she is darker skinned, but so beautiful, we are African, and my mum is Zambian and my dad Moroccan. I'm really light my mum and I came out the lightest in our whole family and I had issues with being so fair while my whole family had this gorgeous medium dark to really dark brown skin and when my niece was born and I was her main child care giver after school and weekends from ages 3 to just before lockdown, I would always tell her how gorgeous she is and how she has her beautiful afro hair that everybody loves with the amazing styles she can have it in and everyone wishes they could do with theirs and her gorgeous eyes and such a heart warming smile and she truly now loves herself! She once asked me why I was white with a bush on my head like hers n all I could say is because God made me like this and we are the same brown people just I came out light and she came out darker and my bro who is her dad is darker than me too, so i just showed her all the ranges of beauty in the different shades of black there is! The majority of her friends in school were white so she used to wish for long, straight, blonde hair, so I would wear mine out to show her how beautiful natural is, till she got it and she loves hers now! Our brown and black babies need to hear this so much, it hurts so much seeing n hearing those words from this gorgeous child on the video, she is stunning! It took my nieces questioning to make me accept myself being so light too. I used to think light skin was ugly because I hated being the one which could pass for almost white. Colourism is so bad in my culture thankfully brown and black women are beginning to realise that black is beautiful! xxx❤️😘", "ohhsophab": "😭😭😭😭😭😭", "cynthiasneh": "I have stay and live in India for many years but few of dark Indian man don’t accept that they are cute and beautiful , they always said that they can’t get married because they don’t have light skin", "raakshajew": "Thank you Deepica for highlighting this clip. People need to understand God created every inch of us we are his perfect creation. People in life do belittle and make hurtful jokes re dark skinned but the jokes on them👏we must always remember our Creator made us perfectly 💞💞💞@crownthebrown", "thecultcurators": "This is such an important video - because it shows how early the conditioning sets in and because it shows how each one of us can help change/alter that! Thank you @thelifeofasocialbutterfly and @deepica for your kindness, love and for bringing the social media world’s attention to such issues/stories.", "natalia_dotcom": "@jobngril @bijstagram @sneeeeeeeeeee", "anaghavinayak": "The most beautiful thing on the internet today❤️", "have_faith18": "First of all... SHES GORGEOUS!! Periodt!! 😍😍❤️❤️. Shine sis!! Second of all, colorism is one of the most divisive elements in a community. I am African American (African by birth, who is now in America) and it just boggles my mind how such a simple thing as skin tone can affect how people treat you, what men find attractive, what the media praises, and even what makeup companies produce. Sometimes I ask myself, “how is this my problem?” And then I realize the systemic poison that had been fed for hundreds of years during slavery and the preferences for the children born out of rape and later on consensual mixed race coupling. Our natural hair and skin was ugly, unless it was mixed with something lighter, which gave us a sense of worth and beauty. It’s so stupid and so simple (as in simple Simon stupid), but then the impact it has on young girls especially, who are singled out even by their own families. It’s difficult enough going out into the world and the world telling and showing you that you’re “too dark,” or “pretty for a dark skinned girl.” It’s just so sickening and sad that this lie has spread across many cultures, but I’m glad that there are platforms such as this one that praises “tinted” girls and their beauty. Please, tell your daughters that they’re beautiful, stand up for them if anyone challenges that (including family and friends), let them know whoever thinks their skin tone diminishes their worth is not worth their time. And don’t laugh at cheap jokes make about them too because those cut deep. And lastly, grow up people because, as a dark skinned angel, this is getting old and tiring and just plain stupid.", "ashnaidu01": "❤️❤️", "de_dee_pya": "All my life I was told that I am dark or black beauty or black. I just wanted to tell everyone by this video it is in your eyes to see the beauty not just by color", "aaliamaan": "😭😭😭❤️❤️❤️", "hijabilife": "Desi women get told early on that dark isn’t beautiful with all those “Fair and Lovely” Ads. This video was so sweet!", "lucindaleila": "😍😍😍 such beautiful words ❣️", "heyyapratiksha": "This was so much needed 💖💖", "amritha.shakti": "@thelifeofasocialbutterfly crying!!!! 😭😭😭😭", "justinekhunkhun": "🙏🏽♥️🥰", "itsgurnaz": "This hurts my heart. Thank you for sharing this, we need to remind women that they are beautiful no matter what their skin tone is ❤️", "mounika.mantena": "I hate how the society has conditioned this little girl and she already feels like she isn’t enough!!! Everything starts at home is what I believe.So please tell your kids they are beautiful,they are strong and don’t let them feel otherwise and people who let your kids feel like they aren’t enough are not worthy to be around you and your family !!!!", "neetdhaliwal": "❤️❤️❤️", "tappa0403": "This made me cry. Definitely hit a button, not gonna lie. Love this lovely soul sending the right message. ❤️", "samantharodrigues94": "Omg.my heart ❤️", "mohita_tak": "🙌🙌🙌🙌", "sabira_islam": "Beautiful conversation.. Though I don’t understand Tamil .. yet I tried to watch it many times and understand the gist of it... A kind heart and an honest soul is the best beauty in oneself", "braveandbronze": "@deepica This is one of the reasons why I created this Instagram account with artwork of women and girls of all shades of beautiful 💕 🙋🏽‍♀️ @colorism_in_india @wing.it.beauty @luvthyself11_", "farahrnajem": "🙌", "_madhu.12_": "Love this❤ such an important message to share to young ones💯", "_anikah": "The heartwarming content we needed as a reminder to challenge current beauty standards!! ♥️", "whereintheworldiscarmen_": "😭💕", "kirkbertino": "In India poor people worked outside so they had darker skin. Wealthy people worked inside so they had light skin. As a result light skin in India became a status symbol representing wealth.", "aashna_s13": "She’s soo beautiful 😍😍💕💕 so so many emotions right now, reminds me of my lil sister who’s exacts words were “im not cute because im dark”. Had to go through with her on the definition of beauty and the importance of appreciating her ownself. ❤️", "hooeydooey": "OH MY GAAAAAAAH Swarnaaaaaaa 😍💥 @thelifeofasocialbutterfly", "irenesarah\nVerified": "Verified", "simplyro__": "@san.jana no im not crying", "preethi.kumar": "I am so glad this is being addressed!! ❤️", "47kmonica": "❤❤❤", "reenatejura": "Hum Kaleh tho kya hua, dil waale hai!", "sifti.kaur": "💗", "deepica\nVerified": "Verified", "rohini9": "Can’t tell you how many times I’ve felt ashamed or didn’t fit in or felt ugly, which I still am scarred and still feel inferior. I’ve been mocked for my tan color many a times by my own kind (Indians) making it a point that I won’t find a guy who would like me. Shame what the society has ingrained into our heads. #livetinted", "madhuarora": "Story of my life. I was taught by the time I was 6, that I am ugly. A lifetime later, still measuring up", "asiental": "♥️♥️♥️♥️", "sanjana.sathrasala": "@yogeshmohanraj 🥺🥺", "janani_rana": "I don’t think this is her mom based on how she’s addressing the little girl, but it’s a nice video nonetheless :)", "what_the_medusa": "So happy to see game changing conversations! This is a woman I needed as a kid!", "_miss_judalyn_": "This hit me 😭😭 I understand how this little girl must be feeling I have been through the same and ruins you’re childhood. I could only be happy when I started to accept myself the way I am", "sitamyseven": "Love this! 😍 I used to feel bad about my complexion when I was younger, but now I am super proud! Thank you for making #livetinted as a platform to boost every girl’s confidence and appreciate the beauty in diversity!😍", "shalomimakeupandhair": "Ahhh what an amazing Mama 🙌 ♥️♥️", "bryan_kayj": "I have grown up being bullied because of my skin colour. Think of adults in the family itself who start it and so does your little cousin. And when i got into high school it was worst. Imagine being bullied for being dark, for talking through the nose,having curly hair. But being bullied for my skin color, had a long term toll on my self esteem. I even left a highly reputed school and move to a private school because everyday I was called charcoal and dusters were being blown on my face (pretending they didn’t see me since i was dark) as well as being rejected for being a cheerleader for sports days as a girl came up and told me I am dark and not beautiful to do so. I had even just posted my experience on a post in my account about all these. And all these led to me having Red Skin today because I used steroid creams to get fairer. But I realize that there is more to skin color. I am recovering from Steroid withdrawal symptoms and brown and dark with pigmentations is beautiful because that’s me. Dark skin and every other shades are beautiful. 🤎", "laraelmonique": "Sounds like our reality in the black community. 🥺It sucks.", "krithikasreddy": "I’m so lucky that my dad gave me this talk at a young age when my family, school, etc. told me the opposite", "seesaweye": "She's so cute", "sshobi": "@deepica not the point of the video but, that's not the kid's mom! That's @thelifeofasocialbutterfly 💚", "livmarya": "♥️♥️♥️", "neelamparbhoo": "I love this!", "dharasworld": "Ohhh I can beyond relate and was blessed that my Mom never made me feel less beautiful even though everyone in our family and community didn’t think I was pretty Bc I was “dark”. But all shades are beautiful and that’s why @livetinted hits home for me more than any brand bx beauty is in all forms and should always be inclusive 🧡", "iamquueenb": "This made me cry 😭❤️", "jassienijjar_": "♥️♥️😭😭", "pretesh.karen": "👏", "spatel324": "This is so touching! Kudos to this wonderful woman showing us inner beauty which no make-up routine or Insta filter can replace!", "jasminesandher": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😍", "anisha_artika": "♥️", "mahimajensen": "I am crying 😭😭😭THIS is such an important message.", "ankitasanawar": "This is beautiful Deepica ❤️❤️❤️", "_buggy1_": "He is so adorable. This makes my heart just ache. What a message!", "angelashaw88": "Love this! ❤️❤️❤️😍", "fruity_pebbles_04": "This made me tear up 💕💕😭", "aquamynhan": "Thanks for sharing this and for the reminder that we are defined by our our skin tone 💕💕💕", "doctor.leena": "I love this so much. It’s not always easy to break the light vs dark mindset in our culture. Kudos to this momma 👏🏽👏🏽👏🏽", "whereisdane": "😭😭😭", "hopelessrahmantics": "this mom does what every mom should aspire to instill in their daughters♥️", "preyoti94": "♥️♥️♥️", "thecurrymommy": "I am so happy to see you spread relatable content that is a part of EVERYONE’s life! This is a very enlightening post that needs to go on WhatsApp! 💕 #iykyk", "nimnadi.th": "@sonea_sk strong 💪🏽", "saniah_shah": "Great message", "divyabgoel": "@deepica I was made fun of because of my skin color. I was in Kindergarten and people said I was dirty because I was brown. They told others not to sit by me because I had a different skin color then them. They said my brown skin might be contagious and they didn't want to be dark. This video brought so many emotions back but it's important to tell people that everyone is different and that's what makes you, your self.", "priyabbhakta": "This little girl is me. The color of my skin has given me the lowest of lows growing up but as the mother of a daughter I REFUSE to let her experience the same! Thank you @deepica for providing a platform to educate everyone on skin colorism and everyone being beautiful in their own skin!", "ritaiscool1": "Ahhhh this was beautiful, yet heartbreaking. We need to stop this madness about dark skin.", "shimaslal": "Crying 😢 this is one amazing mom!!!!!❤️💯😘🙌🏽", "ashantievette": "💕💕💕", "aqeela.b": "❤️", "_suprith.k_": "❤️❤️❤️", "shellyyy.20": "🙌🏾🙌🏾❤️❤️❤️💯", "sunniasays": "Love this 🙌🏽", "faceyourmirage": "💔affirmations like these change everything ❤️long way to go but we have come a long way as well🙏🏽", "mandee.randhawa": "❤️", "shaider87": "❤️❤️❤️❤️", "thisisdamarispierce": "That is so hard to hear at such a young age. I’m glad she corrected her in what real beauty means bc she is so beautiful.❤️❤️❤️", "priyanthyy": "So glad we have a video like this in Tamil too 😭❤️ @mrs.p.ss", "sopenshah": "❤️❤️❤️ She is beautiful!", "shellyfromtheblock": "😭😭❤️❤️", "manviarora": "😭❤️🙏🏽", "abbirami.n": "What an important message! ❤️", "threadsdublin": "This mom 🙌🏽🙌🏽", "abiya_k": "This is so beautiful @thelifeofasocialbutterfly! You have made such a huge impact on this little girls life with the beautiful advice you gave her in this video, Swarnaa ♥️", "brontels": "@pretesh.karen 💕👏🏼 this is so good!", "vilekharizo": "Yes!!!! She’s beautiful & Kudos to the amazing mom for giving her daughter the right message! 👏🏼👏🏼👏🏼❤️❤️❤️", "bwilliams_89": "❤❤❤", "diya.sh": "Hey @deepica !! the older girl isn’t her mom , it’s @thelifeofasocialbutterfly 💓👑", "anganamaheshwari": "💯", "beautybynikichawla": "THISSSS YES OMG ❤️ thank you for sharing videos like this Deepica and making a positive impact with your captions. All colours are beautiful and I’m really hoping one day we can fight the battle of colourism. This video is so beautiful, the women building the confidence of the little girl is everything !! 💕💕", "salinaa.i": "Aww 🥺🥺", "moe_dazzle": "All my life I was made fun of because of the color of my skin. I was the darkest one in my family. I'm Mexican Armenian and I take after my grandfather on my Armenian side. People can be so mean 😔", "soumyabysanii": "this is something a lot of kids and teenagers need to hear growing up. growing up i was made fun of for being “too dark” for my race. i would get comments like “you’re too dark to be indian” “are you even indian” “you should bleach your skin like michael jackson”. people need to realize words hurt. most importantly, everyone is beautiful in their own way. we need to keep addressing colorism because it really is a serious issue. I love this video and the message it is sending to other girls🧡🧡", "anuja_agrawal08": "My heart breaks to see this.", "thelifeof_my": "@shruthirox4", "hairluvbytiffany": "🥺♥️", "yumobento": "This is everything! Thank you for sharing such a. Beautiful video. My sister is darker than me. Growing up hearing comments def made her self conscious (even today). It’s important to be reminded that every tint is beautiful!", "houseofbargello": "❤️🙏", "beverlydudley24": "♥️♥️♥️♥️", "sweeets22": "💖💖", "sandra.hernandez127": "My daughter is dark too and I always tell her she's beautiful!", "rosa.orquidea.lirio": "Lol she’s not a mom yet @thelifeofasocialbutterfly", "runitwithrobin": "❤️❤️❤️", "damalirai": "South Asians have some of the richest and most divine skin tones I’ve seen! I pray we see a change in the way we view skin color. This baby has skin that was kissed by God! @deepica", "satya_raoo": "❤️❤️❤️❤️❤️", "seemamenghani": "❤️", "meeeenali": "@maaru.makeup_hair_drape ❤️", "nickivashi": "@deepica if I’m not wrong this isn’t her mom speaking to her it’s @thelifeofasocialbutterfly herself. Just thought I’d let you know 🙂. Anyways such a relevant topic and it’s so important that we encourage children to realise they’re beautiful in any form ! 😍", "rashmikishore16": "@shreyaspras a positive video :)", "tealalps": "We need such moms in this world.", "ritikamurarka14": "❤️❤️❤️❤️", "meghanav": "💙💙", "daryaaccessories": "Naangalum dark thaan 👍🏼", "dashmenon": "@deepica - i think the “life changing mom” in this video is actually @thelifeofasocialbutterfly!!!", "poovandhree": "@thelifeofasocialbutterfly doing AMAZING things Swaarna💕💕💕", "ashwinionline": "❤️@deepica", "keethesexxyone": "💯💯💯", "kalistabecoming": "As a Sri Lankan, Tamil girl, this video really resonated with me. Growing up, my mother returned from vacations with tubes of fair and lovely. As well intentioned as she was, it took a lot of unlearning in young adulthood to love the skin I’m in. Such an important message. Thanks for sharing @deepica 🙏🏽🤗♥️", "iamsrijita": "👍", "theessenceof_\nVerified": "Verified", "jpad_67": "Bless their cotton socks! 💕", "manal\nVerified": "Verified", "mehrazr": "i LOVE THIS & live tinted for bringing this narrative to the mainstream", "tenipanosian\nVerified": "Verified", "filmyfijian": "😭😭😭", "freshwomanavocado": "the mindset that dark isn’t equal to beautiful breaks my heart 😢", "desiglamboutique": "My daughter who is only 6 also feels she is not fair enuff. She says she isn’t pretty like mommy. Breaks my heart. I always have to remind her “ she is beautiful “ and I make sure she says it loud enough so she can hear it herself that “ I am beautiful “ no matter what colour skin she has.", "aditi.mani17": "💖 I’m so happy to see this issue being addressed more", "angeliqgoddess": "❤️❤️❤️❤️😢", "jesschidwickfit": "That broke my heart as soon as he said that 💔", "nityapat": "@eshapat brb crying", "cecgram100": "Beautiful! ❤️💯❤️", "klaritybyk": "👏👏👏", "marissabirdi_styling": "Brought me to tears. So loving 💖💖", "shajar_khan": "So many young girls go through this, me included! Growning up I was bullied for not being light skinned. Thank you for sharing this... ❤️", "fortunaleblanc": "@genevievel33 et Ena bezer dehors la", "dressyourface\nVerified": "Verified", "macyjordanweatherspoon": "❤️", "elatedsquash": "Let it be heard all around the world . Can only hope I’m able to do enough for my little sister and cousins", "khaamee": "👏🏾👏🏾👏🏾👏🏾👏🏾yeasssss!! @thelifeofasocialbutterfly ❤️", "jononemusic": "♥️♥️♥️", "silvery_shah": "💯❤️", "dianamadison\nVerified": "Verified", "vismaya2023": "As a dark Telugu girl I needed to hear this ❤️", "ashleeglazer": "❤️❤️❤️❤️", "notsordinarywoman": "💞", "nyalagopie": "I wish I heard this growing up. Because of influencers like you I'm learning to love the colour of my skin ❤️", "bentleyandthejess": "🙏🏽💕 Awww", "sellybee1": "@poppyqbertola 💔", "sanjanakreddy": "😭😭😭THATS BEAUTIFUL THEY ARE BEAUTIFUL I WISH MORE PEOPLE WOULD REALIZE"}