{"aroosakainat": "So sorry for your loss 💗", "eri_carey": "May his memory be eternal", "themonoclemuse": "Sending you a huge hug babe ♥️🙏🏽", "nav.beautyy": "❤❤ RIP", "oyincansoda": "May his soul rest in perfect peace 🙏🏾", "nickiiiii0527": "So sorry for your loss🌸 RIP, keeping you and your family in my thoughts and prayers🙏🏻", "mgalie": "Sorry for your loss ♥️", "ambberro": "So sorry girl 😥", "brianna.dambro": "❤️❤️", "notesbysharon": "✨May he find peace✨", "anopenheart33": "I am so sorry for your loss; sending much love and condolences to you and your family", "prothomaa": "So sorry for your loss , sending lots of prayers , love and peace 💕🙏", "helloitsaalia": "i’m so sorry!! sending love and keeping you and yours in my thoughts 💕💕", "ashamadhukar": "❤️", "lovetheashleyanne": "So sorry for your loss! 😭 Hoping you find some comfort in the days and weeks ahead. Death is so hard. 🙏🏽", "berylnaturals": "Sorry @deepica for your loss. RIP. Sending you and your family lots of love and prayers.", "piomina235": "RIP dr", "secretsofsonika": "Sending you my love ❤❤❤❤", "studioeast6": "We are so sorry for your loss, sending you & your family lots of strength & light 💜", "timaahmad": "Condolences to you and family ❤", "advmunnulalmishra": "सुस्वागतम", "redlotusartistry": "Sorry for your loss @deepica Praying for you and your family during this difficult time.", "caffeinated.med.student": "Praying for you and your family. I am so sorry for your loss! Bless his strong soul ❤️❤️", "jayasangha_": "Rip ❤️", "santer74": ":(", "faye_harris": "❤️", "amalid": "Sorry for your loss hun 😢😢😢", "rennpop": "RIP ❤️", "unveiledhawaii": "💕", "vaishnasupra": "I’m so sorry for your loss, stay strong ❤️", "sudhiralakan": "My condolences to u and your family. I can understand how difficult it is as I lost my dad last year on xmas (stage 4 liver & pancreatic cancer) :( hang in there and just pray for peace.", "miramerasi": "So sorry for your loss. Keeping you and your family in my thoughts. ❤️", "beautystylelist": "Thinking of you and your family during this time dear. Sending you lots of love and peace.", "dmolina4214": "Oh my gosh I am so sorry for your loss hun ❤ I saw the picture and I literally went 😩 when I saw your caption. Stay strong my dear.", "elysia.rodrigues": "So sorry for your loss!❤️", "justtaamico": "🙏🏼😞♥️", "insta.karm": "Condolences. But you reminded me of my favorite actress/dancer Shobhana.", "bees_arthive": "I'm so sorry for your loss. I lost my dad to cancer and it's hard especially when they were the rock for you and your family.", "vaishnavi_778": "May his soul rest in peace", "happyyfoodiee": "❤️", "twin_b95": "I’m sorry for your loss... I know words can’t describe true sorrow and hurt but they’ll bring comfort in the time of need. I lost my dog this holiday season. I know he doesn’t compare to being a father or mother or sister or brother, but realizing he was always there and loving makes him more apart of my family like the rest of them. It’s heard but time heals and heart break only makes us stronger. Stay strong ❤️", "arossew": "💙😍🤗😘😊👼🏾🙇🏾‍♂️🙇🏾‍♀️🙏🏾", "tiifffanyd": "❤️🙏", "reemasampat": "So sorry, Deepica. He's proud watching from above ❤️", "stampedbyniva": "Sorry for your loss ❤️. My condolences to you and your family", "sonatayl0r": "What a beautiful photo, terribly sorry for your loss...", "devyanikhare": "So sorry for your family’s loss. May your uncle find peace and happiness wherever he is now. 🙏🏼♥️", "priyajha_89": "Sorry for the loss.. may his soul rest in peace and may his energy drives you to your dreams!!", "shejustknows": "✨", "laven_dirt": "sending prayers for you and your family ❤️", "classtige": "So sorry for your loss. Stay strong. Sending prayers out to you and your family ❤️🙏🏽", "rosemariebeauty101": "Sorry for your loss . May he rest in peace ❤️", "08lx": "#آلـفـآتنهہ_مرت", "maena_s": "❤", "blueillusion_usa": "Love this", "priyadiaries24": "So sorry for your loss. You and your family are in my thoughts and prayers. My deepest condolences. May he Rest In Peace.", "cara_kam": "So sorry for your loss and sending all of my love ❤️", "mermaid12mrunal": "❤", "azanz2016": "💔", "sherana___": "Dear @deepicam So sorry for your loss💔 I'm keeping you and your family in my thoughts and prayers. Remember that your uncle will always watch over you. May he rest in peace🙏 Stay strong girl❤", "onomiebeauty\nVerified": "Verified", "yass89g": "I'm sorry for your loss💙", "themodelmalyia": "🙏🏽", "triciabe": "Sorry for your loss😢", "texanrupee": "So sorry to be seeing this. May he RIP. Prayers for all of you. 🕉💖🙏🏽", "hsahani_94": "So so sorry for your loss; keeping your family in my thoughts 💞", "saturn777": "😯😣I'm shocked to hear this and so sad. I wish you and your family get through this difficult time and please be strong. I'm so so sorry for your lost my love 😔", "sara.shirhanna": "I'm so sorry for your loss. Bhagwan's blessings to you and your family 🙏🏽", "manywomen": "So sorry for your loss.", "katebanfitch": "My sincerest apologies, you and your beautiful family will be in my thoughts this holiday. Bless you Deepica 💕", "dwnydaisy": "So sorry for your loss...thoughts and prayers and may peace be with you♡", "krupjags": "❤️", "nishabecool": "So sorry for your loss ❤️", "smitanair0572": "So sorry for your loss Deepica. Stay strong for your family ❤️", "mymylove4": "My condolences", "denzil.fernandez": "@deepica .. my sincere condolences to you and your family.. thoughts and prayers and sending a lot of love too", "salma_alexandra": "My condolences for you and your family 💕", "leftymasala": "My condolences to you and your loved ones", "jennydr21": "🙏🙏🙏", "itsdilani": "Thoughts and prayers ❤️ love from 🇦🇺 xxx", "nargesnirumvala": "😢", "ragnhildjevnestudio": "Wow!", "sheetal_sanj": "Deepest condolences to you and your family💛", "haanypot": "I'm so sorry for your loss, he lived a wonderful life surrounded by a loving family 💖", "docellero": "He fought valiantly @deepica. Praying for you and yours.", "meganpooran": "I’m so sorry Deepica, stay strong ♥️", "rasmi09": "Deepica, im so sorry for your loss.", "honeywhatscooking": "Awww I’m so sorry for your loss Deepica.", "kiranssphotos": "I am so sorry for your loss; will be praying for your family’s strength in this difficult time. Always sending love and good vibes 🌸", "sweetcandyapple25": "@deepica my thoughts and prayers go out to you and your family🙏😢", "thechutneylife": "So sorry for your loss 🙁. Sending love and prayers to you and your family ❤️", "sannsimmi": "I am so sorry for your loss. Sending lots of love and prayers during this difficult time. 💕💕", "izzy2869": "sorry for your loss", "angeli.t.reddy": "I’m so sorry for your loss Deepica. Praying for you and your family. Sending you lots of love. ❤️", "panpanda_26": "I am so sorry for your loss :( sending lots of love 🙇‍♂️", "hunnybeez30": "Sending you love, prayers and hugs!", "amar.a.desai": "Thoughts and prayers, Deepica", "fashionmavenmommy": "So sorry Deepica 🙏🏻😔", "betsy.rn": "I’m so sorry for your loss Deepika ♥️ My condolences to you and your family 🙏🏽", "reena_r23": "So sorry for your loss - sending you & your family my prayers and positive thoughts. 🙏🏽", "missbichu": "Sending you lots of love and positive vibes Deepica!", "ankinayak_": "I’m so sorry for your loss. 🙏🏻😞 praying for you and your family", "allthesinglaladies": "❤️❤️", "sums2279": "So sorry for your devastating loss 💓💓💓", "adisathi": "Very sorry for your loss", "shamzmakeupartistry": "@deepica I’m so sorry for your lost Hun 😞 I know how it feels , I just lost my dad two months ago 💔praying god’s love and strength will be upon you and your family during this difficult time Hun ❤️", "beauty_insidesbyfn": "Thoughts and prayers going out to you and your family during this difficult time ❤", "leelee64.lw": "Sending special thoughts and prayers filled with Gods love all the way from Paris Texas!", "loveinmedicine": "My thoughts and prayers are with u and ur family ❤️", "reenatejura": "I’m so sorry for your loss!! Sending you love and support ❤️", "shreyaa.p_": "What happened?", "sabrinamolu": "Sending you love and prayers", "peoniesandpoems": "So sorry :((", "senoritakg": "❤️❤️❤️❤️", "shilplet": "RIP 💙", "shepersisted_": "I'm so sorry. Prayers for your family", "richakal": "❤️🙏🏽", "sarahsambhara": "❤️❤️", "samcutler8": "@deepica I’m so sorry for your loss babe! Sending you love and light. 💋💕🌈", "sheela110": "RIP 😢 I’m so sorry for your loss", "s1107201": "Sorry for your loss sending love to your family", "tayyagari": "Omg I'm so sorry", "czjouer\nVerified": "Verified", "preethaali": "Cancer sucks. I’m so sorry for your loss!", "peach_xoom": "my condolences to you and your family 🙏🏼", "anishayadav88": "Sorry for your loss, sending all my love and prayers your way ♥️", "pveda22": "I am so sorry for your loss. I don't know you but have been following your story & successes. I am so proud to have a fellow South Indian TEXAN / Houstonian represent in beauty 🙂 I think we have mutual friends in Houston. My mom has even seen your red lipstick color correcting video! 🤣 You are gorgeous & intelligent and will go far! I am excited to see. I wish you the best in your future endeavors & am praying for your family during this difficult time", "_ahalingam": "❤️", "neetu.k_": "❤️❤️", "_ecoaaraby": "💕💕💕", "lauresejean": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "coolerthanvogue": "Sending you & your family lots of love :(", "nehabeauty": "So sorry for your loss. Sending you love.", "aryaofusa": "Rest In Peace uncle.", "cindycowan1000\nVerified": "Verified", "lailasharinalovesbeauty": "💙", "shaquanzasnapfo": "So sorry for your loss.", "soniahunt": "So sorry to read this. Sending light + love. This is a beautiful memory.", "mrkate\nVerified": "Verified", "romcom85": "So sorry for your loss ❤️ sending love and good thoughts", "justyoyo47": "Sorry for your loss @deepica will keep you and your entire family in prayer.", "salimastagram": "So sorry for your loss 😔 my deep empathy to you and your family", "missamy0331": "❤️🙏🏼", "glowwithanita": "Sending all of our love to you and your family. 💖", "loreleio": "So sorry to hear this-thinking if you and your family. ❤️", "tramaynetirrell": "💔", "lucica12": "❤️💜", "goldnineink": "Sending lots of love 💛 So sorry for your loss Deeps", "_rramesh": "😔I’m so sorry for your loss", "g_untld": "Condolences to you and your family Deeps!! Hit me if you need anything!", "sandyp0707": "Aww cute family. ❤️I love the way you guys wearing Indian traditional outfits. So adorable your mum dad reminds me of my parents lovely 😊 🇮🇳🇮🇳🇮🇳", "beeker1021": "Sending love, prayers, hugs, and strength. ❤️🙏🤗", "delinamedhin\nVerified": "Verified", "shalinivadhera\nVerified": "Verified", "pujamohindra": "I’m so sorry for your loss. Keeping you and your family in my prayers. God bless you with strength during this difficult time. Be gentle with yourself and remember the body is a cloak we wear. The spirit is eternal and lives forever.", "neilnazma": "So sorry for your loss ..my deepest condolences too you and your entire family ..", "kbellah0108": "Sorry to hear about your uncle Deepica 🙏🏽, sounds like he left quite the legacy to follow. I’m thinking of you in this hard time. You are strong and you can get through anything 💗. Sending lots of love to you and your family ❤️.", "mariaalia\nVerified": "Verified", "jasandpal": "My condolences to you and your family! Sending prayers your way! 🙏🏻", "amidesai": "Sending so much love and prayers your way 🙏🏽❤️", "kimi904": "My deepest condolences to you and your family 🙏❤", "suziekins6": "Sorry for your loss, my condolences to your family❤️", "aliahishmael": "Sending you love and prayers!! Rip", "pumpkinpie495": "Sorry for your loss, Deepica! 💛 sending you and your family some love from NJ", "thenivensingh": "Sending lots of ❤️ to you and your family and parents especially.", "chefpalak": "Prayers for you and the family! May he Rest In Peace 💕 @deepica", "mrsmj_004": "I'm sorry for your loss. May the bright light that he has become fill all the emptiness within you.", "darlingnieves": "Oh Deepica, love, I'm so sorry! Many hugs to you and the family. It's so good that you got to spend more time with your uncle in these last few months. Those memories are precious and will be sources of comfort and joy. ❤️❤️❤️", "xxpriyankaxx": "so so sorry for your loss ❤️", "nk2k": "Love you Deepica....", "hanalei_a": "RIP ❤️", "sherylgeorge917": "So sorry for your loss. Sending you ❤️", "taybeec": "So sorry! Sending hugs and prayers your way! 💜", "nanibee": "Sorry to hear about your loss. Hope you find comfort and strength in memories and amongst your loved ones.", "runi_03": "Sorry for your loss 💓 my condolences.", "vaisheli": "So sorry for your loss sending ❤️ & 🙏🏼", "k1mb33": "Sorry for your loss ❤", "marrrx3": "Sorry for your loss. Stay strong ❤️", "simmi_prasad_": "So sorry for your loss.", "kruinspired": "Sending love to you and your family. good soul🙏🏻", "luvstyleme": "So very sorry for your loss @Deepica 🙏🏼💙", "sarahmahii": "Sending lots of love to you and your family❤️", "kripzchips": "I’m so sorry for your loss 🙏🏻", "bethwischnia": "So sorry babes xx", "nehap7": "❤️", "sangeetaswamy": "I’m so sorry to hear this ...I really thought he would overcome ....rest in peace ....", "subhasini_balbhadr": "Condolences to the entire family", "kajaskanvas": "Rest In Peace ❤️😞", "dr_snehha": "Sorry for your loss dear. My prayers for you and your family! ❤️", "nimco.amh": "Sorry for Your loss RIP❤️", "emaans_ayaans_momma": "So sorry for your loss.", "sharebear814": "So sorry for your loss. Sending love and prayers ❤️❤️", "cuedjentertainment": "Sorry for your loss! 💛", "rosary83": "My deepest condolences to you and your family.", "niveda108": "Sorry for your loss 💔 sending my love", "kishori_55555_shimla": "I am sorry for your loss", "n2k578": "My thoughts and prayers are with you and your family❤", "alyaali1": "Sorry for your loss Beauty ⚪️ Thank you for using your platform to raise awareness about cancer. 🖤", "maradhra": "So sorry for your loss, Deepica! Keeping your family in my thoughts and prayers ♡", "linaxknit": "❤", "crys_snow": "My condolences to you and your family, @deepica No words can ease the pain of such a loss, but you and your family are in my thoughts asnf prayers. ❤", "graceatwood\nVerified": "Verified", "reginalddwight1": "💓💓💓", "veronika1024": "Sending much love @deepica ❤", "mohini_agarwal07": "Sending lots of love and strength to you and your family, D! ❤", "theluxurybelle": "Sending lots of love your way. Sorry for your loss", "shireen.b.george": "❤️❤️", "shandravoh": "Thinking of you, sincere condolences.", "aimee_nezhukumatathil": "so sorry for this loss, D!", "mizzmartinni": "🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️❤❤❤❤❤❤", "naturalbeautywithin": "I am so sorry!!😔", "imamandeepnagra": "❤️❤️❤️❤️❤️❤️", "drach311": "I’m so sorry girl. Lots of love and peace to you and the Mutyala family xoxo 😘😘😘", "jenmichellebaird": "Sending ❤️❤️🙏🙏 I am so sorry for your loss", "glamboard": "So so sorry Deepica, thinking of you. 💔", "drea_lily": "My sincere condolences to you and your family during this trying time ❤❤❤", "celicake": "Sending lots of love and I’m so sorry for your loss! 💖", "littleblankdiaries": "So sorry for your loss ❤️", "vanessaobeng_": "🙏🏾❤️", "soniamanijosephphoto": "love and light 🙏🏼❤️", "taleya.g": "Hi Deepica. My condolences to you and your family. Many of us have lost our loved ones, but no one will understand how YOU feel. Be reminded that you have a lot of family, fans and fans that are thinking of you and praying for you all. Grieve however you want to grieve right now- cry, reminisce, ignore (even tho I don’t recommend that one, but it helps some persons), share,... do whatever makes YOU feel better. You won’t believe it now, but you WILL feel better one day 🙂. Sending love and positive vibes...", "bue.nelle": "Sending lots of love 💕 My condolences to you and your family!", "niquethenatural": "So sorry for your loss. Praying for peace and comfort for you and your family ❤️", "yadavalliramya": "Sending prayers for strength and comfort your way.", "ushaa.ravintharan": "Condolences to you and family. Keep strong", "theessenceof_\nVerified": "Verified", "darshna256": "🙏🏼😔", "leenabeeeena": "I’m so sorry for your loss", "caryneer": "❤️", "pablask_": "Sending you and your family my love and prayers ❤️", "keerineh": "Love and light, Deepica. Family is everything.", "jcfullofgrace": "May you find solace in the memories 💕", "sukunthaladevik": "Lots of love! ❤❤❤", "deepa.k.r": "I am so sorry for your loss. My condolences to your entire family.", "annabelsnook": "❤❤❤", "mcarrasco73": "I’m so sorry for your loss, sending you prayers and strength 🙏🙏🙏", "_noorarshad": "May he rest in peace ♥️♥️♥️", "razjazz88": "Sorry for your loss", "poojjlovess": "💛💛💛💛💛", "boxyfrown": "❤", "rajnivasudevan": "So sorry for your loss sending you and your family healing prayers God bless you", "bombshellbeautybychetna": "God bless you and your loved ones", "priyankapatel803": "❤️", "lovemichelleana": "my heartfelt condolences to you and your family. Sending love & light your way. 💛✨", "bigcheeks1013": "Sorry for your loss, sending prayers to you and family god bless", "mz_c.rob": "Sorry for your loss", "ka512": "♥️", "reddiva83": "Prayers for your family .", "priyswa": "Prayers 🙏🏼", "fatimahussain": "Love and Prayers ❤️", "anjushaj07": "Sending lots of love & prayers❤❤", "selinasithya": "❤️❤️🙏🏽🙏🏽", "nmbr_5": "Sending lots of love, hugs, and prayers to your and your family❤️", "shnuckelbums": "So sorry for your loss. May his memory be of a blessing", "5anthia": "My deepest condolences to you and your family @deepica ❤️ with every lost soul, the meaning of life awakens..", "drshriya": "Condolences to your family", "lahqwah_": "My deepest condolences to you and your family ❤️", "happyeverleighafter": "May your memories sustain you. My sincerely condolences. Keeping you and your loved ones in my thoughts and prayers.", "anna_corbett902": "@deepica - so sorry for your loss, eternal rest to him. Condolences to you and your family. ❤️ your number 1 Canadian fan.", "makeupprincessfashionista": "Beautiful family", "meeramemep": "❤️❤️", "behaplyons": "So sorry for your loss babe! ❤️", "bentleyandthejess": "Aww my thoughts and prayers are with you and your loved ones 🙏🏽", "ashgofficial": "🙏🏽", "dhivravi": "RIP ❤️❤️", "cupcakequeen1": "May his soul rest in peace. Praying for your family", "jacquesbenimble": "So sorry for your loss ❤️", "nancytwine": "Beautiful family. Keeping you in my thoughts and prayers. ❤️ you", "trendy_closet12": "May his soul rest in peace..", "stylenbeautydoc\nVerified": "Verified", "psididthat": "May you all find strength in these hard moments and may his soul be at peace. Lots of love deepica ♥️", "neshaneshaaa": "I am so sorry! My condolences and prayers go out to you and your family ❤️", "dishalidpatel": "I’m so so sorry for your loss. Sending prayers to you and your family❤️", "makeupinspo.x": "❤️❤️❤️", "ai.shahana": "My condolences to u and ur family!!! I am so sorry for ur loss! Sending ur family and u my prayers and hugs. ❤️❤️", "aparnabhattacharya": "💜💜💜💜 sorry for your loss.. keeping your family in my thoughts..", "viviana_barrett12": "Rip ❤️❤️", "davidlopezzz\nVerified": "Verified", "sejal34": "I'm so sorry", "adore_brownsuga": "My condolences to you and your family 🙏🙏", "saei_hq": "Sending you and your family lots of love and prayers❤", "thejoyinbeauty": "So sorry to hear of your loss. Sending your family my condolences!", "aradhana_nair": "I am so sorry for your loss", "innahershko": "So sorry for your loss Deepica. He seemed to be strong until his last day. #fuckcancer", "indrasooks": "Sorry for your loss! May he RIP!", "sharese_reynolds": "Prayers and condolences to you and your family Deepica. Many hugs 💕❣️❣️", "ladysapphire77": "My condolences to you and your lovely family...Definitely praying for you all's strength and comfort.", "kokomasbyamneek": "Prayers and condolences to you and your family ❤️❤️", "amandapinay": "Sending you my love. I'm so sorry for your loss", "creativececi": "Deepica, I’m so sorry. Sending love and prayers for you and the family.", "chasingskinnyblog": "So sorry to hear this, your Uncle sounded like an amazing man. I pray that you and your family are comforted during this time.", "shaziaa7": "I’m so sorry for your loss and hope you all stay strong during such a difficult time.", "hiren5819": "Happy family", "camillequintos.makeup": "Condolence. 💜", "drea214_": "🙏🏽🙏🏽🙏🏽", "prexiousbl": "I’m so sorry for your immense loss, Deepica.... 💔", "nika_rx_sho": "@deepica my deepest condolences to you and your family", "zeenizami94": "So sorry for your loss.. my deepest condolences to you and your whole family.. I pray that God gives you all strength and patience during this tough time.. 💖 stay strong beautiful!", "mandeepdoesitall": "Sorry for your loss", "whendressed": "@deepica my Heart is with you and your family. ❤️", "idaliasalsamendi": "🙏🏼", "reshme_24": "I'm so sorry @deepica. I lost my grandmother to cancer and I know how it feels...sending you and your family lots of love during this time of mourning. ❤️❤️❤️😢😥", "essentiallydee": "May God bless you and bring you and your family comfort. Your uncle knew how much you all loved him. I’m sure he was grateful to have you all support him through his illness. Sending you lots of positive energy and love ❤️.", "dr.sunshine_sara": "I’m really sorry for ur lose may almighty give patience to ur family n his and I pray his soul shld Rest In Peace n tk higher n precious place in heaven dear 👭stay blessed 🤲🏻", "neverwhatever21": "He's in a better place @deepica he suffered a lot of pain but now he can rest sending so much love your way ❤️", "rivinishashya": "Sending lots of love your way! Stay strong 🙏🙏", "meerasanimaltribe": "I’m so sorry for your loss. Many hugs and prayers to you and your family. He will always be watching over you❤️🙏", "dr.n.s95": "Death is painful.. unforgettable..may his soul rest in peace.. I’ve lost my grandma recently and it’s definitely not easy to accept that she’s not around us anymore.. she struggled , fought till her last breath.. she was a fighter.. and we just believed that living in peace is less painful than suffering , no matter what ur family loves u more than anybody.. may his soul RIP. #amen I miss my Ammama..", "a_dumbo_artist_9714": "Sending my love and condolences to you and your family, may he happily Rest In Peace", "heyfranhey\nVerified": "Verified", "bhamini76": "Sorry 4 your loss", "usandyn": "May his soul rest in peace 🙏", "shrutirya": "Dearest, sending you so much ❤️🙏🏼", "_djohnbphoto": "cool", "shrutikapur11": "Oh no ..... 😔", "montaeglich": "My heart is with you and your family, @deepica. May your uncle be at ease now. ❤", "luxefacebyanitha": "Lots of love and prayers to you and your family🙏🏽", "tsiddique516": "RIP 😔", "vickyj3015": "My condolences RIP🙇🏽‍♀️", "anais.gsb": "So sorry for your loss. Sending you strength for you and your family 💟", "sourpatchkids_resses": "May you and your family find peace and strength in this time... Keep those happy memories of your uncle during happier times. 😚😇", "silajp": "Sorry for your loss!", "d__o__n__n__a": "So sorry 😞", "kahlanabarfield\nVerified": "Verified", "free_ambreezy": ":(", "simsagoo": "I'm so sorry for your loss. Sending lots of love to you and your family 💜", "danielleasnyder\nVerified": "Verified", "meetmyriam": "My condolences 😚🙏🏽❤", "rudymukta": "We're sorry.", "cbjanae": "Sending love and light 💜✨", "katstruk": "Im so sorry to hear of his passing..he was strong and fought hard..He was courageous...and a world came to know him as that. I pray for comfort over you and your family, his wife and immediate ones....His body is made whole again in Heaven with our heavenly father...❤😭❤", "tarikachopra": "I'm so sorry for your loss, sending lots of love its difficult but keep strong 💛", "glambythulasy": "Sending my love and prayers! So sorry for your loss. R.I.P 😔❤️", "ssofinnaa": "i’m so sorry for your loss. sending love to you and your family during this time 💖💖💖", "lbishop8": "So sorry for your loss", "poonamc218": "RIP🙏🏻🙏🏻", "amila_bhamji": "Sending your family lots of love ❤️", "victoriasagers": "So sorry for your loss 😔😔", "sninaturalhaircare": "💗💗💗💗💗 keep strong", "thedolledupteacher": "Condolences.", "purple_pastry": "💜", "ranihindustani": "Sending love", "shazna_ilham": "RIP 😫 Sending your family sooo much love and strength.... I always loved to see your family in your stories... bless them all! ♥️ such an amazing family you have 💗 @deepica", "mannama4": "So sorry for your loss", "janeshav": "❤", "mominahaseeb": "Sorry for your loss..", "thurimakeup": "Sending love to you and your family deepica! RIP ❤️", "aarohijoshi": "❤", "touchofgs": "So sorry for your loss, lovely. Thinking of you and your family ❤️", "s.waya": "Who is it hunnie? My condolences x", "3m000000n": "May his soul rest in peace .. 💟 deepest condolences to you & your family .. 💟", "nah_bux26": "Sorry for your loss", "seema82": "So sorry for your loss. RIP to your uncle xo", "imrochiee": "So sorry for your loss 😔 my deepest sympathy to you and your family", "redlipsgoldskin": "I’m sorry for your loss, may his soul RIP", "lisaadave": "Deepest condolences @deepica 😔", "siya_monisha": "God bless 🙏🏽", "glambyruna": "RIP 🙏🏽"}