{"sofianwz": "@deepica my best friends older sister told me I should follow you because we had the same skin tone and she was like you won't be disappointed!! Come to find we are the exact same shade in everything sooo AKA I lucked the eff out because I can literally buy exactly everything you use and it always works for me 🤣 sooo yes, you are my beauty guru #blessed 😌🙏😘", "wear_urstyle": "Just now, saw your pic on another Insta page . ❤️", "hm_lk": "When u started speaking telugu in a make up tutorial", "alemoren0": "From your girls trip to cuba ! Im going with a friend so it was really funny and useful ! :)", "beautyandglam_byamanda": "❤️❤️❤️", "madaan_saad": "Hloo", "olivia_martinsen": "@priyalingam IF YOU GO OUT SOON I WANNA DO THIS WHOLE LOOK ON YOU (sleek pony included)", "pereen5": "Nice make up Deepica. You popped up somewhere I was browsing haha. Just followed you", "samriddh_dhareshwar": "When you showed up as south Indian Wonder woman..", "zaliyah.a": "gonna so try this for prom no lie!!!", "tracy_p_30": "😘💋", "getglammedbyhumaira": "Dayumm 🔥🔥", "vickipatel1954": "Awesome", "reensarai": "Now all my telugu friends are hooked to your YouTube videos as their go to when lo.", "poomicaa_p": "Just now, saw the post with the red lipstick choices for brown skin", "itsfotoula": "Today :) because I saw you comment on @maryamishah latest post on life balance.", "maryamishtiaq": "Before I moved to the city from GA. When you launched “Be Your Own Princess” campaign 💕", "ashvini.sundaram": "Gave you a follow because I love your vibe - intelligent, bold and hilarious", "prettybypia": "After Mario did your make up and posted a pic with you!", "iamishena": "Meghan Markle!", "simrindg": "My childhood friend @drbhanusali posted your Time Square Build board pic, congratulations!!", "mycocktail_life": "Vogue article about red lipstick", "cara_kam": "@deepica you’re goals:)", "puja.yatham": "Yesterday!", "anushkapinto": "When I found your lipstick under eye tutorial about a year ago and thought you were crazy but nonetheless was intrigued to see more. I became a subscriber for your makeup tutorials but now follow you for your energy, hilarious insta stories, Indian culture bombs and notes of inspiration that you see in your day that I can apply to mine!", "pink_empress_lini": "Followed u from @ltrdance", "kvw_dotnotfeather": "From your first appearance on TODAY with your sis and the red lipstick. Im an editor there and thought, “who is that cute young Indian gal with the impeccable makeup?”..started following your videos and impressing my own teen daughter with my new makeup knowledge, courtesy “my friend deepica” 😜 (she’s in college now and i still pass along your tips!)", "preetiefaces": "one of my friends told me about you and i am so glad she did! You are such an inspiration to us brown girls😘i live in germany and you inspire me so much!🙏🏼", "_ifary_": "@l1da.s your doppelgänger babe! Such beautiful ladies! Xoxo", "giselle.a.en": "Gorgeous", "l1da.s": "@_ifary_ 😘 I wish lol... she’s gorgeous", "lismojamm": "Just saw you in my latest MAC email😂and thought you were absolutely gorgeous, so I wanted to see if you had any tutorials/YT channel or IG!😊", "sindur1909": "Btw... I'm from Mumbai❤️", "salonsbs": "When your wonderwomen photo went viral", "okayyyy.kirsten": "Live*", "queenvee412": "She looks like you @isha.nanthini", "vishu817": "@deepica on NYE when I met Shyema, she mentioned you! Would love to collaborate down the road with you about my venture in Texas. Xx", "pujanaik31": "Your cousin Swetha is my girl! We went to college together ☺️", "beautybaaabes": "Found you on explore and just loved your energy from the beginning 💘", "anaisabel204": "When? Like 3 months ago", "alongcamejay": "Loved that YouTube video and started following then really love your enthusiasm and determination to make a difference. Wishing you a fantastic 2018. Love from 🏴󠁧󠁢󠁥󠁮󠁧󠁿London! 🇬🇧 xxx", "craypearl": "We met at an interview weekend for L'Oréal, and it was clear you had a passion for the industry. Beauty isn't my passion, but watching anyone share true passion for what they do is always inspiring to me. It's exciting to see your career unfold!", "tcannemarie": "When you put out the YouTube video with red lipstick under your eye", "beautystalker_286": "When i seen you on the Sephora YouTube channel. Love at first site. 😘", "rajiv.4": "Hey God what a great beauty love you", "rndmoreo": "I’ve been a fan since your Birchbox days and have been here ever since ❤️", "cc.vt": "I've followed you since you used to work at Birchbox and do the how-to videos!! Great personality ❤️", "haarshiitaa": "After I watched the video: full makeup tutorial in telugu..😍😍", "veronicamay97": "Literally a few days ago lol. Some makeup Instagram I follow featured you and I liked your makeup so I followed you and here I am lol", "thefoxxymama": "When I started Birchbox in 2014.", "stephrourkee": "Followed you when I started Birchbox!", "fellysha": "@deepica I'm a fellow longhorn hookem 🤘🏻 and saw you were tagged or featured with something related to UT !!!!", "alpa.rama": "Beauty", "jschmidty619": "From Yahoo! Feature found YouTube channel. At the time you only had 4 or 5 videos posted but I devoured them. Kept you on my radar ever since 😉", "xo.alyssia": "It was because of @monicastylemuse video about other YouTubers that inspired her I love diversity, women empowerment, and beauty so I decided to follow you on ig and I loved your content. My stepmom is from Kerala so it’s cool seeing someone of a similar background in the industry she loves your page too lol", "laurahelmsreece": "I started following you because of your Wonder Woman photo shoot. It really caught my imagination. I stayed because I enjoy your feed.", "dimpfu": "about 1 month ago, because of this friend @reginabishwakarma", "phyteclub": "I met your cousin Vivek in NYC and he suggested we reach out to you", "k0pal": "About a year ago I think I literally searched \"Indian beauty guru\" cuz #representation", "marissa.i.s": "@shannonsarkar", "miss.natalie": "I’ve only been following a few days and found you as @toofaced had regrammed your post 😊✌️", "deelicious_makeup": "from @alatorreee love you BOTH 💓", "geetsvv": "Beginning 2015. The red lipstick under eye video 😚 mad respect from Kenya.", "umz98": "I was looking to get into makeup but everywhere I looked, it felt like there wasn't anyone who could give me tips for my own skin color - a friend (@topramanandeggs ) told me about you and I've been following you since!!", "labyrinthbls": "Today!! Saw your makeup on insta and loved it", "amulyadeva": "I saw your Telegu makeup video and loved it being Telegu myself! It's so hard to find strong, Indian role models out there but then I found you and I'm inspired <3", "reematdesigns_": "You are a true inspiration and wish you lots of success!", "azreenprasad": "I’m not sure how but I so like all your pics and videos and styles. I Have also told my friends about you as you have inspire me. It’s great to come across someone like yourself. So keep posting and super proud of what you do.", "lanapatelxoxo": "My maternal grandmother needs a new kidney and is on Dialysis and I found out my grandfather had stage four cancer two days after my birthday ( my birthday was on Diwali last year and I happened to be celebrating Diwali at my Mandir the day I found out). I cried so hard because my maternal grandparents raised me do my grandfather is like my father and I didn't see it coming. I felt so guilty for moving to LA and leaving them behind but I also knew that I needed to make it out here so I could take care of them like they took care of me. I went back home for Thanksgiving and was so scared if that would be the last time I would see him. He was my strength and such an incredible representation of what an Indian man looks like but this incredibly strong man looked so weak in that hospital bed, he lost over 35 pounds and was so helpless. Well he was able to have surgery and come home for Thanksgiving. I pray for him everyday and I'm so glad he's back with my grandmother and he's able to walk around. They fuel my desire to become my own success story just like you, you're story and determination inspire me more than you'll ever know. I can't wait to see what the future holds for you. Thank you so much for reading this Deepica! 😍 🙏🏽❤️", "beaizpun": "Since your first colab with Sona Gasparian!! I met you through her and I thought \"She is so nice!! I'm gonna check her out!!\"", "lydlyd66": "You took over express snap chat last year and i thought she is cool!!", "jignapatelartstudio": "As soon as your red lipstick video went viral...i was whaaaa???? There's a girl with exactly my complexion showing me what i gotta do!!! It was seriously life changing!", "zahra_sandberg": "Instagram explore page - this week!", "shibani.93": "@deepica hi I started following you a few months back. When I watched ur video on how to conceal dark circles.", "keerthanakt": "I think I was looking up color correcting tutorials a couple years ago and your red lipstick vid popped up!!", "claudiamaretta": "I don't remember exactly. 😔😔😂😂 I just remember coming across your page somehow and thinking, \"She's gorgeous and one of a kind. Let me follow her.\" 🤦🏽‍♀️🤦🏽‍♀️ Is that weird? 😔😔😂😂", "aishuu_g": "Your red 💄 video", "cassdoyle_": "When you were on one of @dressyourface live’s tutorials!! Loved it 🙌🏼", "bellababee96": "When you did a video with @monicastylemuse . Since then I was like I HAVE to follow her & I never regretted it. Because you are AMAZING!!!! ❤️👏🏾", "sonupix": "I was on you tube watching makeup tutorials, I also follow #AmiRawalDesai and your tutorial was so informative yet funny, started following you on insta, and hooked!! You are so funny, genuine and so relatable, like it would be so cool to be friends!!! I always lol at your captions!! Oh, and your mom, is the icing on the cakepica!! 😂 👌👌", "jeniesbloc": "I stumbled upon your Instagram page and was instantly in love, especially when I found out you are South Indian because I am too🙂 way to represent us love your page and your videos, especially when you film your parents ❤️ I also love that you film yourself wearing nighty at home so casually 😂LoVE It and I cant wait to see more videos from you 🙂", "beautybyarya": "I got to know you when another YouTubed @shwetavijaynair spoke about you on her snapchat stories asking us to follow you . And that was the best suggestion she gave. Love you @deepica", "thaleigha_tessa": "don’t really remember how i found your account on insta but i do remember thinking you don’t often see fellow brown girls represented really anywhere so i’ll throw my support to you for giving us a face and voice out there ✊🏽", "hdidmymakeup": "I saw your pretty face pop up on my feed and I thought omg she's so pretty! And Indian! 🇮🇳 I've been loving your posts and channel ever since 💕🌟👌🏽💃🏽 keep slaying girl, you're amazing xoxoxoxo @deepica x", "pinkigosal": "I guess since Birchbox days ❤️ you! Thank you for all the inspiration and support. Love how empowering you are to women with such a positive message", "as.durand": "A few months ago when you were featured on @bhldn", "sagal246": "@deepica since March 2017 I think and I’m happy to see you where you are today very proud", "sanashafiuddin": "I don’t remember how I came across your page but I do remember thinking “finally, a beautiful desi young woman who is proud to be brown!” And I was pumped to hear about makeup for my skin tone!!! I don’t typically love all of the accounts I encounter but I absolutely adore you, your family and friends, and your posts!", "hiren5819": "Very nice to see you again (good morning) mam.", "prisci.hdz": "After I watched your video that went viral", "imamandeepnagra": "You are gorgeous 👍😍 @deepica", "selisathomas": "You were in videos with my fave, @alatorreee", "thursdaycloud": "Your red lipstick video, but I think I got hooked after you're #DearMe video? I'm not too sure.", "whereversummeris": "Brown girls need strong and sane role models, and I think you walk that fine line well. I followed you on insta but after I watched some videos of you with your mom (of cooking of course!) I was hooked!", "dafrastar": "I came across a photo from you from a few months ago and loved it, but I think I have been following you for longer than that. ❤️", "ahkneeya": "mom showed me an interview you did! followed you because i love having strong young female indian-american role models ( including @hatecopy and @babbuthepainter )", "farah.hoque": "@ohmygod.tara is just too fabulous and I love her pretty self and found out your pretty self was from our neck of the woods and one of her besties!❤️", "wiscogirl6": "From the Today Show", "tappa0403": "Since you were in Sephora video with David. Found you to be adorable so subscribed to your channel and insta", "fazena_b": "A few years ago I watched your red lipstick dark circle video and then about 6 months ago your Met Gala video popped up in my feed and I’ve been a subscriber since.🤗❤️", "carismah.hazel": "Loveeeee 😍😍😘😘 prettiest", "dreemehta": "I saw your NYC home tour video and I remember thinking to myself wow this is #homegoals but then I saw more videos and I thought wow this GIRL is GOALS. 😍😍 You’re so inspirational and beautiful!!", "shravsreddy12": "@deepica I love that you are representing American telugu people! You are such a great person ❤️❤️", "adikaicker": "I followed you years ago before you became a cool insta baller haha. Hope life's good. Best wishes.", "bhumika26": "I started following you from the red lipstick under eye magic video! It’s been a life saver, i have dark under eye circles and my eyes are deep set, this technique has saved my life! 👏🏽", "chaytanjali": "Birchbox days 😊", "alisharamos": "Since you were at @birchbox!", "tishnii": "Girllll 😍", "sdulisse": "Since the Birchbox days!:)", "vanamsaichandana": "I just started following you😍", "chitraak": "@juhiduggirala !!! & @megggzzy", "radiantbeautybylaiba": "After your dress your face collab", "s_borkowski": "I started following you when you still worked at Birchbox, before you had even posted your red lipstick video. 💜", "iamquueenb": "It would be terrible to ask you for a video explaining how and what happened to your voice! But I hope you really get better soon!", "drppngcrml": "I actually was watching another South Asian youtuber’s videos when yours showed up at the sidebar! So I started watching & followed you too! 💋✨", "_vignesramu": "I started knowing you when YouTube suggested to watch Make Up tutorial in Telugu. Since then , I subscribed to your channel and believe it or not, I watched all your old videos already! ❤️❤️❤️", "__lyaaaa__": "Omg you look extra stunning here 😍😍😍", "heba_jay": "Since you worked at birchbox 💯", "meerasanimaltribe": "I remember a guy in acting class telling me about you because you are both friends...being a journalist I did my research...you had me at dark circles! #Indianproblems", "krishakejriwal": "About a year ago i love watching new BROWN makeup youtubers so since when i found you i became obsessed with them. Now my mum and her firends are also addicted to ur vids! 💗", "vidhi.r.chauhan": "Great picture !!!!!", "spreadcheers.romi": "Almost 2 yrs now.. days of ur phone camera videos😇 being brown skinned myself, I really fell for ur makeup tips😍 then to now..cheers!", "makeupbyvic_": "I did your makeup in the Hamptons with l’oreal around 2 years ago! They invited you along with a bunch of other beauty bloggers for a weekend- I remember you being so down to earth and found you on insta shortly after!", "anitha_with_a_h": "Your viral red lipstick 💄 colour correcting video shook the south Asian community’s Facebook feeds for weeks on end! ❤️ Have learnt loads from you ever since! 😍😍😍", "farrahfogg": "Wow 😳 😍❤️💕", "__maala__": "about a year ago from browsing the beauty section of youtube! ☺️", "dhivravi": "@deepica When you made a video with Michelle and Buzzfeed! More than 2 years now, still your #1 fan!! 😙😙", "krishnadesai_": "In your \"Eat Pray Texas\" video! So heartwarming to watch! When I first saw it I binged the rest of your videos and realized the grind never stops for you, i aspire to be a hardworking person like you!!!", "qawahbeauty": "Today 🌞", "ipuvana": "Your south Indian wonder woman picture ❤", "gittabartholdt": "I followed you right after you posted your red lipstick cover up tutorial! It was my first time on youtube looking for makeup tips( I remember the camera phone videos) and you were the first guru I subscribed to 🖒🖒😍😍😍", "aditidas._": "Desi Ariana Grande 🙌🏽🔥", "mendihou": "From ytube", "khushi.kirk": "Recommended ytube 👏🏽👏🏽", "jahn.a.vi": "was in great search of good brown beauty youtubers and so glad I found u!!", "mrs.alkanshaly": "I saw one of your beauty looks on a page you were featured on, so gorg!", "kristensimonetti": "I started following you when you were doing Birchbox videos 💄☺️", "vana_antoinette": "I saw you about a year ago on a brands snapchat and thought oh she’s so cute who is she? Then realized I had seen your red lipstick video! But I followed you because I love how approachable your tutorials are! Back to basics for us regular girls! #htownconnect", "aarthi520": "I started following you after I came across your \"red lipstick as color corrector\" video. At the time I didn't know of many desi beauty vloggers whose style I liked 🙄and was excited to find someone who had a similar skin tone as me. The fact that you're Telugu just added to the relatability. Love your family stories because they remind me of mine. #theycallmepandu 😂", "itna_vars": "Saw you on the Today show and started following you. Proud Telugu. #represent", "meripiya": "Birchbox!", "roshbhowal": "Started following you when you first started working at Birchbox wayyyy before the red lipstick video. Stumbled across your profile while looking at the New York restaurant week hashtag and followed you because of all the cool content you posted when you worked at Birchbox. Following you first got me INTO makeup honestly. I signed up for Birchbox and began experimenting, reading, researching. It was so awesome to meet you a few years ago", "kaliandkalki": "Not gonna lie-it’s when I found out you were Telugu. Not to be mean or anything, I thought you were North Indian for the longest time, and I’m just not interested in giving my support as a Tamil woman to North Indian women (see current colorist and political dynamics of South Asia) but then I saw your video in Telugu (and I understand a lil bit of classical Telugu as I’m a trained Carnatic singer) and realized I could now finally support you cos you’re South Indian!", "sofiacampoy": "Wooooow 💜", "jomeng": "I think I first saw you when you worked for Birchbox and I loved that you were a brown girl doing’ her thing and I think the makeup that works for you tends to also work for me", "caseymorenoterrazas": "I watched @alatorreee spicy noodle challenge and I started following you! 😘☺️🔥", "crystal_danea_": "You cute 🤷🏽‍♀️", "kreeteakuh": "The dark circles video is how I found you! I subscribed to you and then I started following your social media", "enlightened22": "First Today show appearance ! Red lipstick hack was genius!", "fiionayl": "hey, i start on instagram, this is an account of makeup so if you can follow me, thank so much everyone💋", "poojak_78": "I first saw ur red lipstick video and I was so happy to found your channel. A brown girl whose doing her thing and rocks . Ur family blogs and all just 💕", "amykalinda": "Im Oct of 2016 when I was preparing to return to India since my adoption in infancy, I scoured the internet for successful Indian women and found you! I am a total product junkie and you are like the glamorous brown role model I never had as a kid (even though I have a few years on you 😁😁)", "pooj_rastogi": "You’re the first Indian makeup artist i ever saw on Instagram and you taught me how to use a blender ily!!!!", "sschipotle": "ngl I was searching for brown youtubers bc popular white ppl products don’t always look the best on me (ex. I bought Laura mercier loose setting powder and it left a chalky white cast and had so much flashback but like every single beauty youtuber uses it so...) so basically I found you looking for a brown-friendly setting powder!! haha", "vashteabee": "I met you through the volunteer work you did a few years back with GlamourGals! Do you remember that? The first time was when you came to a small breakfast that I was speaking at and then you came to one of the larger events and was working on the hot pink carpet! Happy to see your success, growth, and honesty about the struggles that we all go through! 💕🙏🏼😅", "shepersisted_": "LOL honestly, it was after the segment when you were doing the black woman's hair. I laughed about it for a few days. But then, you did a video to get educated on the black woman's experience at the hair salon. You immersed yourself into the culture because you wanted to learn. After that I was hooked. I thought that was so awesome and I'm glad I hit the follow button!!! I love your videos!", "swathisyam": "What a prompt response Deepika!! Never expected this. This just shows ur commitment and dedication", "alexmc195": "Gorg! I think you were suggested by IG based on who I follow", "kamrai": "I came across your page at the second half of last year (2017) when I came across your Wonder Woman outfit and then I just liked you stories and videos. I simply like the energy that you have and what your doing. You seem cool and smart too and you just make me laugh", "lisaadave": "I started following when I saw your first Telegu Tutorial last year. It was hilarious and relatable. And since then I’ve been obsessed with you. Oh I love watching your tutorials with mama pandu too. Your family is amazing. Reminds me of my little family too. I have a sister and it’s just the two of us; just like you and your sister ❤️❤️ I hope to see you someday @deepica xx from Malaysia 🇲🇾", "vulpix_rising": "Came for Southeast Asian Wonder Woman, stayed for the awesome.", "parbhumd": "Two months ago", "lavicarbajal": "can't remember but I watched your you tube tutorials. love your personality!", "rebe_pearl": "Today", "sarahjean_v": "When you made an appearance on @patrickstarrr YT channel (a year ago) over his Indian bridal wedding makeover and thought you were cute! ☺️", "ashbydainebeauty": "Because of your videos win Melissa Alatorre!", "right4rich": "By finally seeing someone in western culture who is brown skin and rocks beauty on the another level...a year ago", "ais_vea": "I think I've been following you since I saw you in a video of Melissa's?", "jess.m.ana": "I caught you at the end of your Birchbox days in one of their videos and thought you were so fun! Then I saw your viral red lipstick video and was like, “yea, she is so cool and has good stuff to share” so I kept watching. But I continued to watch and support because I dig your hustle and willingness to put down some serious work.", "puspathevi": "When vithyahaitandmakeup talk about you..", "vennelavav": "I found one of your makeup tutorials in Telugu in my recommended videos section. I was so excited to find a South Indian youtuber specifically Telugu that does these type of videos!", "clpds1989": "I started following you when you did a collaboration with Arshia and Sharifa. I was originally a follower of Arshia's.", "kamnig1": "Wonder Woman", "blichtner181": "I have followed since you first started appearing in Birchbox videos. I had been a member of Bichbox since it first started.", "singaporegirlinoz": "From the beginning!! Saw you on buzzfeed, watched the red lipstick for your panda eyes. So impressed to see a brown girl on YT. ❤️❤️", "vijaya_viharika_naidu": "Just today I started watching your vedio your sisters engagement vedio....later I started watching all your vedios then started watching your moms vedio and your interviews and just started following you in instagram May ten minutes before.... girl I really like your work keep going when I saw your dad I really miss my dad .....i came to US two years back and I dnt go back to India ...since then .....Your vedios made my day all my childhood memories just flashed .....😘😘😘😘😘😘 loads of love and god bless you", "udstevek\nVerified": "Verified", "janirodz": "@deepica since your days @birchbox. I remember when you posted the @jouercosmetics foundation that @czjouer had special made for you since they didn't carry one for your skin tone.", "kstrudthoff": "When you and @alatorreee did the spicy ramen vid 🍜 love both of y'all!", "jamilastj": "Started following after seeing you in Birchbox videos.", "aah.nika": "I just saw a couple of your YouTube vids and I started following cuz I was like OMG it's deepica", "racheljosilver": "@dammit_janet @deepica awwww", "mishj84": "Gorgeous!! I started following you mid last year. I think i came across one of your you tube videos and loved it ,as well as once i learned you were from Houston,I definitely wanted to be a supporter.", "beautbyfar": "My cousin told me to follow you. And I found you so cute. I think it was 1 year ago", "amoony1986": "Was looking for make up tips for dark circles 🤣", "skin_intune": "@deepica Came across your feed. Loved the makeup,looks,dresses amd YOU! You are so amazing at representing the Indian girls. So,started to follow 😍", "rachna_not_rachsne": "You went CHS!", "jeyashris": "really really recently, actually. you were in one of @jennim 's instagram stories so I clicked on your profile, went over to your youtube account and loved your energy and spirit! and obsessed w/ the fact that you are REPRESENTING in this industry. as a young brown girl watching beauty videos 8-10 years ago, i struggled to find youtubers who looked like me, with my skin tone and with relatable experiences. i am glad you are adding to the diversity on youtube and inspiring brown girls young and old with your content. you're beautiful inside & out!! 💕💕💕", "rachamalluusha": "After watching ur makeup tutorial in Telugu 😊😊😊😂😂", "jyotsna.kanchamarthy": "Found you six months ago on you tube. Following you since then and love your family feeds. You have come a long way and great inspiration for people from your ethnic.", "mizzmartinni": "It's been awhile that I sub, and instantly followed because we have the same skin tone , I'm Mexican. I don't see alot of brown girls doing what your doing 👍👍👍❤❤❤", "devika_daga": "My sister told me! @nitika_daga", "mahathiduggirala": "So funny story actually. I was in my friend’s room like 3 years ago and she has ginormous posters of you on her wall. When I asked her who you were, she said Deepica Mutyala. After a couple months, I found your grandma does my makeup challenge and subscribed to you", "dindianchick": "Saw u on the explore page, never saw an Indian IG make up page, got intrigued and loved your content ever since", "amandasushma": "Started following you awhile ago! Saw you from the famous lipstick as color corrector video, and I was like \"whoa, she's indian, my skintone, and a youtuber..must subscribe\" and I've been a part of the slayica fam ever since 🤗", "manu_billi": "I started watching YouTube beauty videos last year and I think I searched something such as \"brown olive foundations.\" Perhaps after watching another beauty blogger, your channel/video was recommended and behold! Now I'm a IG follower.", "anushaprudhivi": "After seeing your mama pandu videos and your family blogs..😍love watching them", "ydmorena28": "Last year.. first on YouTube then here. I married an Indian and I’m in love with everything Indian especially make up😊😊😊", "dollitta77": "After I saw your profile in @vogueindia", "madeofazul": "I first saw you on youtube.. the red lipstick for covering dark circles video. Also our initials and first name are same :*", "prettyconnected\nVerified": "Verified", "roxyroxx90": "You were still working at Birchbox and I saw your tutorials on their site. I don't have darker skin tone but I love your personality in your videos!", "rakel.inha": "After seeing you in some refinery29 makeup video, I think it was like 2 years ago 🤔not sure", "saltysouthindian": "@rclbeauty101 mentioned your lipstick + concealer hack in one of her videos, so I clicked the link, loved your stuff, and subscribed. Then I found you're Telugu, and I like you even more bc representation! @deepica", "toyos14": "After your Today show appearance. I loved your openness plus your girls bustin your chops about the hairstyling", "anoo_on_insta": "Couple of months ago, found your makeup videos with Pandus on YouTube, since then following you on IG, I’m not a socially active person but love to see your stories everyday. Sometimes even I feel motivated when I think that you followed your passion , rather than going with the flow( by not becoming a doc😜😄) @deepica Way to go girl!! Love to see more brown girl makeup and mama pandu cooking videos !!!", "krithika_rajkumar": "Because of @shamsxox! 😊", "christaylor_nyc": "👑", "mstar83": "@deepica after I saw your red lipstick video on someone’s FB post", "sherforjohn": "I randomly stumbled upon one of your insta post today and instantly liked it, and the whole positive vibes it brings out and just like that started following you..... God bless you.... Keep the positivity coming 😊", "hiyoconnie": "Meeting you through Vinesh and it was such a pleasure! Hoping to see you again and hang out with you when I’m back in LA! Keep killing the game 😘", "aleenamehan": "Think about a year ago!! Crazy how time flies! Looking so flawless here 😍", "amolkold": "Cause @djoseph3 kept tagging you on social media and I was having FOMO", "shazara.ali": "Probably the same story you'll hear from me and 1000 other brown girls but I saw your colour correcting video and never stopped watching! You're one of my fav, most relatable people on the internet ever!", "kavitadaggar": "The iconic red lipstick hack!!! I remember sitting in my student house scouring YouTube for a WOC who knew the struggle...and there you were *uncapped red lippy asap* 💁🏾‍♀️💄", "escoffthegrid": "ever since I discovered your dad tbh. He’s SO fun", "burningwilde": "Through @alatorreee Instagram lol", "madli84": "Saw your videos but my respect for you really grew when you shared your struggles with mental illness. Thank you 😊", "fatimahussain": "South Asian Wonder Woman debut!", "julied38": "Came across your video on YouTube while searching for brown tone/desi skin tones", "bohemebourgeois": "Because of @kristoferbuckle and @refinery29 @bea_organized", "sharanya03": "Best nude lipsticks for brown/olive skin tones! Such a great video!", "vx.422": "I found you on IG. You were a desi makeup guru, but more important a desi woman, but also a BOSS. You’re a role model for other women esp in a society that’s even more heavily sexist than American society. Will always cheer you on, will always be a big fan of everything you do", "bailey_bays": "I found you through R29 when they did that snapchat story about your vanity space getting professionally organized in NYC!", "priya.ladva": "Came across your Insta and recognised you as the girl who used red lippie to colour correct! 💄 Love how you're so family orientated and grounded. You never come across arrogant and I love how you're so grateful for the opportunities you have. Can only hope to succeed with my blogging the way you have! x", "themaharanidiaries": "When you started! 😍 Love your work. x", "marleedidthat": "After I saw you at Idealogue! 😍", "gsslleb": "About 4 months ago. Found you searching for darker more olive skin tone youtubers and was elated to find out you were friends with @alatorreee! Love her & love you! ❤️❤️❤️", "parlorwest": "Slay us honey!!!!!🔥", "ambalakshmi": "A while after your red lipstick under eye tutorial went viral (I did it. It worked for me. Now I use a colour corrector though) a friend messaged me frantically saying she found my doppelganger and she showed me your tutorial. I was hugely flattered, but I don't quite see it.", "rachelmonroe": "From when you were in a couple of birchbox videos with Rachel! 🙂", "angelacruztube": "When i found you on the Today Show!!! I was like, she’s amazing 💕", "rekhasglowbar": "I came across your account randomly and I loved it. 💕 @deepica", "blissfulbeauty7": "Today!! I found you on the explore page!! Luv your wrk so I hit “follow” ☺️", "kanikachaddagupta": "After meeting you and reuniting with @iisuperwomanii at a @youtubespaceny event a few years ago. Love your videos (esp the ones in Telegu)! 😊", "tiarramonet\nVerified": "Verified", "myshobha": "Beautiful 😍", "zarin712": "Honestly it was after the Today show mishap but I had so much respect for you when you posted that follow up video that I was like this lady here is so courageous", "nishasirpal_makeup": "About a year ago when I came across your videos on IG...such an inspiration, especially for the South Asian beauty lovers out there! 🙌🏽🙋🏽 Keep up the amazing work! xx", "leepamittal": "I don’t remember how but one video and I was hooked. And that too I am not a makeup person! Seeing you definitely peaked my interest. Love your work and very happy to see your success!", "ktnovy": "About 6 months ago. Found you via @alatorreee 🤗", "sayan_alekseev": "I just search up beautiful and you popped up", "mandaflint_": "I only started following you quite recently but I'm so happy that I did. I work for a beauty company so it was actually that way that I found you - I really liked your look and your attitude towards beauty and life. Through your posts and videos I feel like I've gotten to really know you. You're SO funny you literally have me cackling on my way to work in the morning or wherever I may be - I also think it's so cool how close you are to your family because I'm very much the same way. Keep it up, you've touched me in the most awesome way and I can't wait to see what else you achieve!!!!!", "vivgibbs95": "I think it was a suggestion on Instagram. I loved your style, philosophy and you're gorgeous so continued to follow :)", "noorsmoon": "I think it might be October 2017", "mussarathaji": "Few months ago. Saw a video by @dressyourface and started following you 😍💄🔥 you are awesome @deepica ❤️", "amykathwills": "Met you when you were doing the bhldn photoshoot with Kat and followed you because you seemed awesome (and you totally are) 😊", "welcometotheguyfamily": "Because of your brown girl representation and I continued to follow you because of how career driven you are. We are in two completely different fields but following someone who is goal driven , smart; ambitious woman is worth my while.", "s_shafqat_": "I think the first time when you appeared on the today show after your how to cover dark circles video went viral!!! :) love ya💞", "bal_mann22": "I think it was just over a year ago, I watched a makeup video you did and followed from there, so wonderful to see an indian woman doing all you do #inspiring #rolemodel ❤️🤗", "kaymara99": "Last year with a video where a girl was organizing your place to record videos and I freaking love your personality 🙌🏾", "ashleymlandry": "When I met you at @kristinasrunning wedding! Had a blast with you, Beau and Danny 😘", "rinzta_p": "I think from an article about Indian influencers you need to know in brown girl magazine", "hannahhangouts": "First time I found you I was YouTubing how to conceal dark under eyes and you used red lipstick which got me shook because of how well it concealed! And that is the story of how I fell in love with you and your channel 😍", "bhavnapunjwani": "@arshiamoorjani's video featuring you and @sharifaeasmin whom I've come to love as well!!", "skhanny": "Somehow i found ur thanksgiving vlog and then i loved ur personality and vlog vibes in general!!❤️❤️", "darshaalininadarajan": "I wish I found you much earlier than I did a couple of weeks ago on insta video on that famous Ghoomar dance! After watching a couple of your videos on Youtube, I must say I absolutely adore your personality and enjoy what you do @deepica!! You’re so relatable and I like how upfront and transparent you are on screen about how life has been for you and got you this far. Thank you for being so inspiring! I hope to meet you one day. Big big hugs ❤️", "chirasmaireddy": "@deepica since sephora color corrector video", "alfasengupta": "I met you in college at UT through some friends I knew who were in Beta Chi!! You were uber sweet back then too! I’ve been following your fame grow on the daily! You’re super inspiring and what’s even better is that, because I’ve met you, I know you’re still the same, sweet gal! 😊💕", "llbbyd": "From when you were still with @birchbox :)", "shru_t_i__": "This was such a look", "anxjalie": "😍", "pavikapilan": "@vithyahairandmakeup mentioned you in her story. I liked ur passion", "_azh_52": "Beaut 😍💖", "nima.dhury": "Two years ago, January ish of 2016! You did a talking collab thing with sharifa who I had just started following and I went on your YT and not only was a I shook I didn’t find you sooner, I have been obsessed since", "honeywhatscooking": "My friend @utopialife12345 told me about you and I started following you. I liked how you embraced your culture and talked about Indian parents etc, made good videos. You are relatable and so now I’m a follower. 😊", "aparna.vadde": "Came across your profile in one of your collabs with other bloggers. What made me follow you is brown + telugu + full of energy", "justazia": "Lol. After the Today show. But I really like your YT videos and IG. In fact, I recreated that yellow eyeshadow look you did and wore it to work yesterday.", "sshobi": "You kept showing up on my explore feed, and the content was really good!", "tarainphilly": "While researching MUAs for my Wedding in NASHVILLE where it was tough to find people with great experience with Indian/South Asian skin tones and I was like, \"Am I gonna have to DIY this thing?? Better try to learn something just in case!!!\" Luckily I found a great MUA but have loved following you ever since!", "raelkk": "Today show natural hair debacle", "emily.taylor319": "You were in an article, something like 10 most fun people to follow on Snapchat and they were right!", "miz_fabulos": "Wow such stunning features. Bold and beautiful ❤️😍😘 I’ve been following you for about a year now and loved all your amazing posts 😘😘", "befikre.jawani": "Wow, tou look fantastic", "sasharaveendran": "You were in a buzzfeed video with safiya!", "akhil_aniff": "@deepica sometime in October. I saw your Telugu make up tutorial and died 😂😂😂 and then my girlfriend @dancerish96 showed me some of your videos and said you shared a lot of inspirational content also", "covetchamad": "The natural hair fiasco, then I was like she is SO super cute and fashionable!!❤️", "aamtulaleem": "Can you please do make up tutorials. As your make up is awesome", "nidhi_vaidya26": "BuzzFeed I think? Or maybe I stumbled upon you and was like whoa a brown youtuber I gotta sub", "sums2279": "i'm friends with Shilpa Mutyala (Subash's wife) and found you through her a couple years ago!!! plus, i love me some Telugu girl fabulousness;)", "drshriya": "1.5yrs ago.... Cuz your techniques are so good...", "corischerer": "After cover FX! 😘😘", "anishaknyc": "From your @birchbox days!!!", "kokobeaute": "Saw your profile right after I started dating my Indian bf, a year ago, thoughts it was a great way to understand him better! ♥️", "justthetaz": "Started following when the “red lipstick for under eyes” video went viral. Was in need of a brown girl makeup guru to follow so it was perfect time. Been following ever since ❤️", "maryannjthomas": "This year! 🤗 I saw you on @alatorreee 's YT video. But I've seen your under eye red lipstick color correcting video a while back, just didnt realize you were the same person!!", "he_heen67": "From YouTube..of telugu makeup tutorial @deepica", "rosegoldserotonin": "💖💖💖💖💖💖💖💖💖💖💖💖💖💖", "fahmidax3_": "I found you through @sharifaeasmin when you guys did the no mirror makeup challenge!", "sacfoodiepri": "I came across your page on FB when I was looking for wedding makeup styles last summer, which then lead me to your You Tube page. I was excited to finally see someone with my similar skin tone trying on makeup that would actually work for me for once. And I’ve been hooked ever since! Love your videos 💖💖 #browngirlpower", "sarita_kapoorhotmailcom": "Saw you on Showbiz India, and was so proud. Loved the way you embraced your Indian roots as well as your American side. Great role model for my daughter. Love how you love your family. Keep at it, you’re an inspiration.", "harsini.ganesan": "Make up with mama pandu ❤", "kaviar3319": "I think a year and a half ago? Some time during my sophomore year on a friends recommendation!", "kemba2025": "NOV. 2017", "rspardikar": "@deepica 💕❣️you girl 💪🏼", "monicastylemuse\nVerified": "Verified", "champagnepapi_love": "I came across your YouTube channel when I was searching for nude lipsticks for brown girls. It was so refreshing to see someone on youtube, with the same complexion as me, that understood the struggle lol & how underrepresented WOC are on the YouTube/ beauty world.", "theebii": "Love the sleek look in you girl 😏😍", "psididthat": "Red lippie. Undereye dayssssssss. Enough said 😏", "shiney_sun": "@deepica ! @frenchbliss and I love you and we really love your parents 😍", "neenserella": "From @alatorreee's videos! I thought your voice was so soothing.", "ltrdance": "Indian Wonder Woman! 💪❤️", "theminimalistdo": "I came across your first makeup tutorial in Telugu on Facebook! It was so cool to finally see someone who shares the same culture and speak the same language as me out in the public eye! I never had that as a kid, and it’s so awesome to see it happening now. You’re awesome 💕", "_chelleeeeee_": "About a month ago after a tonne of friends and fam told me they found my doppelgänger (you). I disagree tho, you’re way too gorgeous.", "lavonnebeauty": "When I met you and did your hair for The L’Oreal Event!", "ambiii_s": "Since your Red Lipstick undereye hack went viral♥️😄", "jramirez2505": "Where you put red lipstick under your eyes! 🐼 I thought that was genius!!", "jodi_galvano": "@dressyourface, I don’t even remember how long ago!! I just remember you being so relatable on every aspect and your whole presence made me think damn I want to be friend with her. Just your relatable struggles and that you didn’t fake us out with an airbrushed image of your life. I mean you talk honestly about having a deep voice for Pete’s sake (so relatable over here!!) how could we not need you in our social media atmosphere", "aprilp.21": "Like 2 months ago by @luciebfink", "saraddabod": "Post MYTRA....that video on telugu TV with @silpaaa and @padmasrimutyala clearly paid dividends 😊", "kbellah0108": "Your red lipstick under eye hack video! So glad I found you!", "sonchiii": "Came across your YouTube video as I was searching how to cover dark circles! Loved your attitude & personality and started following you! ❤️", "rajnimitra": "I was looking for apartments in NYC when your apartment tour vlog came up and the thumbnail attracted me to view the video.. from then onwards I follow you", "surprhld": "Bumped into your red lipstick video & since then been a huge fan of you 😍. Love how confident you are about being Indian and doing Indian things 😘! Also u balance your Indian & non Indian self so well 🤩👌", "mahimajensen": "Post red lipstick 💄 under the eye video! So so so glad you exist so you can share all your legit make-up for brown girl finds 🙋🏽‍♀️Thanks to you I’m at @sephora alllll da time. #sorrynotsorry", "pnut_16": "Completely random 😀", "positivegrowth_blog": "U were a savior when it comes to covering dark circles and I've been hooked ever since. @deepica", "sjw4um": "Orange lipstick video on YouTube 😁", "frenchbliss": "My sister in law @shiney_sun introduced me and now you are part of my daily life. I feel we are all sisters ! We live vicariously through you.", "theambralife": "When you did a collab with @tiarramonet! You and your family remind me so much of my best friend also my childhood neighbor who are South Asian and exposed me to your beautiful culture! I immediately connected and felt at home watching you ☺️", "wholesomestartrd": "I am happy to support a fellow desi longhorn from sugar land! Your work and the messages you put out there are amazing 🙌🏽💜", "always_shanamarie": "Not sure when i started following but it’s been a little while now. I like to support anyone who doesn’t represent the typical, women who look like me. You’re smart, funny, not afraid to be yourself. And I also have a lot of love and respect for the Indian community. Has always been very kind, loving, and welcoming towards me. Enjoy cheering you on, thanks for having me!", "lipthimakb": "About 3-4 months, and I am in love with you! 💜 You are just so ridiculously inspiring! You make me want to be creative in my mundane life every single day! 😍🤗", "divya_sharma04": "Omg it took me a minute but I FINALLY remembered I fell in love when I saw you on @dressyourface", "shaadibazaar": "when you were at birchbox!", "anahitg_30_": "Few minutes earlier 🤪", "aditi.reddy2003": "Your first Telugu makeup tutorial lead me here", "alizavellani": "I started following you a few months ago when I wanted to learn more about fashion and makeup for my career in film. You made me feel like I could be anything I wanted to be as an indo-Canadian woman. Thank you. I hope to not only meet you but work with you in the near future! ❤️", "sydelle.jpg": "A while ago when you were still at Birchbox! I was excited to see a south Asian woman in the beauty community", "_iambri24": "My edges are SNATCHED", "pizzaprtyy": "since your 1st YouTube video! 💕", "kristoferbuckle\nVerified": "Verified", "pbeury": "Since birchbox days", "khetan_priyanka": "Finally got an opportunity to tell you thank you by this question .. you Red 💄 video all the way !! I was a new mom back then struggling with my already terrible under eyes, going to even more terrible state .. nothing else worked for my dark circles.. from that day to this day, I don't step out of home without color correcting my under eyes .. a big thank you 🙏.. it's been a game changer for me ❤️️", "bruce_stark24": "I started following you when i seen you as the South Asian Wonder Woman. I couldnt believe how breathtaking you were. And you still are. Im just in awe of your beauty. lol 😍😍😍😍😍", "satyakb1": "I think I discovered you when you did those collabs with BuzzFeed", "tmm1221": "@birchbox days! 💄", "brienneofbrie": "About six months ago through Jessica Alba’s profile", "christinepierson": "🔥🔥😘🔥", "karinegolly": "I love this look", "nivitak": "Red lipstick video! Been following you ever since :)", "maitreyiarya": "For about 2 years. Gotta support my Telegu sista", "porternelson.eleanor": "I started following when you were still at Birchbox! I found you from the videos you did with them!", "poojasingu": "So apparently our families are friends?! I didn’t even know this until I showed my family your videos and they recognized your mom!!! I’ve been watching your videos since forever I don’t even remember when I started following you tbh BUT YEA SMALL WORLD", "zoyaibrahim": "Since your @birchbox days before your first video, so the very beginning!", "official_ridaa": "Your mom and sister are one of my clients at my salon in Sugarland Texas. Your mom told me about you and I was like OMG I know about her. You have a beautiful family. Can't wait to meet you one day. Tell mom I said Hello @deepica", "shalu.sanghera": "When you did that video tutorial about the red lipstick for dark under eyes.", "sandra131_": "I started following you since your birchbox and do not regret it since 😘!!!! @deepica", "wondering_girl_": "Explore page! Love the fact that you represent brown skin girls 🙌🏻 obsessed with your tutorials!", "archu_krish": "When Your red lipstick undereye video went viral! 😍the very start !", "katstruk": "After seeing u on @todayshow do your thing...was lovely seeing a #BrownGirl talk makeup trends", "xoxlovehn": "I was actually looking for a at home brightening face mask & stumbled upon your turmeric/milk/honey mask 😆 which I still use weekly! I loved your personality, so I added you on YouTube & looked for you on Insta! 😊", "sonalhaladay": "I saw you on the TODAY Show!", "thepetitedoc": "That red under eye lipstick", "gajapriya28": "Makeup for indian skin 🤷🏽‍♀️", "sudeth": "When I saw that Today show episode when the girl with natural hair got pretty messed up 😂 and then you made the video of learning what to do with natural hair. Then I looked at your YouTube videos and was like this girl is crazy talented with her makeup. Now I take your advice on everything!", "soniyaa123": "Followed Melissa and watched the Hung Vanngo look she did on you 🤗💄", "sirishfish": "Mytra San Diego 😁", "girl_powher": "Since your birch box days", "devnas": "I don’t remember how I found you but my New Years resolution is to actively support South Asian people doin big things 🌟🌟🌟", "natalie_gore": "I saw you on GMA one morning and looked you up on insta. Then realized you had awesome brown girl content 🙌🏾😁 so I’m an avid follower on all platforms ❤️", "ranisamudrala": "2016", "rhondamarierawls": "During the 3", "haanypot": "A beauty! 😍😍😍 I started following you though the explore page lol it's so basic but I really love watching your videos now 💖💖", "curvesandwords": "Covered you for NBC!", "nadiarima": "When you first appeared on the Today show ❤️", "mustlovenerd": "@deepica when I saw your Indian Wonder Woman attire! Then I did a deep dive into your account and was like damn this woman is courageous and amazing! #browngirlsaremagic 👸🏽", "s_thoma": "Coz of my dark circles issue.when i told a frnd about my dark circles she send me ur video link ,it was before correctors were available and a lil before ur lipstick hack hit 1 million.", "jaynchawla": "After I found out you and @sherryjhawar we’re friends. Fierce strong women! 💪", "shanuka.kumar": "When I first saw your make-up tutorial in Telugu on YouTube. The struggle is real 😹❤️", "sudeshchilukuri": "My mom knows your mom... old friends I think?", "nadia_n84": "When you had like 15k followers I think in 2015 when you were a full blown New Yorker 🚕🌃 I loved your NYC snap stories to esp when you would get ready in a cab before a event hehe 😃", "mixedbynavin": "When I’m like holy shit remind me why I like myself real quick", "danceresha": "I was searching for makeup tips for south Asians, I think, and came across your posts. Anyone who can get rid of those darned dark circles under the eyes is a genius in my book!", "vana.kay": "I was looking for deepika padukone and as I searched her name your thing popped up in my search feed and I remembered you from YouTube so I followed 😂", "slnu521": "I followed @michellekhare and she posted a pic and had tagged you so I went to your page and just knew I had to follow you becuz following an influencer who is South Asian is just so inspiring.", "sumsmk": "Back when you were with Birchbox. I was so excited to see someone into beauty who looked like me and had a similar skin tone! It's been awesome seeing your growth over the years.", "curly_jaimee": "Can’t even remember when but you kept popping up on my Instagram feeds and i loved your posts. Lipsticks that looked good on you made me think omg i could wear that too! I bought and tried a lot of new products thanks to you. Also your struggle with adult acne, depression and anxiety reminded me that I’m not alone with those things. I applaud you for opening up and putting yourself out there. It does make a difference and helps people. My twin sis loves ya too ☺️ #deepifam", "sangii77": "searched for NC45 make up videos on you tube", "satibartistry": "Back when you did you tube segments in your room. How to cover dark under eye, how to highlight and beauty blender 101!", "andreeaa_r": "I was looking up NYC apartment tours and your video came up! I was binge watching all your videos after that lol ❤️❤️💕💕", "real_shrav": "Ooooh when I saw u on some Buzzfeed videos about Indian sari draping!!", "komalijonna": "I think I just randomly saw you on my explore page on insta and then I started following your insta cause it was bomb and then your YouTube channel!! One great decision after another ❤", "valmikcampbell": "Saw a couple videos with @michellekhare and yourself on the YouTubes and I’m always for supporting Indian talent. 🇮🇳✊🏾", "silverfeyfox": "Back when you were with Birchbox - I remember the conflicted feelings I had of being completely straight yet girlcrushing so hard on a fellow SA woman of colour - I utterly loved your smile - still do - and energy and was enamoured with seeing your tutorials and growth (and how you've grown since then!) 🙌💞 wishing you a wonderful new year and lots of love to you and your family x", "nagashriya": "I randomly found a tutorial of yours in Telugu and got hooked! I’m Telugu too and I couldn’t believe that you were as well! You’re also incredible at what you do and so inspiring ❤️", "kross305": "I was watching an insta story from @katiejanehughes a few months back. You both were going to some kind of a party and you were successfully applying a dark lipstick, while in a moving car! Anyone who can do that has got some serious talent, so I started following you from there! ❤️", "tinagadhia": "When I watched your dark circle trick with red lipstick, been a fan/follower since! 💄👊🏼", "dharpooja": "I found out about you from my faves at @browngirlmag ❤️", "poojaponnusamy": "First time was either the Today show or the buzzfeed video. I liked how you carried yourself.", "shilpiroy": "I saw you doing a demo segment on some TV show because of your dark circles hack video anniversary... So I went to your channel because it was awesome to see someone I could finally relate to and have been following you on YouTube since.. on Instagram, in the last few months...", "theluxurybelle": "I believe it was in an article / post someone had shared. It was years back. Glad to be part of the fam ❤️", "megnarasim": "Bc you hired my best friend @juhiduggirala ☺️🤗😍", "valeriasofia28": "When you did the spicy noodle challenge with @alatorreee lol 😂🌶", "jenellesarah_": "I have no idea!", "sonia_kg1": "Last year! Wish I followed you sooner because you are life! 🙌 #yayforyou", "sarahalyson14": "I saw the video where your mom does your makeup and it made me smile 😊", "t.am.z": "After you did a collab with Arshia. Checked out your channel and subscribed immediately.", "kdodv": "Since your Birchbox days! It has been so inspiring to see your career grow and transform!", "dammit_janet": "I started following when you still worked at @birchbox before you went viral. I still remember @racheljosilver sharing your red lipstick vid 😜", "alainarahamim": "Before YouTube success when you were still at Birchbox!", "milanxliz_": "@vithyahairandmakeup mentioned you in one of her stories", "raisarahman": "I actually discovered u from a collab u did with @sharifaeasmin !! Love u both 💕", "theglamoresque": "YouTube a couple of years ago because your vlogs were hilarious and so fun and then followed you on IG i think 2 years ago. hands down my one of favorite beauty bloggers, keep reppin' us south asians!", "sourpatchkids_resses": "After the red lipstick for undereye cirles tip.. still hoping one day you can do it for me!", "ptaketwo": "Found you in some blog about YouTube stars 😁", "rpatel84": "After ur met gala appearance - on the recommendation of @vaneshap", "xxanneka88xx": "I started following you 6months ago when I came across a video of yours on youtube and loveeeeed you ever since! xxx", "joannapallante": "Your brows!! So good", "simplysloane": "When you were working at Birchbox before the undereye explosion! So happy for you!", "bashnibalbhadr": "Please reply back privately only", "carolinamaani": "Since last week, I am married to a telugu and trying to learn telugu. I watched your telugu make up tutorial video and your sisters engagement Vlog and fell in love with the way you appreciate and live the Indian culture. We live in Idaho, I hope my daughter also appreciates and respect our Indian culture the way you do!!", "sumera1023": "YouTube video", "krismikell": "I would say I’m a OG", "okaylali": "I don't know I just found you on YouTube", "themeansweetie": "My sister in law is brown and a huge fans of yours. She showed me your page and I wanted to learn more about the beauty struggles she deals with and learn about products that work with warm skin tones so I could get gift ideas for her! Now I’m a fan girl too lol", "raiomar92": "I watched your you tube video about foundations for girls/ woman with your skin tone, and loved your personality and attitude, and the fact that I could identify with u as a fellow Indian😅n decided to subscribe to your channel, last year I started my instagram account n u were one of the influencers I had to follow 😘", "alwaysariba": "You hung out with one of my cousins Raheel is Dallas, and he told me about you and to follow you", "southpaw_diaries": "Umm not sure, I think I started following you to support a brown sistah!", "shaiirak": "After meeting in person after that summer solstice party! BB days", "keekzzzzzzz": "Well, my sister in law Deepika saw your video and was like “you would love this girl” because I am obsessed with makeup and fashion. I started watching a few of your videos and you literally remind me of myself. I am Telugu, I graduated with a degree in fashion while my older brother became a doctor and got married to a doctor. Ive always wanted to be a vlogger and someday I will. You inspired me so I subscribed! The end.", "herlagb": "Video with @alatorreee", "stay.reddy": "Oh my world😍😍😍😍", "karishma.jay": "Found one of your videos on YouTube a few months ago under recommended, clicked and got hooked! Loved your personality and style and then started following you on the gram. I only realised a couple of weeks after subscribing that I had actually seen you before in the ‘lipstick as corrector’ video AND coincidentally one of your pictures was on my hair inspo board on Pinterest 😂😂 you were so young in the image that I didn’t recognise you! So far loving the deepica/pandu fam vibes ❤️", "mownika_rokkam": "Saw your Dance video at your sisters engagement in my insta feed from there I strtd following u", "stephani_nc": "My Mom introduced me to a video of you and your Mom. Where she did your makeup. She said you had great tutorials too.", "paneertikka22": "On buzzfeed! I love your personality and you I feel like most people can relate to you! Keep it up girl!", "veditha": "@deepica Using lipstick to cover up dark circles!!!! I hadn’t slept for 2 days and had a date 😏😏", "kbhalla2889": "Someone sent me your red lipstick video and I’ve been following since then", "chahri": "For as long as I can remember 😜. I started with youtube first.😁", "thefacebykase": "When you called me 😂😂😂", "grace.amy_xo__": "I saw your article in Deccan chronicle-Hyderabad and I started following you in 2017", "megsc28": "From the very beginning! I just learned of the lipstick trick, then all of a sudden your video with Birchbox came about. It’s been amazing to watch your journey!", "juicyjayxo0": "I believe that I found you on either the buzzfeed video of desi girls trying saris, or it was the video with Arshia and sharifa. I loved your personality! Not to mention, you are stunning!", "poojak87": "You came up on my YouTube in early 2017! I was looking up skin and makeup tutorials for brown skin and there you were! Follower ever since 🤗 @deepica", "summirz": "I started following you when I watched the ‘dad does my make up’ tag, and he was holding a beauty blender and asked, ‘why don’t you hold a stethoscope instead of make up’. That was too funny and then I realized you were the red lipstick for undereyes girl and I’ve been following you ever since. Haha love Papa Mutyala! ❣️❣️", "miiinuuu_": "From the video you made about using red lipstick to color correct dark circles!", "km323": "@deepica met you at Divya and Vinit’s engagement party. (I’m Vinit’s cousin from LA). Years later Divya told me about your posts and I started to follow you!", "mayras131": "Just yesterday bc of @alatorreee", "lipimohanty15": "Almost six months back I guess , after I saw your video with your mom. The one she does your make up but ends it with a hint for you to become a doctor", "maryshekinah": "Your super hilarious first telugu makeup video tutorial", "aneeta.mahan": "Your giant ass leap of faith - oops > what if and that’s when I knew I wanted to follow your choices and journey", "srija_24": "And buzzfeeds saree video", "tayyagari": "Long before you were Deepicam 😍😍😍", "maulidoll": "@deepica Been following since you had your viral video ❤️ still a fan till today! 😍", "mangiferin": "Wanted to follow a desi MUA who was closer in skin tone to me!! Southies unite yo!", "darlingnieves": "After the issue with the natural hair styling kerfuffle. I thought you handled the situation with such grace and humility. Then I watched your YouTube videos, LOVED THEM, especially since we often wear similar foundation shades, I immediately subscribed.", "mynomadiclife2006": "I was looking for rocking desi beauty youtubers! Found you and immensely proud of you!!", "jacq.p_": "A few months ago when I saw you hanging out with Melissa! I guess I had been living under a rock haha.", "pragna_97": "Since your very first telugu makeup tutorial and I was like omg she’s a gem❤️😭 You’re an inspiration Deepica! Lots of love xoxo", "noopuranagol": "When I saw your collab video with @arshiamoorjani and @sharifaeasmin or Arshia’s channel that I was already subscribed to. Promptly subscribed to your and Sharifa’s channels after that :)", "stylenbeautydoc\nVerified": "Verified", "denisetanya": "Around the middle of last year", "its_alisha_": "Fam and I were watching random Indian news THEN YOU & MAMA PANDU came in all of your glory 😍✨ #thankyouTV5NEWS", "productjunkie_confessions": "Heard about you through a family member", "stllrphoto": "You're Telugu!! But so much more obvi. But that was why haha", "shellybewalking": "Recently saw a post with @mannmukti", "serenasteph": "When I saw your princess YouTube video 💕", "ruchi_kan": "Started following you and @arshiamoorjani after desperately looking for lip colors and eyeshadow ideas for women of medium and darker tones. I was sick of going to weddings and other events with makeup that didn’t suit me. Thanks to the both of you for what you do!", "nehanayy": "You popped up on my insta newsfeed!!", "jenniercampos": "When you did the spicy noodle challenge with @alatorreee hilarious!!", "the_emcat": "When you were making videos at Birchbox! 💕", "pripriyankapri": "@spartan_hkb Telugu girl for you", "jainihs": "You were featured on Buzzfeed for your red lipstick under eye coverage & I followed you. Then immediately emailed you 💕", "preethaali": "Started following you during your Birchbox days and the videos you would make! I was and am so proud a South Asian girl is killing it in such an industry where girls with darker skin have a harder time making it. So, now that I am a mother to a baby girl of 6 months, it’s people like you that will help to open up worlds to her that were previously shut off. I took the traditional physician route, but want my baby girl to know she can do whatever she wants! Go get it, girl, and thank you for forging the way for her.", "mihna_nasih": "So one of your makeup videos while scrolling through youtube. Liked the positive vibe and how passionate you were. Also being a Maldivian I could totally relate your makeup as kinda same skin tone. Much love. Happy new year ❤️", "srajanala": "Right when you went viral! I remember I was out with my friends and one of them was talking about an Indian beauty blogger and I was like “YAS that’s Deepica” lol", "emilymen": "You are so beautiful!", "kelvinboeii": "YouTube from your 1st video 😂", "sheryl_109": "About 10 months back , I stumbled upon you account on my INSTA news feed , and being an Indian ( and dusky South Indian 🙌🏼) residing abroad I could relate so much to your posts about beauty , culture , representation and beyond! I especially love your vlogs and posts with mama and papa pandu 😍 one of my personal fav is mama pandu teaching how to make dosa and papa pandu doing your make up💛💛💛", "sunnyskyze": "A friend of mine shared your YouTube video on covering dark circles with red lipstick and I was intrigued because that has been my #1 nemesis. She also told me you and I were twins👯‍♀️", "brown_girl_things": "I saw you in khusbu’s marriage in Houston. At first glance I had a feeling you are a public figure. You carry those vibes. Then I started searching you on insta and bingo I was right🤷🏻‍♀️", "rorocartagena": "Birchbox days! 😃", "arwaleilah": "when buzzfeed featured you for your red lipstick video !!! you were the first South Asian MUA who kept it real so I’ve been hooked ever since ☺️", "varshasdiaries": "I was browsing for some brown girl makeup stuff and you popped up 🤩 So binge watched all your videos and love them.. have been following from almost an year.. 😍❤️", "kullumanalii": "When you dressed up as Disney princesses!", "jasmin__rahman": "Hmm a few years ago when we were featured on india.com in an article together! @deepica", "amandaschoice": "Two weeks ago! Came across your funny Telugu video and loved your personality. Also you’re the first Indian Beauty guru I’ve seen and I love following beauty industry women of different cultures. Ohhh . . . And you have the MOST beautiful eyes💕💕💕", "sarahq84": "When u did the dyf collab!", "veena_ganesan": "I used to see your Buzzfeed articles and I recently got into beauty/makeup! I find you so inspiring for doing what you love!!", "_lisamol": "I found you after desperately googling South Indian make up fixed especially for under eye circles! Then I followed you bc I like your posts and upbeat message - I also think we may have been at UT together and know some same folks from Houston!:)", "smileysayli918": "When you came to our school event at Rutgers!!", "sorahsays": "L’Oreal Brandstorm. Cc @dannyicruz", "nuhasyed": "Found you through Lucie Fink and stayed bc I absolutely love seeing brown girls who like me prosper and inspire in a such a creative way :))) 🌻", "desh117": "Fellow Telugu girl doin' big things outside of the stereotypical expectations of our culture is what led me to follow you! ❤️", "rblevs": "Back in the day when you were with Birchbox", "harinimedikonduru": "After your DP inspired Cannes look showed up in my suggestions 💚", "carolinesherrilphotography": "Watched you with @monicastylemuse", "sincerely__sneha": "About a year -is ago when I was looking for lipstick colors to match indian skin tone. It led me to yours , @arshiamoorjani and @sharifaeasmin instagrams", "ladyvee822": "Birchbox days 🙌🏻🙌🏻🙌🏻", "monica_k26": "After your youtube video where mama pandu does your makeup #lotsoflove ❤️", "fatema.m.bharmal": "When your south asian wonder woman look went viral, I was obsessed. I \"hit\" follow and have been lovin' your posts since then.", "marygmccann": "saw you on refinery29 :)", "imaiolino": "After I saw one of your family videos in youtube. the one when your sister got engaged..", "arishanazir": "When I realized you were my friends long lost twin 2 years ago hahah", "kp_karisma": "Last week because my cousin knows you", "catkkal": "Buzzfeed!", "johag_lovelife": "video #2. When you did your red/orange lipstick undereye 😁", "sriyagokul": "Gorgeous!", "thomas.steffi": "I think i saw you on BuzzFeed, then started following you on YouTube and now Instagram as well 💜", "abigail_danielll": "Since your red lipstick color correcting video!!!", "arushikt": "5 y ago ❤️", "_krutimehta": "Intrigued when I saw you reppin brown girls at Birchbox...and found out you were an AHS and McCombs grad 🤘🏼", "rakheemandalia": "Buzzfeed (probs about two years ago!)", "gsnxmakeup": "A couple months ago on YouTube because of the video of you and @alatorreee 💕💕💕", "beautyproductsaremycardio": "I think it was when I started my blog 2 years ago and you came up on my popular page! I liked what I saw and followed 😻😻😻", "its.sita": "I got a Birchbox subscription in fall 2015 as a way to teach myself more about makeup and started following their content. I was really struggling to find tutorials that fit my skin tone and I was so excited to find your videos through them. When I realized you had left the company, I found your YouTube channel and the rest is history!", "jamillaedwards": "2 months ago. Came across your channel on you tube!", "nika_rx_sho": "Undereye coverage back when you first started! #loveyou", "mkparti": "your article w the tig!! been subscribed ever since 💕", "thavig2": "When you were in Michelle Khare's video on her channel.", "ttnali": "Found you via my other fav @colormecourtney when she tagged you in an insta story from an event you both attended . My fav 2 of 3 ladies on Instagram . @oliviajeanette_ is the next and you all add something special to my life", "schaudhry91": "Literally your undereye video and then after that I was ALL UP IN YOUR BUSINESS LOL 😂❤️❤️❤️❤️❤️❤️❤️❤️", "vruu07": "Right after the red lipstick to hide dark circles", "glambythulasy": "A few months ago on YouTube! I wish I had come across your page sooner 😭❤️", "ayerey": "Telugu tutorial my sister @abigail_danielll was watching 😭😭😂😂😂", "lifewith.summer": "Idk remember if it was Jackie Aina that suggested her viewers ck you out or You Tube recommended your video based on what I’ve been watching...🤔 I think it was Jackie tho 🤷🏾‍♀️", "hanalei_a": "About a year ago!", "arikashani_": "Saw your WonderWoman picture floating around somewhere on Instagram. Immediately hit follow & never looked back 😂❤️", "shalini_sandy": "u wore one dress lehenga type from thT in insta", "sharese_reynolds": "I was doing research on beauty bloggers/makeup artists etc. and I came across your name on several sites soooo that’s my story 😁😁 not sure when I started-late last year I think 🤔", "vaishcantsingh": "About a year ago when you wore a white Payal Singhal lehenga! You looked STUNNING so I thought wow I need more of this. Then I checked your socials and you just seemed so chill, open to both praise and criticism, which was so admirable. Even to this day you seem like a friend to me, fame doesn't seem to have changed you. I respect your hustle and will continue to support you. Love you ❤ #deepifam", "harika_reddyp": "There was a recommendation of a video which u did in telugu(1st video) in the youtube..soon after watching that I fell in love with you and I started following you😘", "aimformoksha": "Since your early Birchbox videos @deepica", "mszawlowski": "About a year ago! Love your insta!", "goopygoops": "Early 2016 after a friend sent me a link to a Buzzfeed article about you! I had just been complaining that there was nothing for South Asian girls who don’t know how to do makeup 😂", "punitavakil": "I was on a 3am feeding with my son, 2 years ago,and went on to IG and you popped up! I started watching your smashbox tutorial and bought all of it and learned how to do it all from you", "shimaadil_": "Literally today only :( when your make up tutorial in telgu popped up on my yt feed. P.S you are GORGEOUSSSSSSSSS🌻💛", "sharkk28": "When I looked up Indian makeup tutorials because I had no idea how to do makeup", "mimiazeera": "After I stumbled upon that video where you put red lipstick to cover dark circles 😬", "sanisub": "Through YouTube when I saw you do a collab with @sharifaeasmin & @arshiamoorjani", "hinahaji": "This year", "libbycphillips": "I think it was from @maybelline and I went out and bought the eyebrow drama pencil thing! About 2 years now! Mainly on snap and insta!! Love from 🇬🇧💕💕", "farha0401": "Came across your turmeric facemask tutorial on YouTube about 2-3 years ago and that got me hooked. I love me some kitchen pantry skincare. Besides the fact that you're also hydro ;)", "eyesofchu": "I was randomly looking on yt for makeup videos for us brown skin gals and I came across your channel and then I watched almost all your videos then subscribed and followed on insta and now we're here! 😊💛 ty for doing the most!", "dirtymindrottenthoughts": "Honestly cuz I like looking at you, in a not that creepy way. Don't remember when but you popped up on my timeline last year", "ateliersona": "You were at UT when I was there but I saw you on the Today show and recognized you so I followed you! 😊", "sindhumerugu": "Somehow on Youtube I got linked to the video when your mom did your makeup and I loved that video!! I subscribed to your Youtube channel and followed you on Instagram!", "thychainz": "Found you through @alatorreee maybe a year ago? Love your content and want to say hi from a fellow Houstonian 👋🏼", "_sanashine": "Birchbox’s instagram. I thought it was cool that you’re Indian and appreciated the representation and your mad makeup and fashion skills of course :) happy to follow you through your success", "isha.dami": "A little over 2 years ago! 🙌🏼", "osuqt515": "Shortly after I saw your video on YouTube with the red lipstick under eye cover", "anakul": "You are the first American youtuber I could relate to.", "byhumna": "Probably around the time of your epic red lipstick hack video. Best decision! Love seeing your content on my feed(s)! 💕", "aasthamalhotra": "Buzzfeed!", "totallyhookedonthisfeeling": "After my friend sent me a link to your makeup tutorial in Telugu! 😂", "pajamamama512": "We met in Tulum in March & you gave me some really cool advice and were so easy to talk to. I asked you about make up routines for mommy’s and told me some cool tricks! You were so honest and genuine and I have learned so much from you ever since. 😘", "archbomb": "Birchbox days", "kavyab95": "YouTube and 1 year ago 😍love the look", "bidishask8s": "Probably YouTube makeup, most likely.", "sophia_farah": "Your first buzzfeed video 😂 I was like YAS look at this fellow Indian princess slayyyyyy", "mximena87": "Since you worked at Birchbox!!", "ayeshavarshney": "I saw the way you handled your Today Show incident and I really admired how down to earth you were and how willing you were to learn from your mistakes. I really appreciated it a lot and it showed me that you are one of the few public figures who wants to learn and grow and not make excuses. From there, I just really enjoyed your posts and all your creative looks.", "pinkyganesan": "Insta 2017!!!!", "natashter": "Through @ready.to.glow", "mygoldenbeauty": "So fierce!! 💕", "jesselizarraras": "though @luciebfink!", "sreya98_": "My god u look 😮💕😘😘", "indigotrip": "I followed after you popped up on my YouTube recommendations. I instantly subscribed and then looked you up on Instagram! I absolutely adore how much of an impact you have made in traditional media to bring people of different skin tones or sizes to attention. Coming from one South Asian to another - you go girl! You’ve got a sh*t ton of supporters who will back you up! 2018 is for you @deepica 😊", "heyshiks": "Because of your Telugu makeup tutorial. Love you Deeps. I'm from Andhra as well 😘", "bringmethecurry": "BIRCHBOX DAYS!!!", "monicadeva": "Back when you still worked at Birchbox"}