{"daaniafazal": "Thanks for sharing this and bring it out of its shadow.. a lot of people go through this process every few weeks, and hell yeah its a struggle, it fricken sucks and I hate it so much! But I appreciate you sharing that you do it too.. #livetinted", "texanrupee": "Mine too! Sideburns..I’m a hairy beast on my face. 🤷🏻‍♀️", "msnadiak": "@rabeena_", "dinora_r0221": "Wow. I've never tried the whole face. Just doing my eyebrows is painful enough 😂 but I am hairy beast so I wax the stash at home. I've got lots of peach fuzz and sometimes I feel like foundation would sit better if I just waxed the whole face but I'm afraid. Sensitive skin problems. So which do you prefer threading the whole face or waxing it?", "kvc1015": "Oh it's a THING alright! Every two weeks THING.", "sid_channa": "I feel you, I go every two weeks for my full face too.", "aartie.biharie.visagie": "Ohw no, this is hurting sooooooo much 😳😭. Tried to do my moustache, neverrrr agaaaaiiiinnnn 😂😊 hahaha.", "betty_verghese": "It would nice to go every two weeks ..hair grows every week", "debra.sh": "You should give electrolysis a try. I’ve tried everything before electrolysis. Electrolysis made such a difference with the amount of hair I have on my face. I must warn, it’s a bit painful and you do have a few days of redness and a few scaring that goes away with good skincare routine but I promise you, you will never go back to anything else for hair removal if you try electrolysis.", "denise_the_foodie": "I have the same problem 🙌", "decade47": "Totally can relate!", "sharonhalli": "#browngirlproblems", "carolineelliotttv": "Bliss spa has an awesome wax you can heat in your microwave and just do at home at your convenience. Highly recommend! Not an ad!", "y.mazhar": "Laser has been life saving for me. Best investment ever made", "hebaglobin": "Any honest laser hair removal place should admit that laser doesn't work on finer hair like fuzz on the face. It only works on very coarse body hair. When I tried getting my face done the lady literally said \"I'm sorry but I'm not doing it on your face because it won't work\" but most people won't admit that because they just want your money", "rehanad96": "I go through the same thing . Every two weeks id be threading and waxing my face .. so tired of th fast growth of facial hair😣😣😣", "psethi5": "Thank you for sharing!! Love your honesty ❤️ This makes me feel so much better knowing other brown girls go every two weeks to get their face threaded as well! 🙈😳 Its frustrating too because sometimes the ladies threading my face make me feel guilty for giving them so much work and hair to thread 😫", "my.crazy.lyf": "@shistatad this is you... except your hair is light", "saybilli": "@adiba204", "saimas_henna_mua": "I tried threading my full face once and I broke out right away. My face was covered with small bumps and pimples for 2 weeks and it was a nightmare. I never threaded again and it has taught me to embrace my facial hair. I do get the looks sometimes as to why I have facial hair and people has passed comments (my own friends) .. I occasionally bleach (for special events) but try to keep it minimal #embraceyourbeauty", "desirousmuse": "The struggle is real. I have to wax my face every WEEK. Four days in and my chin is covered. It is so embarrassing and I am thinking of doing laser but man it is a struggle", "mapsmatic": "this is so wonderful you are sharing this!", "oatlygoatly": "Why did you choose threading and not waxing? I’ve been wanting to remove my facial hair but i don’t know which method to pick", "ranoya90": "I like it😍but it doesnt painful???😰😰", "beautycuratoryyc": "But your brows are sick!", "lotuskiki": "Yes, every 2 weeks. Currently, I'm getting lasered and already see a reduction. Hopefully it stays that way.", "haseena.samtani": "@deepica have you tried dermaplaning? I’m so curious, I feel your pain!", "chicmom2011": "@deepica yes I can relate...I have whole body laser with pretty good reduction, about 60%. I stoped threading after having my son because it was so painful and it started to mess up my skin(enlarged pores) and I am continuing with laser and shaving in between. It sucks. I already feel for my daughter who is 7 😩", "ri_ti_11": "You are helping so many girls with your post 👍🏼", "indiabythread": "I’m fed up of threading! Going to start laser hair removal in two weeks!", "hiren5819": "Cool", "jen_darling": "#browngirlproblems", "navprivatex": "THANK YOU FOR THIS THANK YOU", "bombshellbeautybychetna": "I get this done too!", "1cicy": "@deepica I feel like I break out afterwards but I totally agree with you!", "bengalspice": "Full face threading season is upon us. Gotta get rid of the winter fuzz.", "sruthi12": "Right there with you!!! No shame", "shivana": "Try electrolysis! Was threading for years now I don’t have to 🙌🏽🙌🏽", "mitsamazing": "I did the laser thing and didn’t work. After my 2nd child the hair on my face came back darker and coarser so have to get it waxed every 2.5 weeks, eyebrows threaded. It’s a pain and felt a waste of money on the laser. So jealous of those who don’t deal with this maintenance every 2-3 weeks.", "emilycwiesman": "@leighmichelle28 I want to do this", "simplyblissfulliving": "I just got my face waxed ...", "janineronda": "Do you use anything on your face right after threading? Any moisturizer or toner? Would love to know! x", "suhashani_": "Thank you (hug) ✨", "innavative": "I’ve tried laser three separate times, with 4 different people, and 2 different styles of machines(gel vs cold air) and for some reason, my hair just grew back coarser, i tried electrolysis which seemed like it was working, but it takes FOREVER to do it to your entire face, and it kinda hurts a lot when each individual follicle is burned off 😭", "uresha74": "I’m definitely one who can relate! Price we pay to feel pretty!", "shalinirosebeauty": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "keshirarihsek": "It feels like a massage after a while! I've been getting mine done for the last 4 years, best decision I made! Favourite part is when your face feels like silk after!!!!! Your face is a dolphin gliding!!!", "amrpatel30": "Laser worked partly but too forever still not perfect. Yep- the threading never stops!", "osugarsugar": "🙋🏾‍♀️", "theorigin.elle": "@deepica you are a champion I tried this ☝🏽 time and I barely got passed the lip before I told her “that will be all” I stick to brows only. 😅", "shalinisarena": "Hairy girl problems like woah! Why didn’t laser work for you hon? Would love to hear your feedback. Hope all is well! x", "its.sita": "THIS! There is SO much upkeep and it feels like it never goes away. I’m “lucky” my mom started teaching me about waxing when I was getting teased for my mustache at 11 years old (I mean I did have more of a mustache than the boys in my class lmao). It’s literally been more than a decade and I know I have the rest of my life to deal with it. I tried laser recently, but I’m mixed so some of my hair has lighter roots, so the tech said it may not take. 😒 Body hair is such an every day part of my life, but us brown girls feel so much shame around discussing it because we’re expected to suffer in silence and just deal.", "iluvbri": "Why do we have to deal with so much more hair than we should. I’ll never forget the day I got teased for my hairy arms and mustache I went home that day and shaved everything off and haven’t looked back lol.", "lindsay_nunya83": "I get my brows done but haven't thought about getting my face done! I might have to try it.", "dreamindulgences": "I got Electrolysis done on my chin area and it has done wonders in just 5 sittings. I don't do it anymore. It is painful though but you can get numbing creams. Worth it!!!", "bthorn00": "I relate to this so much!! With black hair, facial peach fuzz is so noticeable, I hate it around my eyes. And when I see my face in sunlight and there’s a layer of hair illuminated lol. I need my whole body threaded", "dasate89": "💯 there with you", "only_anniemarie": "Man how do u just sit there lol. I cry every time I get threaded. And they aren’t happy tears!! 😂😂", "asmasidd": "This was me last weekend ugh. Hate doing it so much, but hate how I look if I don’t do it 😭", "rpat51": "Story of my life!! Argh! I tried laser too and it helped a little, but still have to see my threading lady every 2 weeks 😣 @deepica", "tatumdavissolis88": "I'm in pain watching you girl lol @deepica ! I just started shaving mine. Wax didn't seem to work, never did the threading because I'm a tit and it looks painful 🙈", "anumanes": "Thank u for being so transparent and sharing..this is something so many of us deal with", "karthikakurup": "@deepica You got it right. I remember when I was younger , i had this guy come and ask me \"did you forget to shave ??\" Whilst pointing at sideburns and chin hair that was on display , courtesy of thyroid. I remember till later years going over that scene everytime i had to wax/thread it . And now in this stage of life, i know there are more beautiful and important things to hang on from the past than that scene !", "shebeet89": "Thank you. We are humans. Someone just yesterday pointed out my not even that noticeable chin hair. I was insecure until I saw this. Honestly. Best post ever.", "kamrai": "@raman_rai 👀👀👀👀 I’m not alone", "bal_mann22": "I get my eyebrows threaded... best thing ever!!! when I was younger I had a lot of facial hair and it being black it stood out! But luckily as I grew up the hair went finer... so I actually use an eyebrow razor on my cheeks and upper lip and it works for me... and luckily the hair didn’t grow back thicker... but it exfoliates the dead skin at the same time 🙌🏽🙏🏽💯😂😉😘😘", "mayatou": "Middle Eastern genes here 🙋 I don't do my whole face but eyebrows and upper lip for sure every 2 weeks or so. @deepica", "makeuped_._": "Is it okay to get baby hair threaded?? I have to much and they are irritating", "dishij": "I used to thread my neck, chin, upper lips and it was a horror. Horror because it came back so fast. But Laser has helped me a lot!", "vysch.v": "I can relate!!! Threading breaks me out 😭", "spidermonkey_11": "Why don’t you wax it? @deepica", "aminamukadam": "@deepica totally feel u girl!! Perks of our skintone is that we age better but have to deal with alot of hair upkeep😂 Could i suggest shaving the face with the microblade- eyebrow razor.... its a totaly game changer- for makeup application, skin care and even ease of use... please try it... alot of makeup artists use it n have shown the way ... n and let me know if it works for u..", "rv11090": "@deepica it makes my heart so happy that you are bold enough to post this! I love that you own it! I’ve suffered from facial hair problems for a while now after laser removal induced hair growth instead of removing it! And now I’m going through the antiquated painful process of electrolysis. It’s so embarrassing and been something I’ve tried to hide. Even from my bf. Thank you for doing this!! 😘😘 love you girl. Keep on keepin on! You are truly an inspiration! ❤️", "esmeeeraldaaa": "@coooookieeeee98", "mvarma8": "@deepica girl go to Clearstone Spa in Houston @clearstonelaser. They have a special laser for our skin tone and it does work. I had beard like hair under my chin, now it’s just peach fuzz!!! And most of it is gone. I LOVE IT. You may have to stick with it a bit longer, but it’s less trips and much better long run. Use me as a referral, I love them.", "chloe_coolidge26": "Yes! Such a challenge. #hairybrowngirls ❤️💖", "su.may.dha": "This hurts so badly...I’m near tears every time I get it done", "anita.lall": "Totally can relate @deepica", "karishmadonde_": "Sammmeee I get my fave threaded every 2 weeks on routine!", "ladyoftheloft": "Preach girl! I dermaplane my face every 2 weeks. I couldn't handle threading for whatever reason", "esthernaut3": "Amen! 🙌", "bhoomerang": "same here...glad you're sharing 😘", "arunitad": "Do you not breakout?? That’s so awesome if you don’t with all that threading!!", "mez_mirza": "Y don’t u wax them.. I get my face waxed every 4 weeks..", "lionlox": "Weighing in on behalf of your chocolate sistas. GURL the facial hair removal grind is real. Ought to at least be tax deductible. And add false eyelashes for good measure😂😂😂", "nbmoving": "Eyebrows on fleek! I have the same problem with facial hair", "keerthanakt": "Oof I can physically feel the pain of this video 😭😭 I quit threading and now I just use a razor", "mitrakavita": "Yassssss 🙌🏽🙏🏽 @yasminejonesphoto @tashalate", "themeliora": "Omg girl I cannot believe you do your whole face!!! The cheeks look so painful ahhhh 😮😢 I'm so sorry. You could probably grow a beard and I would still think you're beautiful.", "musicfreak813": "Literally have to deal with cleaning my face on a regular and it's frustrating. I feel your pain", "nataliepomponio": "Hi! Does threading make your hair grow back thinner over time or is that a myth?", "k1mb33": "Ouchieeeee 😥", "neeeshnation": "@deepica when the eyebrow lady asks you if you want upper lips 😒", "igobyrhea": "Hahah! Indian girl problems 😊😊", "milik617": "Yes! So difficult", "chris_paul891": "I tried threading my brows and the pain was unbearable.", "shenil1311": "@riyaa_p you.", "thatweirdindiangirl": "Omg I have to wax, can't do the threading at all. Hate the way it runs against my skin, but much power to you and everyone else who can tolerate it", "anopenheart33": "I can totally relate!!!! I was doing it almost every 2 weeks but I haven’t gone for awhile and I need to get use to it again because it really hurts lol!", "bioindividual.elena": "I tear up when they do the uppen lip - 😭 giristache problems", "mika_paddle": "I get pimples when they thread under my sideburns - any tips you could offer for post threading pimples and redness?", "allthesinglaladies": "Omg I can relate!!! My eyebrows and upper lip grow back so quick! And I have really bad side burns and a bad hairline but I don’t get it done, I really want to get my side burns waxed, but once I start I have to get it done every time", "lexierra": "Upper lip and eyebrows for me monthly! I wish I could do every 2 wks too, but my wallet would cry😭 it's cheap but it adds up. I only do my whole face for special events like Deepavali", "vazzzy": "Honestly i was really self conscious for a long time because of my body hair (thanks to my grandfathers genes 😩). But eventually as i got older i realized its so crazy to be inflicting so much pain on myself just so other people can see that i am beautiful. So now i rock my side burns and my hairline that is scarily closed to my eyebrows but i love me without seeking validation for anyone else...it’s part of me and i will never let anyone make me feel less beautiful for it 💕", "ps_reiki": "Ouch! Does it make you break out? I did this before my wedding and broke out big time! 🤭", "juliekiehl": "🙌🏻🙌🏻🙌🏻", "pshadowss": "Try electrolysis it works for us Indian girls! Been around a long time my mom got it done back in the day, I’m getting it now!", "kirans_korner": "OMG girl I feel sm tho! I go about once a month now the get my eyebrows and upper lip threaded, I used to feel so insecure abt it, we should start being open abt our facial and body hair!", "sanashafiuddin": "So. Much. YES! I haven’t had the time to get mine removed and I literally feel disgusting", "frangen_": "Owwwww!!! You have a high pain tolerance... I used to get my lip threaded but I stopped because it hurt so bad 😭", "tannacious": "This is my life story. Eyebrows & upper lips: every two weeks, Brazilian & Armpits: every four weeks, & Legs: every 6 to 8 weeks. I have to plan wearing dresses around this schedule. I used to shave but it was too frustrating seeing hair growing midway through the day and the hair getting thicker. I always felt (and still do) self conscious about my body hair that other girls didn't have to deal with (dark hair shows up no matter what). I was called Chewbacca in middle school and asked if I was part monkey/ape because of my unibrow, thick hair, and hairy legs. Now those girls compliment me on my thick brows and hair (still are disgusted if I have leg hair). #browngirlproblems", "chairbangles": "Wrote my graduate thesis about body hair and stigma~ chairbangles.com", "banita1_": "@deepica mee too 😩do you not get any bumps ? coz i got em done once n i got bumps all over 😭", "jtorress__": "@mariathattil next video tutorial with Nimmi 😂 dam she handled the pain so WELL!!!", "_____alexfavela": "@rosiyadan", "heer_.a": "U look shit without makeupp omggg", "paradisebriana": "I am the hairiest person EVER!!! My face is so furry lol", "marzianazar": "I'm so tired of it and I'm afraid to do laser what if I spend the money and it's not even effective! @deepica", "nataliaccrz": "👋 yo también lo hago pero con cera odio los pelos", "nattyice634": "Try electrolysis", "ayemahomed": "@sana.mahomed", "thatssoreshma": "So there it’s like part of a monthly budget rent, food, gas, brows ... worst was when you were younger and everyone else at your school was a hairless wonder 😩 also there’s medications like steroids which are life saving but they make your hair growth worse which does not help!!!!!", "kdr62290": "This is actually really great though because it’s like another way of exfoliating which is always a good thing", "aryatg1201": "@ceylongiirl", "kavitha_bindra": "I hate it but do it every 3-4 weeks (should do more though)", "julesnailart": "🙋🏾‍♀️ brown girl lyfe", "accessoryfreaks": "Do you know what laser you were treated with? Im Asian too and I’ve been doing a lot of reading around it. It seems that IPL doesn’t work well with Asian skin tone. I’ve recently started my treatment with a YAG laser machine called Cynosure and looking and results people have had it does a great job. I’m based in the UK and getting it done at a company called Skn. I’ll keep you posted on how I get on with it. But you have to be careful because I’ve been told that some hair on my face is not suitable for laser as it’s too fine and light in colour and all the laser will do is stimulate the hair to grow more. They refused to treat these areas which I really respect. They could just take my money and be done with it! I seriously could not take the pain of all that threading xxx", "chandy.gal": "Currently at my threading appointment and relating 😊", "ks9380": "@deepica hurts like anything😭...I both look forward to and dread going to my appt. every 2 weeks...but ❤ the result.", "bakshsar": "RELATE TO THE MAX😂😫😭", "kamyadatwani": "OMG SAME", "laniethediva": "U still pretty though 😊", "gentrymac": "I’m white as can be but hairy ness runs in my fam! I use a “beard trimmer” probably every 2 weeks or so all over my face. Tweeze the pokey hairs on my chinny-chin-chin. But hey, no problem growing bold brows!", "paigesfraser": "@deepica I see your tissue!! 😂 my eyes always pour!!! I’ve been before where it doesn’t hurt at all and others times it hurts terribly!", "miriryan": "Asked my girl to wax my sideburns and she went aaaaaalll the way in up to my nose. #browngirlproblems", "gibcherie": "@deepica why didn’t laser work?", "actuallylc": "@deepica I can relate!! Thank you for sharing girl🙋🏽‍♀️", "ashantikaur": "Do you turn into a tomato at the end of your threading session? Because I do 😂😂😂😂", "lipgloss_and_sarcasm": "#hairyitaliangirl 🙋🏻‍♀️", "m4n15h4": "Threading hurts too much for me I barely get my eyebrows done once every 2 months 😫 laser worked wonders for me best investment yet!", "mehvashk": "How do you deal with the pain! 😭", "shivaniikkumar": "I can relate to this so hard!!!!", "therealhusnaav": "@asmasabrina824 watching this physically hurt me.", "lpacileo": "Heck yeah girl! Every two weeks! I love dermaplanning but I think threading lasts a longer. Dermaplanning I can feel the hair coming back in like 4 days. Urghhh #hairyproblems", "senoritakg": "@deepica laser on my face took 2 years...electrolysis?", "itsdipsmakeup": "Laser was a fail for me both times I got it done! Have hair growing in places it never did before! Went back to my threading monthly. Dermaplaning you can feel the hair growth after a couple days and waxing your face causes premature wrinkling because of the tugging. This post is so relatable! Thanks for posting how real the struggle truly is for brown girls! 😘🙌🏼", "rimarima331": "Umm yeah! I got tired of going somewhere to get it done, so I just buy wax strips and do it myself (not my brows tho, I get those threaded like every 2 weeks) 😬😬", "varshayav": "literally just got my entire face threaded, it’s so frustrating and I was thinking about how you deal with it all! thanks for sharing this with us, makes me feel validated", "avneee": "Omg this is my life @weeeewu", "crys_snow": "@cici.solis.80 Every time I see threading I think of you...crying...😂😂", "kilanil": "I thread my forehead eyebrow upper lip and wax my side locks every three weeks. I mean this has been the routine for the past few years now. I’m kinda waiting to save up enough money to laxer everything off and figure a more permanent solution.", "dollitta77": "My parents should have also invested in a hair removal fund for me when I was born 🤣☹️", "mrstorrie": "@deepica this was me last week ... went to try laser removal and got scared so I went and got this done ...", "feliciaspeakes": "I get my brows done but could not do my face. I'd be so red and in pain!", "shefali281": "Can totally relate. So many times I thought to try laser but haven’t had the chance yet. Yup every 2 weeks too!☹️", "coachingbyvarsha": "Thank you for sharing this! 💪🏽💃🏽🙌🏽", "maryam_noordien": "Does it grow back thicker?? I really want to do it but im scared my lady beard will turn into a manly man's one 😂😂.", "mmmmashallah_": "Isn’t waxing better though?", "pinksun": "I do this regularly too! It does sting a bit, but your skin couldn’t be smoother afterwards ❤️", "richa_agnihotri_": "Why don’t you give face shave a try? Isn’t that a thing these days?", "jakovererrthing_": "This post is so refreshing", "shraddha4deshmukh": "I would suggest if possible try to find out about electrolysis! Its time consuming and expensive but have heard nothing but great success about it!", "tattyjew": "Eina!😱", "gloryguliani": "@shikhaasaini 😭😭😭", "simflora": "Hair struggle is real girl! Glad we are talking about it and sharing it, mostly so when we see one another around with a mustache or brows gone cray, we don’t judge but relate! 💁🏽‍♀️", "gabrielamdeoca": "Brown girl problems indeed!!! If I could wax my whole body forever it would be amazing (except for my hair, of course)", "diamond.pee": "Thanks for sharing, why are we so embarrassed when it comes to facial hair 👭🏽✌🏽", "bebe_agapi": "Laser won’t work on everyone unfortunately :/ sometimes it makes it even worse!", "keshitawithadollarsign": "Have u thought about laser? There’s different kinds and u can even buy a little machine for self treatment. Personally I used to do wax/ thread but I am super squeamish and get embarrassed about having it done publicly so", "nabeela2838": "It’s worked all people I know", "herinfinity": "Thank you for sharing!!", "shikz06": "This is me every three weeks", "preetikhale": "@shivani1304 every brown girls story!", "corischerer": "Ooooo girl I feel your pain. I hate threading and it hurts so bad!!!! But I do my brows.. I can’t do my lip it hurts so bad. Been lasering full body and loving it but face I stick to good ol Aishas ☺️", "ssavitax": "Yessss this is me every month and am not embarrassed having it done 💖", "priti_om": "@deepica 🙋🏽‍♀️ Brown girl issues.. ugh", "riiddhii": "Me every month!!!!", "tiffanynarine": "My friends look at me like I'm crazy when I say I get my hairline threaded, it's really a struggle for a brown girl in these streets smh 🤦🏽‍♀️", "amank16": "@deepica try electrolysis", "meggan_samath": "@nandasm05", "__deepti1111_": "OMG this is my story! Tried laser it worked but it doesn't last. Haven't garnered the strength to get my whole face threaded. BUT thank you so much for sharing this struggle. It is bad for Indian women, worst if you suffer from some sort of hormonal imbalance. It really plays on your self esteem. Thanks for being open about this, you're the best!", "luminesscosmetics\nVerified": "Verified", "shanjohn21": "I couldn’t imagine this struggle.. alopecia runs in my family so my female family members (who hpn to be practically hairless bodywise) have to buy their hair and draw in eyebrows.. which is separate struggle. NOT ME THO! I’m the hairiest thing in the family. Which compared to the world is medium to minimal 🤷🏽‍♀️🤷🏽‍♀️", "a_cob322": "Feel you 💯 woman! Especially after moving to sunny FL! It’s pretty crazy what we’ve become accustomed to. This needs to be addressed so much more these days!", "thelady_wray": "Thank you for your posts and yessss I can relate! 🙌🏼 It’s a constant battle. I get a full face wax and I also have my tweezers ready lol. My hair grows crazy fast and though it is said not to pluck in between, it’s impossible for me not too.", "shaguns.being": "@deepica great post and so relatable! However, laser changed my life forever. 3 yrs and hair free. Do it!!!!", "vepimentel197": "@deepica My daughter is 9 and has asked to have facial hair removed. Is she too young?", "krishna_prince": "Can definitely relate! I have thought of doing this but have very sensitive skin so just let it be 🙂. A pro of being hairy: having amazing eyebrows!!!", "swabha": "@deepica, I have done threading for almost 20+ yrs of my life and I’m not old lol!! That just means I started young 😐 I have moved on to waxing now though, it is definitely less painful!! Try it 😬 I have hair even on my tummy 🤦🏻‍♀️ I’m much more hairy than my husband 🙄 but now I’m ok with it! I just deal with it rather than been embarrassed. It’s a normal human thing to have body hair.", "lovetimesamillion": "Amen to this. I would always joke that if we Indian girls did Movember, the charity would raise quadruple the money 😂 The struggle is real 💁🏽‍♀️", "divyabasu": "Guys best advice ever given to me by mom: take an Advil or a Tylenol before getting facial threading done..it'll ease the pain a little. 😉", "harkirat98": "Oh god I can feel this through my phone screen, I hate threading 😂", "mazzatude_v1": "Hey @deepica would you ever consider doing dermaplaning?", "nijatriv": "@gopz507 #browngirlstruggles", "neelkotha": "Same here girlfriend", "priscillagallardo": "How I love thee, let me count the ways! My struggle was doing this in NYC and then having to brave the streets and subway ride home with full redness on 10!! Looks coming from all sides! Haha", "siru020": "Relatable! But thank God, IPL LASER worked for me, I thread only my eyebrows now & laser maintenance sessions twice a yeat ☺️", "am_brownbeauty": "I’ve never done face threading but this video has got me interested! Can you do a video and talk more about this? Is it better than laser? @deepica", "palatmani": "Did the laser thing and it's almost like it got worse! Been dealing with threading and ingrowns on my chin, and jawline for almost 20 years! It's been a struggle!!", "jasmin_nina": "Thank you for bringing light to this @deepica! So relatable and so painful!!", "payalmaldemua": "@deepica get laser done nabe", "shaf_im": "@sehar112", "missamy0331": "Girl. Electrolysis. It’s life changing!", "melstonelove": "I can relate! I used to wax my entire face but would break out! Then I tried threading bit it hurts! I use a depilatory cream now", "fiyaraya": "@leefromamerica", "erizamudio.nino": "I can totally relate @deepica", "christa_gunaratnam": "AHHH!! MY #1 insecurity. I honestly think I’m absolutely horrendous to look if I don’t get my facial hair removed every two weeks. I can’t look at myself. I’m so glad that you’re willing to talk about this cause I definitely struggle with this ❤️", "bhumika26": "I’m hairier than my husband. 🤫 def brown girl problems", "drea_life_style": "That hurts so much... I did it once and never again.", "claudiamaretta": "I don't have to go through this, but this video was so satisfying for me to watch. 😂😂😂😂", "howboutnooscott": "What salon do you go to in LA? I need a new thread lady 😫😫", "veneshri_gounden7": "I find this so relatable!!! It's a real struggle😱... I actually gotten to the point of leaving it, so when people stare, I ask them do you like my fury face that much ...😂😂😂I am contemplating IPL....😥😢", "sonal_mekky": "I can totally relate! 🙋🏾🙋🏾", "ashadc": "frog eyes like me Telugu girls rule!", "soniaginsd": "Yes! I have to tweeze or epilate my sideburns and upper lip weekly.", "jahn.a.vi": "story of my life", "preetilalwanisingh": "This may be the weirdest thing I have written on the Internet but unibrow being threaded is the most satisfying feeling ever! #godiamaweirdo 🤷🏽‍♀️", "moodysotherpoint": "I think it’s just because we have dark hair that stands out. It’s not actually that bad. But threading is awesome, it also exfoliates and helps you glow", "nehapatel91": "@deepica totally relate to you. Hate going for face threading every couple of weeks. And it’s expensive too..", "khanstantinople": "Omg this is so eye-opening! Laser didn’t work on me either, and I’ve been so disappointed. Thank you so much for sharing @deepica 💛 you’re an inspiration as always!", "_laksh19_": "Omg I feel you girrl! I didn't really have a problem before but now due to hormonal changes Ive looking like a bit of a gorilla for the last few years. I used to wax as threading was wayyyy to painful for me. I did stop all kind of hair removal for about 2 years whilst at uni after having a bad experience with a lady burning parts of my face with hot wax and not even saying sorry. Over the last month I've been feeling reallyyy self conscious about my peach fuzz and got it waxed after so long. And my skin reacted (I have very sensitive skin) and within 2 weeks I had to go back to get the hair removed coz it was growing back and at a quicker rate. I got it threaded this time (about a week ago) my whole face and neck area and my God the pain! And my face is still sensitive from it. I am getting lil spots and my face and it is all bumpy from where the hair has been removed from the root (so not a nice sight when u put makeup on coz the skin isn't as smooth as it usually is). But Im determined to get it done regularly despite the pain and the after effects in the hopes my skin will become less sensitive and my peach fuzz will grow back less. If you have an tips on aftercare I'd appreciate it! 😘", "lizlgny": "The struggle is so relatable. I have three chin hairs that magically appear when I am no where near my tweezer. 😐", "rakhee.chavda.mua": "Legit my life. Had laser. And if call came back once I had my kids going in for my wax and thread tmrw!", "always_shanamarie": "I’m Italian in ma’s side and Jewish in my dad’s, I can relate. I have thick dark hairs and white hairs (yay 40) that I tweeze, probably 2 or 3 times a week because they’re all at different growth stages. Never thought about threading for the face. I might look into that.", "charlylazz": "How long does this last for? ProfessionalLaser worked great for me but only for like 5 years 😭 I'm thinking of investing in that at home laser from sephora. Thoughts?"}