{"jetteset_": "Rodan and Fields!!! The reverse lighten regimen! It’s phenomenal and clinically proven to work! I’ve even used it myself on other parts of my body!", "kamilabravo\nVerified": "Verified", "beamwonder": "I think so many asian, indian , middle eastern women have this issue and it can be very tricky to deal with since pigmentation comes and goes depending on triggers. So you could potentially tackle it one moment for it to reappear again. I definitely love botanical extracts and clinical grade actives to deal with this ( Vitamins especially vitamin C in certain %, acids, etc) ❤️", "thrivehigherdaily": "I gave up long time ago.. I have 50 shades of brown tones on my face lol ... brown girl probs indeed! But how awesome to have this platform to share it .. @deepica 😘😘😘😘", "varnasharma": "Try amara organic eye cream gel for dark circles!", "mahrishbeauty": "haven't tried it yet but I've heard great things about the @muradskincare rapid age spot & pigment lightening serum", "mrsmillertheminimalist": "My cheeks are so dark, and I can't find anything that works!!!", "makeupbyshaili": "Oops you mean fixing not masking lol", "smarti_arti": "Please let us know what works #browngirlproblems", "tturn53": "I really like this radiance serum by caudaile. I get it at Sephora and the glycolic essence that goes with it. It is one of the only things that I have found works well on darker skin tones", "prettypink_blush": "The @artistryus dark spot corrector helps well with fading dark spots faster", "pragna_97": "Chemical peels @deepica they do wonders for discolourations and fix them permanently", "valdocampo": "Certain essential oils will even out skin tone", "theonlynaynay": "@deepica the ordinary vitamin c suspension cream & granactive retinoid 2%! Works wonders :) xx", "rakheemandalia": "What were the best recommendations @deepica?", "aqeela_amin": "@deepica try a darker shade of concealer.. but a warm toned one.. picked up that tip from MAC..", "jasmeet__m": "@deepica which eyeshadow is this?", "i_am_kanikakapoor": "What's this lipstick @deepica?", "rv11090": "@deepica I’ve been hearing a lot about using 100% cold pressed grapeseed oil to reduce hyperpigmentation. It will take few months for you to see the difference but try it out! Good news is it’s au naturallllllll 😉💕", "priya.ca": "@prachi.bains", "valentinaunlimited": "I don’t see the discolouration", "_rramesh": "@deepica Admire My Skin 2% Hydroquinone Dark Spot remover from Amazon! It is STRONG - 4-6 weeks after first use I’m seeing some super visible patches from hormonal/cystic acne on my cheeks fade. My mom even noticed on FaceTime! (Be warned there is some peeling and an annoying burning sensation)", "mashalbaksh": "@baebodybeauty makes this amazing eye gel.. it has totally saved my life with my under eyes situation!!! I’ve totally noticed a difference over the last couple weeks! My under eye bags were BAD. People also talk about @lilyananaturals but I didn’t see a difference with their stuff", "swatipedia": "I use face wipes compounded with some hydroquinone by a dermatologist...and then moisturizer etc as a night time routine. Totally helped!!", "nepalikanchi24": "I have the same issue! I get glycolic peel every month! I don't have that anymore!! My skin looks beautiful 💜", "srilasya523": "Same!!", "taara.rama": "Try Vitamin C!", "ammani_nagesh": "@deepica try @drunkelephant vitamin C serum, I use it every day and it really works", "milazekhael": "Laser... Dr. Ourian", "beautygoodies": "Try chemical peels specifically for eyes. I’ve treated my Indian patients that have tough melasma with it with great success.", "shamitap": "Check out a dermatology provider near you for prescription/laser/products. I’m pretty sure their suggestions will get you results faster than home remedies and over the counter products. I use hydroquinone and non hydroquinone skin lighteners, I plan on trying @skinceuticals discoloration defense soon too. I love chemical peels. Lasers can be tricky with indian skin, so make sure the person is experienced. I kind wish I had a professional account to plug here😄 #dermpa", "neeshyd.o.g.g": "Neutrogena Rapid Dark Spot Corrector!", "alyp5940": "Try a series of VI peels. It’s one of the deeper skin peels, and one of the few ones they do on POC. Down time is only about a 3 days for the worst part. Your skin looks amazing afterwards. It does help skin pigmentation issues quite a bit.", "deeps_0293": "Lemon! Potato juice (like the juice that oozes out when you cut it)! #indianhomeremedies", "nawshaba.morshed": "Don't use lemon juice. Buy a good formula that's been put together by professionals. You can see what works for you. Vitamin C at a concentration of 20% min. Also, use at night. And load on the sunscreen with min spf30 through out the day I'd you are going to use any brightening treatment. AHA'S such as @drunkelephant Framboos.", "caughtawildcass": "I have found that vitamin c+ magnesium serums really help with discoloration.", "jamilanefertiti": "Give us a follow we teach makeup tricks 😘", "katstruk": "I wish i knew...my dermatologist gave me a fair and lovely cream made in france for things like that.i think its too strong for my face and those areas...i use natural things like castor oil and i saw a difference to....", "meripiya": "Lancome tiu camo or Laura Mercier secret camouflage", "usurapaneni": "None of the skincare products worked for me. I tried hydroquinone 4% it worked, after a dermatologist gave a prescription, pcp will not give one very painful.", "meera238": "Try @beautybioscience GloPro micro needle - encourages skin to heal itself which is great for pigmentation and general condition of skin. Hope this helps!", "girlsjewels": "Do you hair issues with dark shadows above your eyelids,too? That's where I struggle an all the primers just make the area gray! Help!", "amitakundramd": "I’m trying out skinceuticals new product for discoloration! I have heard amazing things about it!", "tanyalua": "Have you tried Neostrata? They have a line called SecureWhite I think.", "triptissar": "Same issue with me. Tried many, most likely nothing works perfectly.", "trushanp": "Try yogurt with lemon juice or tomato juice with milk", "rasminm2": "Mederma gel i heard is super good!!!", "patrice_eleisa": "I am going to try vitamin E oil and turmeric", "davidlopezzz\nVerified": "Verified", "heytheregawjess": "Girl when you find a remedy you LET ME KNOW. I could use one 😩😩", "raynewka": "Gurrl I feel you, I’m Indian brown girl with all sorts of discoloration around my mouth and deep dark circles. I think they lightened( never completely) when I started to workout heavy and regularly, drink lots of water and rubbed in a lot of raw coconut oil (made my lips luscious soft man!) @deepica", "keshitawithadollarsign": "The one in the Urban decay face palette. It’s an orange corrector", "_pharmartist_": "Agreed 😩🙌🏾", "rivas.lisette": "I am working on my discoloration too! Super hard! I was told vitamin C serum is a must!", "nainaplanning": "Love this look on you!!! Dark spots = I try to bronze over after concealer lol (most of mine are close to my neck)", "aartefact": "Otherwise I think laser is the best way to go. I have hyperpigmentation and that’s what my derm recommended. But I have to stop breaking out first or else I’ll have to keep doing laser lol.", "bliss.kay": "Deceim Re-Pigment! I had hyper pigmentation to my forehead and around my mouth/chin- it works great", "kbellah0108": "Love your makeup here!", "pallavi_garg": "I've heard the Sunday Riley brightening serum is supposed to be good for dark spots!", "glow.zee": "Tarte orange concealer ❤️❤️", "styleandthesagittarius": "Laser treatment!", "patriciapanos": "Belleza ❤️✨", "meghatailor_": "My mom recently started selling this oil from a tree in South Africa and it works wonders. I use it for dark spots (acne scars) and they are slowly fading it. It’s like a all on one oil cause there are so many things you can use the oil for including discoloration, dry scalp, frizzy hair, dry skin, acne. It’s really amazing and it’s nice to have something that works Head to toe lol @deepica", "shastyali": "Skincueticals c-flueric serum helps even tone", "anoushka_c": "Red lip stick apparently 😉😉", "shiifaa": "I use the maybelline one", "djdosa23": "Fair and Lovely", "madina_____": "Have you ever tried apple cider vinegar toner?", "peachesandpearls.za": "La girl pro hd correctors 💖 @deepica", "hijabilife": "@deepica most Southeast Asian women have discoloration in those areas. Rather than fix why not embrace who we are?", "bhavishavp": "@shades510 her.", "keer_thanapk": "@deepica Face Shop’s intensive blemish patches does make a difference especially if I need some overnight quick fix. On a weekly basis, I have applied apple cider vinegar on my pigmentation areas and seen a difference. Also, I recall seeing some YT videos by @mrjovitageorge where she gives home remedies and also explain the use of vitamin C serum which helps in hyper pigmentation. I did try out one of them and that’s helped too😊", "roshinisrini": "Artistry Ideal Radiance line! I absolutely swear by it.", "akilahh\nVerified": "Verified", "alyssafernandezdecordova": "Have you entered the giveaway yet?", "aditisheth23": "@muradskincare rapid age spot and pigment lightening serum with hydroquinone 2% for around the mouth. And @muradskincare retinol eye serum for eye area", "nanibee": "You are naturally beautiful though", "lanapatelxoxo": "I love the Mac medium deep studio finish Concealer Palette. I mix the orange and yellow together for the perfect color correction. The mixture ensures that you color correct and conceal without having to apply extra Foundation to mask the strong red or orange undertone.", "karishmakaul": "Sounds like hyperpigmentation. I find glycolic acid based moisturizers and peels are the best for that. Another ingredient to look for is hydroquinone.", "blessleeeee": "Alpha arbutin from The ordinary", "vijisiddharth": "Rosehip oil ! I find it is slowly lightening the hyperpigmentation around my mouth.", "lexierra": "Vitamin c (21%) and arbutin (2%) has helped loads in my dark eye circles and dark upper lip! Plus my biweekly tumeric +french green clay mask. Niacimamide has been said to help too but i haven't seen it rh", "rupz813": "I’ve been using the Kiehls dark spot color correcting serum! It takes a few weeks but i do see a genuine difference in some of my acne scars and general discoloration on my skin @deepica", "brown_girlinthering": "@drdennisgross has a great range with glycolic acid for discolouration", "adub_84": "I've been struggling with the same issues, I'm going to break down and just go to the dermatologist.", "lo.ve.sabari": "@deepica OleHenriksen Pure Truth Youth Activating Oil at night — has Rosehip oil to help brighten your face. I have South Indian hyperpigmentation, too! It’s helping my discoloured spotting tremendously!", "ankitasanawar": "Beautiful", "shikha271991": "Hey girl you should definitely try MAC prep and prime in the shade peach luster. It’s amazing stuff and blends in super easily.", "h_sidhu11": "@deepica My mom has the same hyper pigmentation like you do but on her cheeks. And brown skin is just more prone to this type of pigmentation and it doesn’t totally go away but can decrease drastically. She uses a combination of Klairs Vit C serum + Lancôme brightener + Clinique dark spot corrector. There a lot of Vit C serums available so have to find out which suits your best. For the eyes- I personally have used The Ordinary Caffeine solution and the Drunk Elephant eye cream. The Ordinary line has a variety of serums for different skin issues and are relatively inexpensive so I would recommend looking into it. Hope this helps.", "samhitashetty": "@deepica @drunkelephant C firma helped reduce the discoloration around my mouth. I do believe some of us brown girls are generically predisposed to hyperpigmentation so I don't get pre occupied trying to fix it I use @beccacosmetics color corrector in peach!", "_______venita_": "I don’t know about you...but this Palmer Skin Fade cream completely cured my mouth discoloration.", "mother_of_krishna": "Good ole turmeric, honey and yogurt with a dash of lemon juice will do the trick, used up to three times a week. @deepica", "thereal_siri": "Try the skincare from @paulaschoice it’s life changing", "ashley.drouillard": "Prescription retinae 👌🏼 Totally worth the hassle", "razia_hassanxo": "@deepica I have been using @dermalogica power bright TRX treatment, for about 6 months and it absolutely works! I was so skeptical at first because I tried so many other products, concealers, correctors and what have you not. But I genuinely see results with this product. It’s a bit pricey but I was at that point that I was just tired of trying everything and nothing works.", "nivramkumar": "I used to use ground up cucumber and apple cider vinegar as a face mask and it reeeeeally helped", "sumi0494": "I’ve been using rosehip oil nightly for other discoloration on my face for 6ish months and it’s helped tremendously!", "reallyarchie": "Try using the Kiehl’s dark spot corrector. For me, it is working on the my hyper-pigmentation. I️ am going to start a vitamin C serum as recommended by a couple of friends to help speed up the process as well.", "the.viral.life": "Mac Burnt Orange & I just discovered @vasanticosmetics O2 corrector", "thaveester": "Bio Oil", "soniaks": "Murad’s lightening serum worked crazy well for lightening my sun spots. I also like Image’s bleaching serum.", "adashofchai": "Grated potato with all its juice, it’s slow but works", "kaijurobot": "I have the same problem! The only thing that has actually lightened the areas is @deciem’s Re:Pigment serum", "salonsbs": "Urban decay the orange one", "asgojfaain": "I don’t see any discoloration except a beautiful smile 🤔", "krithikakashyap": "Try vitamin E oil directly from the soft gel capsules...you have to poke a hole in the capsule and extract the oil to put it on your face.. a little tedious but it works miracles...its my night time skincare routine and my face is baby soft and has minimal discoloration!", "sharonsds": "I've found my dark spots are fading as i have started getting laser genesis and or carbon laser facials. Definitely improved the discoloration i have under and around my chin area and the nasal folds", "amiteeamin": "@deepica have you tried the IPL photo facial?", "payalthak119": "The smash box color correcting stick in “look less tired - orange” .. aptly named!", "pujshah": "Concentrated vit c serums? The darkness around your mouth may be a hormonal imbalance", "hsahani_94": "@glossier solution has been good at making my whole skin tone even!!", "av_sidhu": "LA girl", "simmi_prasad_": "Vitamin C serum and exfoliate regularly. I started using Noni eye oil and have used 100 percent pure eye cream. Both contain caffeine. It works for me.", "aleenstagram": "Dr. Obagi melamin corrective cream!", "ronniekalra\nVerified": "Verified", "sukstar_makeup": "@deepica try the @gorgeoarmani master corrector. I have a vid on my page where I show you how to use it.", "kavyasaurusrex": "Becca color corrector in papaya!", "abi.anushan": "Have yo tried almond oil, it works wonders. It worked for me. I had horrrrrible discolouration. Also oranges. Slice up oranges and gently put them where you need it. It will brighten the area up. Hope this helps love 💕", "puja.yatham": "@deepica ❤️😘❤️ Proud of a fellow Telugu girl on beauty industry! I use ‘Nomarks’ for my dark spots and pigmentation.😍 It’s amazing, cheap and gives you quick results! 😁 I believe it’s an Indian company but I live in Miami and get those from amazon.☺️ It’s so powerful that it literally removed second degree burns. 😱 You should definitely give it a try. I promise it works. 😍Love you 😘😘😘😘😘", "michele_perumal": "La girl orange corrector", "deepa_kapadia": "Nip fab extreme glycolic fix night pads! I have the same problem and have been using these after reading reviews for the past two weeks and can definitely say that my discolouration has improved. @nipandfab massive thumbs up", "selinasithya": "maybelline color correcting pens! ❤️", "corinnebmeister": "Use @sundayriley Good Genes & Luna oil", "subani23": "Rose hip oil! I have been using it for years and I love it", "bamblingsofnaffy": "You look flawless! I use a glow tonic from Pixi which may help long term xx", "vrals": "Ultraceuticals @deepica worked wonders for me. Its a serum", "navi_deon": "@deepica you should the ordinary alpha arbutin. It’s does wonders for brown girls like us.", "alissapodber": "@caudalie Vinoperfect Serum!", "puni787": "Rodan and Fields reverse regimen with the eye cream!!! Gets rid of dark spots, sun spots, and dark inder eye circles!", "sheereen0604": "A serum like Skinceuticals vitamin c + e with ferulic acid has worked best for brightening and evening out my dark spots. There's a more affordable version made by Timeless. My go to, swear by item!", "notaleaf": "I’ve seen @farahdhukai have great homemade/DIY solutions for this :)", "thunder_sword": "Fillers and peels!!! I get peels every year to tame the pigmentation :/", "vaishu_1412": "I have the same issue😞😞 i get peels done.", "_halimaiqbal": "Bobbi brown correctors are pretty dope. They’re not red based ones but actually a peach based one. But I’m also NC42 and it worked amazingly.", "ariellapidus": "Caudaie vinoperfect serum - works amazing on all skin types!!!", "nisha_kurani": "Same issue, but I’ve focused on cost-effective and low-chemical remedies. Raw aloe vera straight from the plant worked wonders when I had young malleable skin, haven’t tried it recently. An aunty swears by vitamin e (but sourced from the pills and applying that on issue areas) and she has great skin so I trust that Aunty.", "xolilmispay": "omgah 🔥🔥🔥🔥", "vihitha_k": "@manvitha90 follow this page bhe!", "geedha": "Hi @deepica ! Firstly, you look gorgeous to me, have seen your face and your dark circles and spots does not seem bad at all 😊 but if you want to know, try Apple cider toner, dilute in with water to a 1:1 ratio or less concentrated depending on the sensitivity of your skin. Almond oil after that will, with brightening as well as moisturizing. But like all natural remedies, these take time to work.. Hope you find one which suits you soon!", "shreya.p.goyal": "Sokoglam vitamin c serum (lightning liquid) + The Ordinary Resveratrol/Ferulic Acid", "thevary": "Pass it on if you find a solution! 😫", "sharusri.ss": "I have the same problem @deepica Try the Make Up For Ever Step 1 Skin Equalizer Primer ( shade caramel)", "ricecarb": "It’s hard... but completely cutting sugar out of my diet worked for me", "kanikar16": "@deepica hi! What is this beautiful lipstick color?", "cardammom.queen": "I use a DYI baking soda scrub for body discolorations... I don't see why it wouldn't work on the face.", "netijyata_mahendru": "Try the @smashboxcosmetics colour correcting stick in orange. Works like a dream!", "bhamini76": "Gm sunchine", "tweedmode": "Please let me know too! Same problems", "suzywoozy04": "Homemade mask of milk, honey and turmeric helps with dark spots and also really helps to brighten the face.", "mrzdiaz11": "When you find out ... let it a sister know lol", "anjalihpatel": "@deepica laser! Fraxel is supposed to be a safe way to get rid of scarring and hyper pigmentation ! I have really dark areas near my mouth and actually have a derma consult about the laser treatment today, so I could keep you posted!", "karenobeauty": "My OG is @cliniquecanada Even Better Clinical", "xxanneka88xx": "You can try hypermigmentation laser? I have some friends that tried this and they have noticed a difference. I have a consultaion next week as I have dark spots too and looking for a solution as oppose to masking.", "chefchuckcooks": "🤗", "triniorigins": "That's how your skin is. Nothing's going to fix that. The melanin is just deposited differently.", "am_ri_duh": "Omg thank you for posting this. I have hyper pigmentation in the same areas and I have no idea how to get rid of them 😩", "wearingwednesdays": "There are some awesome all natural masks that I’ve used that have helped my pigmentation issues . I’ve got DYI info from @farahdhukai channel. It hasn’t completely removed it , but made some huge improvements. You look radiant, but I feel you! 💛#livetinted", "christaylor_nyc": "🔥", "coachingbyvarsha": "Can’t wait to go through these comments!", "ramakrkshna": "L like your lips", "binbip": "I’ve used The ordinary’s alpha Arbutin and Olay’s dark spot corrector. They take time but I’ve seen improvement in the hyperpigmentation I get due to acne scars. I’ve also found a good night oil is important. I’m currently using the balancing oil by clarins.", "poojakrishnaswamy": "@deepica lytera by skin medica Sheer transformation by ole henriksen clinique even better dark spot . And for a clinical really strong one cosmelan you have to do it at a dermal clinician .... it really works but I have post inflammatory hyperpigmentation so it fades fairly easily just spots from acne etc I don’t really have it around my eyes etc so not sure if it will be the same ?", "saptail": "Try @Clinique dark spot corrector!", "sanathukral": "What's that gorgeous lip shade!", "pequereque11": "Did quite a bit of research just recently on getting my dark circles to lessen (nothing will make them go away entirely for desis, since this is a hereditary/genetic issue). I couldnt find something specifically for south asian women but i did for the men.", "whatawonderur": "I hv that too....common amongst indians ???", "chahatchadha": "Radha Rose Hip Oil + Kiehl's Dark Spot Corrector", "thejgoagency": "Vitamin C serum, Shiseido dark spot corrector", "_karishmatailor_": "The body shop drops of light peel!", "natalie_rampersad": "Try @sulwhasoo.official Snowise Brightening Serum or Spot Treatment. I’m an NC 43-44 myself and their brightening line is very effective. It brightens with white ginseng. Good luck!", "rupallshah": "the ordinary rose hip oil at night has really helped with the darkness around my mouth, it's still there but I def see an improvement, I'm around the same skin tone as you 😊", "zenvoca": "Anything inisfree should help", "gabrielaj18": "I thought I was the only one with those problems around my mouth. I don’t know what else to do", "shilpiroy": "Although I am not sure if you can find all ingredients...You can try this home remedy: coarse ground shelled masoor dal, coarse ground orange peel, Neem leaf powder, tumeric powder... Mix that with a bit of water/watery yogurt... Use as either a quick scrub-face cleanser or a 5-min mask-scrub or a 15mins/till dry mask..", "jayyidha": "Hands down LA girl pro concealer! 😱", "nawrinislam": "I like this Nyx double ended product it’s called sculpt and highlight face duo in chestnut/sand the highlight side is super orange so it perfect for colour correcting and the contour side has a loving undertone for contour. You are bit darker than me so it might not be dark enough for you.", "jyotis2012": "@deepica - it’s the bane of my existence. I have discolouration due to PCOS (melasma) and have tried pretty much everything but without any noticeable results. I would be happy with a good cover up at this stage, that itself is a bit of a struggle. I hope you find a solution 😊", "kimberleyn": "I heard vitamin c serum may work. Maybe look into that", "cherrymanya": "Go for any organic product whose main ingredients are Arbutin , AHA( chemical exfoliant ) , Kojic acid , ninacinamide , mandelic acid , Vitamin C and E and Licorice . You can go for Quesera Ceraminde ampoule from THE PLANT BASE , it works wonder and you can also use potato juice as a home remedy for hyper pigmentation .", "_anotherbrowngirl": "Brighter concentrate lamelle👌👌👌together with their luminesce range", "shilpasabarinath": "Try rubbing one half of lemon", "elesham": "Avon banishing cream discolouration improver.", "janeetasteephn": "Please share the fix when you find one!!", "glamislander": "Personally, I have noticed a difference with The Ordinary's Azelaic Acid Suspension. It is great for brightening.", "sunandarana": "Vitamin C, Triphala , Neem powder and laser treatment after following the above for 2-3 months u", "murs.ali": "Good Genes by Sunday Riley!!!!!!! 🙌🏼🙌🏼🙌🏼🙌🏼", "adelejayde": "I’ve just started needling and it’s done so much with just one session. I was actually so shocked. I’m so happy bc I’ve always been so self conscious about it despite knowing it’s a common brown girl problem. At home I use a Vitamin C serum to help with the pigmentation as well.", "rachelrk7": "Any Vitamin C serum and NYX dark circle concealer! That stuff covered my black eye and scarring after my car accident", "marryvvvv": "Your beautiful!", "marissha_pillay": "@deepica Lamelle Correctives Brighter Concentrate.", "laniethediva": "Beautiful", "the_priyanka": "@maccosmetics Peach Lustre corrector 👌👌", "beautiful___interior__design__": "Definitely clinique concealer and foundation 😀😀", "mital523": "Have you tried the rollers with needles? That plus tea tree oil helped lighten stubborn dark acne spots. Also used Dr Dennis gross alpha beta peel pads", "prakashravikumar": "Very nice", "almas_ahmed07": "Beautiful 💓", "m4n15h4": "There’s laser treatment for pigmentation but I’m not bothered enough to risk that", "thendraluthaman": "LA girl’s pro concealer in Orange Corrector is LIFE! It’s SO orange it’s almost red and blends beautifully!!!", "beautybydrkay": "You need to come see me! My prescription bleaching pads are the best! 8-10% Hydroquinone, Kojic Acid and natural lighteners! And under eye filler is the solution for the dark eye hollows!", "aditikatbamna": "LA Girl Orange color corrector and maybelline master camo pen! Those are my absolute ride or die products! <3 lovee you deepica! <3", "sehar.mk": "NYX dark circle Concealer in shade medium or deep. It’s very orange toned and it works perfect for concealing the hyper pigmentation/darkness and brightening the areas concealed. 💕", "monikagill": "For a permanent solution, probably go to a cosmetic surgeon. For example: @simonourianmd1 (he just happened to post a before & after video for dark circles).", "boldlooks1": "I use a stabilized SeneSerun C for the pigmentation The SeneSerum has stabilized Vitamin C so you get full absorption. With Grape Juice Extract Juice – exfoliates the top layers of the skin to promote moisture restoration, and help other ingredients reach further into the skin. these actions also help to correct discoloration and improve the skins texture.Orchid Flower Extract – a powerful antioxidant  to provide free radical protection and moisturization, and is well known for as an effective sunscreen. Plus other extracts.", "meghsmk": "LA Girl pro conceal in orange ! A little goes a long way", "rajani_palaparthy": "As fresh as a flower", "kirbiejohnson\nVerified": "Verified", "sherinarathor": "Almond oil @deepica! Under the eyes, the eyelids and around the mouth, it works! I’ve been doing it for a long time now and it works. #indianremedies #backtomyroots #ayurveda", "stephanieibold": "#LIVETINTED (almost hashtaged livelintend that's not really a cool way to live tbh lmao)", "karmanmaani": "Makeup forever ultra hd concealer in orange! It’s the best for covering up all the darkness! Concealer on top of it then set. I’ve noticed that if I ever forget sunscreen the darkness gets worse! Also, exfoliate - I love the Boscia peeling gel.", "mallika_hiremath": "I mix la girl pro conceal into a shade of peach.", "aniswaggs": "LA girl in the orange red shade and Becca color corrector in the darker peach shade! LA girl is amazing such a great shade range 🙌🏽", "alyaali1": "Laser skin correction works better and never has to be redone", "harls1993": "Kiehls dark spot corrective solution and the alpha h rose gold exfoliator x", "singaporegirlinoz": "Bobbi brown color corrector in dark peach. Skin care wise, anything with vitamin C should work. I’ve heard of Apple cider vinegar as a good treatment too", "pshadowss": "Also rose oil works WONDERS my fav is Korres brand 1. A bit pricy but worth it. My fam has noticed my discoloration disappearing", "__gnarkill": "I’ve been using La Roche posay dark spot corrector for a few weeks, I have v dark acne scars and I think it’s working, very slowly lol but I think I see a difference!", "oatlygoatly": "LA girl orange corrector! Skin care wise, multani mitti and turmeric with aloe vera and lemon juice", "allnatural28": "I swear by the @nyxcosmetics concealer palette’s orange concealer. Works like a charm every time! Also for a long term treatment to help fade the discolouration I recently started using retin-a :)", "shazmihussainmikhail": "How about trying out Kryolan? It’s professional makeup for stage and film, photo shoots etc. They have an awesome shade range and a little goes a long way! Easy to apply in stick forms as well. They work to cover my dark circles and the dark areas around my mouth. You can sheer them out with a wet beauty blender as well. But I love full coverage!", "ranyal": "I've been trying something in my skin care routine for dark spots and darkness around the mouth ... I've seen some change it's slow but it's working. One part apple cider vinegar to two parts water . i put it in a little bottle and use it with a cotton pad before I put anything else on my face and after I take my makeup off . 😊", "taanya_sharmaaa": "Love love love😍😍😍😚😚😚😚", "alima.nasir": "Whatever u have on in this picture seems to be doing a good job though!!!", "dharmeshtrivedi2363": "Cute smile #deepica", "kaykaysway92": "I like chemical peels at the facialist med spa office. I also like @caudalie s vino perfect serum. Also, dr Dennis gross peel pads in extra strength are great. basically glycolic acid, ahas bhas are amazing", "amaninder_216": "Girl. I can’t get the dark spots around my lips fixed no matter how hard I try 😭😭 it’s my biggest insecurity on my face", "omritasethi": "Dr.Obagi C serum and night cream .( whatever percentage is ok with your skin )", "makeupbycynthiarobinson": "This is a cream that not too many people know of.. or talk about, but it totally got rid of the dark pigmentation around my mouth!! https://cynthiarobinsonblog.wordpress.com/2017/03/19/olifair-radiant-night-cream-a-miracle-portion-for-hyperpigmentation/", "therealsuzyq": "Bio oil worked wonders for me! And shea butter too", "manviarora": "Bright forecast from mac is a god send for under the eyes! 😘", "makeupbyzeba": "I love doing the la girls corrector in the dark peach tone. I use just really little of it but before that I apply the kiehls avocado eye cream in that area to really help moisturize is which also helps kinda brighten it up. Then I use the nars creamy radiant concealer. I will say though working on skincare has allowed me to stop using a corrector! Vitamin C will be your bff. If your skin can’t handle citric acid then use a rose based vitamin c (Korres has a face oil) the new PTR vitamin c serum feels amazing on the skin as well :)", "blingmythingsco": "👌", "xxjmillzxx": "Tarte shapetape is really good and mix two colors it’s even better but if not when in doubt use good ol Stillmans cream 😂😂😂 #ifyouknowyouknow", "sajbat": "I like the Becca concealers - have the right undertones and a bunch of shades. They also have correctors that work well", "parlorwest": "Working on a hyper-pigmentation correction formula with one of the top dermatologists in the US....coming soon I’ll send you a sample once it’s ready 🤗😁", "hannybyblos": "I have really baaaad undereye dark circles and Kryolan orange corrector shade 30D works wonders for me. Then Shape tape concealer applied over that. Problem solved!! :)", "yourbabygrlll": "LA Girl Pro Conceal in shade Orange Corrector!💯💯", "crystal__samuel": "I love the one from MAC the prep and prime in peach lustre", "naomircohen_": "I’ve used Murad’s dark spot corrector in the past, and that worked really well for me. That and sun care.", "visualproses": "Becca corrector in peach it has a good orange tinge, they have a darker orange too! Light in texture so it won’t crease under your makeup 🍊", "beautybykinjal": "The @coverfx collector in orange always helps with my dark spots and discoloration 😍", "jennydr21": "U look perfect!! Don’t worry 😉", "thehennaali": "You are beautiful", "priya0808": "Everyone, she is asking about skincare NOT makeup.", "pappadamn": "Also origins ginseng eye cream is so good for brightening around the mouth!! (Even though its an eye cream haha)", "pinnyxo": "bobbi brown corrector and la girl orange concealer! #browngirlprobs", "tb_itsme": "It could take several months but find a good skin lighter from a medi spa or try Image skincares illumi line", "handbagdivas": "@deepica Do share if you find a cure. Dark circles suck! 😢", "__carolina__arias": "La pro orange corrector"}