{"wuhancorona": "@lilmrswifey EXACTLY🙌🙌🙌", "lilmrswifey": "beaut beaut", "g_untld": "@deaundria do you think she picked the models? You have no idea how television works and how these networks put ppl in back places that they aren't comfortable with. You need to place blame on the network, not her. She didn't ask for this.", "thesumairagirl": "@lavidalovescoils the woman who she \"messed\" up on spoke out and was sincere and understanding so I think it's harmful to be hateful when this can be an educational moment.", "sexcclexy": "@g_rnf 😕😕😕and you are? No I did not read your comments cause that's too much", "sherylgeorge917": "This, too, shall pass. Sending you ❤️", "naturallynatasha5": "Just here for the comments about that messy hair job 🍿", "lipsticklitterati": "@deepicam keep your head up, mama! This shall pass. From one Houston girl to another!!!", "gcopez": "@iam_kristiaun this the hairdresser that messed up the hair on tv", "tammywithapurplebently": "@icy_rob no I didn't \"pass high school\" I got my diploma and degrees tho icy Rob... I'm sure you passed though. You sound pretty stupid enough. Sweet dreams.", "icy_rob": "@tammywithapurplebently girl you probably didn't even pass high school, Tammy with a purple Bentley 😂😂😂😂 But you're right that none of my business🐸🍷 have a great night😉", "coledennie": "@deepicam.....i just think you should know your that versatile at doing hair as you think", "shxn_876": "Why did you butcher home girl's hair like that. I almost cried. You really tried it.", "nidhi_vaidya26": "I'm sorry but how are you a beauty expert if you have a business degree??", "veenayrao": "All of you bashing this poor woman are disgusting. She made a mistake, feels extremely horrible about it, and apologized. Deepica did not physically harm anyone or murder anyone to receive the kinds of threats and utter hate being spewed at her at every direction. She did not intentionally style that model's hair to make a dig at the African American community or be racist. Do you know how absolutely ridiculous that sounds? How you guys are channeling your hate and typing away on your phones while you rip another person apart? And the people commenting \"oh look at these comments haha\" or \"these comments tho\", you all are JUST AS BAD. Bullying leads to depression which can lead to suicide. Bashing a woman over an HONEST mistake is just despicable and deplorable. Be human beings. Don't bash another woman of color because you can sit on your phone and type hateful words in a couple of seconds. This model's life was not forever affected by this one hairstyle and the African American community was not being attacked. This was just a woman trying to make it in the beauty industry that made a mistake. Be compassionate human beings and live in this world by treating others how you would like to be treated.", "blkidtwins": "@g_rnf she trying get her followers up 😂😂😂😂", "anissagonzalez45": "Look here's an expert. I said bitch where?", "decorconfidential": "Deepica--don't you worry one bit about that makeover!! You're an awesome stylist and we all have bad days!! You are amazing -keep smiling and move forward!❤️❤️❤️❤️❤️", "millyalmodovar\nVerified": "Verified", "tam0103": "@amzy_jo_jo agreed.", "much_melanin": "@redstar_1166 ... Calm with that shit... We don't all wear weaves ... Most people who do wear it for protective styling ( look it up before you come at us with all this bullshit ) .... Natural hair has a different texture ... It was a mistake I get that ... But people have the right to be angry because her hair was a bloody mess .... If you can't handle black hair don't get on the damn tv and pull some shit like that .... She made herself look hella foolish ... I'm just saying .. For a trained professional", "envyzazie": "You need to be sued 😐 beat up or something for messing up that lady's hair.", "rizzy_ayyy": "I am so dead at these comments 😂😩😩💀", "kurly_birdie": "A lot of people are ignoring the big picture: THEY DON'T TECH HOW TO TEND TO NATURAL BLACK HAIR IN COSMETOLOGY . Which is NOW becoming a problem for a lot of inexperienced hair stylists since a lot more black women are embracing their natural hair.", "melanin_dollbaby": "It says she's a beauty expert... Tears.. Real tears! 😭😭😭😭😭😭😭😂😂😂 @ms.jenene", "itsmarialikewhat": "I just wanna know why she did that too that poor woman 😂😂😂😂 got her hair all fucked up, omg 😂😂😂", "styledbydoosa": "@deepicam you are the most strongest person who doesn't give up no matter what. #beyourownprincess 👸🏼👸🏼", "amvibhian": "I feel like her apologizing and stating she is sorry is enough don't u think? Haven't u ever made a mistake or had a vision and had it not go the way you think? She was not invited for this segment, she has been coming for many, and she thought she had control, sometimes things just don't work out, and it's good to call her out, but also not to discourage WOC", "currydough": "The asian one also didnt look nice. I see asians wear natural hair better than your braids. Lol", "raneishablack": "Can we all show a little grace like many times we are shown. Instead of bashing encourage her to learn more about black hair. If the model isn't angry why should we be angry. @deepicam hopefully they will allow you the opportunity to showcase the style you was going for. Keep your head up and keep on making your paper. <3", "jaclyn_cw313": "I think the problem is that you should never do a curly girl's hair that way. I don't care if she's white, black or purple, you can not take your hands through curly hair like that. But not one's hair looked good on that show.", "twackles": "@travissjay the comments 😹", "liymarie": "L", "kreyoli": "following to support a fellow POC and encourage you to learn from this. not saying you should be a kinky/ coily hair specialist but inclusivity is important and i'm looking forward to seeing that in you IG posts; love your aesthetic #BrownGirlsRock", "bridgeyolanda": "I honestly saw where you were going with the young lady. No need to beat yourself up about it. Just have fun with the the next natural hair beauty....natual hair can be fun to style and play in :D", "doriyen": "You are righteous enough to touch a queens hair", "estrellabrillante_08": "@mo4reel", "smatzxo": "Making Indians look bad smh @christianeford", "hectstr": "HAHAHAHAHAHA", "forever_rene_xo": "Hun, you need to prepare before appearing on national tv.... You could have attempted several styles on different hair types beforehand, so that you could execute something polished in front of the camera", "emmysuniverse": "It's so hilarious that the today lady said well it helps that you are beautiful because the shit you was doing was horrible", "cakefacebyj": "@redstar_1166 did the model have a weave in? No she didnt why you bringing it up?", "ms_kjohne": "I dont know why everyone's so offended, I thought it was hilarious.", "shari.elle": "@qtsmartee", "tyalexander\nVerified": "Verified", "ekkatta": "She did her best made a mistake and will learn from it. She's already apologized. STOP cyber bullying her.", "katelynn767": "@redstar_1166 We never said our hair was special idiot. She didn't know how to do black hair and embarrassed herself on live TV. If she can't do black hair then she shouldn't be called a \"Beauty Expert\". Also all three models hair she did looked horrible so she sucks at hair period.", "jasmincamille_xo": "@redstar_1166 that's the point though. If you have no clue don't do it lol duhhh", "sovietteddybears": "She did her best your hair is not special get over it.", "tara6828": "Really??? That's your response???", "raviejae": "She's the one that ruined that black models hair on national tv, these comments are wild'n @guyfell", "sweetblood123": "@deepicam We all as people make mistakes and hopefully we learn from them.. That's where the term comes from (you live & you learn).. I hope you get through this situation and stay in a positive mood and continue with what God bless you with, which is your talent. Stay strong Doll... This situation will soon pass ❤❤", "tjaylaurel": "@zoeflynn93 this is the lady that ruined that girls hair on live television.", "zoeflynn93": "@tjaylaurel she just needs to do a quick statement and call it a day. She should have never agreed to style that woman's hair", "theelite4": "@redstar_1166 Our hair is clearly different than that of other races. Less and less black women are wearing weaves and are learning to embrace their natural hair. You are completely unaware of the hair texture discrimination that goes on in the workplace and in schools against people with type 4 hair and that is why many opted for wigs and weaves in the past. I dont know why you just randomly felt the need to declare that you're Mexican, but there are in fact black Mexicans too hon. Mexican is a nationality, not a race. Education is key. No ones putting black hair on a pedestal. Black people are more comfortable with their type 4 and 3 hair more than ever. The fact is that she knew she messed that girls natural hair up and embarrassed her on TV and tried to play it off. It was messy and unprofessional. If you're going to call yourself a hair expert then you should probably know how to do more than one type of hair. All of those hairstyles looked pretty bad and even the host herself noticed it. Please have several seats Ms. Rodriguez. You sound foolish.", "swj21": "🙆🏾🙆🏾🙆🏾🙆🏾🙆🏾🙆🏾🙆🏾🙆🏾🙆🏾", "jacqblac": "@parlorwest - Being an advocate and having skills are two different things. It's not a race thing it's about her lack of skills. The Asian lady's ponytail was a mess as well. Her finished result looks like when My Niece gets a brush and wants to play in my hair. She's your friend, you obviously have her back, please let her know she was in over her head, more training is necessary and an apology would be in order.", "aykae47__": "Wtf", "harpowhothisbitch": "Congrats, you played yourself", "hello_im_yellow": "She screwed up all the girl's hair to be honest..but black hair is easier to screw up so it looked worse. But I really wanna know what she thought putting a band on the end of TWISTED Asian hair would do? 😂", "jodyann_noir": "@redstar_1166 so you don't think that a stylist should know about ALL textures of hair?? Especially if she is doing it live on air????", "hairtype4you": "@shari_amoor don't laugh. Let her reflect and let a real professional do hair", "miavous": "That bio needs to go 😂😂😂", "m3_glam": "@parlorwest YESSSSSSSSS!!!!! I never everrrrrrrrf defend anyone on social media but this time I felt the need because I felt I've built a digital relationship with Deepica since her days at Birchbox and are intentions are truly pure and she definitely represents women empowerment. It saddens me how quick we bring each other down for mistakes that can happen to anyone. Constructive criticism is totally ok but bashing and inferentially bringing someone down is not! Also @deaundria she does not at all claim to be a professional stylist at all I don't even think she claims to be a makeup artist she just shares her experiences and hopes to show a few tricks on the way.", "crownsbynikkij": "I don't think she should leave our textured hair alone. This was trial and error. You live and you learn. I remember when I f'd up someone's hair for the first time, that's life. You live, you learn, you grow. And after reading a story on the situation, it wasn't like she intentionally did it. Now she knows that every style don't work on every hair type. My advice is to keep learning and keep practicing", "treasurewellness": "And what makes it worse is your a woman of color. Shameful just shameful", "honeyandbasil_x": "I know she didn't do her own hair", "leeshyface": "This is cyber bullying at its finest. You should all be ashamed of yourselves, it was an innocent mistake and she's apologized. Its torturous what you're doing to another woman instead of teaching and guiding her on how to get it right the next time. I'm really so embarrassed that women are attacking another woman like this.", "blujailove": "Why did you try to attempt to style thick curly hair? You are not an expert! What you did to that lady's hair was horrifying!!! Her hair looks damaged and dry after tugged and pulled her hair out her scalp. PLEASE DON'T TOUCH THAT TYPE OF HAIR EVER AGAIN! 😖😖😖😖😖😖🤕", "emmesab": "@ketran0", "salonpk": "She tries to spin into expert advice", "soap.mogul": "Her biggest mistake was that she put in that hair tie too tight. She left no room for the curls to be fluffed or manipulated in any way. Plus she forget a piece of the bang. Lol that part on the left that was looking all crazy needed to be tucked in. Lmao I'm sorry I'm still laughing 😂😂😂", "darkskinnedmakeupdaily": "@salonpk exactly👏🏾👏🏾", "finauq": "Lmao fake hairstylist.", "noellykinx": "You're amazing ! Don't ever forget that ❤️ this generation is shitty and you can't let hateful people bring u down. Love u ! You have people who support you.! Xoxo", "blackk.hippiee": "Disrespectful Tuh My Race. Yuh Aint No Damn Cosmetologist", "monimonki_": "Keep your head, love all your video's! 💕", "jojofabfab": "Think she'll get fired as the beauty expert???", "aranyaandco": "Mistakes happen, life goes on, don't forget you are still an inspiration to so many girls! 💕", "nue.bian": "mistake? 😂😂😂it's like going to spanish exam having studied for your french exam. i get she's an inspiration to girls with hair like her \"white hair\". however as a natural myself... i know my niece can do her hair better than that. learn your trade thoroughly or just stick to what you know. no one would think less of her for not knowing how to deal with natural hair. if i went to work like that my colleagues would've thought i'd lost my mind. straight facts.", "missfayyyy": "Horrible! She needs to go back to beauty school.", "jazzydapowerhouse35": "Educate yourself on Natural Hairstyles also for Black Women", "pdiddy3424": "You do NOT know anything about doing hair. The todayshow was ALL bad.", "amzy_jo_jo": "So many comments bashing @deepicam and she has already apologized and said she will make this right! Not only did she get raked over the coals for the last 48 hours she has been called names and abused relentlessly! We as WOMEN, need to do better! She is a human being that made a massive mistake on national television which she has acknowledged. It's been a few days now just let her live. ALL of us have messed up, but luckily we haven't had it filmed for the world to see and comment on. I first started following @deepicam because she is knowledgeable about beauty and have grown to really love her personality and positive messages that she posts on IG. Being in the beauty industry it's rare to find someone who is relatable and she has accomplished that. She's also stated this is a huge learning lesson in regards to her doing hair and she is going to make this right. At this point it's counterproductive to continue the endless bashing. She has apologized and will never make this mistake again. It's time to move on.", "ooheeyolie": "All these guru's on national TV are always messing up on poor black woman 😂😂🖓", "kourtney7_": "@neesh21 they harsh as hell sheesh!", "ttctwilliams": ". @deepicam Try to not feel to bad. That hair did look a pickle😂😨😊.. You thought you did a good job. Just practice practice practice. Our hair is pretty hard to manage. I guess everyone feels you gotta know your client before coming on national TV and working on them..Thank you for the apology. WE LOVE YOU❣❣You are a beautiful spirit, don't get to down on yourself please..IT'S OK..You let who ever wanting to stay in this moment STAY HERE. LEAVE THEM HERE..Tomorrow is a new day..Bring us the best you you can be and nothing more..Whomever is not satisfied with you well TUFF TITTY! DON'T LOOK BACK💗😙", "siebreeeze": "L", "neesh21": "@kourtney7_", "tlford90": "Bol these comments under this photo is too darn funny, they say the worst of humanity is shown in comment sections 😂😂😂😂 but I must say the hairstyle was umm 🤔 rather interesting 😂😂", "lilliesinjune": "@her_sweets she was ripping her hair! Just because you have a folloqing and a youtube channel doesnt make you an expert.. Not only did you defile her hair but you made yourself look like an inexperienced fool.", "mercedesnobens_": "@s.ayma the comments loool", "micahsarai": "You are getting draaagged honey..where's my popping corn......", "erykahbadurag_": "These comments 😭😭😭😭", "nanasagaly": "She is human", "christieccc6": "You know the hardest trials in life make us stronger! Anytime I've faced something where I've felt the world coming down on me, I endured it with arms wide open and that's when I walked away bulletproof. You are beautiful, young, and ambitious. I am a hairstylist and know how stressful it can be on TV. You truly did your best with all the good intentions in the world. Take this as a stepping stone into the next chapter of your life. Keep your chin up and know there is so much more than these hateful comments trying to bring you down! 💋🌸💋🌸💋", "tolivel0velife": "I would have slapped the shit out of you for yanking my hair. Why say you can do something and you clearly can't those hairstyle could of been done better by my four year old sister. That whole segment was comical and don't ever play yourself again. Stick to what you can do all of those girls looked messed up!!", "rixon_mcqueen": "@bettybapdw no actually your reaction is making a fool of yourself, all this because she tried to do a hairstyle? What's with the hyper sensitivity? You're black not holy", "rubygirl30": "My hope is that she'll use it as a teaching moment for herself, and maybe observe more, research, YouTube information. I think a lot of this came from a lack of knowledge. I think it would have come out a lot better. Btw, all the Black women know that natural styles take a lot of work.", "mzanji2": "@msjoy_warren", "parlorwest": "I'm seeing all these comments and I have to step in and say something. I've known Deepica since 2012 when we started working at a beauty company together, we bonded over our love of the beauty industry -- hair, makeup, etc and we also always talk about the need for more diversity in the industry. She has been one of the biggest advocates of women of color in the beauty industry -- black, southeast Indian, Asian, etc. She didn't have a lot of time to practice the hairstyling and that combined with the pressure of live tv created this scenario that everyone is commenting on. We are all women of color and we need to stick together and uplift each other. Love ya @deepicam! 💖💄💖💄", "cammiewarren1": "Where did you get those earrings you had on on the Today Show?", "charleepayton": "@parlorwest amen", "sacajaleahhh_": "WORST HAIR STYLIST EVER😂😂😂😂😂😂", "beebeautiful2": "People make mistakes ...learn from this ...pray and move on ! Stuff happens and with your career, unfortunately it's in the public eye. Don't be ashamed...learn from your mistakes and hold your head high 👸🏽", "__rehh": "O god guyssss ...I'm sure it was an honest mistake ... mistakes are meant to be made how else do you learn . I'm sure there was no intention to hurt or embarrass anyone. I'm sure she is the only one feeling very embarrassed right now ... now I'm sure she will master our hair for her next segment ...learning process ppl learning process ...", "meancurlz": "@imoneofakin_", "sklove199": "Very easy. Tell the network you cannot do the AA models hair because you don't have the experience. You would've avoided all the pain you caused yourself and others. Simple solution. Now you have people bullying you all over, because you made a horrible mistake. Glad you apologized on Twitter but..no need to love people who call you a \"curry ass\". It works both ways...they cry that you are insulting their culture yet call you a curry ass. What a farce! All could've been avoided if you said \"sorry i don't have the expertise with her hair\"", "d.ejanet": "Summer 16 was not your summer boo. Maybe next year💀💀", "t_feld": "These comments are too damn funny. I'm in tears 😂😂😂😂. I'm natural, and have had my hair messed up plenty of times by professional black hair stylists who could do natural hair or at least they thought they could. #imjusthereforthecomments #blackhairmatters", "melo426": "@ohmythompson 👏🏾👏🏾👏🏾👌🏾", "sandra131_": "@deepicam You are gorgeous ! #Staystrong #livelife ✌🏽️😉", "allisonegreenberg": "Sending you ❤️❤️❤️❤️ and hope you have a good weekend", "dani2classy": "You should legit never do natural black hair again, maybe other hair, just not beautiful natural black hair 😉", "lokalsito": "L", "waxbymary": "@deepicam keep your head high 💕😘 you're amazing.", "urbainspace": "I agree with @danisoclassy if you do, researchthe hair of various type. of texture. You could have slick the black girl back the same as yours. If your culture was disrespect that way you did the black culture you would cry foul, the work of all girls look like a grade school person did it, a wantabe. DON'T GlVE BEAUTY ADVICE. The state of California require training and a license yo do hair not some one who wants to be famous or just get paid. Any product you promote l won't nor my fiends buy", "lex_belike": "Stick to stringy hair. Trying to tame textured hair is always going to leave you looking a damn mess. Textured hair takes a bit more patience than what you seem to have with those 1min ponytail attempts. Amateur", "soulphenomenal": "All the hairstyles looked bad though lol.", "_thequeenpin_": "You know you didn't know what the hell you were doing with that black woman's hair. You set her up to look like a fool on television. Unacceptable smh", "justgigi": "Ma'am I have no doubt in my mind that you are talented but um what where you thinking? Like for real for real what went through your mind when you where doing that woman's hair? Where you tired? Nervous? Inexperienced with ethnic hair? I need answers. When you look back at it now do you really and truly believe that you did a good job on the woman's hair? Natural black girl hair, despite what many may think, is capable of versatility, there's a plethora of styles that you could have done on her hair and yet you choose to pull up in to a pony tail think with faux bangs. Why? Ma'am I need answers.", "sweet_highyellow": "Wow. You should be embarrassed", "mizdulzura": "@denise9455", "alyssa_kunselman": "You know what is always on trend, chic and stylish? CLASS AND RESPECT. Which CLEARLY no one posting all of these hateful comments has. Deepica, you are a beautiful young woman at the beginning of a long and rewarding career, do not let these disgusting, hurtful people bring you down. There are real problems in this world that we should be paying more attention to, seriously.", "joeybuck3ts": "😂😂😂😂😂😂😂😂😂😂😂", "mz._nae_nae": "Bestfran look at these comments @kendallkyndall", "ayeshahbrals": "Shame on her!! She totally ruined models ( beautiful curls)hair 👎🏼", "sayheyymrs.coleman": "Woah! The insults are not necessary. Properly educating her on how to handle African American hair is the key. I think the style was hideous, but shit happens and you learn and while she is learning, here is our chance to teach her.", "spicylikebigred_": "She need to apologize to the model for pulling on her hair like that & embarrassing her on tv!", "jayt53": "@thatsmycj Here's the \"beauty expert\"", "jess_mzhuerta_": "😂😂😂😂😂😂😂😂😂😂😂 OMGGGGGAAAWWW she fucked up all 3 of them girls hair !!! We can't stop LMAOOOO ... @jackiemmmm 👎🏽😁😆😖😖😖😖 PRACTICE MORE PLZ", "thatsmycj": "Why you do that to her ???? @jayt53", "reallynotlogan": "@bbaveja yea it's not really her fault she just needed practice", "matt_xivv": "That hair was atrocious.", "heyviheyyyy": "These comments are terrible, read @thecut article. It was an honest mistake.", "theincredibleshrinkingmomommie": "You cant do hair lady", "miss_baileys_hq": "We are all human and learn from trial and error. Wishing you all the blessings", "benita_baveja": "wow ! I can't believe the outrage here . It's unbelievable! Do you think the hair mess up was intentional just so that Deepica could have hundreds of people bash her ? Why are you people making it personal? It was NOT intentional and she did right by apologizing on Twitter. She is human and yes humans even make mistakes when on air or on stage . People have ripped this girls hair out for doing a poor job on the models hair . I really don't think deepica deserves this. Yes she could have done better...but given the time pressure ..it didn't work out. So you say\" OK that didn't work out on national tv\" but to throw insults like that to me says ...you're just looking to pick a fight for no darn good reason.", "lanapooh_": "Right @rayshad I love the cuff", "rayshad82": "@lanapooh_ that cuff is hot though", "agrace216": "Lets be nice! Somedays I can't handle my own curls after hours of trying and some salons wont touch it.", "ms.gemini.butterfly_": "@_brightness___ look who it is", "crazysexycoolsista": "Please turn in your resume", "_brightness___": "@g3minibutt3rfly 😂 that isn't Farrah", "cleo__not__chloe": "You can't do hair for shit", "blu_beyond_teal": "@icki_vicci read the comments bihhh 😂😂😂", "kajal85": "Sending love your way Deepica. We are all human and none of us are infallible. What speaks out to me is the way you have apologised and dealt with what happened which says far more to me about your character than what happened in the first place. I hope people are able to acknowledge how genuine and positive you are and for what it's worth, the majority of comments here go beyond being constructive and come across as being far more aggressive than they should be. Keep being yourself xx", "vicfila": "@_kimrules 😂😂😂", "bluejazzbabe": "I realized you made a mistake, thank you for representing BROWN WOMEN on TV. However I realized u were pressed for time but please don't get mad, but the styles were horrible please tell its not going to be trend.", "toniacheatham_": "As a licensed cosmetologist I cringed at looking at her go from touching one persons hair directly to the other. She used zero sanitation! I was grossed out and was in shock after each and everyone of those hair styles! Horrible just horrible! She can't be a licensed beauty expert?! Stick to photography and marketing and maybe coach ppl with real talent to market because you are clearly not a beauty expert in hair!", "faithhopeloveu": "The Today Show and @deepicam should be ashamed AND outted for this bs!! 😠. There was nothing wrong with this woman's hair!! She simply had to say \"easy and breezy curls are perfect for the summer, let them fall naturally\"! How tf hard is that to do?! 😠🤔. If you haven't worked on African-American hair the LAST thing you do ...on national tv no less...is pull out all the curls then make some crazy looking ponytail and call that a \"style\"! #missmewiththebs ✋🏾", "banks.r.us": "I can't believe how far people are taking this! Racist taunts and all... coming from people who are also fighting racism in their own lives. The model was not mad about the style. She said it came out better on practice runs... give her a break!", "angelawolfe216": "Stylist card revoked until further notice", "deepica\nVerified": "Verified", "sable.rae": "The way she was pullin and tuggin on that ladies hair damn I know her hair broke off fr 😂😂😂", "pseekand": "If you watch and follow Deepica, she's very talented and works hard to stand up for all women, from all backgrounds. As an Indian, I love seeing a familiar face on YouTube, today show etc. That being said, we can all agree that the today show segment didn't go quite as anticipated. I hope you all see her recent Twitter post to correct this. We all make mistakes, the bigger person (in my eyes) is the one who tries to learn and grow from this. I hope that we can create a culture that is more accepting and supportive of women - through our good times and especially through more trying times as we strive for success. @deepicam", "barbielenox": "Why you mess that girl hair up like that on national tv. You a dumb bitch", "krisssssme": "girrrrrrlah! domt ever put ya hands in the kinks if you dont know what to do with all of their beauty! just stopp 😒😒", "bkcyd": "Teaching moments: know your limitations. Stick with what you know. Research learn and practice new skills before showcasing them to the world. Continue to work on being culturally sensitive. The statement that @deepicam made about embracing the texture of her hair suggests that the model may have had an issue with the curly texture of her hair when that was highly unlikely to be the case. That statement projected an issue that others have with afro textured hair and their inability to embrace it.", "bryaarieee": "L", "yabadmindnadone": "Why did you think you can handle a black woman hair...I'm ashamed because I'm half Indian too and Indian can't do black hair y'all can't handle all that natural beauty...stick to your straight hair and you lucky that woman didn't slap the curry out ya ass that day", "jstonewall": "Should have done more research 😩", "prettytanzanite": "@yuboseyo Bravo", "angeljace10": "@unapologeticallymj @simply00beautiful the comments😩😩😩", "fat2fitbeautytv": "She's getting the business", "deaundria": "@parlorwest If she didn't have time to practice that particular style on that texture if hair, then she should've PULLED the model, booked her for something else and got a model whose hair texture she was more familiar with under pressure.. there's nothing wrong with that, it happens a lot. But to put a model, a black woman on national television looking a hot mess in a \"60-second style\", not only ruins her credibility as a stylist, but also as a professional... all of these black women saying the exact same thing can't be wrong. She may very well be a great stylist!!! But I'll never know or care to know because of this video. Just because you fight for WOC in the industry doesn't mean you have knowledge of all hair textures that WOC have. She definitely needs to take these criticisms and apply them accordingly.", "ty.keraa": "Df u was thinking 😂😂😂😂😂", "5ensible": "Embarrassing....", "beautybyprimrose": "So when is the today show going to hire a real hairstylist?", "ericadsaleem": "@deepicam To calm down the hateful comments that you've been getting your best move would be to apologize. Admit that you didn't know what you were doing and that you will learn more about how to handle African American hair. I don't think you intentionally went on national television to embarrass yourself of your models but that's what happened. Publicly apologize and move on.", "cyrhondacyerra": "🚮🚮🚮🚮🚮🚮", "brincess.ish": "You need a new career. Cause this one obviously isn't for you. Smh, dragging that poor girl's hair right out her scalp.", "ladyjsublime": "Cute look but horrible Today Show segment. I'm sure you've learned the error of your ways by now. #lessonlearned", "meddrip": "Then u had the nerve to put the link in ur bio😩😕trash", "muslimahmarylm": "Almost 400 comments just to remind you over and over about the today show. It's okay. The model will live. You will live. The rest of black America will live, and the Today Show sure as heck will not get cancelled because of the segment. Learning what is right for our own natural hair is an individual process, it has been a challenge for a lot of US. If not we wouldn't spend over 1.7 billion a year on products, books videos, etc. Pick your head up and keep on trucking. You're not the first to make a mistake and I can assure you you won't be the last. Black women go to black stylist and get jacked up too.", "sarah.mubo": "👀🙎🏾🍿", "ohemgeeitspaige": "Deepica; I'm coming to you as a black woman. Some people are taking this way too far and this is nothing more than bullying. I don't believe you had any ill intent with styling her hair. I'm assuming you were simply unfamiliar with African American hair. The hairstyle wasn't good , I'm sure can all admit that but it's truly not as serious as some people are making it. The model's hair wasnt shaved, dyed or harmed in any way. It's just a bad hairdo that can easily be reversed. Please don't be too hard on yourself. Everyone here has made a mistake at work and their mistakes aren't causing them to be publicly berated all over the Internet. Please take this as a lesson learned, that's all you can do at this point. Be blessed!", "cumsponge": "Funniest thing I've EVER seen.. u just needed to practice that's all, its all good", "chark_baitt": "You KNOW you tried it right?", "inessamendoza": "@d0llipop @naturallypatty seriously???? It's not that big of a deal, she messed up, it didn't look cute but you guys take it to another level..", "mrsjells": "Why did you do that to that black woman's hair 🙍🏽😒✋🏾. Did you practice before you went on air??", "briknows_best": "Girl. 👀", "x504x": "1. Go to the beauty store 2. Get a mannequin head 3. Practice.... You have no shame do you? Tryna rip out the girls hair follicles knowing damn well you can't do hair", "thushaa": "@_naffyg watch the video of her butchering this poor lady's hair on TV 😭😭😭 'beauty expert'", "xoxopearliepoo": "That was an EPIC fail. You're not allowed to do black hair anymore", "asleep_by_dawn": "It's simple. Stop having \"beauty influencers\" doing the job a professional should be doing. But this can happen on anyone. If it was a white woman, would everyone be THIS angry? Jesus, get over it. Nothing to do with race. I'm seeing \"viciously anti-black.\" Are you kidding me? Yes, this woman looks \"viciously anti-black\" to me, LOL. Whatev. She's talked about being a woman of color herself. There was ZERO bad intentions coming from her. Come, now. She just doesn't know what she's doing. How about apologize to the model - not the \"African American model,\" if she should apologize at all. I've seen worse happen on t.v. I'm white as the driven snow and I've had my super natural curls wrecked to high heaven. I just moved on. A LOT of hair people can't do curls, never mind a YouTuber. I guess they hated white women's curls because there as been a shit attitude towards curls for many years until recently. Telling us to straighten them and that they aren't \"in.\" Curls never go out of style, dolls. If this shit doesn't stop, we're totally screwed. Seriously. Focus on REAL ACTUAL problems and stop making up crap to get people fighting over. Get mad at \"beauty influencers\" and \"taste makers\" who shouldn't have these jobs to begin with? If she were smart, she would have called in a stylist to do the segment. THE END. So sick of this nonsense. Girl, apologize for taking jobs you get offered because of YouTube. Apologize for taking money from stupid consumers. Well, nevermind, that's their fault. Idiots. I swear to god. Utter NONSENSE. This is a dumb ass beauty vlogger who got a job she shouldn't have because she's NOT a qualified professional. She didn't get enough experience and expertise before running off to fantasy YouTube land. Probably couldn't hack it. Definitely not a hair expert in any way. Drop the race shit. It doesn't exist here. If I had a buck for every stylist who effed my hair up I'd be rich. Jeeeezzussss. Non issue.", "anastassia18_": "@zienna_eve Though I definitely agree with you about the bullying, I still do think it is important for her to educate herself when it comes to textured hair. While, it may be \"just hair\" for some, for others their hair is something they are proud of and take seriously. If she is going to do many different textures of hair and advertise it to the public then it is actually vital to learn not just what looks good, but also what's healthy for certain hair.", "yuboseyo": "I'm going to tell you something and I mean it in the most respectful way possible: you truly hurt my feelings doing that beautiful model Malyia's hair in that side ponytail. I'm no beauty expert, but let me share some natural hair tips with you (I've been natural for quite some time) 1.) never tug that hard on the hair. It tears the curls. 2.) if you're going to do a \"quick\" updo, bobby pins are your friend alongside a hair tie. 3.) side ponytails aren't that ideal for textured hair. 4.) you cannot manipulate our curls that much in that short of a time and expect a good result. And finally 5.) textured hair does not and will never style in 60 seconds. I hope you take these tips and run with them. Bc I am saying this with kindness. You post on YouTube so maybe you could try using it for the next time you might come across textured hair.", "thatchickveeeets": "Your employer should take a good look at you and your lack of integrity. It's clear you went up there with zero preparation and called yourself an expert. #sad", "anjubsm": "Why didn't you just do makeup?? I don't get why you even agreed to a hair segment you rarely ever do your own hair even on ig.", "charellshmoney": "a mess", "_kyrachanel": "Terrible", "_attractivechic": "How are you an expert ? And at what?", "jammacey": "You did a terrible job. Just terrible.", "eva_mangura": "Maybe you should just stick to makeup...", "mrsjonesie1022": "Yes honey try again, it didn't work & you messed up that lady's cute curls with that sad excuse for a \"hairstyle!\" #hairfail 👎🏾👎🏾👎🏾", "thetowandatioga": "@sruti0105 people are angry because she made a fool of that woman. She CLEARLY messed up her hair and made her look foolish. The appropriate thing to do would be to own her mistake, apologize for it and move one. I for one, am upset, because at the very least she owes the model an apology. You don't get to tout yourself the \"Resident Beauty Expert\" and then not acknowledge a HUGE beauty faux pas. Clearly she had no idea what to do with that woman's hair and she needs to simply own that fact.", "lhamilt77": "I think it's important that if you are brought on a show like Today as an expert, you stay in your lane. When you reach into territory that is not familiar to you, you risk your credibility. No one would be dragging you if you actually successfully styled the models hair. We know the idea was \"one minute styles\", but this should have been thought out prior. I respect the fact that someone, you/a producer/whoever thought \"Let's have diverse models\", wonderful! But making sure you could actually deliver is pivotal.", "razrobertson": "There are classes you could take that could help . But I agree you should definitely apologize,", "_vichoward": "In her defense it wasn't just the ethnic hair that she messed up, all three styles including what she did to her own were pretty bad and made me go 🤔. She should probably invest in a view classes in the hair and styling department because clearly makeup maybe her only \"beauty expertise\"", "jazzonthego_": "Agreed.@viciousvicc", "chicjewelsbysiobhan": "#EpicHairFail on all the models😕😕", "mallori__": "@kellystorey this is the stylist from the today show. They found her in IG and started going in on her. 😂😂😂😂", "danyelle4life": "Understanding diverse textures, products, and trends would be helpful to you as a stylist. Not all hair is the same.", "yuyuleroux": "Girl were you the stand in for the actual hairstylist? You must do makeup or something. Girl you to take a class, not YouTube, but a class. Shameful.. no Asian and Afro American hair you gun.", "ajsuperparty": "Wow shameful. Just yanking her beautiful hair into a ponytail!", "unapologeticallymb": "From one colored girl to another...you truly TRIED IT and failed. No ma'am. The model deserves a public apology.", "chele.belle": "Calling yourself a professional stylist is an insult to all of the talented stylists out there. Do you even realize your mistake? I really feel like you owe that model and every other curly/natural textured females an apology.", "dvnmrgnobi": "Thanks for messing up that woman's hair on the show. I hope you are roasted until the end of time.", "docgentry": "Slick all y'all commenting on her page really need to start with the @todayshow cause they the ones who set this up in the first place 🤔", "tatidgaf_": "These comments 😂😂😂", "thelifeof.tee": "Lol", "pink_muff": "@lolap1000 I don't think it has anything to do with color! If she was white or black she still fucked her hair up!", "aliahbk": "\"Expert\" I lold so hard!", "behindenemylines5": "You corny ass bitch 🌽🌽 you know Damn well those hairstyles was trash.. ✋🏾💩", "juicytribe": "Don't ever do hair again 🙄", "jennywhoa": "You need to apologize to that Black woman for what you did to her head. Talk about an atrocity. Haven't Black people suffered through enough?!?", "lolap1000": "Also please don't use your argument of \"haven't black people suffered enough?\" Grab a history book ya'll. There was a time when indian women were slaves too. Actually they gained their independence much later than ya'll did.", "angelicasmith1913": ".... And abrasive ....did you really call her beautiful hair abrasive ?", "kinaboo_80": "I'm sure you're a nice lady, and I understand there may have been a time limit to get thru to everyone . However Please NEVER! NEVER! NEVER! Touch a black woman's curly hair like that again😂😂😂😂😂. You were better off grabbing some Bobbi pins and making a quick faux hawk. God Bless you", "thatdamngina": "She tried!!! Y'all are being too damn brutal to her. Maybe she should have done a test run first but you can see she meant no harm!! SMH!!! It's really sad that women are so quick to tear each other down.", "jamalisking": "At thw end of the day, what black girl do You know that going to Ever go to someone who looks like her to get their hair done??... please show me her, and i will show you a girl who probably doesnt know shes black....😂😂😂😂 you set yaself up Deepica girl, u knew u couldnt do her hair Before she sat down. Sucks for u .. bad call ref.. it was a bad call. 😂", "itsteewilson": "Word of advice: Practice and prepare before you go live. Amateur mistake. Know better. Do better.", "lannij788": ".@i_sawday she's a troll I seen her on other comment threads saying the same thing to undermine the essence of black women", "sruti0105": "Idk why ppl on here are attacking her. It's a 60 second segment on the Today show and the model was gracious about it. You can all learn from her example. No one is perfect, and it takes a lot of guts to be on TV - and things always go wrong. Stay strong @deepicam, nice to see another Teleugu lady kicking ass 💪🏽🤗", "senorita09": "Damn shame how you did the Black Model's hair!!!", "tanganikabytangie": "Next time: Bobby pins. Fro-hawk.", "nik_ty": "@rixmcqueen you want to be us or like us you mad or nah sit your angry ass down", "whereisnursekelly": "\"Beauty expert\" lol 😭😂", "bih_im_magic": "Quit your day job because you keep fuckin up ppl hair gonna get you hurt", "karinakhemani": "@nish221988 these comments 😂 \"beauty expert\"", "myheartbelongs2ivry": "Really? Who does that to someone on t.v.? You need to be fired!!!!!", "thefamilyibuilt": "Absolutely love that cuff!! Girl you've worked hard and have accomplished so much. Sending positive vibes your way and wishing you loads of success. God bless!!!! ❤️", "nola_q_darling": "Either the today show are clowns for having an inexperienced child who is nothing more than a blogger with a pipe dream, on TV, or you are a scam artist. A beauty expert you are not.", "doriwanz": "You really made a fool of black women.", "outlawd98": "Ma'am, I'm struggling to be kind...but what the holy hell?", "taylordbydiamond": "@itsdiamond_duh", "only_1_nikki": "Just bald that lady's hair up and moved on just say you don't know what the hell you're doing made a fool out of that poor lady and yourself", "alyssamorganofficial": "@tabby_d_ I actually feel bad for her.", "gaugaugrl": "Gurrrrl, love your posts on insta. However, what were you thinking when you signed up for that Today show segment? 60 second hair do's are never a good idea 😁", "ybert": "All 3 Styles were a fail 😳😳", "rainbowinbloom": "It truly was not the end of the world. Just required a little more planning. #lifestooshort", "sydnita": "@mallori__ this is the stylist. I'm dead at the comments.", "courtneymincey": "@camillerosenaturals while you all are at it, send me some too 😂😂😂 #forrealthough", "skinnylish": "Found her! @nicolegarder @_nahhla", "issa.big_mama_ting": "lmao you messed sis head up 😂😂😂😂", "itsericae": "🙆🏽🙆🏽🙆🏽🙆🏽🙆🏽🙆🏽", "theprincess3": "Poor thing @fee_est87 and she's their beauty expert. You would think she'd tried the style in the back before doing it live. Smh. That poor model. She looked better before the \"side pony tail\" massacre. 😂😂", "donpetal": "I am a fan of vertebrae in general.", "anrippey83": "@yuboseyo 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "dopenaturalchick": "She tried but it was a epic fail.", "laginawashington": "I watched that segment and my 6 year old sister does my hair better then that when she is playing in it. I know you had good intentions but damn lol you did give me a laugh for the day though so we thank you for that 😂 @deepicam", "camillerosenaturals\nVerified": "Verified", "tinashanee": "This is the women who did ol girls hair on that video we saw. They're goin in on her comments 😭😭😭 and rightfully so to @melanin_scorpio", "shansamazin": "@sherronmiracle this is the lady that messed that girls hair up", "anafdiva": "@tiffanybassett I watched the video and I'm crying! 😭😭😭. What the hell was that? Somebody said #blackhairmatters...I'm logging off.", "lillmaticc": "@pleeznomayo these comments", "alter_her_nherg": "@zienna_eve Well Then She Should Have Taken A Few Ethnical Cultural Hairstyle Classes Before Making A Fool Of Herself And The Woman Who Happens To Be The Victim. Culturally Speaking, We Don't Just Slap A Pony And Uneven Curl Bang Outside And Assume That's The \"IT\" Look. At The End Of Day, It Is Still A Joke.", "tiffanybassett": "@anafdiva read comments", "lauren_iman": "Why is everyone mad..... Its really not that serious", "divadahling": "I can't believe you jacked up the black model's hair. Had you even touched black hair before this? And the other two models' hair were a hot mess, too. Maybe hair just isn't your strong suit.", "andreadiggs": "@cordon_bleu1231 You have to read these comments! Somebody said #blackhairmatters 😂😂😂 She really messed up by doing that to her head!", "sun_kissed_nubian": "Yeah it was messed up but that shit was funny😂😂she threw that hair in a 1st grade ponytail like she knew what she was doing.. @deepicam you gave me my best laugh for the day😂😂now don't ever attempt styling textured hair again", "missmo6one7": "Please understand what you did to that woman's hair is disrespectful to black women. Especially to those of us that embrace our natural hair texture. Even if you do not see your error you owe us an apology. Your idea of a style is incredibly insulting.", "goldengalll": "😂😂😂😂😂 some one said #blackhairmatters...that segment was soooo painful to watch, like why do that if you're not experienced with black hair ..sigh*", "melanin_scorpio": "@tinashanee she straight disrespected that woman's hair. She owes her an apology, having her look crazy like that on national tv. It was fine the way it was before she stuck her hands in it. She need not ever touch a black woman's hair again. She should let me do her make up.", "fee_est87": "@theprincess3", "harperloveslife2": "You screwed up that girls hair on the Today show. Are you even a hair stylist? If you can't do curly hair, don't do it! Her hair was gorgeous before you touched it.", "unstolen_royalty": "😭😭😭@curlylocks_1", "jasibella": "We need real answers as to why you thought roughly raking through the model's hair was a good idea. How as an alleged \"beauty expert\" you didn't think this isn't going to work, what's a plan b? Or what made you think her curls needed fixing? As a \"defender\" of woman of color in beauty as your friends claim, you didn't educate yourself on kinky & curly textured hair before embarrassing the model, yourself, your brand and women of color who already have to deal with the disrespect of our beauty by \"mainstream\" media? You have some atoning to do and you should be willing if you are really about promoting the beauty of WOC. And a note to your friends: I get defending your friends as you should, but REAL friends tell the truth & don't make excuses for trash.", "moanalima": "Lmao everyone going in on these comments. I found her insta y'all LMAOOO @alt_pmama @nxlima @maileimataliya", "arianashordy": "You should issue an apology for that atrocity.", "pmahmz": "#blackhairmatters @moanaleeee lmao they hella going in", "znariah": "You really should apologize to the model. If anyone tugged and pulled at your hair the way you did hers, I'm certain you'd be upset. I get your friends standing up for you, but as a human being we can acknowledge when we do something wrong, learn and grow from it.", "nxlima": "Lmao TRIED IT @moanaleeee @alt_pmama", "cartierdiamond": "I don't really comment on stranger's accounts but your segment on summer hair was not well done. Please address this or do something in the way of preventing such an embarrassing display on national television. I'm sure you meant well but it didn't showcase the lovely African American lady in her best light. She was absolutely gorgeous before you put that hairstyle on her. I would try to write in to the company if I could figure out a way. Because my hope is that they bring you back to better showcase summer hairstyles that look good on black women. You really need to redeem yourself @deepicam . @babinefertiti @kl020225 this was the best I could do.", "the.nellya": "@serah_adwoa_tamar u said that! ✊", "charlie2087": "Everybody makes mistakes but that was hard to watch #yikes", "loxo_xo": "yikes 😂💀", "queenruthie1": "@riipete I know right. Beauty expert my ass😑😒", "allthatandaboxofpolish": "LOLOL!! Girl... you did that black girl wrong .. smh", "f.shea.m": "I watched that segment in horror!", "ririchy1": "@queenruthie1 😂 I saw that trash ! She made her look like buckwheat from lil rascal. She needed to seek advice from people who actually has that type of hair. That honestly was mad disrespectful. She needs to stay in her lane", "ryanhustler": "🙅🏾🙅🏾🙅🏾🙅🏾🙅🏾🙅🏾", "cinnamonstaxx": "Why Girl...just Why 😩😑", "badgal_raquelmonroe": "@_______claud They dragging her about doing the black lady hair. 😭😭😭😭😭😭", "hawa_ca_": "Bitch u tried it with your hairstyle 😫😫😫😂😂 stay in your lane next time boo boo kitty", "studio.badu": "@santigrams 😩😭 the comments, #blackhairReallyDoesmatter", "kevnmadeit": "#blackhairmatters", "jazztheg": "Leave our hair alone please!! Lol stick to what you know boo", "curlylocks_1": "@unstolen_royalty the comments", "reina.smiley": "@fitnessproducer omgggg they killin her here 😂😂", "og531": "I hopes she's ignoring the buffoonery in these comments.", "fitnessproducer": "@reina.smiley lol", "_reonar": "Lmao they are going in on her for that ridiculous mess she put in that girls hair @lecorbeau_", "bossyin_charge": "👎👎👎👎👎👎👎👎", "lovejess7": "Sorry that job on the today show was Horrible", "d0llipop": "#blackhairmatters", "blk.bodhi": "#blackhairmatters", "ziennasonne": "Ladies, this is turning into bullying. It's really not okay. Yes the hair did not look good, obviously she didn't know how to handle her hair, but come on?!! It's not like she did it intentionally to make her look bad. Imagine being in this woman's shoes - she is being bullied all over the world because of this, and I guarantee she is probably very vey sad about all this. It's just hair. And no one was trying to hurt anyone.", "xoxojustbubbly": "Wow, women of another color bashing another woman of color. Bravo, guys, just bravo. Yes, she messed up but it was not her intention. And the hairstyle was not meant to be perfect but a quick on the go. Cut her some slack and let's refocus on Donald Trump. Have you seen HIS hair? Now, that's something to talk about. ✌", "k_emmy36": "Not shaming you just giving a little advice. If you are not sure how to do something, it is never a good idea to do something on national TV. I think this whole thing could of been avoided if you was just up front with yourself on what you are able to do vs what you dont. It's never a good thing to experiment on new things on television.", "jnettepooh86": "Tried", "shortt29": "@mizdulzura", "kissme_london": "Not being petty!! But why you fucked that girl hair up like that?! 😂😩 #QuestionsThatNeedAnswers", "nappy4b": "👎🏾👎🏾👎🏾👎🏾 stay outta black ppl heads MISS", "delareeseluke": "Miss I would of slap the F@$K out of your ass you know you did a F@#K up job I hope you apologize to that young lady for making her hair look like shit on national television 😬😬😬😬😬😬😬😬", "newkitten87": "@i_nvy chyle look at the comments 💅🏽💅🏽💅🏽", "mstanyalachelle": "I think you owe the model an apology @deepicam", "whoisthiskydd": "U stupid bitch", "ms_fields32": "But you fuck with a real sista...and she was naturally cute until you touched her #failattempt to bring her summer sexy out...smh #naturalhair", "richelle_destined4greatness": "@deaundria yes!", "856si": "you aint no beauty expert pulling on ole girl hair 😭😭", "_from_tiny": "I just had to check the \"expert\" out 😂😂😂😂😂 girl you tried", "nycwhitney": "Who the fuck made you an expert. DONT ever touch another black woman's hair. PLEASE!!! Also, she was a freaking fool for sitting there too while you fucked up her hair! 😤😂😂😂😭😭😭", "shaunee721": "Please don't go on television again. Especially if it pertains to hair. Not only did you make the black woman look like a fool but you messed up all the ladies hair. Including your own. Maybe teach people about make up because yours looked amazing. \"Beauty\"expert, yes. \"Hair\" expert, no.", "briannaneedsapenn": "Why did you mess up that wonderful ladies' hair? She looked so much better before, and it was honestly TOO OBVIOUS that you had no clue what you were doing.. #shame", "chef_apple_k": "@msnsula akima insta lol... Ppl r going HARD 😫😂😂😂😂", "suaveshorde": "smh", "jocelyn_gail": "🚮🚮🚮🚮🚮🚮🚮🚮🚮", "toriananicolee": "Im sorry sweetie but if you dont know how to do black people hair then stay away from black people hair smh you just embarrassed tf outta yourself for fuckin up they heads smh go back to school 👌🏾👎🏾", "kayley_pratt": "Anyone know her credentials? Genuinely interested to learn what composes a beauty expert and Today Show style maker.", "freeafter12yrs": "Wtf was on your mind? What was u thinking ? And then that other lady had the nerve to say \" super cute\"", "mzmika_": "Epic fail😐", "dmv_body_sculpting": "You don't fit into their standard of beauty dear. You are Brown, that was real messed up what you did.", "empressdee91": "Well you damn sure ain't a good friend to her if you condone what she did to that black woman's here! All skin folk ain't kinfolk 😞", "boujeeblackgirl": "So clearly as a another woman of color you got on national television and decided to humiliate another woman of color? You should be ashamed of yourself", "imnotsureyet_": "I saw the video.. It was def cring worthy lol nonetheless.. She's human.. I hope these comments don't get too far out of hand! Be respectful everyone", "kianaterrell": "Please do better next time. Practice", "jasminemann44": "wow!!!! people are so bored today!!!", "edotfozz": "Honey, don't call yourself an expert. Either you were trying to make her look bad, or you need a new job if you thought that was cute.", "lovebeccabeccas": "Please educate yourself on ALL hair textures. I couldn't even watch the whole video bc I was so embarrassed. I'm sure you didn't mean to be disrespectful but it came across like that.", "mama_josephine": "The expert is really not the expert", "spunky_brewstah": "Please don't call yourself a beauty expert if you're NOT an expert. That \"style\" for lack of better works was embarrassing, on national tv no less.", "misshoutx": "Y'all talking bout the black girl but the Asian chick ponytail was crooked too!!!!", "jennellenic31": "I feel the same frustration as everyone else but at least she tried, most people would even touch our hair. I bet she is working on doing black hair better after this. I'm sure she wasn't pleased with the result but she had to keep moving because it was live. #leaveheralone", "gift_of_gabbs": "Do you normally work with natural hair textures?", "gabriannnaaa": "You tried it sis, nothing about that shit was \"cute\"", "mss.keke": "WHYYYYYYY DID YOU RUIN THAT LADY'S HAIR???!!!! ON NATIONAL TELEVISION, YOU ROYALLY F*CKED HER HAIR UP!! I WOULD'VE FOUND YOUR FRAUDULENT ASS AFTER THAT SEGMENT!!! 😠😠😠😠😠😠", "ahyanni": "It's okay bc you tried 🙄", "rooflessroo": "😂😂😂", "kreeesha_": "Please go and apologize to that model and the black community ! And go learn from a REAL natural hairstylist how to do black NATURAL hair !!", "trillary.clinton": "@anjuhleek.shante nicely said.", "gorgeousbrownt": "Lol I understand you were trying but next time do extra practice if you are out your comfort zone. This felt like a slap in our face for natural women tbh", "novella1986": "Girl you should be ashamed of yourself .. Try that hairdo on other Indian woman .. But that shit don't work for black woman.. You made that woman look a mess on national tv", "_winged_maat": "You had that lady on national TV looking a hot mess.You know NOTHING about Natural Hair", "lippielovin": "Please stay away from black women's hair if you don't know what you're doing. I could feel that girls pain when you were tugging and pulling her hair. Beauty expert? Please 💺", "nzdmylove": "You should never do anything to natural hair, that was horrible instead of saying that you had no idea how to do African American women's hair. You get the DONKEY OF THE DAY! Horrible job, you should be ashamed of yourself", "leo_empress_87": "🙆🏾🙅🏽💁🏾 just why??", "starg1rl_": "expert?", "kiki_w_89": "Stay in School.", "thehexartist": "Y'all check out my artwork 😎", "ayannacaprii": "Just one thought,,, let's not touch black women's hair again. Cool?", "_lexdanielle": "U know u were dead wrong for that lol", "girllikeanu": "She looked like she was in pain 😯", "alluring_xoxo": "You need to take some serious lessons, absolute horrible job on the natural hair lady. You are clueless", "simplypeechie": "You looked like you were seriously hurting her and she stayed calm! Could not have been me.", "toddawful": "Please do black people hair a favor and drop dead.", "breecam_can": "👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾", "drea6421": "Here's the L you won today 😂", "colormekiana": "I wish y'all would stfu, yall are acting as if she tried to mess it up", "starring_kya": "Please Don't ever do a black girls hair again 😩😩", "speakershinjini": "@parlorwest Love you! SO true! Love and light always! ❤️", "lalocali": "@tanoriphoto major fail!!", "_theyheartbk_": "Lol I knew these comments were coming.", "feb4thfab": "@queen_kei96 😂 I had to come find Deepica lmao", "kisscole_xoxo": "@uberpretty did you see the video of what she did to that Black woman's hair on the Today show? Smh her notifications about to blow allllll the way up 😳", "anais.9024": "My daughters are bi-racial and lol I was in shock when you violated that poor girls hair. You ruined her ringlets 😩....lol if anything you should promote the satin lined cap next for a quick look. It's cute and it's versatile...", "being_ericka": "@lovoyajones Did you see the mess she made of the black woman's hair today on national TV? I was so embarrassed for the model. Please find the video", "flourishinggsoul": "Not here to bash you but please learn more about natural hair textures before laying a finger on someone's hair and at that calling yourself a beauty expert. That was by far the most disrespectful thing you can do is to pull and tug at someones natural hair confidently saying you want to rid her of her beautiful curls. If that was me or many other natural haired girls I would have gotten upset and walked off stage or got crazy with my hands. I wish you a well educated future in NATURAL hair. ✍🏽 Peace", "mealsy79": "@likey78 @sadiwoww 😂😂 did you see the \"make-over\"?!?", "crown4crown": "You tried tho. I have trouble with my natural as well but DAMN girl you should've skipped her FrFr.... Poor lil Tink Tink", "kaye.monet": "As a both Black and Indian woman I was so appalled to watch a Brown woman do that to another Brown woman smh", "urbanbeauty619": "What was that on the Today Show?! 😁", "abby_tanori": "@lalocali this is the girl that ruined that cute girls hair lol horrible!", "akevathediva": "That style was a fail the moment you decided to put it in a side ponytail #epicfail", "tiffdoesmakeup": "@parlorwest 🙄", "williesdaughter": "Shame on you!! There's so much info online on kinky afro textured hair. You should have done your research.", "_melanatedempress_": "@imnotsureyet_ he's cooning with self hate! No realizing his mom looks like a mop too when her hair natural", "dominicanamimi": "You ought to be ashamed of yourself. If you don't know how to style coarse hair then don't attempt. That was the shittiest hairstyle I've ever seen. I've seen little girls do a better job on their dolls than that mess you did. 🚮🚮🚮🚮", "mz_kandylicious": "Think you need to put yourself through hair school because what you did to that poor woman's head is atrocious. If you don't know how to do black people hair that's fine. But don't try to act like you're an expert and make the poor girl look like a train wreck on TV smh. Learn or just stick to textures you know", "godwitchquatichia": "She made a fool of herself. She owes the model an apology", "rosaleeonline": "You made a fool of yourself! Get an education! You owe that woman an apology!", "nfabulous": "If you aren't familiar with naturally kinky/curly hair you absolutely should not take the risk of styling it in 60 seconds on live television. #epicfail. Women watch these types of style segment for inspiration and expert advice none of which you were able to provide. @deaundria I completely agree with your comment.", "sieraszn": "😒 girl. Please tell me you can't be serious with that Buffoonery on national tv ?", "ilovehersmile": "Please don't ever manhandle natural hair like that again. That was so painful to watch. I wanted to take an advil after watching that.", "jvadala4": "Hey, let's get dinner next time you're in Texas", "fashionstylebyjohanna": "❤️", "emilylfoley": "Bracelet game strong, chica!", "b3.brittany": "Im sure you can do various styles but the way you manipulated the black model's beautiful curls into a frizzball and that poor braid 😳 it was painful to watch", "mka4evr": "You owe that black model an apology and a do-over. Her hair was GREAT until you touched it.", "grandbabycakes\nVerified": "Verified", "sonalibajaj": "@candacemread thanks! It was a pleasure to meet you yesterday. Hopefully we can meet again in sept!", "adriennecgarr": "I'm not sure what kind of hair expert you are, but you really need to talk to some of your colleagues/stylists who ACTUALLY do black hair for a living. That style was shameful. Lol😂😂😂 Seriously what were you doin gurl?", "lindsoux": "oh so you're the one who played the black model on national television...well your styling was cringeworthy. You gave no regard to her type of hair and what style would look best. I sincerely hope you at least address the error of your ways. Be blessed.", "jeanellrey_": "She literally made those women's hair look worse!", "its_alisha_": "Cutie 😘", "beautyproductsaremycardio": "Stunning", "frecklebrooklyn": "Great hair ✔️✔️", "kamanabhaskaran": "That cuff 🙌🏼💖", "jenniferfisherjewelry\nVerified": "Verified", "michellejailine": "Hair looks gorgeous!", "kittykatya13": "Where can I buy the choker? Thank you!", "amna_andrea": "Queen! ❤️", "candacemread": "The gal I was telling you about!! @sonalibajaj", "glambassadorofficial": "Superb!", "natsampsong": "Perfection!!🙌🏾🙌🏾"}