{"shrads": "Haha.. They're the cutest", "lalalalema": "Lmao my mom packed me bolani and her sponge cake when i went to cali @mmas1225", "h.elk73": "Sooo sweet!!😂😂😂😍😍😍", "allurebyhamsha": "Awww they’re so cute 😩❤️", "mesmerizingbeautybynikki": "Hahaha..this so reminds me of my uni days..", "tanm786": "I love your mom ❤️", "doctalks_": "Love Pandus 💖🌸", "neelozahra": "Omg just like my parents! Mom sent me home with a box of dates ❤", "mr.sarah__": "@areebz2 @bukhtawer lmao us when we hangout", "deepthi_ranjithkumar": "Amma: \"enduku aggressive...check-in lo padesta ave vellipotay\" hehehee ...she is so much similar to my mom 😍😍😍😍😍😍😍😍😍😍😍", "miliip4": "@vaidehi419 lol", "monicams195": "@soumya.vhasure", "saniyakladhani": "This is totally our parents. @seharkanji", "kareensingh": "Omg. My parents are the same.", "officerdoofy0": "@saladmaker1234 cute lol", "groovychiv": "@deepica I love the videos with your parents because of the undercurrent of Telugu from your mom...reminds me of my mom back in Australia whenever I visit and just that “aggressive” love i get! #endukuaggressive #checkinchesesay", "aramas33": "Omg my dad is EXACTLY the same....always with the fresh fruits, chutney, instant Indian meals and sometimes samosas (I take those)", "tish.sene": "@tarikasene totally our Thathi with the mangos", "sojasubhagar": "@onewordepic", "sohinisengupta_": "@torasengupta", "oh_its_just_amy": "Every time I go to my grandparents or one of my uncles or aunts. I always get loaded up with so much food!! Oh and blankets!", "beulah_sudhatan": "Deepica is your dads name Murthy by any chance?", "deepica\nVerified": "Verified", "jenniferblair5573": "NEVER say no to mangoes!", "geethika.bathini": "@harikondabolu", "eemaanarthenna": "Omg how could anyone say no to mangoes? 😅 this is my parents @_srija_ @hennabilge @healinghenna @mandeep.k07", "sahi.sp": "@vbarlas_ story of my life 😂", "subadooba": "Our lives are the same sans chicken (sub in sambar).", "hennabynatasha": "#desidaughterlife lol 🧡", "akscientist": "Lol, like my parents packing the goods for my trips back home.", "fergalicious_but_with_bees": "My parents??????", "khushi_ab": "So cute!", "nongmoheaux": "What angels x", "mayaminocha": "@jenaminocha", "laya.kal": "Real lifeeeee", "maggieanton": "What mamma does every weekend....literally 😂 @jananymohan @elianeafram @achugha #thisiswhyIcantcook", "sammandortemptu": "#mylife", "thechutneylife": "They are the cutest!!!!", "min0ska": "You have the sweetest parents", "hussein.yusuf.100": "I've been their,hahaaaa,I love them", "humblebeezzz": "Gotta love it, typical sweet Indian parents. 😄😄😄", "lionlox": "Your parents got Jamaican in dem. That’s what makes dem special 😍", "_christina_smallwood": "Your parents are amazing ☺️", "cosettiiie": "OMG so cute the mangoes!!", "juvena___": "The disappointment in how he said ‘no’ and then smiled", "zeetaylor898": "Omg, save my plate😁", "priyabhaidaswala": "@monica_mahal", "decade47": "Got to love Indian parents!", "m.aptesam": "omg I really love u r family u r mom nd dad r sooo cute especially u r mom she act sooooooo cute u r aaaaaaaa😍😍😍😍😍😍😍😍😍😍", "breezymee": "You’re parents are so sweet!!!♥️♥️", "ismath": "This is exactly what my parents do too! Mangos, muumuus and all! #southindian", "kunalmerchant": "Always accept the mangos!", "jcfullofgrace": "Love this! Where can we find these muumuus?! 😬", "dicesoslick": "They are cute", "tarinic": "@asundaram got to love Indian parents", "kajubabe": "😂 Yes. I know exactly how you feel, oh and when you get married it will be your in laws! P.S. MIL might throw some shade as well. 😜", "sejalshah58": "My parents are the same! And another reason Indian parents don’t like the plastic bag ban....", "insiyakapasi": "Hahahah this is exactly like my mum and dad! They give you fruits, curries, spices etc hahah", "divyareddiev": "Enduku aggressive ! Check in lo padesthe aypothadi..lol all Telugu moms are the same..", "wanderlust_shivs": "Gotta love Indian parents ❤️", "sasha2912": "Exactly like like my parents! Xx", "bhanuvagolu": "Hahaha deepika ! i can totally relate to this where mom is trying to fit chicken Curry in my suitcase ( check in lo padeste satipotaadi le 🤦🏽‍♀️) and dad is holding mangoes in his hand to find more space !!! Same happens at my home too 😅", "whoelseisnamedkshitija": "@sanahsuvarna perks of having Indian parents 😏 My mum would pack an bag full of curries whenever I was travelling back to uni during my bachelors. My dad still gives me home cooked food whenever I’m travelling from UK to NL for uni now! 😂", "makeupbypiru": "Hahahha the mangoes 💖 #goodtimes", "jeyofmyuberlife": "I relate to this", "amitakundramd": "Lollll", "raggedyang01": "Mine do the same", "vinssmile": "Exactly what my parents do!", "lexierra": "I love to rub milagai thool (chilli powder) on them too! Best with those sour kind of mangoes😋😋", "jempaga": "Typical telugu parents ❤. Especially with the mangoes.", "maygar2": "Awww, your your parents are So cute!", "shilpimua": "@deepica does it happen with you too that you visit your parents with one bag of clothes and then come back with an additional bag of food items!", "hayleexbrows": "This is me too coming back from Louisiana!", "am_brownbeauty": "I live for those sugar sweet mangoes 💁🏽‍♀️😂💖", "browngirlbuzz": "Can relate so hard hahah my grandparents try to stuff every food that ever existed into our luggage on the way back from overseas 😂🤣", "lizkennedy": "Soooo cute", "ru_gandhi": "Awww your parents are so cute! This is real life for sure. Love it 😊", "pbnjayam": "Omg straight out of a @harikondabolu bit <3 I love telugu ppl", "hereislyfe247": "They are so so like my folks !!", "niromila_n": "This is so cute! 😭 Gotta love Indian parents ❤️", "tazzystar": "We have mangoes in L.A.", "frenchistaa": "So cute 😊. My parents are the same whenever I relocate they pack me with so much food and I love it", "bridgetdheredia": "Omg you’re from Houston!!! Ahhh, love you even more now 💕💕💕", "asharani_": "Looks familiar 😂", "sarpatel": "@filmoz I think you will enjoy this... pretty much why we own a @yeti", "artisticbrowsandbeauty": "Life at its finest! I loveeee the feeling of being cultured even if it’s just as simple as packing mangos to send away! (@apple we need a mango emoji ASAP!)", "justyyyface": "Aww your parents are super adorbs, they remind me of my parents 🤗🤗🤗", "_ms_gem_": "Typical Indian parents! What no papaya?", "michele_perumal": "So Indian parents.. food is life to them.. always packing💗💗💗 and at the time we think we don’t need it but when we get home.. we can’t wait to dig in 😋😋😋", "spicyish": "@ayu_sinha lolllll same!!!!", "ramyakumar": "So lovely 😊", "pluralisticignorance": "Lmaooo my parents are the exact same way, except with avocados that grow off my neighbors tree 😂👌🏾🥑", "pinkrains": "I love all the posts with your family it always makes my day.", "sumiyarifat": "They r the real lover of life.😊😊😊", "sanfran2407": "Don’t you love Desi moms!!", "silajp": "It a universal parent thing...... Mine do the same", "vinoothna_reddy": "@deepica Aunty in the background talking in Telugu. 😆😍", "neera19": "Are you even indian if this doesn’t happen? 😂", "sonia.geo": "Awwww I love your parents!! 😍❤️❤️", "annette_mathew7": "@neethumm @chandana404 how my mom expects me to come home every time with mangos", "imamandeepnagra": "Aww wow 😍😍😍😍 mangos 😋😋", "tharumilove": "This is so precious", "andreaesg": "@deepica she is every Indian mother!! I Iove it!!!", "radiaig": "Aghhhh I love your dad.", "rohini9": "Lol, Telugu moms....they’ll even send food through someone else if they have to!", "mor_elizabeth": "Awwwww how cute is your dad?! 😭 lol he shows up with mangos 💕 that’s how you know you are a dads favorite when they low key try to pack food for ya!", "chaits1993": "That is true love.", "rachelmariaofficial": "Parents are the fucking best.", "rasmi09": "My mom did this with shirmp curry and wagh bakri chai packs lol", "niasheereen": "🗣 SEND THOSE MANGOES MY WAY I’ll GLADLY TAKE THEM!😆💗", "victoriarod13": "Hahaha!! 😂 oh my gosh they are adorable. Those mangos 👏🏻", "liz_alam": "He almost seemed offended that you didnt need the mangoes. You never say no when your dad gets you mangoes. I've learned it the hard way that they will pack it anyway", "saradesignstudio": "Parents are the cutest!!!!", "jess_mulaa": "Lmao my nani does the same", "meghsmk": "Desi parents 😂❤️", "emitommo": "No mangos?? I always bring mangos from DR lmao but it cuz the mangos in DR ARE HUGE and gmo free since it’s grown in our backyard over there", "thedutchcaribbeanstyle": "But you need those mangoes! Lol yup same here!", "roobaby3": "They’re so so so cute!!!! Y’all need your own show lol. That’s love right there!! ❤️❤️❤️", "darshi_sj": "This is the sweetest ❤️ reminds me of my parents 😢", "rubycf": "Brown parents ! Love it . Are mumus Indian nighties lol", "itsakrish": "I love how he looks genuinely confused for a moment when you say you don’t need the mangos... like how could you not need more mango in your life?! 😂😂", "arshiamoorjani\nVerified": "Verified", "radchandra": "🤣🤣🤣All Indian parents think alike! Love hearing the Telugu in the background...reminds me of my parents:) 😂😂 about the mumus...I wear my mom’s whenever I go home.", "seemagroverwong": "#desiparents", "apandeezy": "Let me guess, straight from the indian grocery store 😂 my mom brings me spices in her suit case when she visits 🤦🏽‍♀️", "amidesai": "😂😂😂 In love with your parents", "33amp": "My parents would do this all the time and I miss it SO MUCH now! ❤", "swathn": "I don't think I can love this anymore", "uma1989": "Omg, almost every Indian can relate! Bless our dear parents' hearts! 💖 Sweetest!", "hunnybeez30": "You were blessed with the best parents!", "gloryjohn7": "So sweet! Thank God for our moms who keep us well fed! There’s always some home cooked meal that we leave with! Must be an Indian thing :)", "paigelizabeth88": "DYING❤️✨", "vidyani.maddula": "Omg i love your mom sis , she is reminds me of my mom . Guess all telugu ammas will be same @padmasrimutyala @deepica", "nor__73": "Possible follow me😢", "sumachenn": "@deepica okay for real our parents are CARBON COPIES of each other. Are ALL telugu parents this alike?! Straight down to packing the food in my suitcase for me when I say “theres no room.” And btw Im married with a baby and this still goes on 😉 Gotta love them. To bits. @sushuchoochoo @menakshee", "miz_fabulos": "Lol 😂 too funny. Love your family 💕😍😘", "thenivensingh": "I love your parents! They remind me so much of my family. ❤️", "akadambi92": "@madhumitha_kumar literally so relatable", "drea_life_style": "Sweet.", "_talikaur": "This warms my heart ❤️", "corischerer": "😂😂😂😂", "skapasi13": "@deepica and I thought I was alone lol", "sufi_xo": "Hahahaha my parents just gave me mangoes too! They are in season right now", "rofosho": "❤️❤️brown parents", "transki": "I just came home from my parents with TEN mangos (I asked for 3). Frozen marinated meat, fish sauce etc. immigrant parents will never let their children go hungry no matter how old we get!!", "swatteam91": "@shraddha78 @arth_ee 😂", "hannahbonillaa": "The same thing happens to me when i go to fly home from my grandmas! Except i don’t get curry i get homemade canned tuna and preserves 😂😂😂", "atihom15": "This is the cutest @deepica", "nigoooo_": "Uhhh watching over and over again and makes me Miss my Mom even more! Wish we stayed in the same continent at least 😭😭", "sarakimaiyo": "Omg. I remember my parents literally sending me a mango in the mail when I was at boarding school as a kid. And both they and I lived in Southeast Asia at the time so it’s not like there was a mango shortage for anyone. #itsthethoughtthatcounts", "poonamaste_": "@pruthvi19 everytime a brown child goes home. 😂😂", "kutharbachaa": "I feel this post so hard. Try carrying achar 😩😩😩", "kspence68": "😍", "ashikap": "Parents are the best! This chaos is my favorite type of chaos.", "banainer": "@trox101 omg she’s speaking telugu, i get so excited when i find people who speak telugu LOL", "sophileh": "Awwwww parents are so sweet packing all your treats", "mariamshahidjamil": "Oh my God I love them 😍 he’s reminding me of my dad and mom when I’m coming back from Pakistan,they want to pack everything I like for me (it’s like they’re packing their love filled hearts in those lil precious things )", "mishatahir": "Desi dads and mangoes is a Power couple hahahahaha", "ushakpatel": "This melts my ❤️", "linda.almodovar.75": "They are the best parents ever 😍😍", "beebopholmes": "@beanoburpie this totally reminded me of your mango story! 😂", "padmalakshmi\nVerified": "Verified", "a_bag.lady": "God! Caribbean and Indian parents have so much in common. Love it", "chrisarias810": "Your parents are so sweet. Be safe", "blankwhiteframes": "Awwwww your parents are so sweet!!!! My parents are from Guyana and it’s the same story, accept most times I am in a car so it’s not too big of a deal space wise. ☺️☺️☺️☺️", "harikaboo": "@deepica my mom literally would say the same thing “check-in lo padesthe aipothundi” 😂", "ninachahl": "Gotta love Indian parents!😘💖", "pinkandgreenlady08": "Love it! His expression is priceless. Awww!", "nitheeuh": "@sathiyaparans you and dad", "jagoayeea": "Parents are the best", "kruparut": "I lovvveee mangoes. I don’t mind joining you 😅", "veronicasixteen": "Chicken Curry with Rice is what I am craving 🍛", "harikak98": "Your mom is so Telugu like my mom in midst of all this I spotted a new red nigthy in your bag .", "valerievanessa.hair": "Hahahah!!! Your fam is amazing 😂", "reema.127": "@hitukatira I like when you tell me to take as much as I want😋💚", "sheebalizninan": "Awwww so sweet... Miss my parents 😭😭😭", "desigirl_dini": "Awww!!. I always end up paying extra for my luggage. Omg mom, dad. When did you put all this stuff in my luggage?", "ingy28": "@deepica but they’re sooooooo cute ♥️😱😫", "gpatel20": "This is so cute! I move to LA soon for a fellowship, I’m expecting my parents will do the same.", "sarahsabuu": "Love your parents! Haha. They remind me so much of mine lol #southindianparents", "girl_powher": "Your parents are so cute", "aprillbutcher": "Southern Hospitality and Parents Love all wrapped in one package! ♥️", "string_bean_12": "Those mangoes look good as hell tho😳", "humasulaimandesign": "That’s Desai parents love @deepica ! So sweet!", "medkinza": "omg this is precious lol! my parents were always packing my suitcase full of food when I’d head back to Boston", "sanjana_yellamelli": "What is your mother tongue??? @deepica", "blichtner181": "Your parents are literally the cutest ever. Love seeing them in your videos.", "smithapereira": "Did she speak Telugu??", "sprathyu": "Can I come over.i miss having mangos..", "rachna_not_rachsne": "Totally thought this was a vid of my mom.", "brookehanrahan1": "Parents are the best", "rasamra0104": "Desi parents packing style and your only going out of state not out of country. I wonder how your suitcase looks when your leaving the country.", "prempadams": "#everyindianparent and then your bag and everything inside of it smells like Indian goodness 😂", "jinelle_loves": "You got some chutney too right? I never leave without bhuja 😂", "vaishalig_": "“Enduku aggressive, check in lo padesthe ayipothundi” 😂😂😂 Literally my parents whenever I go home!", "vvaidya": "@varshinic this is my life every time I leave home", "sunnyd716": "This is hilarious.", "annephylaxis": "Your Mom packing up the curry is my favorite ritual", "heena.patel_": "Awww, take the mango’s, he bought them just for you! So sweet! ❤️", "da.luxuri": "Lovely family god bless u all", "aditijs": "All Indian parents 😂", "talesofcuriosity": "@rajiabasha ; Mom you do the same ❤️", "ridashaikhh": "Omg lol my dad would do this to me with Pakistani oranges when I lived in Ottawa 😭 @uneebamubasher", "v._merin": "@jennayy91 @nichole_mathew you guys make fun of me but look", "nishaahir": "Okay serious question, how does she pack the chicken curry??", "sheelapaulachariam": "😍", "lurkinsince94": "If this isnt indian parents, i dont know what is! My parents do the same thing ALL THE TIME! 💕💕 Don't forget the biriyani! 😂😁", "blueberry3584": "@deepica SAAAAAMMMMMEEEEE. and i ALWAYS get selected to display all my curries and explain in detail what it is and why i have it....ummmm my mom made me 😂", "reshme_24": "Oh god, this looks exactly like my bag just before I leave my grandparents house!", "shuruthe": "@harikondabolu", "dm_11370": "❤️❤️❤️❤️❤️❤️❤️❤️", "theannmaryshow": "Lol true story #southasiangirlproblems", "xbrine": "Take the mangoes!!", "meenananduri": "@nishananduri", "kivonika": "@caammsee every time we travel 😭😭", "original_sando": "Your pops is the goat for grabbibg the mangos. He knows 😂", "divyarr": "@saila.reddy mommy watch this. Her dad with mangos..”I bought this” and her mom packing “check in paraee” and helping pack. Reminds me you all!!", "karissabodnar\nVerified": "Verified", "madhuurrr": "My mom does this every time I come home from college 😂 there’s no more space in my fridge 😵😩", "msbangladish": "Can’t beat Desi parents!", "fly_yogi": "@sweetteadrifter it’s universal 😂😂😂", "dali_a91": "A mothers love ❤️ is the best kind of love. Papa Pandu is soooooo adorable too.", "alysha0105": "Hahahahaha love it 😍", "dannyicruz": "THE MANGOS LOLOLOL", "nash13137": "@madam.jilapi this was me throughout college 😂", "_______venita_": "I thought I’m the only person but Guyanese parents do this 😂😩😂", "h_montana23": "Enduku aggressive? ??? 😂😂😂", "mitra_nathan": "Blessings 😘", "theveravault": "Hahah this is so relatable. My mum does the same 😂 And all in a nightie too", "leeshmari": "@rubz92 this made my day", "marryvvvv": "The love your parents have for you is beautiful.", "d__o__n__n__a": "💯💯💯", "ccherian101": "Omg my parents does the same thing. All Indian parents are alike!! Lol I love it!! 😂😂😂", "thesassysam_": "Desi parents things!😂😂♥️♥️♥️", "smallorbit": "This is the cutest!!!!!!!", "stllrphoto": "@laks99 this is you", "bushrashid": "LOL every brown parent 😂😂😂", "priscilla.pratap": "@patricia_singh23 this is mum and dad when I leave home. Everytime!!", "seema.c.rahman": "Brown parents are the best", "leeshalatchman": "Your parents are so sweet! Do you guys have a mango tree in the backyard?", "purplevette": "Don’t know your parents, but I love them already 💜", "molikalucia": "They’re so cute!!", "geethag2": "My mom does the sammmme 💕", "poonamandpriyanka\nVerified": "Verified", "katstruk": "@deepica i love your parents..they love u to...now i dont think my mom will go to that extent..but waw.that warms my heart all she is doing for u...and dad got u mangoes...jus like #caribbeanparents #westindianparents #ThatIsLove 🤗🤗🤗🤗🤗❤❤❤❤ making sure u not home sick..take it all deeps..take it all...", "privacyjasminev": "Can relate to the mangos! 😆", "sumayyah.khan": "They’re so sweet and cute i love both of them ❤️❤️ @deepica", "mkhan11": "This is every brown mom!", "kinz424": "They’re so cute omg", "frahman925": "They're so cute! Make some mango lassi 🤣", "iknadat": "You mean a NIGHTIE?! 😂❤️👌🏾", "jenmichellebaird": "I love your parents!! ❤️❤️❤️❤️", "csquaredlee": "😂❤️", "mehvashk": "Haha omg he looked so dejected when you said no “I just bought them yesterday for you” 😭😂", "keekzzzzzzz": "Omg uncle 😍❤", "thefabdose": "Ugh I love your family lol. So cuteeeee. I love how much they care about you. ❤️❤️❤️❤️", "codeadress": "I know how it is 😍😍😍", "merena.n": "Hahahah! I’m surprised you didn’t bring mango pickle / pachchadi with you back to LA! Mangoes, chicken curry and mango pickle are the go to for South Indian parents sending their kids away, mine included 😂", "pshital7300": "All to familiar as it happens to me all the time when I go home! But when I get home, so grateful!", "abhilaly": "This is so cute haha", "prernabhandari05": "Awww!!! so much love", "indiechik35": "Haha love your parents and I can relate, my parents reside in FL and have a mango tree in there front yard.", "islandgirl_rosie": "That’s my family too 🤣🤣🤣", "nandofundo": "Omg this so reminds me of my parents. The other thing my mother is constantly trying to pack in my luggage is Tupperware and Pyrex 🤦🏽‍♀️", "sumamjurczak": "Omg your parents remind me so much of mine😢♥️ obsessively watch your clips of them whenever you post them.", "mrsmj_004": "Lol my parents", "pehswiggy": "So sweet!!!!! What a blessing 💞", "tasha3t": "They are so cute ❤😘", "nesa715": "Parents are the best", "kiyamyers": "Real love, lol 😂", "kiimdhillon": "@ddhlln haha Mom, everytime!", "tej_1717": "😍love them ...so nice of them", "shilp_r": "My dad has to give me mangoes whenever I leave the house, too!", "neyneymusic": "This is literally my family 😂♥️ Especially dad with the mangoes! ♥️", "ashlokhande": "You are Indian. You NEED mangoes! 😂😂", "meerasanimaltribe": "You know you are Indian when mangos and packaged curry chicken are a travel neccesity", "sharonsds": "My cousin (who is more like a sister) lives in London. When she comes to NY and is packing to go back to uk.. the chicken curry, lamb curry and every type of roti possible gets made and packed! (And some west Indian style pastries as well) This clip with your parents is a scenario that plays out every few months here too! Lol", "lostintravels15": "Lol this is so my mom packing me goodies! Gotta love those mangos though!! 😋", "jinalll12": "@riyachoksi", "leftymasala": "Love our desi parents! Mangos for life!", "summirz": "I love your dad so much!!", "kavita00": "The best is when you get stopped by tsa without knowing what these moms put in there!", "jennydr21": "My mom 😍😍☺️☺️", "melissajagdeo": "@christina_angelaa Literally grandma", "ariochoa_": "😭💛💛💛💛", "photojaneicdc": "Omggggggg meeeeeeeeeee!!!!!!", "dharpooja": "Basically the cutest 😻", "anamikapersaud": "@aliss_m 😂😂😂", "jyotiiii": "This is Mom 😭😭😭 @tej_banipal", "iammukhtarali": "@diipakhosla reminds me of my Indian father in law. Super funny. They ALWAYS give me mangoes.", "nehaassar": "Parents are the best..... so ride or die ❤️", "rachanaiyer": "They are so cute.They remind me of my parents 😊", "desiglamboutique": "🙈 so cute !!! Love desi parents", "alokvmenon\nVerified": "Verified", "jannanii": "Literally, SAME 😂 tagging my mom @dhanalakshmi.u 😂", "ruhruhc": "Omg Indian parents ♥️♥️They know how to send their kids off!", "loveintobeauty": "If this isn’t the epitome of Telugu parental love I don’t know what is", "itsamandababes": "Hahha so true #desiproblems", "nurberxo": "LOL!!! Omg, my parents do the same thing!!", "samta_s_bhatia": "Parents are the cutest 😍😍", "deepalikini": "Mangoeeessss 😻😻😻", "sunita_du": "Parental love is the only love that is truly selfless,unconditional and forgiving ❤️😊", "flyfree25": "Awww reminds me of my parents.❤❤", "titiksha": "Such a mom!! My mom does this, too! 😩😂", "gabrielzamora\nVerified": "Verified", "pragna_97": "They're SO cute!!! Makes my heart melt <3", "girlmeetsboston": "Ditto!!!", "bhav_mrs": "Happens every visit home 🤣", "sriti_effigy": "Mangos with ❤️❤️❤️", "reynareigns": "Parents are theeee BEST when their kids live out of state and come home to visit. Cherish it. ❣️❣️❣️", "tj_khaledddd": "i’m doing this when you guys leave to college! @miyapotackle @ross_the_bosssss @princesscinnabon21 @currylicious_", "diipakhosla\nVerified": "Verified", "emm1561": "Indian parents 😂😂 everything but the kitchen sink lol", "kavita.rimal": "Awww this video makes me miss my parents even more 😔 You’re so lucky ❤️", "ankitasanawar": "Hahha sounds like my parents ❤️❤️❤️", "sherrinefrancis": "@teenbug 😭 remind you of anyone?", "luckynandzz": "parents r so pure", "nidhisunil\nVerified": "Verified"}