{"tanyasubramanian": "Meet and greet in Delhi 😍", "divya_reddy_challa": "You should definitely try 788 avenue /moonshine project where ever the band capricio is playing ...its a telugu band ..take your family along and you’ll will really have fun... @bandcapricio Must try restaurants @santespacuisine @farzicafe @palamurugrill", "sritha2": "Ayy kakinada 🙌🏽 there’s a whole street full of cinema theatres there that I wish I saw but couldn’t", "pranjallll": "omg you’re from Kakinada? My aunt & cousin lived there for YEARS.😭❤️", "alatorreee\nVerified": "Verified", "cafebaharhyd": "🔥 best Hyderabadi Biryani please visit Cafe Bahar Since 1973", "fairi_tale": "Hey love do a meet and greet in mumbai😘😘😘😘😘 excited to see you 💋💋💋 on sunday pleasee", "nishcakes": "Only advice is to go for a longer amount of time! The traveling alone will cost you at least a couple of days", "manushri_udaykumar": "Please come to namma Bengaluru ☺️", "shifali1210": "Go check out Air Live in Jubilee Hills!", "lesslin.dias": "Bangalore ,you should do Bangalore!", "neelyx215": "@lovelaughmirch send her your entire itinerary that you just did! She will love it 💙💙💙", "nikithavamsee": "armoor is good place to see so many interesting temples are here and many foreigners visit this place", "a_good_skin": "Come to chennai too 😍😍", "photographyonyourblock": "@deepica come to Bangalore 😊", "lathasunadh": "Omg am from kakinada!!!! And woah", "navbanga": "I’ll be in Guntur over the holidays. Just look for the confused Canadian-Punjabi girl 😊", "devieskridge": "Kakinada is my hometown ,", "himagetsfit": "So cool! My dad is from kakinada too!", "hey_you_rey_here": "Come to Chennai please 😍😍", "sahithisanku": "Meet and greet in Hyderabad!", "shilpaarcot": "Have Hyderabad briyani in old city and lots of shopping in charminar.", "ashwati89": "Please come to Delhi !!! I can show you around :) love you deepica !!!", "notur_be.lla4802": "😍😍😍", "pavithra_ramanadham": "Oh... come to banglore also deepicaa.. i would love to see u", "lve12219": "Hi it's Good to see you in Big City PUNE IT HUB AND MANY MORE😍😍💞💞", "rajnivasudevan": "Come to mumbai", "anu_channagiri": "Come to Hyderabad 🤗", "ski.97": "Bangalore please! :)", "hardlyevertranquil": "Skip Mumbai and Delhi. They’re boring . Do your hometown , then Kerala/ Goa or go to Shimla-Kulu-Manali or Sikkim-Darjeeling.", "harri_not_harry": "If you haven’t already seen then, there’s a ton of historical sites in Hyderabad, as well as palaces (Chowmahala, Falaknama etc.), and temples. Traffic is horrendous, even moreso than before (I last went in 2015 and it took 1.5hrs to go the equivalent of 4 miles) so DEFINITELY get an early start wherever you decide to go).", "dotnotfeather23": "You should take a mini trip to Kerala 😊", "lbk1121": "@hudatbabe", "pinnamaneni_nirupama": "Make it Hyderabad and pls I would like to meet you on a weekend if that is possible...pls", "notordi_naari": "Please visit bangalore please please", "spamaccountofyourbestfriend": "Meet and greet in Hyderabad please. 🙌❤️ @deepica", "slesha_chowdary": "Meet and greet here in hyderabad please. 🙌💕❤️", "poojithachowdary44": "Come to Bangalore too🙏🙏🙏🙏", "ameeksha": "Are you all from Hyderabad?", "chouettepants": "You need to see Munnar. Hear me out, no one talks about this place. I just spent a month in India and visited a ton of amazing places, Kashmir (Srinagar, Pahalgam, Sonamarg), Amritsar, Calcutta, Delhi, Agra, Jaipur, Udaipur, Goa, Munnar, Alapuzzha, Kanyakumari, and Chennai.", "hansaseechurn": "@deepica Delhi is very very polluted and dirty as compared to Mumbai. You should visit Phoenix mall in Mumbai x", "prakashravikumar": "Very nice", "killwitkindnesss": "Kerala, Bangalore, gokarna GOa, finish off in the adamans and you’ll never go back to north india. Remind yourself of the western world on you way back with a stop in Dubai. Spend a day in Abu Dhabi and go to the grand mosque worth the trip. The largest mosque out side the Mecca we can go in as non Muslims.", "snaina": "If you go to Mumbai first, go for Mount Mary Christmas Eve service, irrespective of your faith. Very moving. :) Also have Sardar Pao Bhaji in Mumbai, try and order chikoo shake with it. 😁", "bedheadmd": "Bangalore for fun but (Coorg , waynad for weekend , you won't regret)", "lohita.venkat": "You have to visit vizagggggggggggggg♥️, stay at my home. My mom actually says you guys are our distinct relatives. But meet meeee", "preethi_gadiyam": "Welcome deepica and we should meet pls . I’m from hyd", "bhavya_infi": "Please come.... 😍", "docrakhimalhotra": "Go to chandni chowk in Delhi n have the best street food, also go to GK in Delhi and have the amazing momos!! Too many places to do amazing shopping, the list is endless! Since u r limited on time do make time to go to colaba and bandra in Mumbai!", "candi.cane.missy": "Vizag is super cool u will have a great time, if u plan to come then let us know", "immaculatechristy": "Visit Chennai too", "apa_r_na": "A visit to Kerala✌️", "jammygems23": "Come to Hyderabad, so that we can meet you", "ramya8693": "Both of you looking soo cute ☺️", "kruthikasethiya15": "why not chennai 😢😢", "_simrann": "EAT ALL THE FOOD. NOTHING TASTES BETTER THAN HOME FOOD", "harleenkaur.us": "❤️❤️❤️❤️ Gorgeous", "sjanipal": "Awwww.. Kakinada , my hometown. Im currently staying in Hyderabad but I ask my parents to always stay there in kakinada so I keep visiting that place.. @deepica you should visit uppada village and buy uppada silk sarees for sure so you take a piece with you when you leave ...also visit Uppada beach ❤️💋😘😍 keep rocking ...love you for who you are", "prahlad6903": "Nice", "zubairaliii": "I love my home city Hyderabad with all my heart❤️", "goglam90": "Come to goa", "deepathedisco\nVerified": "Verified", "telugupappa": "@deepica I went to St.Joseph’s Convent (Blue Convent) in Kakinada for 3rd grade when my parents decided to sent my sister and me away for a year while Mummy studied for her nursing boards. SO many fond memories of this city for me and this how I learned to speak Telugu fluently! I probably don’t even have to tell you but the seafood in Kakinada is amazing! Make sure you have someone make crab curry for you while you’re there...challa challa nuchthudhi neekoo. ♥️", "kayleigh___grace": "Have fun!! I was in Hyderabad last year for the holidays and it was amazing.", "bebeautethical": "Mumbai vaste mammalni matram kalawakandaga velladu meeru 😆", "pravallikavenkatesh": "Bangalore..... please come to bangalore", "pakshal_kothari": "When in kakinada go to Subbaiyya Meals in Ramaraopetha,Mecca for andhra cuisine food lovers", "mqdmd": "Omg I was in Hyd in Aug/Sep and I vaguely remember u posting that ur parents were there. And the crazy fan girl in me secretly hoped i would run into them 😆", "manshaj": "if possible go to uttrakhand.. especially munisyari..its very beautiful😊", "de.pick.ah_chu": "COME TO SOUTH INDIA TOO 😭 IF YOU'RE NOT COMING I WILL KIDNAP YOU🤦‍♀️", "aawwknee": "Kolkata, please!!", "bellafawzi_": "Don't forget to visit Udaipur and Jaipur baby @deepica 😘😘👍👍", "saina7maknojia": "Taj mahal for sure", "amritparashar": "Pl meet and greet in delhi also...", "rehana_bhaiji": "Stay at the @tajmahalmumbai -it’s near a lot of sightseeing, breathtakingly beautiful, and amazing service", "amazinghazell": "Meet and greet in chennaiiiii plejjjj?", "lakshmi_lizi": "Kakinada yeahhhhhhhhh you should come...............", "dimsharshreddy": "eat ram ki bandi dosa in hyd at nampalli in the morning .", "roshanixo": "Jaipur! It’s such a beautiful city 💜", "bedandbeauty.shop": "Hyderabad for sure! 😄", "lalitha_shreeee": "Please do visit Bangalore tooo 😭", "bindi108": "Meet with some of the lifestyle influencers, collaborate, so you can shake up the fair n lovely industry good with Tinted 💓.", "kalyani_akkana": "Hey ...any plans to visit hydeyrabad ?", "sanchi______": "Come to Mumbai", "poojasinghalgi": "How funny! I literally just told my husband that I need to go to India. I miss it and I feel it in my bones. I am also going solo to Mumbai and then Delhi from 12/21-1/2. If you end up going, it would be so much fun to connect and shop. ❤️ I don’t know you obviously but I love ur videos and think the work you are doing is incredible. @deepica", "samera.bilal": "Hyderabad and Agra are a must!! 💕", "sujathapamod": "Let me know when your coming to MumbaI...will meet you...👍🏼", "irapancakes": "Weather in Mumbai will be ideal during the holidays! It won’t be an armpit", "vrndanovowels": "Run the all womens run in mumbai on the 16th supporting womens health and empowerment! @pinkathonindia", "sonu_nilofer": "Chennai please 👌", "nicole.k.k": "Charminar in Hyderabad!!", "prameela26": "Wow you are coming to India.glad to hear that ...", "sharmilasardarbhandari": "Please carry a smog mask in Delhi 😥", "rubanasyed87": "Eat Eat Eat", "cageyourage": "Bangalore!!!!", "naveenkurati": "Vizaggggggggg plsssss", "sujitajoshi": "Do it! Just got done with a 2 week trip to Delhi, Hyderabad! Weather is pleasant and great time to visit!", "freidasmonkey": "Too many cities in such a short time", "shashankjaiswal": "@deepica if u can u should checkout @tajfalaknuma it’s amazing !!!!!", "love30jasmine": "Hyderabad 👏", "sansulee": "I would suggest staying away from Delhi if possible. Mumbai is definitely fun and safe. Delhi is fun for sure but not so safe for women. You should definitely do Leh -Ladakh if you have the time to travel further North. And southern India is my most favourite! But if you’re traveling for just about a week then I’m afraid you may not be able to cover so much in such short time ! :(", "manunahataa": "Have fun!! I wish I could go right now too!", "mukks80": "Don’t spread yourself thin. All those places sound good, but cherish the moments in places that matter the most. Enjoy!", "satyakb1": "My Amma is from Kakinada too! Wherever you go, try to find whatever food or sweet is unique to that town, like Kakinada Kaja!", "productjunkie_confessions": "Kakinada is my father in-laws hometown. I visited Hyderabad and Bangalore for the first time this summer. #punjabiwifeteluguhusband", "smaturu": "That’s where my dad grew up too!!", "areeba310": "😍😍", "mel_pereiraxoxo": "Go to Goa @deepica !! ❤️❤️", "vero_biriani": "Chennai and Pondicherry", "singlebrowngirl": "Whyyy such a short trip?! If you're gonna go, GO and reallllly do it. Life is too short to not take advantage of it, the distance, the history and with your parents! @deepica", "_gagan4_": "Please do catch up with your Delhi fans beautiful 😍", "anu30jain": "Yes!!!! Delhi!!! I am from Delhi.", "courtlareau": "I second Kerala but someone commented that it will be busy with tourists so maybe don’t go this trip. One of my favorite places is the Taj in Coorg Madikieri and then you can make a day trip to the Elephant camp. Also the Taj Lake Palace hotel in Udaipur is pretty spectacular. I hope you have an amazing trip!", "_riyageorge": "Hey Deepica Akka! Go to Kerala! You’ll love it and it’ll love you! ❤️", "deeptikalani": "Omg @deepica u have to come to Mumbai 😍😍😍 there is so much to see n to eat", "teach_nikitaparshu": "It’s a great that you decided to visit India. It’s an amazing country and you will love it there. However, I have a sincere request please do explore both urban and rural parts of India. If you are going to upload videos or vlog please do that and specific not all the people in India live in villages or herd cattle. People drive, live in big cities, shop in mall, etc. I love your videos, I’m fan of mama pandu, then who isn’t.", "kamakshigorle": "@deepica have a tonne to recommendations for restaurants,( for authentic Hyderabadi biryani) spas , must do’s for Hyderabad!! Will DM them to you", "sandybeaches92": "Bangalore! 😍", "natashakalimada": "I wish I could go back with you!!!! Im not sure you’ll have time, but Udaipur and Coorg!!!", "alpeezy4sheezy": "Shop, shop, shop, eat, shop, eat, eat, & shop some more. Haven’t been back to the motherland since 1993 😭 Soooo much has changed since then & I plan to go back soon myself. Have lots of fun & take it all in 🇮🇳✊🏾🧡💚", "rekharocks": "We have family from there too! Well, there’s this Indian sweet called Kakinada Kaju that you should eat! + How about shopping at the bazaars around the Charminar in Hyderabad. I always enjoy that. #offthebeatenpath", "aditi.designs": "I’m from Mumbai! So cool that you’re getting to visit ☺️", "shilpy_sarguru": "@shnawesome Gurgaon hotel? What’s it called??", "karmakazi3": "@deepica there’s a place in Hyderabad that specializes in onion samosas", "itsgurnaz": "The number one thing I have to say is, EAT as much as you can, everything you can! And a cup of chai everyday is a must ❤️", "thejoblessthrifter": "There are so many places to see other than Mumbai and Delhi (usless you want to do a meet and greet). Rajasthan would be a great place to visit in winters. Kerela is pretty too!", "desi_eyes_": "I'm so excited your going! Please vlog your trip lol Try to go to Goa if you can!!", "janeetapriv": "Visit Kerala for sure", "giggles_999": "@deepica eat pani puri in mumbai! And kathi rolls yummmm", "bees_arthive": "Go to Chennai", "anjaliartham": "You can check “khan market “ in New Delhi", "nehapethkar": "We are going to Mumbai to 1/4-1/12 so excited to see homeland again!! Just take it all in .... I would say @deepica", "divyanka27": "Goa and Bangalore should be on your list too ❤️❤️❤️", "soulstarluv": "@deepica I had already inbox/pm u earlier in the day", "vaishnavi.tipireddy": "In hyderabad, go to charminar at night, its really nice! And theres a bunch of cute, themed cafes everywhere. Definitely check those out!", "sourpatchkids_resses": "@Deepica we want to come with you!!", "itssanjanaa": "Yes!!! And vlog it all!!", "ourlittlesecret": "Meet and greet in hyderabad pleaseeeeee", "darshika09": "try street food, shop in local markets,", "aashiroyyuru": "Girl yes! If ur in Hyderabad u gotta see Falaknuma Palace!❤️", "anuacharya_": "Bangalore!!", "nayalooks": "@madupula_harini 😍😍😍", "codeadress": "Mumbai - queens necklace by night; leopold cafe in colaba causeway; arth lounge. Other cities I love are Jaipur and udaipur so so beautiful. On my next list are cochi, khar dessert, leh n Ladakh, Calcutta", "lilysensimilla": "Hyderabad 💚💚💚", "rak_gill": "Rajasthan 100%", "vanity_catalogue": "It’s going to be incredible!", "_fan_of_love_": "Rajamundri ... Go see godavari there which is the best place to watch sunset", "palaknavdeepsingh": "Just please be safe. I’m born and brought up in India (living in NYC now). IT IS NOT SAFE FOR WOMEN. Please do NOT go out ALONE at any time of the day. Please stay safe @deepica It’s beautiful. And when you go to Delhi, don’t forget to wear a pollution mask. You can google the pollution level in Delhi. I really wish you a happy and safe journey!! ❤️❤️", "neddtalks_": "Chennaaaaai as well please!!", "angelica.sophiaa": "Oooo maybe recreate this picture??💗", "anuanand413": "Maldives!!!", "rheakanthirao": "If possible, please do a meet and greet in Mumbai!", "neerajabee": "Come to Mumbai please!!!!! Please have a meet n greet or something! I love you!", "im.kran": "Kakinada kajja 🙌😋", "poojaponnusamy": "Just a recommendation: Maybe focus on one state per visit ? There’s lot’s to see and experience in each of the states you mentioned.", "caline_fernandes": "Pleaaaseeee come to Bangalore as well 😭😭♥️♥️♥️", "anujabhawalkar": "Visit Nalli Hyderabad", "humayray": "Definitely see the chaarminar in Hyderabad! And you HAVE to try havemore/ohris ice cream sundaes!", "ushbho1": "Mumbai, yes. Delhi, NOOOO, Hyderabad, of course. Mumbai Christmas and New Year celebrations are amazing", "mermaidbidisha": "Wow that will be awesome..I wanna see meet and greet 😍", "dimplekumar": "Sent you a message with info", "iamjustalisha": "Visit Goa too", "rockingmymomgenes": "Take me in your suitcase!!!", "i_am_archu": "Vizag", "pujli": "@deepica Swaminarayan Akshardham in New Delhi! ☺️ @janakipatel @artipatel_14", "reeeshna": "Come to Keralaaaaa 💓", "swabha": "@deepica my dad grew up around Kakinada too!! My memories of it are when I visited the place back in 97 as a kid! You will love shopping and eating in Mumbai! Definitely do all the touristy stuff in Mumbai you will love it!", "sethicouture": "Jaipur - checkout @28kothi @barpalladio", "beautiful___interior__design__": "Please go to Kerala, it’s beautiful 😍 you would love it 😀😀😀😀", "pooj1027": "Go to @jayantireddylabel!! Trying to hit them up when I go wedding outfit shopping in January!", "augustaleecc": "The Golden Temple was my favorite place in India. Monsoori is awesome and Dehra Dun", "shivangi.11": "Come to Delhi ❤️❤️❤️", "makeupbyrash": "When ull come Mumbai just text me upppppppppp ...... I would meet ya❤️😭", "shai__makeupandhair": "Mumbaaaai!!!! 😍💕💕💕💕💕💕💕", "anikanicolee": "Bangalore!! 💕", "rituparnaj": "Bangalore!!!!!", "deepika_rajiv": "Bangalore? :) I'll be there. Happy to show you around", "replyginnie": "Why not rajasthan?", "gabrielamdeoca": "Jaipur!!! 💕", "accidentalmuggleborn": "You must try Biryani in Hyderabad 😋", "ramya_singireddy": "Ahh please meet up with my bestie / singing sensation @manisha.eerabathini in Hyderabad!! I think you guys would have a lot of fun!", "vandana.raaj": "Do visit charminar in Hyderabad 😍", "stayreddy": "also delhi..... can def skip esp if you only have limited time", "vinoothna_reddy": "Please add kakinada to the list as well!!!!!!!!!! Please do.", "savoniadorasamy": "Bangalore 😍", "sushmaraghu": "Go to Bangalore!!!", "harshitanegi_30": "Hauz khas Villagee", "richakal": "I have alllllll the recs for you. Also...thinking I should just come back with you. 😬", "jediinheels": "I feel like your largest fan base in India would be South India and East India ( going by the names in comments, live videos and YouTube) so how about adding Kolkata to the itinerary. I feel east India often gets excluded when people are planning India trips. North east is a hidden gem and I have feeling you might love it.", "moninooo": "My boyfriend will be in Hyderabad (his home town) during that time! Hopefully he’ll meet you so I can get an autograph haha. Have fun!!!!", "arika\nVerified": "Verified", "monalisaaa108": "Kerala!!! You gotta visit god’s own country", "akshitasurabhi": "Must come to Hyderabadddddd 💙", "sarvani_nori": "@deepica If you go to Hyderabad, I want a vlog on fashion. Apparently the street bazaars have awesome clothing and jewelry for really cheap prices!", "anithakutt": "@shinipatel09", "dhano923": "8 days to see 3 cities, plus your travel time (both to India and City to City)is not enough! I'd would really suggest either extending your vacation or reducing your itinerary, otherwise you're not going to be able enjoy any of it! 🙂", "champagne_aishy": "You must eat all the hyderabadi biryani", "piyali94": "Delhi, me I will make the itenary for you .. just tell me what all places and what kind of stuff you would like to do. Also how many days would you spend in Delhi. May be we can meet to x 🥰", "beautybella1881": "@deepica i will also be in hyd around that time. I am from UK. You got to go to VARAMAHALAKSHMI silks ( they have many branches all around hyd, chennai might even be kakinada also). Lovely Kanchipiram silk sarees. You gotto buy one pls. Do you have plans to do meet and greet? Love you ❤️", "soni.shivani": "come to Udaipur you gonna love it🖤", "daminineha": "Kerela and kanyakumari", "ivahdam": "Bangalore!!!!! ♥️", "alekhya_akkapeddi": "You should go to Vizag!", "meenakshishukla": "Yo have to do GOA!", "bhakti027": "Yeah! If you ll be visiting south india I would suggest you to visit Chennai and pondicherry and so more. I am exploring south india at the moment. It is really great and blessed to be here. And do visit me in Gujarat too. You would love food there! 💓😍", "chaitralik17": "@deepica if you like animals definitely check out animal aid unlimited in udaipur, idk if you'll have the time but its worth going to", "lil_milzz": "Mirchi & Mime is an AMAZING restaurant in Mumbai that hire deaf waiters/waitresses! They teach you how to order food with sign language :) 10/10", "sana_nagur": "U should visit North east india.", "rheakaly": "I am going to Mumbai around the same time too!!", "chaya_shilpa": "Meetup in Hyd . Pls pls pls 🙏🏼😘", "niveda108": "Omg can I come with?!?! 😍", "srushtisalunke": "one of your subscriber could take you to the Indian sephora? would be a great video! @deepica", "sushma_vutukuri": "Come to hyd And Banglore dear", "teatime76": "I’ll be there for the holidays! Going to Agra, Delhi then back south to see my family.", "pearlkyoung": "Omg I came back after 7 years and so much has changed you need to pack dual voltage hair tools and once you get here you need a Jio so you can have WiFi everywhere it’s amazing", "angela_eliza93": "Kerala :)", "pkolli": "Hey! My parents are from Kakinada too! I bet they knew each other...", "bindu1989": "Bangalore", "shivani.nilangi": "BANGALORE PLEASE!!!", "devii.patell": "When you go to Dehli don’t forget to visit Akshardham!", "whereismyseamripper": "Please eat a thali for me! And lots of gongura pickle. And many masala dosais. And of course Hyderabadi biryani. This Madrasi girl misses it all so much!!!", "poojatanna9": "Mumbai ! Carter road is a must , the buzz on that street is amazing, especially at night. There is a coffee shop called ccd and you can grab a coffee whilst taking in the vybe and watching the sunset. Post that you can head next door to Corniche where they serve up lush food, awsome cocktails and wicked music. Marine drive known as tge queens necklace is beautiful to stroll along at night with lots of juice bars and places to grab the yum bombay sandwich from! Olive is a cool n sassy place to eat in bandra. Out if the blue is a lush place to eat - it's a chain but really good food! Farmers cafe which is kind of new sells organic fresh food and it's meant to be yum! Ayre is a club that many go to and the roof top bar is meant to be wow! Yaucha is another top place to eat at BKC ( bandra kurla complex ). Elco market for the famous pani puri which is in juhu / bandra. Head to the flea market round bandra it's got an eclectic mix of lil stalls! Lots of lovely shops round there too! Golden gate Elephanta caves. Hop on a train to Churchgate station and head to colaba - another cool place with lots of markets want lots of British architecture from when the Brits ruled. Santa cruz west , juhu, colaba are good places to shop for Indian attire, Fusion attire shops, boutiques and high end branded names. Hope you enjoy your Indian trip hun x", "saranya_smiles": "You should come visit Chennai too! 😊❤️", "champagneandfrosting": "@deepica stay at the Taj Lands end in Mumbai. It’s a fab hotel! And I will be there too, so I can totally fangirl you! 👏🏾👏🏾👏🏾", "manasa1202": "You cant go to hyd and not have the biryani!! ITS A MUST.", "sherinarathor": "Lovely!", "hennabeautybykrupa": "Have to go to Kerala! @keralatourism", "rajadhyaxketki": "Maxi girl if you come to mumbai do meet me 😁😘", "kartasian": "Bangalore Bangalore Bangalore.", "bvarije": "Take a mask to Delhi and visit jodhpur", "ama721": "Bengaluru is fascinatingly like an American city in India...neat intersection of two generations", "kauliflour": "I forget the name, but you HAVE to go to the Shewarma stall across the DLF campus in Hyderabad at night. It’s the best.", "_kimberlina143_": "That’s wonderful! Enjoy!", "aditikarande": "Finally! Super excited to meet you", "theworldisflat24x7": "Come to Bangalore 😬", "smehta76": "We went to Delhi, Agra, and Jaipur last holiday with the family! It was awesome, but make sure all arrangements are made prior!", "lakshsarkar": "you should do NYE in Mumbai .. mumbaikars know how to Party 🎉🎉", "aneesha_2208": "Karnataka is an Amazing place in south India you will love it♥️ 😍", "palsharms": "Please don’t promote the view that India is about cows on the street! I am sure you don’t intend to but this picture which may be your only memory does depict that unfortunately! You being a social celebrity or personality- people view things from your eyes, your posts! Unfortunately your post seems to communicate to those unfamiliar with India that this is the only reality of India!", "kripzchips": "Gotta go to Taj Mahal!! @deepica", "mounikayepuri": "@summerrr97 omg you’ll be there at the same time as her so jelly", "meghna.98": "Bangalore!", "themystiquekohl": "Please please come to chennai!!", "ksub155": "Hello! I’m here now!", "lipimohanty15": "I would say mumbai and Hyderabad!", "mdsinwoman": "Kolkata!!", "_shravya29_": "Come to Chennai n have a meet n greet", "madhumitha_i321": "Dooo a meet and greet in mumbaiiiiii🔥🔥", "swathi.kotni": "You should do a meet and greet in Hyderabad!!", "tasha_con": "The traffic is scary and don't pack your schedule takes half a day to get to one place in Mumbai.", "nishitakommana": "@therhymegirl she’s from Kakinada too!!", "veenyasa": "I’ll be Hyderabad too :) sadly leaving on Christmas though! If you’re in Delhi 12/17-12/18, I would love to meet you! Going to be there for wedding shopping and we could take on Chandni Chowk together!!", "itsme.anitha": "You can visit Taj Falaknuma, Charminar, Golkonda, Tank bund( Necklace Road), Shilparamam, chowmahallah palace in Hyderabad. These are must see in Hyd. Hope you will have good time & are going to love these places. Also try Hyderabadi Biryani & other popular cuisines. @deepica", "spidermonkey_11": "Come to Chennai 😍❤️", "vinita_raghavi": "Hydddddddd pleaseee", "mammabearlife": "Try @bombaykulfi Kakinada and Ofcourse don’t forget to eat at subbayya hotel and if you plan to visit Vizag I’ll have many more recommendations and would love to take you around myself ♥️", "daft_poop": "Three cities in a week?! Going to be crazy.", "blessleeeee": "Kerala(varkala), Bangalore", "k_c_krutika": "You must visit Rajasthan it’s beautiful @deepica", "rodriguez8987": "Regardless of my opinion, you’re going back!!!!", "gtothe_g": "GOA", "mahithavarikoti": "Please come down to Hyderabad and I can’t wait to see you live ❤️❤️❤️❤️❤️😭😭😭😭", "riddhi_bubbletea": "You should check out Goa, it’s got amazing vibes!", "you_sruthi": "If you are in kakinada will you be willing to.meet some school kids @deepica", "lady_bear82": "Dang girl, your going to be paying an arm and a leg now", "talesbytalz": "@deepica plz do come to delhi and do a meet and greet :)", "thebeowulfagate": "Lame", "maggoyamini": "Udaipur - a must visit to experience luxury with culture", "guptanaiya": "Visit Chandigarh, my city beautiful 😄", "susmeetha": "Omg deepica in hyderabad you should definitely go visit Olive Bistro and United Kitchens of India. They have really good food and the location is prime👌🏽", "ramya.mamidi": "Drink some of the local Artas drink!", "yanazaad": "MEET AND GREET IN DELHI. WILL ATTEND 100%", "rochellealeena": "Plan a day or two to Goa 😎", "swatypana": "@deepica both my parents grew up in kakinada and i love love going back there .. its a cute town", "ssufi1215": "Jaipur!!! It’s beautiful there", "suckerforpositivevibes": "Meet and greet at Mumbai !!! Pleaseeee @deepica", "sindhumerugu": "If your heading to Delhi, visit Akshardham. It’s a Swaminarayan Temple, and it’s just gorgeous!! 😘", "surekhashetty9999": "Awww🥰 Deepica😍 welcome back🤩", "iam_aishwaryaa": "Please please please come to Chennai! You have inspired me since forever and Ive personally made so many people your fan too! ❤ It would mean the world to me if you saw this comment 😍 love love.. Keep inspiring us all as always ❤", "nikkimeta": "Delhi meet and greet please! ❤️", "farzia91": "Definitely try to hit Goa and maybe ooty!! @deepica", "sharithomas": "You should definitely try to go to Kerala and try Ayurveda!", "anadhyabn": "@deepica BANGALOREEEEE!!", "ashwiniparimala": "Plzzzz visit vizag too deepica😍", "k_kinni": "Suree u need to put a meet and greet in hyd...!!! So many young grls have taken u as inspiration like me ..!!! It will b so much pleasure meeting uh 🤩 love u @deepica eagerly waiting for uh...!!", "njain17": "Also the Amritsar chole bhatura is a must try!", "hsp2019": "When in Mumbai, make sure to meet up with @missmalini. Have dinner 🍣 and drinks 🍸 at KOKOs on a Saturday night.", "aariyanphant": "Yay omg obvi vlogs I love south india maybe being biased because I am one my self but yeah so obvi vlogs in telugu and u with locals showing the indian culture like food building stuff like that cant wait deepica akka I'm calling u akka cause why not heheh hope u dont mind", "sroachbeauty": "Come to Chennai as well girl!!", "u_d_one": "Please visit Kolkata!", "makeupjunkie0900": "HYDERABAD 😍😍😍😍 I was just there! Buy lots of maxis lol and other stuff that we don’t get here", "s_r_a_v_y_a": "Hyderabad meet and greet", "bhagyahegde5": "Deepica you should definitely check out kama ayurveda. It is avilable in shops and on nykaa online. It has a product kumkumadi night cream. It works better than kheils on me. And tbeir facial mists are to die for. Definitely check them out", "christina.david": "Jaipur!!!", "painterofcomics": "Meet the fans in Delhi?", "makeupbyhuraina": "Do a meet and greet in Hyderabad... would love to meet you. 🤗😀", "poojauppalapati": "Vizaaaggggg pleaseeee", "sageworthy": "Don’t forget Jaipur - it’s beautiful", "jooooo_colaco": "Please do a meet and greet", "suplish": "Kerala. God's land.", "gloryguliani": "@shikhaasaini I’m gonna do this someday now 😛", "thebrideshandbook": "@deepica do meet n greet in hyderabad pliss!", "tulip_0124": "Jaipur", "shailaja_yelgani": "Visit shilparamam in hi-tech city", "rachita_ramaiah": "Bangalore!!!", "idasheba": "Hi I’m from Hyderabad! I was there Nov of 2016. Go to Shilparamam the market is great. You can get mehendi done on your hands and arms for like 500 INR and the ladies who do it are lovely!", "mallikaneelala": "Go to Health n Glow. Indian version of Sephora! As a kid I loved going there, now of course Sephora fulfills", "the.fresh.n.fabulous": "Pune please and a meet and greet. That will be the loveliest @deepica", "archanareddy": "I would say go to Kerala instead of Delhi! It’s too polluted", "amykalinda": "I did delhi agra and calcutta two years ago at holidays!", "letmehearyousingh": "Go to a part of India you’ll actually find beautiful.", "cookie8me": "Definitely hit up Kerala (munnar and thekkidi) or Coorg even!!", "kiiki_krithi": "Visit manali😍 n ofcrse chennai ur fans r waiting ovr here", "karuvyshali": "Trying going to visakhapatnam trust me ull not regret", "meghawagh": "A meet up in Mumbai please!!!", "shreyghatnatti": "Bangalore?😭", "bhumika26": "Take a portable air filter and mask, I love india a ton, but I just went in October and have had a cough since I got back. With your vocal chord issues I def recommend the filter and mask and stay at a hotel with air filters.", "pumpkinpie495": "I'll be in India in December, too! Doing the Golden Triangle - Agra, Delhi, Jaipur. Hope you enjoy!!❤️", "priya_s_mishra": "Jaipur too", "kp.fitstyle": "And eat alllllll of the good street food!", "varnikajp2101": "Wow.. do spend more time in Hyderabad.. it has changed so much over the past few years", "jouelzy\nVerified": "Verified", "krishhkrishhh": "My parents are from there too!✨", "steffi.stephen_93": "Come to Bangalore too and have a meet and greet..❤️❤️", "swati_pn": "Delhi Darbar biryani a mustttttt and pav bhaji and kalakhatta at juhu beach.. and a meet with me 🤗🤗", "canindian_nimesh_ymm": "Natural is natural 💕💕💕💕💕", "grace.amy_xo__": "@deepica please come to Hyderabad and meet your fans here ❤️❤️", "chrisbeanthomas": "Omg go eat at BBQ nation!", "shamsxox": "Play with the cows on the beach in Goa! Life changing 😍", "payaltayde": "Hyderabad😍👍come soon.......with your cute parents....lots of love 😘", "rebelranis": "We’re here visiting Hyd right now! Come every year. For food gotta go to @cafebaharhyd, @jewelofnizam, Absolute Barbecue, Chutneys (for that straight South Indian), Golden Dragon (for the Indo-Chinese goodness). For bars/lounges - @fatpigeonbarhop (beautiful rooftop with live music), @prostbrewpubhyd, @farzicafe, Over the Moon (great rooftop as well!). If you wanna take any pics while you’re here def check out Falaknuma Palace as a setting (it’s stunning 😍). For shopping check out @storeanonym, @anahitahyderabad, @elaheofficial, @plantationhouseindia. And so much more! Let us know if you’re looking for anything specific!You’re gonna have the best time 😊", "rishaan_rohan": "Bangalore 😊", "prombom": "Bombay def", "srikala.a": "Anywhere in East Godavari (Kakinada, Vizag, Rajahmundry, etc.) has AMAZING food. DO NOT HOLD BACK! Also, since you’ll be so close, you should really consider visiting villages or the backwaters in the Konaseema area! My dad is from Rajahmundry and I hold anything to do with near there so close to my heart! I always make it a point to go when I visit. HAVE THE BEST OF TIMES DEEPS.", "anushakondreddy": "Chennai ❤️", "preddyrx": "chaat everyday!", "sruthi12": "If you can, Jaipur is downright lovely and totally a must see!", "vidyadalai": "That’s awesome 👏 I would say you should go to Goa it’s so beautiful and people are so nice... I feel it is the safest place for women... also there beaches 🏖 are so different from USA beaches..", "pbnjayam": "Bangalore! Amazing city and so much to do", "sarthellabra": "Omg I'll be in Delhi for Christmas and New Years!!", "aaadesouza": "Go to Goa 👌🏽🌴☀️", "catalinamontiel": "I would love to visit India, first in my bucket list! A vlog of your trip would be amazing!!", "the_bohemian_dame": "Visit Kashmir, leh ladakh, beautiful eastern india... come to Gujarat.. enjoy the view at the rann of kutch, visit the ghats, see tajmahal, explore the beaches in mangalore and puducherry, have a boatstay in the backwaters of Kerala!!", "ekpanipuri": "Mumbai, Rajasthan and Kerala...", "little_black_rosee": "Please come to Bengaluru ❤️❤️❤️", "amyranmommy": "Please let us know when ever you will. Be in delhi", "styletravelista": "Yass! Mumbaii!! Secretly hoping i bump into you somewhere here🤓😊 @deepica", "annabolicaa": "Omg please do a meet and greet in delhi 😍😍😍", "perfectlyimperfecttiffany": "Go to himachal", "starfish.arts": "As a vacation go to Kerala, it's so beautiful!", "call.me_leilani": "GOA❤️", "bindu.vemula": "You need to visit GODAVARI district to experience good food,nature and even the people are too good.And plz cum to vizag😍😍", "sheetalkandola": "Himalayas are for Queens and Goddesses 🙋🏽‍♀️", "noodle._head_": "Meghalaya come to MEGHALAYA I'm 100% gurl you gonn love it💖💖💖🌚", "nidhi__umesh": "Bangloreeeeee🙌🏼🙌🏼🙌🏼", "notaleaf": "Those are great! I’ll be in Delhi and Hyd! All my fam is in Hyd ☺️☺️", "susanjohnmu": "Kerala!!", "pallavi_aru": "Aww... Hyderabad must.... ravalsindy.😊🙌", "nitikachopra": "I haven’t been back in so long too. Love that you’re going babe!!", "par_deee": "party w me for New Years duh", "subichandra": "If you find time visit Chennai- the food, shopping and beaches are worth it!", "besidone": "Very happy you’re doing this", "amulyakundran": "This is so cool!!! I hope I run into you in Hyderabad! ❤️", "ashamoosai": "Mumbai and Delhi are beautiful! I would add Agra and Jaipur, definitely visit the Taj Mahal, the Amer fort in Jaipur, Jaipur has fantastic roadside shopping! Cute little markets. If you go to Delhi make sure you go to old Delhi as well to see what it’s really like. Hyderabad I’ve never been to but my dad has been several times and apparently it’s wonderfully ahead in technology, and visit Golkonda fort! Also extend your trip that’s too short lol @deepica", "anuradha.joshi.714": "You will love it", "rainbowscraps": "It’s gonna be foggy in Delhi that time! Watch put for plane delays. I would definitely go to Chandni Chowk if you make it there though. Love the shopping and food!", "sindhuchandraa": "Trips to India never go as planned! Everyone demands your time and it's hard to say no. My advice is don't plan too much, and don't beat yourself when u can't follow the plan. Happens to everyone! Just enjoy meeting people and try to soak in as much as u can 😊 if you want to take a mini vacay with your dad in the south and not travel too far, I'd suggest Kerala. Have fun 😊", "shibsub": "@rohittetali invites doe", "southpaw_diaries": "You should for sure make a vlog 😍", "rudymukta": "PLEASE PLEASE COME TO BANGALORE Y'ALL CAN STAY AT MY PLACE", "streetstyle_women101": "Bangalore pleaseeeee", "aditikhareedhi": "bangalore", "rini_sujitha": "Bangalore as well......", "inayat.jain43": "Oooh! Go to CP (connaud place I think it’s spelled??)! There’s a lot of stores from all the states in India that have their own specialty products", "beyoutyunveiled": "Take me with youuuuu!!!! Definitely need to go back there too and sooon 😩😩😩 @deepica", "shrimarai\nVerified": "Verified", "simplysupritha": "Make sure you eat Hyderabad biryani tho. Duh!😁", "hummerrr_a": "Visit Jaipur and Agra too!! 😍👌🏼", "amul_butter": "Charminar, please you have to eat authentic Hyderabadi biryani.", "udayani_97": "A meet and greet in Hyderabad pleaseeeee...!! Dying to meet you ❤️", "pratyusha_kp": "Do come to vizag and you can actually stay in my home @deepica", "karishma_m029": "I wish I could be there to meet you! You are amazing ❤️ Please visit Dhaka. I would love to show you around Bangladesh 🇧🇩", "ramakrkshna": "India vachra", "snehajrathi": "Check out vizag?", "tinabiswas2008": "Visit Kolkata for at least few days. You will thoroughly enjoy the stay:)", "sahijeeth": "I'm from Hyderabad and would like to meet you and my father is also from Kakinada @deepica", "lal_mirchiiii": "Do visit Rajasthan and meet me😍😍😍", "elisa.dalto": "I traveled To India three Times in my life and in my opinion Varanasi is one of the places in the entire world every human being have to see at least once. The first time you reach the Gange river from the narrow streets is sooo beautiful!", "namu618": "Agra- Taj Mahal, Jaipur, Udaipur .. Also I heard Delhi has a lot of pollution right now- like it’s severely toxic from what I heard from my family so maybe not be good to go there?", "nikkshitha": "Bangalore pleaseeee", "sorahsays": "Yayyy!👏🏼 You deserve!", "maha_163": "Wherever you go and whatever you do, I hope you have tons of fun..And oh don't forget to vlog there! 😂❤️", "hanifarahman5": "Qutubshahi Tombs, Golconda Fort, Chowmahallah Palace (You can dress up with royal clothes and pose and take vintage pictures like princesses/queens), Falaknuma Palace (Dinner), Charminar, Lad Bazar (Fun stuff like jewelry/bangles etc as gifts)... Shadab Hotel for authentic hyderabadi dishes like kebabs/curries etc, Hyderabadi Biryani either from Shah Ghouse or Paradise.... Make sure you vlog and post on youtube if you can!! Omg, my mouth is watering right now!! Miss Hyderabad so much! ❤️ It's been 4 years since I've last visited! 😭", "zoobaeduhkaay": "Deff visit charminaar, falaknuma palace, and chowmahala palace in HYD!!", "thehannahrachelgeorge": "Pune!!!!!!!!!!", "meenananduri": "@nishananduri @msastry @arya.sastry", "simran_upadhyayy": "You are missing everything if you are not going to the mountains", "talesbytia": "Pleeeeease visit @le15india when in Mumbai!", "wear_urstyle": "Come Mumbai & enjoy the streets with street food . ❤️", "divyapurnima": "Vizag 😍", "65_love": "Udaipur", "vidya_loveformakeup": "Come to Mumbai 😚", "siri_chakravarthula": "Pls come again to kakinada ..", "sameehakulkarni": "Do a meet n greet in Mumbai please !🙌🏻 Also you must try @le15india cafe at Colaba. It’s a beautiful place with amazing food and @poojadhingra ‘s famous macaroons 💖 @deepica", "akhilathota": "Falaknuma Palace for sure", "audreyycolaco": "please do a M&G in mumbai ! ❤️", "ann7381": "Wet wipes... lots of wet wipes", "sriv22": "KAKINADA SQUAD 🔥", "risheeka.vaddi": "Vizag", "kass_przybyla": "YES WE STAND", "heyshiks": "Ekkadiki vellina vellakapoina, Hyderabad maatram ravaaliiiii ❤️ #TeluguTintFam", "bindu_saleena": "Hyderabad 🌈", "blushed_n_bronzed": "Its winters in delhi. Carry one warm jacket n plz do meet n greet 🤗❤️", "uma_lakshmi_chinta": "Vizag beach.....!!!! How can u miss this.?!!! The most cleanest city of Andhra..😍😍😍😍", "yashoda_d": "Bangalore!!! Please do come :)", "_psmahalakshmi_": "My cousin is getting married at Hyderabad on 27th or so I'll be there in Hyd it'll be dream come true if you do a meet and greet in Hyd ❤❤❤", "millennialgoddess1111": "Plz come to Bangalore deeps😍😍💗", "therajakumari\nVerified": "Verified", "sujatareddy": "Just don't target any location. See the local beauty. Just drive around, see some festival fun, etc. This is usually what I do, just sharing", "arrchparrch": "@booyashaka1337 isn’t your fam from close to there???", "thrushna_n": "I m from kakinada 🙌", "pahreeeya": "The sabya store ofc! 😍 It’s a work of art", "roshnidsrivastava": "Bangalore!!!9", "sukruthapothula": "Welcome back to kakinada.... hoping to meet you", "sashikalalala": "I’ll be there during that time too!! Try the late night biryani spots, and then SHOPPING!!", "ipsaaygonetipsaay": "omg yes", "thunder_sword": "Can you do a vid of u shopping in chandni chok and charminar??? Pleaseee", "nehamedaa": "come to bangalore! I’m gonna be there on vacation:)) california to bangaloreeee", "ajeetha16": "Please visit visakhapatnam... ♥️", "kamakshiahuja": "Amritsar!", "pallavi.2102": "Visit punjab as well 😍😍", "amrietaa": "Chennai!!!", "deodatta007": "Try Pune as well..!!", "jayatribhatt": "In Delhi there are monuments, there is hauz khaz market, Khan market. Plenty. 😍 And ofcourse a meet and greet is awaited. 😊", "jr.patel": "if you want a day or two long detox, check out coorg or madikeri", "tejap_98": "I’m from Kakinada too!!!", "ssabina18": "In Delhi - you must go to Fatehpur Sikri! Seriously underrated, but gorgeous! And while in Hyderabad - Falaknuma Palace!", "my_last_name_is_sri": "Eat paradise biryani you’ll love it deepiii @deepica", "saki426": "Eat at @thebohrikitchen in Mumbai if you're a foodie.", "cookaymonstare": "My nephew’s wedding! Lol. He’s getting married in HYD the 25th", "wiryhair130": "OMG you have to go to Vishakapatnam 😍😍😍 it is so amazing", "prachi_potnis": "Mumbaiiiiiiiii❤️ it's like a dream come true for many of us !! ❤️ Deepica in India❤️❤️ you made my day girlll 😘😘😘😘😘😍", "mona_zac": "Yaay hyd❤️💃", "enigmaaks": "Come to Hyderabad 💓", "natashaj542": "You need to shop affordable cosmetics from Mumbai and eat Mumbaiya khana😍", "reddyarpita": "Go to charminar and falaknuma palace in Hyderabad", "namsiv_": "Chennai!!!!!", "kavya_pb": "Bangalore too❤️", "sruthinadiminti": "Yaaay!! ❤️", "kani_goyal": "A meet up in delhi please😍", "thelifeof_my": "You'll absolutely love it ! Make sure you eat at the chat stand by Chennai Silks in Ameerpet, and I tried Sodabottleopenerwalla restaurant last time I was there and it was pretty good !", "megless93": "If you’re into dosas, check out rambandi in Hyderabad. The dosas are delicious 😍", "jaiipappu": "AHHHH KAKINDA SQUAD‼️‼️‼️‼️", "bhargawi_vutukuri": "oh my god THATS WHEN IM GOING TO INDIA!!"}