{"miichellechandra": "@hnatt_", "dinkinihalani": "Amazing ❤️❤️❤️", "drrager": "#mutesony", "emilymcallister_": "Just finished it. I’m sick about it.", "iyonnaaaak": "Lol y’all ain’t innocent u the one who got in the car", "mo.chelle_": "Check out my recent video to the whole R.Kelly madness !! Link in my bio #survivingrkelly", "shazzajanno": "Wow you were so beautiful at 14 and that signature smile of yours, priceless.", "montayfoolin": "Wow ... ppl are really that miserable", "theluxuryinvestor": "👏🏼👏🏼👏🏼🙌👍🏼", "angiemikaelian": "Ok you are a baller too? Knew I loved ya.", "achutei": "😂", "lauraleybaofficial": "Hey thanks for sharing! 💪🏼💯", "mr__dc_one": "🙈🙈🔝🔥🔝🙈🙈", "dancing_devi": "🙌🏽💯", "nationuk": "@deepica just saw the cara post....Unbelievable that people stopped following her. Have you lost followers from this post ?", "meergatito": "@mkondapi tbh thought this was u for a sec", "fabulouslyerica": "👌🏿", "miss.catharine": "Wow!! You look so pretty!!! Love the pose!!! 😜😘 @deepica", "miabellucci": "♀️🌹💪🏽👭🏽 Fuerza", "kim.m615": "@deepica what does this pic have anything to do with muting R.kelly?", "cheyenne2wavy_": "You just got a follow because I appreciate your words so much ❤️❤️❤️", "hiteshjodhawat": "#Natural#Beauty💙💙🥀🥀", "jessicadahanjd": "Cant shake that docunentary off either. I cant believe this man has been getting away with this behaviour for decades !? Im shocked and so hurt for these victims.", "prajaktapp": "You looked much better then", "aunnacolette": "💯💯💯", "metaterran": "Also remember your daily dose of fuck Coachella and ladyGaGa. Let’s also mute anyone who performed at Coachella. Rkelly is just the tip of a very deep iceberg.", "parlorwest": "✊🏾🙌🏾💖", "geminimystic": "You were and still are beautiful 😍❤️", "aditi5586": "Good", "empoweringwomennow": "It makes me so happy to see influencers like yourself using your platform to speak truth 👑 agree with you 💯 I just keep thinking what took us so long to give these women justice", "seemaweinig": "Just started watching...My heart is so sad and I’m only one episode in.", "sassyass18": "@deepica I feel completely the same. It’s shocking that not only had this been going on for so long, but there are people on his team helping him recruit the women/children, assist in keeping them locked away & assist in brainwashing, etc. They all should be locked away & held accountable. I’m 150% onboard and those that unfollow are ignorant. You keep on being awesome. #muterkelly #rkellyissick #rotinhellrkelly", "malted__rye": "kobe!", "drkanodia90210\nVerified": "Verified", "metanoia.31": "u look 16.", "shastyali": "I cannot shake it.", "websterg3lss76": "Say that 🙌❤️", "s_mamilla": "You were so pretty even in basketball shorts", "apleatforever": "Something is different with your face. Beautiful then and now.", "eamah1": "Great post! Much respect! 🔥", "_krutimehta": "Go bulldawgs 🤟🏽", "oluwatimilehin": "I actually started following you on the strength of your statement I’m very happy to lose all my followers over this as Hitler had millions of followers Jesus had 12 .", "fiend_like_queen": "You look absolutely beautiful in this picture!", "abigail.jka": "Yes. Preach it. 🙌🏾", "ashumi.s": "👊👊👊👊👊", "koman99": "Omg actual boycott r kelly I hate him @rhea_bhargava @angelatandon", "thekimfactor": "Always been a beauty! Your smile is 🤩 Did you wear braces?", "thorsdreamgirl": "💖 thank you", "reneekayjay": "@surekha.nadendla okay how does she look soo good for a 14 year old", "sanjoyd\nVerified": "Verified", "thoughtsonparis": "girl you look the same!! so beautiful!!", "mcelentano63": "I agree with you 100%! I watch as well and it made me sick to think about what he has done and continues to do, disgusting. He needs to be locked up! #muterkelly", "themelodyeffect": "I love this pic of you and I love your stance. I’m sickened as well. Brown girls matter.", "anisleymaharaj": "Cute ❤", "krupapatell_": "❤️❤️", "define.define.378": "Osm", "neenfofo": "Love this pic so much!", "divmtr": "Love the picture...you look beautiful as always! 🧡No awkward phase like me! 😂", "ritupatel6": "Yesss!! 👏🏽👏🏽👏🏽", "thekukkulife": "Omg you totally got to skip the awkward Indian girl phase! Usually it lasts for like 15 years 😝. #noglasses #wheresthefrizzyhair #luckygirl ☺️", "kaseyannee": "I think all the agreeable post highlight the inclusive beautiful #tinted community. I am happy for all of us.", "annadromero": "I feel the same way. Its just disgusting that his fame and money has let him get away for so long.", "thesumairagirl": "I love you and you are so cute in this photo!! Sporty deepica🤪", "ritika2009": "OMG where's your awkward puberty phase? I was out here looking between 20 and 10 all at the same time😂😂😂", "christinasha7": "Would love to see a pic of you in the blonde hair and blue eyes 🤣", "dmcloutier26": "Girl, that series has been with me for weeks! I’m so frightened for the girls still with him, I’m sad for the girl Dominique who has so much de-programming ahead, and I’m furious so many people have covered for him and supported his behavior for decades. We should all be speaking out!", "graciously.031": "You look so gorgeous!", "ryan_j_bergin": "The people who lost followers were not fans. They were blind!", "hallow_x": "I really want to see everyone involved in allowing this to happen is punished to the full legal extent. I get sick seeing how many films had Weinstein on them or just thinking how grown adults funneled kids to Robert for years and just passed it off as OK. The people that threatened and intimidated victims should be literally beat to bloody pulps for doing that. What kind of sick, fucked up people actually think this is OK? I want to see justice. This world needs to see you can't get away with that no matter how long ago it happened, who the victims were, or how famous/wealthy/talented people say you are.", "humnak": "This is my fave pic of you tbh", "mistridancer": "At 14/15 we think we know so much. Even at 17. We are surrounded by manipulative forces we cannot control. For an adult to abuse that a d be accepted is just gross. As per usual so many are blaming the girls forgetting what they themselves were like at that age. Powerful men choose to be predators knowing there's no real backslash due to the society we live in. It's sad that even after documentaries such as this one people still close their eyes to a reality that many suffer through. ❤️", "anita.lall": "🙌🏽 #muterkelly", "masha_robles": "You always say the right and best things. Thank you for this.", "justanothermuslimmom": "@deepica Thank you for always using your platform for speaking out about important issues. It’s so easy to be just another beauty influencer, but you do so much more. We need more people like you and I pray/hope that you inspire many more people to speak up. #rolemodel", "lashlovelopa": "Well @caradelevingne just gained a new follower", "haveuseenjas": "👏🏾👏🏾👏🏾 Yes Deepica! Preach!", "debbiessavage": "Thank you for sharing your voice", "sghobs": "❤️", "salmeenh": "You look so cute! Totally agree about that monster. I been following it for years waiting for the day he is punished for what he did to those young girls. I dont even have the heart to watch the documentaries - Just reading about it sickens and saddens me. Thanks for being you. It makes me proud to you. Keep being the wonderful you! 💖", "jackiebarnes13": "Omg I remember this", "rayr9224": "👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾", "krismikell": "Omg bmoor4lyfe 🏀", "_aasthashankar": "welp i’m fifteen and i don’t think i’ll be able to look as good as that anytime soon", "tazmanian93": "🙌👏", "rumaysatalks": "Beautifully said! 🙌🏼❤️", "katiesturino\nVerified": "Verified", "azeb_aman": "Thank you for this - we need our brown girl allys to stand with us on this. Youre beautiful. 👏🏿👏👏🏽", "nicolemastrorocco": "Feel the exact same way, after watching I just can’t shake the feeling of knowing it could truly have happened to us all at our most vulnerable state in life. Praying those girls still with him find the strength to leave and reunite with their families. Also praying we as a society learn from this and never turn a blind eye to another’s struggles and pain.", "nanaifyanasty": "❤️❤️❤️❤️❤️", "deachovatia": "I wish I looked like this and I’m 14 😂", "y.rucker.jones": "💖🙏🏽", "neelimakunammd": "I completely agree. I have so much to say on this. We need to increase access to mental health - there is a desperate need for more funding for many parts of the mental health system and education for mental health professionals. #mentalhealthawareness #mentalhealthadvocate", "coachingbyvarsha": "Awesome for sharing this and your thought! 💪🏽🤗", "srigunturux": "completely agree with the post (also, you look better at 14 than i did. kEEP IN MIND THAT I TURNED 15 7 MONTHS AGO I-)", "meena__j": "❤️❤️❤️", "aftab.nizamani13": "So cool style", "mzsh_9_": "You are the rare ones who’s been soooooo pretty at 13-14... I can’t even look at myself from that age 🤭🙈 you’re just as beautiful - actually more now!!! X", "piyu___pj": "Awsmmmm lovely smile", "amycwebber": "👏🏻👏🏻👏🏻", "miss_j_84": "@nisha_sraja your doppelgänger!!", "one.life.one.journey": "Beautiful ❤", "manrinar": "I don’t think the documentary is available in the uk yet but will watch when it is for sure. All these big accounts posting about it has definitely raised awareness.", "anisha147": "#girlslivesmatter", "symphonyofcolour": "I actually love this photo of you, Deepica! You look so badass already, but I also understand why you got the contacts and blond streaks. I also went through that phase in school and wanting to fit in with everyone else. But I realise that feeling was stronger when I went to high school in the US, before that I was never made aware of my skin tone in South America. I’m so happy I outgrew it and I’m happy with who I am now and Tinted has strengthen that too. ♥️😊", "makeupbygeedha": "This is why we look up to you! 👏 p/s still so beautiful back then!❤️", "lequeen103": "I love you even more now🥰🥰🥰🥰", "millann345": "You have always been gorgeous! 🙌🔥", "christinamorales138": "Thank you for sharing social media can also be used for good, constructuve, productive purposes. Finding solutions. Being positive , etc. You look so good. Blessings❤", "_maitryee__": "fav", "sdyfl_love": "I love what you stand for! 👏🏻 ❤️", "mrjovitageorge\nVerified": "Verified", "chait_anya_studios": "Omg natural is beautiful:)", "_jessicawil": "You were always beautiful I guess 😭😍", "curryscented_x": "@chicken_macbeth_ @da_muffin_mann @realsim_shady @_spicyhalloumi_", "lovevvanita": "Sick 😞", "kruthikasethiya15": "love that long air 😍", "manishajhingoer": "So cute 😍", "jaimieanandinteriors": "🙌🏽 So disgusted by him!! #muteRkelly", "abiana.i.n": "This is fav pic of you. Tbh", "melodiapaz": "Yes!! ❤️✊🏼", "callen33": "Girl, you are truly my lil sister! 😍", "aliyahmakeupp": "Youre so beautiful, thank you for sharing light on this 💝", "caaawn_yay": "Yassss!!! 👏👏👏👏👏", "creativemidnight": "Holy hell you look like one of those cool athlete girls that I want to hang out with so bad! ❤️❤️❤️❤️❤️", "juhinegi": "Ztrtry y y y y y y y y y you m#l", "reina.philip": "It was so hard to watch the stories of these young women, and that’s all I could think of for a week after watching Surviving R. Kelly. Here’s a question though @deepica. People continue to turn a blind eye to this. I remember when Tyga and Kylie Jenner were dating, I couldn’t believe Tyga wasn’t in jail already. I think Khloe or Kim K. even excused their relationship by saying Kylie was not like a normal teenager, and she was wise beyond her years. Why was the Kardashian family defending their relationship and why is the world still giving Tyga a platform and why is the world still fascinated by the Kardashians?", "ssaltner": "Not to be rude but I have no idea who you are (from Australia) but know now because of THIS post you're the type of person I want to follow!! ✊🏽", "kneehighz": "@deepica nope, what’s a platform if you don’t use it for good. I’ve followed this story and others (look into almost any make athlete/actor/musician and see what you find) and these guys continue to roam free, making millions of dollars and have fans everywhere. It’s sickening.", "justthej0j": "Woooooow, this is amazing! The shoes and everything ♥️♥️♥️", "cydbee\nVerified": "Verified", "maheen_kahlon": "AWEHH ❤️❤️❤️", "veda_harrich": "@deepica Omg just watched the segments this past week. Sick to my stomach. Yes #blackgirlslivesmatter . R Kelly shd be in jail. The victims need justice and all those supporters of his music should boycott him. It is not a difficult decision. Just think of your 12 years old daughters, nieces, sisters, granddaughters should in his world. STOP SUPPORTING This inhuman of a person.", "desi_mixed_x": "You were probably the best on the team 😯😯", "rachelhunkele": "Following @caradelevingne 👊💪", "karandeep2631": "❤️💟", "dhav_27": "He is a disgusting human. Everyone needs to watch it, stop supporting a monster! Thank you for this post. #muterkelly", "xpkjx": "@deepica when I was in high school (2001-2005) I remember hearing the allegations R.Kelly had against him at the time of raping young girls. I stopped listening to his music back in the 90s. I haven’t seen the documentary because I don’t have cable, but I am eager to see it and I’m sure I won’t be surprised by what is on it. My thing is - Why THE HELL DID IT TAKE SO LONG FOR PEOPLE TO SEE THIS? And why did it take a DOCUMENTARY for people to see this? He married Aaliyah?! People didn’t see anything wrong with that?! I thought he was creepy back then and didn’t listen to his garbage music then! What is going on with the world...", "thisgirlcharlie": "Yes. yes. yes. ❤️", "the_realroseal": "😉My gal! Speak it queen! 👌👌👌✨✨✨✨✨✨", "auni_mua": "Wish I could follow you double tbh", "amidesai": "I was so shocked when i read that too about cara losing followers..and about his album sales going up. So disguising. Scares me as I raise 2 small kids 😢", "sanjay__sizzle83": "Wow ur awsm deepica 😍😍😍😍😍", "tatjanabrown": "Way to go!!! He is a piece of human trash and you are helping someone out there with this post!!", "fruity_pebbles_04": "@deepica Thank you for always inspiring keep up the beautiful work you are truly amazing 💕", "dalal02": "♥️♥️♥️♥️", "ekosullivan": "Luv u more", "shanna_zia": "Thank you for speaking out against this, it’s extremely important that people that are in the position to influence, talk about these issues ❤️", "akankshamama": "We all have a voice if not a platform, and you use both of yours marvelously. Oh, and I just STARTED following @caradelevingne as a result! Girls and women will be heard and we must amplify their volume. Shine your light lady.", "thecurtisfamilycnotes": "🙏 ❤️ well said... blessings", "shruthimurali6": "Just the fact that he has gotten away with this for so so so many years and with so many women is just heart wrenching. I hope and pray that the victims finally find peace and attempt to move on. Also the girls who are still with him get freedom!", "mishael_marcia": "So true!!!😍", "mjfindingjoy": "Well said 👏", "jayashrees": "Best post of yours ever! Thanks for standing up for what you believe in. Totally with you!", "rosegoldserotonin": "❤️❤️", "slokanene": "I do not know who Cara is but I just followed that person", "drunken_gypsea": "🙌🏾🙌🏾🙌🏾🙌🏾", "asha43": "@cjhels07", "aleja487": "Yes, sister!!!✊🏽 #blackgirlslivesmatter", "__septembersveryown__": "Beautiful!!!!!🙌🏽", "ramya_rams": "@deepica you look so cute and gorgeous!", "susmithakanapala": "You just gave us another reason to love you....🙌", "imamandeepnagra": "❤️❤️", "maneeha.m": "My. Thoughts. Exactly.", "msppj\nVerified": "Verified", "jackieaina\nVerified": "Verified", "beautybydrkay": "👏🏻👏🏻👏🏻", "basmah.zia": "YASSSSSSS!!!!! 100000% AGREED.", "lionlox": "🎯", "hustler_from_oak_town": "Beautiful😍💓", "haanypot": "Thissss 👏🏼👏🏼👏🏼👏🏼", "parita_shah6": "U look so cute aw", "sl2edwards": "😂😂🔥🔥", "janirodz": "@deepica you are the MVP! You constantly speak on issues facing WOC and are a true ally ❤️❤️❤️", "kp.fitstyle": "This is why I love you!!", "shimaslal": "❤️🙌🏽", "kaydwebb": "Shake the table! Love it.", "jess.m.ana": "I recorded this and am just now able to start watching it..it makes my stomach hurt to think about, but we have to listen to these brave women and stand beside them!", "seemagroverwong": "Well said, you go Deepica!", "manviarora": "👏🏽🙌🏽", "elenaomand": "Yesssssss❤️❤️❤️ @deepica YOU GO GIRL! Love this, ps. You look adorable in high school!!", "denissaacg": "Hottie 🔥", "misswhoeveryouare": "YES!!!! Thank you! 👏🏾 👏🏾 Honestly! I lost a good 75-100 twitter followers when I was live tweeting and I know I’m a small fry compared to you but those who unfollow are not worth it. This has been going on for years and completely ignored or people made excuses on his behalf. I’m so happy the documentary aired. I’m just hoping law enforcement actually prosecute.", "ranavat": "Always using your voice for positive change in the world 😍😍", "_stephharris": "Ballin shot callin", "zoherakarim": "Omg I looked at our team photo last time I was in Houston lol we were babies", "pakifornia": "Insane that anyone is still supporting him! Thank you for speaking up and using your platform for good 🙌🏼", "karishmadonde_": "Yesss it hurt my soul! And was so saddening", "sarah.rudkin": "YAS GIRL", "pratyushaaaaa": "Exactly!!! Everything I preach. You’re so awesome. Love you🍭", "cvlienteqvxxnn": "Love you ♥️ stand in your truth all the time, I fully support you♥️. @deepica", "ncginnyc": "im loving this post on so many levels. thanks for your voice and using your platform for getting the right message out there.", "thelaladoll": "Thank you so much!!! ❤️❤️", "amdivin": "Girl you've always been hot! 🙌 When I was in basketball I went through a very awkward phase lol!", "susanyara\nVerified": "Verified", "ladyburgundy": "❤️❤️❤️", "msjenny_88": "Yes girl! I agree with you 💯", "shyla.xo": "I watched it and am DISGUSTED that he even made a song saying “I admit it” and is still a free man... how?! It just doesn’t make sense. I pray for the victims and their families and the poor girls still stuck in that lifestyle", "helloitsruth": "👏🏽👏🏽👏🏽👏🏽", "hanalei_a": "Say it louder for the people in the back!", "nikischwan": "💥💥💥", "sgorantla91": "Telugu sweetheart ❤️", "rumshakerr": "You’re amazing and I love what you stand for! ❤️SIDEBAR: is that a Stephen F Austin high school jersey?!😱", "smkh_july3": "I was disgusted when I read years ago about sweet #aaliyah. And he got away. With #metoo I couldn’t help but think of R. Kelly and when we would wake up. I don’t think the white audience wanted to get involved. And I am unsure of why the black audience kept his music going though the documentary touched on this. He needs to pay for his crimes even though his victims will pay for years. #muterkelly", "simsimscorner": "❤️❤️❤️", "tramaynetirrell": "🗣 louder for the ones in the back", "am.meadows": "Thank you for speaking out, when so many are still in fear of coming out for such an important conversation that is still not being had enough. 🌻", "marinunes01": "@deepica i just finished watching it and opened my IG to relax a bit. So good to read this words right now. #muterkelly", "ssarebearr": "❤️❤️", "am_brownbeauty": "And for that reason I’m going to now follow Cara. Agree and support your post!", "chanchallel": "👏 @deepica I respect you for this. Huge ratings!", "meghanaaa3": "Dang you're so pretty! 😘", "nishabalsara": "Yes.", "riyavaidya": "Omg!! @__nikitav", "vaaridhibagrodia": "❤️❤️❤️ You and I can’t agree more. I think it’s so important to use this platform to speak up and speak your mind. Yes #blackgirlslivesmatter and #survivingrkelly sickened me too. Thank you for this.", "crossoverbasketball": "👏🏽👏🏽👏🏽 🏀🇮🇳🏀", "sanyaaanthony": "You’re always an inspiration for many and you fight for what is right. You show how we have the power to change the world.", "beautyandquotes25": "❤️❤️❤️❤️❤️❤️❤️❤️", "poojithaa_c": "Ommggg💖💖💖", "pree_theeventplanner": "Wow. Gotta watch it. Honestly I’m a bit scared. But #whattodo to prevent it from happening in the future? Our children are the best gen 😔🙏🏽", "te_lashay": "@deepica preach🙌🏾 ❤️❤️", "aditijhota": "I can't even bring myself to watch it but what's even more sickening is how many people still support him....😶😐 Thank you for being vocal about it", "misslady_k17": "Preachhhh 🙌🏽", "desigirl314": "💞❤️🙏🏽", "beefwindly": "thats the girl I remember!", "blushandbindis": "❤️❤️", "ivyjanitza": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾♥️", "blackcanary11": "❤️💕💗", "simran0509": "You rock @deepica such a role model!", "trophyfem": "Go gf! 👏🙌"}