{"makeupbyparsaaaah": "Take the L already LOL 🤡♥️🖤🧡❤️🏠🧥🔑🗝👁😭😭😭😭😂😂😂😂😭🖤", "isabellaballerina": "Congratulations Deeps!! So happy for you! Can’t wait to buy 😍", "mseth1": "So proud of you @deepica . I remember when doing this was just a thought in your head hustling in NYC and here you are! 😙", "geetsvv": "Can't wait for this to go global so we can get some in Kenya. Well done Deepica- I've followed you from that first video 👊🏽", "alizavellani": "🙌🏾🙌🏾🙌🏾", "thecurrymommy": "I am ALL over this!!!", "preethik88": "@ranjanaa.s", "semytheistanbully": "I’ve been a fan ever since that video. Congratulations ✨", "syed_mehvish9": "Woah woah 😍😍😍", "stefaniesyat": "congrats deeps!!! can’t wait to try it 💓", "lvndrgms3": "I’m excited for this! I normally don’t go for red but I will certainly try the Origin shade.", "fathimachocpie": "This is great - again South Africa will be left out .. we are too far lol .", "supriya801": "Congrats! ❤️ I can't wait to try this!! @padmalakshmi you might like this too!", "mrsannaptak": "The red lip stick trick is how I found you and I use it every day!!", "vickytsai\nVerified": "Verified", "babbuloo": "That's awesome! I'm not much into make up, but definitely follow for brown girl power! Have to work on hiding my dark circles at times as well lol so can't wait to try myself! Congratulations!", "spanouthere": "When are we getting this in India Deeps?", "veethang": "Tbh that lipstick trick was a MAJOR life changer for me. Can’t wait to order!!!", "_gowthu": "Insane🔥🙌🏻", "aroraashima_": "We hardly have any good vegan lipsticks here in India. Deliver here too boo💃", "supjali": "Congratulations!!! I will be buying all the 3 after reading how they are made. A healthy version cosmetics!!They look amazing.", "karima_j": "@mrs_ashina", "mrinjoshi": "@purvajoshi17", "tamilbossponnu": "😍😍😍😍😍", "lelandcd": "👏🏼👏🏼👏🏼", "misslady_k17": "Congratulations ☺️❤️💕 And I’m so happy you came up with this concept 💁🏽‍♀️", "prahlad6903": "Nice", "marilandiasmit": "Beautiful I really like..", "thequintessentialstylist": "Would love to see it available in the UK soon 🙏💋", "ashamoosai": "I need the tutorials so I knowwww which one to get the minute it goes on saleee @deepica", "beautybydrkay": "👏🏻👏🏻👏🏻👏🏻", "styledby_rakhi": "You have made the whole world happy!! #differentshadesofTINT", "danizacharia": "💯💯💯💯", "misschandhini": "Omg I’m so proud of you and this is going to become a key staple in my makeup routine!", "mint.labs": "Congrats deepica! Loved watching you on this journey!", "devika_rdb": "Congratzzz Deepica!!! 😍", "nicholatgray": "Congrats!!!!!", "theillustratingdentist": "@vieshnavi we must try! 😍", "natalieebel": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "thequirkybong": "Yay 😀 ❤️❤️❤️", "issuesthatmatter": "Hi @Deepica Are these fair trade certified? Who is making this product? Please share. Thank you", "minalpatel": "She is a queen. Guys our makeup is going to look so fierce now. Like even more fierce!!!! 🔥 @mirar16 @shivanip7", "ooomers": "So so proud @deepica !", "diviathani": "@deepica the packaging is just ❤️❤️❤️", "sereinwu": "Congratulations 🍾", "anjalikumar\nVerified": "Verified", "vithyahairandmakeup": "This is AMAZING 🙌🏽", "stellarbeautyofficial": "Congratulations!!! We know what goes into this. ❤️❤️❤️", "misshauteness": "All I can think of is how proud Mama and Papa Pandu must feel! ❤️👏🏼 Congrats Deepica, much success! 🙌🏼", "emmsokha": "This is awesome Deepica! You’re such an inspirational. ❤️", "kmsevltwn": "Sell it at @birchbox!!! #fullcircle", "theearthygoodness": "Huge Congratulations Deepica! 😍", "monachatterjee": "Amazing!!!! Congratulations on your launch!", "letbodyheal": "Much love deepica♥️♥️", "pleatsandpetals": "Ahh so excited to try these!! #byebyedarkcircles", "queen__stormborn": "I need this 👏🏽👏🏽👏🏽👏🏽", "the_snazzy_mom": "Congrats @deepica on your journey ! Very inspiring. I can’t wait to test it", "mcm475": "👏 game changer", "meeta_gandhi": "Here for this!!! 🙌🏽🙌🏽", "beautif1y": "This launch will become unstoppable!! You have allowed so many of us to give our feedback and insight on what we look for. Thank you for building the #Tintfam community!! Letting our opinions be heard; as we continuously share the importance of inclusivity and diversity!! @deepica #livetinted", "shalinivadhera\nVerified": "Verified", "meet.ashy": "This is amazing🙌🏼👏🏼", "nbhagani": "Congrats!!", "soni_93": "@kritasadrani only US and Canada to begin with 😭", "_sareshnie_": "Please bring it to New Zealand 🇳🇿 what would be the price range for these beauties @deepica and a huge congratulations for helping brown girls like me who suffer with dark circles and can never find anything to match my tone. Thank you 🙏🏼 😍", "caramelchemist": "OMG SO ESTATIC AND EXCITED FOR YOU", "purvislodgestyle": "😍🙌🏼🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡Please ship to Australia asap @deepica 🙏🏼🙏🏼🙏🏼🙏🏼", "jlo2884": "How do we know which is the right shade to use for our skin tone?", "pizzamonster20": "How much will it cost?", "rajeswarimenon": "Can't wait for the review!", "tobegill": "I really really hope this doesn’t show up under foundation like most color correctors. Fingers crossed @indiancrystal_", "marydiasswift": "Congrats Deepica! I’ve been following you since that video came out 4 years ago and am so proud of your journey!! Can’t wait to get my hand on these.", "kanchan04beauty": "Congratulations , looking forward to try Huestick @deepica", "anis.collections1": "So excited!", "rinzta_p": "Love that a south Asian role model launched this during Asian Pacific American Heritage month how better to celebrate than supporting an AAPI business?? #APAHM19", "divmtr": "Love this!! Can’t wait to buy them...when are they available in the 🇬🇧?", "glowngreen": "Congrats", "dulariamin": "Bravo d!!!! So proud of you 👊🏼👊🏼", "aarthipilli": "Please make it global! I'd love to show my support for your first product! All the best!!!", "melissaflores": "Wow this is amazing @deepica congrats babe!", "m4n15h4": "Well done girl congrats on your achievements ❤️🙏", "dil.to.dil": "What a #GameChanger and #SelfEsteemBooster all in one!! Living for the innovation!💛💥👏", "kaviladnier1111": "Exciting! I heard of you first when I was looking for a corrector and saw your red lipstick video. This is fantastic! Congratulations!!!! Great talk @justbobbibrown btw:) she herself showed me her Bobbi Brown foundation in golden almost 20 years ago in Saks one day and I cried later to finally have a color that matched. All the best and here’s to all good things to come!", "najistica": "Cant wait to buy 💝", "mowbilly": "If we use it as a color corrector for dark under eye circles, do you use concealer on top of it? Super excited btw !!", "alabamastatter": "Congrats Deeps!!! You deserve it all. So proud of you!!! Can’t wait to get my hue stick!!!! 🙌🏻💞", "trendfamily": "Amazing!!", "pandeyjeee": "What about India!!!", "alishadsouzaa": "I’m so so so excited about this. Thank you @deepica.", "div.vishwanath": "Love! Such a great nod to your orig red lipstick hack too! Congratulations! 💛", "aawwknee": "India too pleaseeeee", "varshaharish": "@annikajain wait i kinda want this", "rittikaushal": "You go girl love you and wishing you lots of success 💕💕😘", "richa118": "@deepica so proud of you girl.. 🙏👏👏", "kam773": "i remember seeing that video early on and trying it myself...what a truly full circle moment for you!! congratulations!!! 👏🏼👏🏼👏🏼", "dawnetc": "🙏❤️🌟🌅My girllllllll", "flossy74": "Bought. Congratulations @deepica !", "puja1605": "@nirizzana", "tniquejhair": "👏👏👏👏👏👏 You ROCK!!!!!!!!", "jotimann": "Amazing!! Congrats girl 😍❤️", "purra_limbu": "@umaaa89 I will get one for you!", "anjalyantony": "👏🏾👏🏾👏🏾", "camishg": "@glamlifeguru please review this for us 😊😊", "gracellamahabier": "Awesome Deepica & congrats🎉👍", "radhikats": "Just wow Deepica, Congratulations ! Totally excited to try this product !", "delinamedhin\nVerified": "Verified", "taleya.g": "🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙇🏽‍♀️🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "sowmyak\nVerified": "Verified", "rsuchde85": "Congratulations! So proud of you and excited to see what’s next", "indrajala": "Will this be in retail stores soon? Planning to visit NYC next week and want to order this amazing product☺️. Congrats @deepica 💥", "kirbiejohnson\nVerified": "Verified", "jignapatelartstudio": "You are freaking incredible!!! OG fan right here🙋🏾‍♀️... followed the whole journey and couldn't be more proud of not only how far you've come... but how you've literally helped change the world we live in! Your video for this product launch is EVERYTHING that the whole beauty industry needs to learn from to market products. Instead of staying 'you need this product so you can look more beautiful or score a fine man'...(like so many ads do), it should say what you do: 'you can rock your own beautiful skin the way it is, but if you wanna play with make up... go for it, and we have what you need... no matter your skin tone!'❤️❤️❤️ I love this whole brand and you! Sending you so many more successfully wishes and t prayers from back home in Houston!😘", "kahlanabarfield\nVerified": "Verified", "lifewithsuggy": "Can’t wait to try this 😍🙌🏽", "triptjohal": "this is amazing @deepica ! it’s been so wonderful watching you on this journey! 💛💃🏽", "chayakumar": "This is incredible!!! Congratulations!!! ♥️🙌🏽", "numpatel": "How do you know which shade is right for you?", "shopdeepa": "Soooo proud of you!!!❤️❤️❤️❤️❤️", "meghatron5": "🙌🏾🙌🏾🙌🏾🙌🏾 Yaaaasssss", "vidsrams": "Congratulations Deepica!! 👏🏽👏🏽👏🏽", "saili.salunkhe": "What an amazing concept this is! 😍 For girls who are not used to using multiple lot make up products, this is perfect! Please start international shipping soon.", "crabulousm": "Waaaaaaawwwww", "theprinceandthep": "Yesss!!!!!!! This i genius! I find that \"one shade of red\" color corrector does not always work. This is soooo exciting! Congrats Babe!!", "laurengores\nVerified": "Verified", "tyy.clark": "Congrats deeps! The fruits of all your hard work is paying off, press on!🏆so happy for you", "caifucius": "Obsessed!!", "luvproject": "Congrats @deepica way to go! Love the product branding well done 🔥👏🏽", "sheetal.pi": "Love love love this concept! Can't wait to try it once it goes global 😍😍", "asmatic33": "What an amazing accomplishment!🙌🏽 Congrats! Cannot wait to support your company and purchase this product🧡", "sobiqazi": "I need these in my life!! Congrats 👏🏽🎉", "jetsetmarg": "This is amazing!!!! Congratulations Deepica! ❤️❤️❤️❤️", "jentan26": "Congratulations! It’s been a joy to watch how your career and this tinted community has grown.", "aiswarya9": "Excited!! Can’t wait to try this out ASAP!! A colour corrector which can be used on lips, cheeks, eye shadow, covers up dark spots and any hyperpigmentation all in one product 😱😱.... take my money already. 😍😍", "nimisha.sindhwani": "Congratulations 🎊", "iam.khyati": "So proud of you! Congratulations 💛💛💛", "meghan_shah": "Can’t wait! 🙌🏾", "makeupbynikkilarose": "Yassss!!!!! Love 🙌🏼🙌🏼🙌🏼 congrats @deepica !!", "jag4jag": "👏🏽 Meeting you at a LA Beauty Con at the Briogeo booth was absolutely amazing. Your beautiful smile shows how much light and soul you have in your heart♥️ and to create this amazing brand that is all inclusive ...well that is what makes you more HUE-ti-ful 💋💄🙏🏽 Congrats on a well deserved full circle!!", "ornella.rayan": "❤️❤️", "the.viral.life": "Looks amazing & yes definitely full circle ⭕️! This product is so key for women of colour!! ❤️", "therealkamie\nVerified": "Verified", "tinywaves12": "Wow awesome!!💗💗💗🌹", "honeywhatscooking": "This is awesome deepica. What color do you recommend for each skin tone? That would be great if you could give us examples. Excited to try for dark circles.", "samridhi.ganeriwalla": "Looks great! Congrats", "neeeshsta": "Amazing I’m so many levels!!! Congrats on your launch and continued success 👊🏽 🙏🏾", "sonikohli": "would love to see your recommendations for matching the shade to your skin tone 🤔💕", "reinha.n": "Yessss!!! Congratulations🥰", "sonagasparian\nVerified": "Verified", "nextwithnita\nVerified": "Verified", "ranimaan11": "@deepica Congratulations! This is Amazing! Can’t wait to try this product. 😊", "elizabethpriyakumar": "So happy for you ❤️", "amidesai": "Couldn’t be prouder and can’t wait to put these babies to use!! ❤️❤️❤️", "goldnineink": "Epic 😍", "classtige": "Congratulations!!! What an incredible achievement! 😍😍😍", "anuprakashtv\nVerified": "Verified", "simransnath": "😍😍", "rakel.inha": "Congrats @deepica 👏🏻👏🏻 👏🏻👏🏻", "amaa.l": "FULL CIRCLE ! Congratulations Deepica and thank you for all that u do 💕", "mzastute1995": "My fav has released makeup products @farhana_jc . Not available in Aus tho😭", "seemajashn": "You certainly are THE GiRL💜💜💜💜💜", "rachnaa_": "this is awesome!! thank you for all that you do for our community!!", "sayranb": "Congrats Deepica and @livetinted!! Can’t wait to incorporate into it my daily look❣️❣️❣️❣️", "saroja_naidu": "Can’t wait to see it in India especially in Hyderabad", "allthingsada\nVerified": "Verified", "dippymenon": "Bring it to @mynykaa :)", "poojkulkarni": "Congratulations!!! 🔥", "roopcreativeagency": "I cannot wait! ✨✨✨ amazing job @deepica", "paosfitworld\nVerified": "Verified", "mi_amruta": "So glad that you made us try the products when you were in India, remember the Hyatt Meet😊loved the colours Can't wait to launch in India. @mynykaa are you listening we want the Huestick @livetinted soon😍", "uzmamomin": "Ahhh I can’t wait to buy this!!! May 6th is on my calendar🙌🏼🙌🏼", "thechaichica": "Congrats! 🍾🎉Can’t wait!", "yaminimaggo": "PLEASE LAUNCH IN INDIAAA<3", "carmen_daniela_patrascu": "Congratulations! You are the only youtuber I watch and follow on a regular basis (creepy much?! :))) and you are such an inspiration! You deserve all the best!", "preetiijoshii": "So proud of you! I’ll be getting them all 😘", "oyindrilarayghoshofficial": "Congrats @deepica and @livetinted .", "taniatagle_": "Can’t wait!!!!!! 👏🏽", "syfly3": "To the left to the left!!!!😍 Omg need that red!!!", "linda.ann_": "are we able to see the ingredient list prior to the launch?", "rohozxx": "A MILLION CONGRATS TO YOU MY QUEEN 👏🏼👏🏼👏🏼🎉🎉🎉", "edgability": "Ooh 💋", "rishired": "Congratulations! 👏💜", "mona576": "I can’t conceal my dark circles without color corrector. Can’t wait to try this! Congrats on your launch! So exciting! 🙌🏼", "rks1010": "Congrats!! I remember seeing that viral video and following you from that, as I’m sure most people did. 👏🏽👏🏽", "beautyproductsaremycardio": "This is just so amazing", "sarachabra": "Congratulations! 🎈🍾🎊", "shilpy_sarguru": "Yes girl!! 🙌🏽❤️", "drishti_gudwani": "Could you make it possible in India at the earliest with the help of @mynykaa .. I’d be more than grateful. I know how much hardwork you’ve put into this. Thus, I can’t wait to use it plus it has amazing features which is making impossible for it to wait!! @deepica Lots of love XOXO❣️😘", "natmack1": "So happy for you D!!! Looks gorgeous!!!", "anj779": "Congrats! Is it going to be available at Sephora?", "sumanjita": "Congratulations ♥️ can’t wait to try this!", "sidaraahm": "I can't wait!!!! Im soo excited for this, so needed!", "b0w___": "Yay!!!!!!", "anushiashan80": "You definitely are inspiring 😘👏🏻👏🏻👏🏻 congratulations!!", "justanothermuslimmom": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "arundhati_baitmangalkar": "Can’t wait to order on May 6th", "himahearts": "YES! Can’t wait to watch the tutorial bc I have no idea how to use but definitely want to learn!", "whatsyour_rashi": "3-in-1. Yes please! Congratulations on your launch and for always creating such amazing content in the brown space!", "seesaweye": "Will you launch it in India?", "nabeela.parkar": "Yes!!!!! A long time coming!!!! Cannot wait for it to go global so I can get my fingers on it.🙌🙌😍😍", "karishmagidwani": "CRYING CAUSE YASSS GURL", "theeislandboi": "Major Congrats Deepicaaaaa Babeeeee !!!!", "imjesskiddin": "So awesomeness congratulations!!", "umul_vara": "Love this so much!!", "shahtriplets4lyfe": "Congratulations @deepica ❤️", "greeneyeambition": "This is awesome! Congratulations!", "meghagenie": "Please, please, please, I'm begging for this to be available in India!!! 🙏", "drvisha": "Gonna need them all", "nssadaru": "So proud of you!! Will share and share and share!! Because I met you a few times through @sanahsue and you’re her family, you automatically became mine! I wish you the best and will always root for you!! Buying the baby and me a #livetinted shirt too!! 🙌🏽🙌🏽🙌🏽", "mynameisamreena": "This is so awesome!", "shrutiv": "Is it weird that I don’t even know you and this makes me so proud of you? It is what it is. You go girl 💪🏽💪🏾💪🏼", "ashapateldesigns": "Must have RISE!! Congrats!!💕", "anand_anjana": "@beedoesthings we have to try this!", "cincin412": "Congrats @deepica!!! This is awesome and deff needed!!!", "srreddy4": "So happy for you👏👏👏", "samp425": "Good for you, girl! So super exciting!!!!!! Congrats! 💕", "sarahsugu": "❤️🔥", "nujent": "Yessssssss!!!! So amazing 🙌🏾🙌🏾 congrats!! Can’t wait to use this!", "jinal_shah": "❤️❤️", "ceceinla": "@sahursart", "anmvibrant": "This is fantastic!!! Congratulations on everything! Can't wait to try!! The video is dynamite 🔥🔥", "soniabehal_": "#browngirlmagic congratulations I’m so proud so happy for you! You are a role model for my daughter and me! Stay happy and blessed always! Love you!", "radchandra": "Congratulations @deepica! I love what you have created & can’t wait to try it! I love that you are making waves in the beauty industry & representing brown girls/women everywhere! I can see you put so much thought into the idea, design, colors, and names. So clever!!", "rthak": "@raniapatel", "simplykarmie": "Definitely game changer💗💗💗", "ja.ne.ssa": "So excited!!! #cleanbeauty 💕", "gregoryarlt\nVerified": "Verified", "alatorreee\nVerified": "Verified", "mpavri": "❤️🙏🏾❤️🙏🏾", "kashanielb": "Is there a video tutorial or manual for knowing which color you need? 🙈 I’ve never used a color corrector before 😅", "kristiedash\nVerified": "Verified", "dchalasani": "Congratulations! So proud of you!", "b.reddy": "Love this concept! I’m a dermatologist specialized in skin of color and I have tons of patients who come in asking about ways to conceal hyperpigmentation. Excited to try the new product!", "thatgirlyusra": "Amazing 💛", "bijpatel": "So excited! 🙌🏽", "yegonre": "@trendmood1", "paula_b99": "Congrats! I can’t wait to try it!", "faiza1730": "Congrats! So happy to see you made the products available in Canada.", "gargimishra12": "Yay🙌 finally something to deal with “real” dark circles!", "iamruta25": "Good luck", "susanyara\nVerified": "Verified", "wannabeechef": "How exciting!", "yoliglo\nVerified": "Verified", "usandyn": "Congratulations dear @deepica . Really happy for an Indian, born in America is making it real big in the world of beauty. It's not very common.. 👌👌👌🤗🎉🎊", "kavi_t_a": "Cant wait to try this🤩", "sinkissed_beauty": "Definitely need this in my life 😍", "ksub155": "Can’t wait till Monday!!! Looks exciting!!!", "sriyamuttavarapu": "@chinmai_r19 @srijauppu @nishisteasis @indramanikadiyala @ms_puvvada @_._._._.karen._._._._ @chelsyb23 @arismelurbina y’all should take a look at this!", "myinnershakti": "This is incredible - all of it! Congrats to you and your whole team. Can’t wait to try this myself!!", "bombbeauty_1": "So excited to try and happy for you @deepica !!", "manasavedula": "Wow! Been following you for years and this is amazing. Way to go! My dark circles and I thank you! 🤩", "khaddijaj": "I love how the huestick is inherently diverse in its functionality and to whom it caters!!! We can all use it in whatever way we want! LOVE YOU and the work you do 🧡🧡", "davidlopezzz\nVerified": "Verified", "carolinerazia": "YASSSS ITS HERE!!!", "delhisjanks": "This seems like it would help cover melasma used user my foundation 👍", "shaktinaran": "Cannot wait to get my hands on this; congratulations!🙌🏽", "vickyxgrit": "So happy to see new brands being launched to meet all types of people and by female + POC 🔥", "megs1804": "So proud and excited for you @deepica 😘", "thechaimommas": "What a journey you’ve had and yetvrhis is only the beginning...we cannot wait to try! These tired but grateful momma eyes (and faces) are so SO ready!! 🧡🧡", "junisingh7": "Can't wait to buy Rise 😍", "mariasinstaglam": "YAS YAS YAASS 🙌🏼🙌🏼🙌🏼🙌🏼 @deepica", "fazena_b": "Congratulations! Will there be a video on your YouTube channel?", "chefpalak": "Oh I’m dying to try this! @deepica congratulations 💕💕", "avantic23": "Which would you use as your under eye corrector?", "dmar_007": "Can’t wait!!", "darjcreations": "Congratulations Deepica!! Beyond proud of you 🙌🏽! Cannot wait to try them! 🧡", "jkkollects": "This is it! #tintified", "dannyicruz": "🧡🧡🧡🧡", "lil_miss_moi": "😍😍😍😍", "tiifffanyd": "Dee I’m so proud of you!!!! I will be getting ALL three!!!❤️", "visualproses": "Woot woot! So proud of you! Can’t wait to get my hands on the terra-cotta one!", "mahimajensen": "Need 👏🏽this 🧡right ✨now 💯", "earl.st": "💥 💥 Yes! Love it!", "lakshsarkar": "Oh I’m so getting this @deepica 😘 Vegan and tinted ! I’m there ♥️", "deekapadiyaofficial": "Congratulations Deepica!! These look amazing!! 👏🏻👏🏻", "nav_ya": "I love love love that you are saying it’s “vegan and cruelty free, of course!” Like you’re making vegan and cruelty free normal and necessary for beauty products❤️❤️❤️ love you and your work @deepica", "mindi_84": "OMG!!! Exactly what I need for my dark circles. Amazing product to begin your product line 🙌🏽", "vshameni": "Gorgeous!!congrats again!!!🎉🎉🎉🎉🎉", "rutu.amin": "@deepica I’m so proud of you and I’ve loved watching your growth so far! I know this is just the beginning for you. Lots of luck and love from one brown girl to another 😘❤️", "tealfirefly": "Congratulations on your product launch @deepica!!! ❤️ It’s so amazing to see you come full circle from your YouTube videos so many years ago!!💕 Can’t wait to check out this product on May 6!✨", "makeupbygeedha": "Congratulations lady boss! This is going to be great ❤️", "anuria": "Is it available in the UK!!", "sorahsays": "I can’t believe it’s finally hereee!! Honored to watch all your dreams (you told me the first time we met) come true!", "browngirlfashiondiaries": "These look too hard to resist!! Good luck 🍀", "pariheart": "Congratulations 👏🏼", "niharika_kandepu": "Omg this product is releasing on my birthday May 6th", "varshasdiaries": "This is amazing.. cant wait to get my hands on them. 🙌🏽🤩", "skb.ontherun": "So excited for and proud of you Deepica! Can’t wait to try the huestick out 👏🏽🙌🏽", "sumonaseth_": "Amazing!!!🙌🏽", "marzapanh": "U need to do a demo with them!!! I can't wait to get my hands on them!!!! 😍🤯😍🤯", "andreafontanabeauty": "Yessss! I love it! Great job! 👏🏼", "theluxurybelle": "Sp excited and proud of you!!!! ❤️ @deepica I think I’m going to need all 3 🙈", "sramana07": "@deepica This is so exciting!! 🙌 As someone who struggles with hyperpigmentation which was and still is one of my biggest insecurities, this is life changing!! I am obsessed with your red lipstick trick which was a game changer and now I have something multi-functional that is designed just for people with the my skin tone and skin concerns!! Can’t wait to get my hands on these!! Thank you 🙏 🧡", "guptanaiya": "💕", "lipthimakb": "😍... the middle one is what your lip color is I am guessing! I am allocating my money for that along with the Sephora sale! 🤣 go Deepica! #livetinted", "deejayzoo": "@deepica very proud of your story and your launch. we seem to have a lot of friends in common. CONGRATS!!! 💦 And, lets grab coffee when things calm down. Maybe with @rachelista 💌", "rupal527": "❤️❤️❤️ can’t wait to have one of each.", "jocelyn_biga": "Just great! So proud of u 🙏🏽🔥", "apintolife": "Waking up singing “what’s your hue whats your glow ?” Lol can’t waittttt", "shauneylicious": "Wow, congratulations!!!", "jessedoddi": "Beautiful! Can’t wait to try it. More power to deepica and tintfam! 🧡🧡", "neeps81": "Congratulations! 💕💕💕", "richakal": "👏🏽👏🏽👏🏽 so proud of you!!!", "dermpa23": "Congrats @deepica 💕✨", "nilublue13": "This is incredible! 🔥🔥🔥", "tach.j": "What a GENIUS first product for you! So perfect Deepica! I can’t wait to support and get my hands on it ✨", "launeld": "😍😍 Can’t wait to get my hands on this. 😊😊 Congrats again!", "sbeautynyc": "Congrats 😍", "sudhakarthik": "Woow! 👏👏", "puni86": "Can't wait to get my hands on one😍😍", "vaishcantsingh": "I can't wait to get this and basically anything Tinted ever creates. I know you guys will make nothing but the best ❤️", "deepsmak": "Amazing 💜", "s.ruthiii": "@tangareeny look its the color corrector i was looking for!", "sukanya\nVerified": "Verified", "anki_jolyn23": "Yayyyy", "arshiamoorjani\nVerified": "Verified", "shuchii.patel": "Lol it releases on my birthday", "doseofshivs": "Congratulations!! Your story coming full circle is amazing and inspiring. Can’t wait to try this product. 🙌🏽💕", "hsp2019": "That’s my birthday ... May 6th. You shouldn’t have ❤️", "naturalista.us": "👏🏽🖤", "shrayani_dutta03": "Congrats 😍😍❤️❤️🙌🏻", "reshme_24": "Omg I want them all, take my money 😍😍", "malvika.iyer\nVerified": "Verified", "mooky1230": "Brilliant! I will definitely buy them all", "rachelmariaofficial": "😍😍😍😍😍😍", "meergatito": "@mkondapi we need to get!", "anunblurredlady": "Omg omg omg! So good!! Congrats!!", "shyan_mcs": "Congratulations on this beautiful product launch! Proud to be a woman of colour and can’t wait to see this product stocked in Australia!! #please", "millyalmodovar\nVerified": "Verified", "danaariel": "Freaking out for you. Congrats !!!", "attajaanr": "So happy for you!!!! 🎉🙌🏼❤️ can’t wait to get my hands on this!!!! 💄💋", "roopa_4": "Cannot wait to try them ❤️", "riaparikh": "Love love love ❤️❤️❤️", "shamitaaax3": "Which one is the orange shade that you were wearing?", "neha_joy": "Yasssss sooo good! Was hoping it would be this!!!! Congrats♥️♥️", "reebam": "Congrats!!! So genuinely happy for you!!! You had a vision and now it has come to fruition... And inspiring so many in the process🧡🧡🙌🏼🙌🏼", "gamanwani": "Love thisssss", "reddyshruti": "Congratulations and proud of you ! 🤗 @deepica 🎉🍾", "n.a.n.d.i.k.a": "❤️❤️ absolutely love this!! I am so happy for you and I can't wait for this to be on Indian shelves!", "jevika_p": "Yay!!!! I've been looking for a good colour corrector! Do you ship to the UK?", "thefacebykase": "Beyond proud of you!!!", "mynameisrekha": "Will this ship to Australia?!"}