{"srreddy4": "After I saw you on YouTube about a year ago", "chindienne": "I found you a little over a year ago when I got into makeup, and wanted to find Desi influencers to follow! Love how you represent our culture in every way, whether it’s on Instagram, YouTube videos with the Pandus, or doing brilliant things with @livetinted!", "sophbheadrick": "Hmmm I think I found you on IG maybe 8 months ago? Lovin’ it!", "nishapsw": "🤔 I think after Shilpa’s 30th bday in New Orleans we were Facebook friends and so I think I started seeing your career blossom from back in the days:)", "dcboaden": "I started following you not to long ago! I am Anglo Indian however I am an Australian (Mum English dad Indian! )Love you makeup range I guess because my skin tone I hv been attracted to your makeup😊because of my olive skin! My skin is much lighter in winter and golden in summer. I also identify with you as being Indian. My husband and kids are Australian.", "sophileh": "Girl isn’t it weird I have no idea... it was either a makeup or skincare vid and it was def on insta but how idk. Maybe somebody reposted", "thuylatta": "A Co-worker of mine by the initials J.R. mentioned you guys are friends from Houston. He recommended I follow you on IG for he knew how much I love and appreciate an amazing makeup artist with natural born talents. I enjoy watching your vids. Also a joy to see how much you love your dad, mom, sister and extended family. Thank you for your humble and down to earth spirit. 💟🙏", "summirz": "I followed you after watching the dad does my makeup tag and he said you should be holding a stethoscope instead of a beauty blender. I lol'ed too hard at the relatability. so, here for the papa pandu content! @rajamutyala #neverretire", "sha.bvvv": "Maybe few months ago? And I fell in love with your genuine humble personality ❤", "touristsinresidence": "The famous res lipstick 💄 color corrector!! I couldn’t believe there was an Indian on with a beauty hack that worked for my skin tone!!! 😱😂", "joannef0615": "When I saw the gorgeous photos from your sister's wedding festivities and fell in love with your wit and your relationships with your parents 💖", "tomya_shakur": "I first started watching you when I searched up brown girl lipsticks and bam I was addicted", "yiwenz_makeup": "Hi", "carleylynn_": "I attended Idealogue in NYC in 2017 and you were a speaker there. I was so inspired by your story and really connected with your vision and your passion, so I started following you on IG and I continue to love your posts and your message and I truly enjoy watching this journey you are on unfold 🖤", "annabel_govender": "@deepica I started following you after you slayed the indian version of wonder women❤️😘🇿🇦", "ankinayak_": "after you took your HTOWN break!!", "rayr9224": "😍🤩😍🤩😍🤩😍🤩", "amneetka": "Learning about #livetinted to ultimately living tinted🧡", "jeetakool": "I watched one of your videos with mama pandu. Loved it and been following you since.", "trinjabhi8598": "Your personality caught me plus a makeup vid knowing your also indian and of a brown skin tone", "jtineee": "After I sat next to you at the @pencilsofpromise gala in 2016! 🤗", "rekhapathak862": "Looking stunning", "jennyfertatteea": "Started watching your YouTube vids,3 and a half years ago I was looking for some brown girl's makeup hacks at the time I was already following @farahdhukai ,but as she didn't have any dark circles issues,I saw your vid,loved your personality so bubbly and cheerful and I am still faithfully following you and Farah seen you transform over times and improved your makeup skills and now you're killing it!!,I wish you all the best with your makeup launch and when it gets to Ireland am gonna get me...much love ❤️😘 Jen", "alifya_b7": "I started following you after I saw Radhi Devlukia Shetty in your promotional video", "_raivijay": "2019.", "faz0514": "A few months ago. You’re so sweet and beautiful! So sorry about all your vocal cord stuff. Hope the road you are on to recovery is a fast one! Stay strong. @deepica", "christine___2": "On YouTube and a year ago.", "riversdisguise": "Recently! After listening to your featured episode of @presssendpodcast", "monicabhatara": "@deepica stumbled upon your nyc apartment tour 1.5 years ago and loved what you did with the heirloom sari and you have me at that. making us #browngirl proud deepica!", "shyheena": "I started following you after I saw you in one of sephora's YouTube videos I think 🤔", "omamosu": "After seeing the vid of you styling that black girls natural hair 🙅🏾‍♀️😭. Came to your page & then saw how you did damage control vid w/ I think Tiarra Monet & others on how to ACTUALLY style natural hair. Was impressed you took out the time to do that!! Then I also loved your content & then I saw that you’re a HTown girl too... instantly had to follow 💫💞", "thekookoonest": "@deepica that’s a very good question, I think I randomly came across one of your makeup videos and I remember thinking, “wow, an YouTuber who’s Asian is doing make up tutorials, that’s awesome! I want to support her by following her.” And that was that. I still enjoy watching your vids! ☺️", "kkimberleep": "Just started following after catching up on @presssendpodcast with @chinaealexander ❤️🙌🤟", "nubo0o": "through melissa alatorre channel, a video with you and her chatting and getting ready and it was awesome. finished the video went to your channel and subscribed 😊", "tmorshed3865": "A year ago....i saw your ghumar Performence....since then i loved all your contents...all pandus...❤️👏 all the best...you doing great work with tinted!", "sanfransaf": "Birchbox! I used to look at their blog for all your picks bc I finally found a brown girl that could recommend colors that were suitable :-)", "virudaljith": "I randomly came across one of your vlogs with your mom & Dad ❤️ and I thought you guys were so adorable, started following you on YouTube & Instagram thereafter 🌟🙌 @deepica @padmasrimutyala", "jenngar1130": "@kamilabravo did your makeup and I said, WHO IS SHEEEEE and the rest is history😘😘", "makeupbynida_": "I really don’t remember lol!!", "halfbakedfruitcake": "After I found the red colour corrector video and loved your tone and your honesty ❤️", "summerheather": "After we gave a presentation together at the @_glamourgals GLTI! 💗💗💗", "syakirinrosik": "Think I mistaken you for @deepikapadukone but loved your content so didn’t unfollow :)", "rohinisharmamishra": "As soon as your orange lipstick concealer video was released on YouTube", "nav0620": "When I cam e across your red lipstick video online. Started to follow you on YouTube and started to follow you Instagram because I found your content relatable and it was nice to see a fellow brown girl who embraced the melatonin she was given. As I struggled with being \"darker\", you really helped me to start my self love journey🧡🧡🧡", "badassvibes__": "I accidentally stumbled upon a video of you clearing out your makeup and getting it organised. Loved that vid. Also you look fire 🔥❤️", "sonalsinha97": "Buzzfeed!", "drach311": "Back in your Birchbox days. I couldn’t believe there was a influencer that looked like me. I won one of your first giveaways 🥰 .Been cheering and following you ever since. 😘😘", "babipedras": "When I saw you in a video colab with Sona maybe a year ago", "skb.ontherun": "Omg so many years ago!! I think not too long after your red lipstick under the eyes video made headlines in New Zealand 💄💋", "saishree.mupparaju": "My aunt showed me your sisters wedding vlog!! I started following you after and now I am subscribed and have watched each of your videos multiple times!!!", "jacquesbenimble": "Since your days at Birchbox and doing videos on the side. I have loved watching you grow.", "mstar83": "After your red lipstick to conceal under eyes video", "sharmacherry": "The red lipstick hack video", "malniganesh366": "I started following you on YouTube last one n half years ago 😍😍 your honesty and your great attitude towards life that you have 😍😊😊I admire your parents ❤️😍😍love them", "krithikasreddy": "I started following you and Tinted last Jan during the first month of my career as a model. Naina introduced me and ever since, you've even my role model <3", "morygarcia": "I started following after I saw you do the red lipstick for dark circles segment on the Today show. 💄", "sdey26": "After I saw your you tube video on covering up dark circles with a red Lipstick. I was finally thrilled to find a you tuber with the same skin color as mine.", "bijpatel": "Through a friend! It was after your red lipstick for under eye circles came out! Since then I’ve been following you! 🙌🏽😘", "serenasteph": "When I saw your “anyone Can be a princess or prince” video! I was emotional because because growing up there was never a Hispanic princess I could relate to .. plus I’m from Texas and once I found out you were also from Texas I couldn’t stop following you! You made it so far and you weren’t from NYC or LA but you still made you way there and that made me believe in myself too and motivated me to continue to do things I’m also passionate about! Thank you! ❤️😘", "annalisa.wegner": "I start following you last year through @chinaealexander", "dianahariprashad": "After I saw you on the news doing the red lipstick thing under your eyes . 💕💕", "apurva1204": "When @aanamc mentioned you in her stories last year on women's day!", "dhirengwalani1999": "😍", "idasey": "After I saw your family videos on YouTube. I was hooked after that! I loved how genuine you were", "isha__500": "When I saw you have adorable parents and you have an important place for your family in your life. Also that you are ambitious, but staying grounded!", "mitli": "Birchbox video using red lipstick as a color corrector to conceal dark circles under your eyes. That’s when I knew I had to follow you because you were the first Indian I had seen on a social platform. ❤️", "jessy_labroy": "When I was looking for more brown girls to be inspired from ❤️", "christaylor_nyc": "✨✨✨", "anitha_with_a_h": "Uhm ever since your first viral vid! #darkeyecircles #longtimefan", "rishikan8": "After you wore a Shane falguni peakcock stunning gown!!!! Still your best look ever ❤️", "bhagyahegde5": "I think from the time you did what to do in New York video", "rosie_bridge": "Through dress your face tagging you on a makeover", "simsta": "When you did a class with @dressyourface ☺️", "inherpurpose": "When I met you @amidesai and V’s wedding!", "shilpy_sarguru": "Early on just around red lipstick video time!! 😘 We love and support you beautiful woman! @shnawesome @_kriti @charu26", "sofialatifoils": "It was the live tinted movement that brought you to my attention, on my personal insta account, and then I was inspired by you as a business owner and started following from this account earlier this year. You have said what has been in my mind for years.... I haven't seen role models growing up in the UK who look like me. I am now 45 and am loving seeing more people like me in the media, albeit much younger than me, but it is encouraging. It is also making me more brave at saying that I want more people like me to be visible to the older ladies who, like me, spent a very long time just trying to fit in. We didn't have social media when we were growing up, so we only had traditional magazines which were so limited in representing brown people. Carry on please, because it provides fuel to the fire of us older gals!", "ashleymlandry": "After meeting you at @krismikell wedding. I am so glad I did!!", "sadia_ahmad95": "When you did the Byrdie Beauty minis with Melissa Alatorre and Sona Gasparian!", "quicul": "A few months back after I saw you on a video trying on makeup looks for Macy’s I think. ❤️", "sulusesh": "4 years back when your Undereye video was just released. I was looking for tips on makeup to buy for my wedding and was most concerned about my dark circles :-)", "ikhlas_lolo": "I don't remember😂", "nidhi__umesh": "Cause of your darkcircle video and I fell in love with you cause of all the cute videos of your mom mamapandu gang🔥", "beaizpun": "I started following you after you did a collaboration with sona!! I thought you were funny si I decided to follow you!!", "priyankavaranassii": "When i was searching videos of Ms Raja kumari ,happend to see your makeup tutorial with @therajakumari trying to speak telugu😘 and which paved way to subscirbe pandu mama too😜", "raffia.hameed": "I started after I saw your you tube video akka then followed u on insta to see my akka excelling who is good and has her roots so deep with valuves is what I like about u akka", "snehajrathi": "Since your red lipstick as corrector video. 💋", "jay_jayaraj": "That lipstick corrector video! 🙂", "pammydevi": "I think I discovered you after that post with @sazan, where you've both had the amazing Indian outfits on! 😍😍 Its always great to see a brown girl with a voice that can make a difference 🙌👏🙏🔥", "prahlad6903": "Nice", "das_saheli": "4 years ago 😌💕 when you're growing yourself as an independent QUEEN 🔥", "kavyeah27": "When I saw your really cute and funny makeup tutorial in telugu😂", "shinydoc": "I was preparing a medical lecture and found a MU video on YouTube (searched tan skin makeup )...saw you and loved it! Great to see my colour skin tips and recommendations", "wambuikbr": "And i cant wait for the launch of tinted. You should visit kenya btw.specifically nakuru kenya. Will be waiting for you😍", "uncool_chic": "Forever ❤️ since ur makeup vids", "m_dipster": "Watched your YouTube videos and loved finally seeing an Indian face that felt genuine/real...also helped me recognize it wasn’t my face that was the issue...the products weren’t made for my skin. Simple yet crazy huh!", "ktomblin51515": "3+ years ago when you were at birchbox!", "dammit_janet": "When you were at Birchbox ! Saw you on one of their insta posts and have been following since 💘", "amreenk_artistry": "Discovered you from the @patrickstarrr Indian makeup video and stayed for the personality, genuineness and mama pandu 😁❤️", "piyali94": "I saw your video doing makeup like Kaushal and then saw more videos and found the pandu family , being Indian abroad I think connected us and since then I never left cause I am meant to stay !🤩🤩😘", "inimay_2000": "Saw your viral video on YouTube and realised you were also telugu and I suddenly felt represented cause I hadn’t seen any out there. Also cause everything you use makeup wise is a hot for me. Love from India 🌺❤️", "_keshav_b": "The time you did a collab with @patrickstarrr", "roothie_patootie": "Found you on IG explore pg lol. Loved your vibe and especially loved your YT vlogs. So I’ve stuck around ever since. ❤️", "priyo_mar": "Red lipstick for dark undereye !!", "amidesai": "After our H town connection obviously 💁🏽‍♀️❤️🤣 love you!!!!!! Soooo freakin excited for this next chapter 🤗", "michybe1": "I used to watch @arshiamoorjani and she mentioned you and ever since I’m so in love with not just the makeup but your warm personality... you are so genuine 💕", "cecedubie": "I started following you when you did the red lipstick under the eyes to cover dark circles and still following love watching what you post.", "ankita117": "After your be your own princess video 👌❤️", "sandysandhar": "Recently maybe a couple months ago", "sdulisse": "Birchbox era!", "themeliora": "My lovely friend @hellolavenderdesign shared your profile with me a couple of years ago and said that I look like you. She's absolutely correct, and I refer to you as twin in personality and looks. 😂😂 people at work asked if you were sister when they saw you in the Samsung commercial #notawkwardatall", "emmers752": "Like a year ago after I found your very first attempt at doing a makeup tutorial in Telugu. 😂 I’m trying to learn Telugu and got such a kick out of it", "kaitimkirkpatrick": "@serenagwolf was on @chinaealexander pod cast and I just kept being introduced to all these amazing people through them", "sourpatchkids_resses": "Red lipstick for undereye circles!! Around Birchbox time. 🤩", "imamandeepnagra": "Beautiful 😍😍 @deepica", "whosilseanywayew": "I followed you like maybe a bit more than a year ago and it was because of Melissa, after seeing one of your videos together, I saw my Mexican girl was friends with a Desi girl and I had to follow, no regrets!", "moniah92": "After I saw the video of u with arshia and sharifa ☺️", "xyto.skincare": "🙏", "brenna.mcca": "Just a couple weeks ago after listening to Press Send!", "pratyusha_nalluri": "I came to see your you tube video randomly and then realized you are a telugu girl and CEO so started following you 😍 such an inspiration you are @deepica", "nivaa_patell_": "Saw you in a buzzfeed video and was amazed to see an Indian girl doing makeup", "amna_044": "After randomly finding your video and just really liked your personality and your openness", "jfab77": "That Wonder Woman shot! For so many reasons...👌🏼✨👊🏼", "dedipsyeah": "Your first makeup tutorial in Telugu!", "rabia_uddin": "Since the red lipstick dark circle post on Buzzfeed years ago", "janizkrazy": "After you had that epic fail hair segment on a morning show. Then I went to your FB page and you did a follow up remediating the situation. I was like, ok I think I like her vibe. Everyone makes mistakes. ❤️", "theluxurybelle": "Birchbox days! ❤️", "taniatagle_": "After I did your makeup on @meeranayar ‘s wedding ✨", "sumsmk": "Your Birchbox days!!", "kalluuu_": "since 2015/16...found you on YouTube your content was so inspiring and relatable", "nekita.singh": "Attended a Glamour Gals Leadership event in NYC & have basically have been following since then! You gave a little “how too” on thank you letters & also gave a few lucky high school girls Birchbox boxes @deepica 😊😊", "kflores56": "I started following back when you were making videos for Birchbox. Everything you put out in the world keeps getting better and better. Can’t wait to hear more about your next chapter ❤️❤️❤️", "natasha_gangal": "I followed the same month you quit Birchbox!!", "sonanyc_": "Since I saw you in this video w @sazan , loved you since!!! https://youtu.be/_xrwipx1U-Q", "peppersugaar": "Just an hour ago. I stumbled upon your YouTube videos yesterday evening and I’ve been binging them ever since. From one Telugu girl to another, wow and weldone!! Loads of love and best wishes to you. Ps: my sister’s name is Deepik(c)a too & we are also from kakinada ❤️🥰🤷‍♀️", "vino_rana": "2015", "venus_the_vixen": "I saw you in a video with @alatorreee probably about a year ago and then just loved your content!", "glossyaffair": "Almost a year ago 💕", "meeranayar": "After college when we had that girls trip in Puerto Rico and y’all convinced me to get an instagram!!", "prateekg89": "3rd grade 😝 #OG", "nesimaa": "After your be your own princess YouTube video!", "styledaily365": "I started following you on You Tube before you started Live Tinted. It was great to get makeup and skincare tips from another Indian Girl. Then I followed Live Tinted from the very beginning. You are amazing. Thank you Deepica for everything you do and everything you share. You are having such a profound effect on so many people! 😀🙌", "lalabri": "A million years ago when you were just an itty bitty baby doing your own makeup in from of a camera 🤷🏻‍♀️🤗😚", "sapnamystery": "I saw an article about your red lipstick dark Circles hack!", "shilpamak": "Immediately after viral lipstick vid💄😘", "bankersd": "U were one of the first I started following on insta...either 2014 or 2015", "anapsingh": "Your red lipstick hack for girls of color like me. Omg that was so super cool and after that there was no turning back.", "itsme_shwetz": "Awesome!", "poojithachowdary44": "I accidentally saw a video of yours in YouTube and after watching that video, I watched all your video's 😂 #ilysm and obviously I subscribed to your channel and followed u on insta💓", "ambapunjabi": "Literally remember the day I read the article about your red lipstick hack and followed you since! Can’t believe how far you’ve come and what a beautiful and happy person you’ve grown to become ! Hard core city loving girl and you make me wanna move to LA!! Haha way too invested in your life for someone who literally has never met you 🤣😂❤️😍 sending love your way 💕", "itsageorgesday": "Your red lipstick video!", "gasini18": "Like a year or two before you started up live tinted which made me love you even more 😍💘😘❤️🤩 You’re literally my role model", "shaheen111": "After you were on the Today show I wanted to find out more about you. I’m Indian too so I can relate to a lot of what you say and do which is so refreshing 😊", "porternelson.eleanor": "Your Birchbox days!", "prasanna_ratnakar": "Ur grwm in telugu video.. I still remember ur erra colour lipstick 😄", "tulshi19": "As soon as I discovered you on YouTube !! Rewatched all your vlogs especially your sisters wedding vlog 😍😭😍", "smriti161": "About 2.5 years ago I was desperately looking for South Asian market tutorials to get me through a makeup look for medium to dark skin tones for a new years eve party. ❤️ I even have pictures of my makeup that day.", "namratapalit": "Almost 3 years back ♥️♥️", "sammm57": "@deepica when you worked at Birchbox!", "zenet_sujatha": "I accidentally saw a video of you and your mom in YouTube. Your mom was calling you Pandu, even my kid's Nick name is also same. I felt connected after watching it... And the thing which I liked the most was you are damn REAL..", "sshakes92": "I found you somewhere along the journey of a YouTube spiral but I subscribed because I genuinely love your attitude about life. Wishing you all the best on the next step of your career!", "laurenascher": "During your Birchbox days! Loved your video tutorials and had to follow 💛", "annielawless\nVerified": "Verified", "ladyvee822": "Right after you left Birchbox 🙌🏻", "farahpierce": "After being tagged for one of your giveaways, and I saw your insta story about your family. You seem genuine real person, not like those other two faced fake people.", "evedemilo": "Last year as you ehere starting up about tinted", "thefabdose": "When i saw a post on tinted.", "natalie.atl": "After listening to you on @presssendpodcast 💕", "d__o__n__n__a": "After I saw the red lipstick video 💯", "archanam": "And I like u more because u are what u are and u promote a positive message to women of all colour.", "lexybahn": "Birchbox days!", "purvislodgestyle": "After stumbling upon your YouTube video with @amidesai 💕💕💕 love you Indian gals 🙌🏼", "walkersparklefullofjoy": "Insta rabbit hole - was looking at videos of concealers or maybe facials oils voila ❤️here you were. You became a friend in my head 🙌🏽", "pooj10": "After I saw you tagged on one of @jessicaalba posts at some breakfast event. I was like who is disss brown girl?! Then subscribed to your YouTube channel because all your vids cracked me up, you were so personable and real :)", "farziazaman": "After I saw your collaboration with Sharifa and Arshia, and I was like wait a second- this is the red lipstick girl!! 💄👀 @deepica", "merena.n": "When you first put out your orange/red lipstick hack video on YouTube 🤗", "vijvlogs": "I cant even remember but it was from your early youtube days! You're one of the only youtubers I can relate due tp us being a similar skin colour and having dark circles!!!", "disealann": "Idk i think i saw ur video on my explore page", "marissaflorindisolan": "Lipstick concealer! 💋", "labelanu": "Randomly appeared on YouTube. I have two daughters almost your age. can totally relate to you. Love mama pandu’s cooking show too. I hope to see you and mama pandau in one of my Sarees one day !", "bue.nelle": "Shortly after your first red lipstick corrector video ❤️", "justtheempties": "Saw you in a @trestique ad and thought you were one of the most beautiful people I’ve ever seen.", "hemz8": "Afterchecking out your red lipstick dark circle hack ..u represented the indian skin tone which ws much needed🙌🏻", "sharonrjackson": "After your interview on @presssendpodcast", "vallyshabaichu": "Fell in love with your idea of tinted, personality and family,,,", "kulture_khazana": "When I heard about Tinted and just loved it 💕💕", "jerseydoc18": "@honeywhatscooking recommended you. As I’m into makeup :-)", "poojachurch": "My amazing friend recommended following you 💗💗💗 @kbellah0108 just last year 🤗", "ncginnyc": "red lipstick under eyes video on buzzfeed 😍", "alexbowie940": "I was scrolling through YouTube to watch something cool and you pop up and I watched the first video of you traveling back to Texas and preparing for Thanksgiving and your sisters wedding. After I watched it more than once that's where I started following you. I love your work and your personality and sense of humor and hard work.", "bombbeauty_1": "After you and @monicastylemuse did a vid together! 🧡", "thrivehigherdaily": "When you launched @livetinted and I was stoked to see a platform like it and then even more stoked that it was a Desi beautiful strong af woman behind it 😍", "rachelmonroe": "When you worked at Birchbox and were in their videos!", "aanibanaani": "Early 2013! I was still in high school and 6 years later I’m done with my bachelor and going to grad school and so much is changing but you and your videos have been a constant. Much love 💕", "sazan\nVerified": "Verified", "am.meadows": "You were still living in New York and I was struggling with crazy adult acne and my YouTube binge about acne led me to your channel and it’s been a pleasure to follow your journey! 🧡", "umul_vara": "Been following your for a while now. Don’t remember exactly when. I think I saw your Wonder Woman costume for Halloween. 🤗", "valeriasofia28": "When you did the spicy noodle challenge with @alatorreee! 😘 Love love you, can’t wait to see what’s next!!", "nanda15": "def wonder woman got me hooked on you..you brown skin beauty 😍", "lakshmikarri": "When I saw your South Indian Wonder Woman costume on Instagram!", "alinegalantinni": "Vi um vídeo seu se maquiando e percebi que seu tom de pele e formato do rosto são muito parecidos com os meus. Então comecei a te seguir para me maquiar igual a você. 🇧🇷", "always_shanamarie": "Love it’s been a while now and I have the shittiest memory because distractions. I found you through a bunch of influencers I was following at the time. I kept following you because I just like you. You’re more unique than a cut crease babe. No offense to cut creases. 💞", "sorahsays": "When Instagram became a thing when we were living together 👵🏼👵🏽", "sheels74": "When I saw your red lipstick hack for dark circles! You are amazing!", "__sahinnnn__": "I was procrastinating on homework and your videos just popped up as a recommendation. (This was a few years ago) And then I binge watched a bunch... Still got my homework done 🙌🙌🙌...just barely 😂", "fizzkhalifahh": "Your red lipstick hack... it was the first content I had seen specifically for brown skinned girls and I loved your message after that :) keep up the great work!! 💜💜", "sage_ness": "When I saw cute kiddo Tinted shirt 😍!", "satyakb1": "I think one of your tutorials was in a BuzzFeed listicle a few years ago, and this was around the time I was desperately trying to find influencers/reviewers of South Asian descent with skin tones similar to mine.", "tasha3t": "When I saw ur red lipstick video for dark circles and I found you on Instagram. ❤️💕", "sheena91": "I’ve started following you recently. You randomly appeared on my YouTube and I felt like I could really relate to you and some of the struggles you mentioned! Anyway, really enjoy your travel vlogs and you’ve definitely inspire me to pursue my actual dreams. 🤞. Thank you!!!!", "vidyeahh": "Good that you clicked it before staining it. 😂", "ekkatta": "After Birchbox videos", "rpatel910": "Tbh! IG has sponsored ad pop on the page. Your make video keep popping up. Thought decided to take a look of your make-up video. Since then I started following you. Couldn’t recall exactly how long ago was that? 😀", "keshitawithadollarsign": "After I found your video on the red dark spot corrector video", "browngirlpod": "When I started this podcast! Great to see a shift in the industry. Good luck with the next chapters 🌻", "aliachinkz": "January 2013 I was in the hospital, trying to past time and your video popped up on my YouTube", "thebostongirl": "I recently found @nitikachopra and her podcast, The Point of Pain. I listened to the episode you did with her just today and what you had to say really resonated with me. I love following people with a positive vibe!", "krismikell": "Middle school; me: weird foreign girl You: Indian girl who moved to Shreveport and it was too late to go to a ‘good’ school so you came to mine🤣🤣", "aiswarya9": "I have seen your videos on YouTube and IG but I actively started following you since you released your sisters engagement video. I felt instantly connected to you as an independent women who is also an Influencer, beauty guru, makeup tips for brown girls and also from my state in india. And I love watching your family vlogs a lot as well. 🤗", "divahhhx": "Red lipstick iPhone filming days 🤗", "vorshini_kaveti": "It came under my recommended youtube videos.... clicked it for fun... but watching makeup videos of similar skin tones is rare and helpful... 🙌🏽❤️👌🏻", "komalijonna": "I started following you when I searched up brown girl makeup tutorials cause I was so lost with makeup 😅 I got hooked after watching one video and was even more in awe when I realized that you were telugu!! I started following ya on social media soon after!! ❤", "kateydenno\nVerified": "Verified", "mrdrew3782": "A year ago. Started following Indian culture stuff on Instagram.", "reneee_75": "After watching your youtube videos", "thebestanvi": "I came across your video on YouTube about talking about arranged marriage in car with your parents. It was kinda relatable and cute. Your parents were mad chill btw. 😎 @deepica", "ashleyshannanzuniga": "Three years ago I was inspired by you following your dreams and your family life reminded me of how I am with mine💜", "jithesidhu": "After I was tag on your name", "theadventuresofmichelle": "The red under eye lipstick trick 🙌🏽 on YouTube", "ifra_hs": "I was looking for someone who has a similar complexion as me to help me figure my out my way with makeup and I happened to find u!", "nitapita786": "Birchbox days before the red lipstick trick went viral ❤️", "rashmikishore16": "Brown girl favorites 🙂", "vyoma_ghatpande": "2017😊", "akilareddy13": "I started following you since the very beginning when you had around 50k followers on Instagram and then watched your YouTube videos and found out you were a telugu girl following her dreams and followed you ever since!", "riddhi_kulkarni_": "Luckily just stumbled upon it!!", "mehreencharania": "Honestly, I was frustrated not being able to find a brown girl of my skin tone doing foundation reviews and that’s how I stumbled onto your channel! Then I found out you’re a Texan and a fellow longhorn!! 🙌🏾🙌🏾", "vibhubhardwajs": "@deepica I started following you late last year after I saw almost ALL your makeup videos before that 🤗 lots of love and support for your new ventures!", "meganpooran": "I saw you in @alatorreee video and instantly was in awe of you. Then we met and have had cute convos! I hope I get the opportunity to work with you someday ♥️🙋🏽‍♀️🎉", "embassyofglam": "In fashion week NY few years ago while you meet @dressyourface after you reconized her voice at the distance while both of you had taken over different brands IG live", "kajubabe": "Birchbox", "arundhati_baitmangalkar": "Last summer when a friend introduced me to your channel ❤️", "adeline0611": "Hahah the red lipstick video. Looks like many have the same answer", "itna_vars": "Saw you on the today show and found you on Instagram❤️", "mangobungalow": "Your pic showed up in the explore feed", "mukks80": "Oct 2015...the be your own princess video 👸🏽", "deepa__c": "You were in NY working for Birchbox still... i think... saw a youtube video when your ex bf sent flowers to your office ...", "davidjozeph": "2005 - thanks to @paigelizabeth88. U were a little wild for me but no regrets", "indianganesha": "I've been suscribed since the colour correcting video with the red lipstick. You have been empowering me since then. Lots of love from Uruguay 💜💜", "ranyal": "I don’t know how but I remember it was around the time I moved to LA in 2015 ! ❤", "salinaa.i": "I first started watching your YouTube videos on beauty/skincare and absolutely loved your channel and that led me to your IG and the tinted community. I am soooo here for representation and a supportive, non-judgmental community in the beauty industry and I think your values and platform 100% uplift other women and dismantle Eurocentric beauty standards that a lot of us brown girls were trying to conform to. Never stop doing you, the work you're doing is sooo important and inspirational 💕", "mutiyaaarr": "@deepica Last year I think. Huda beauty shared your video and It was refreshing to see an Indian face making the difference in beauty industry. You inspire me and many other Indian women and give us hope to be the best versions of ourselves one day.", "meghchap": "I saw your undereye lipstick tutorial and felt so proud that a Telugu girl was making it in the beauty industry. ❤️", "paulsalvad": "Since Barcelona and I am still wondering what your answer would be ;)", "sulx13": "I was intrigued by the red lipstick used as a corrector. After watching that video, I binge watched all your videos, and I was hooked! 😂❤️", "teddybear.allie": "I started when you I came across your tutorial on how to cover under eye circles (I think it was red lipstick , with concealer over ).", "mmmeenakshi24": "I saw you first in the saree draping video on BuzzFeed!", "mooky1230": "Undereye corrector with red lipstick!", "_kimberlina143_": "❤️❤️❤️❤️", "nanditakakar": "I randomly came across your page on insta and instantly fell in love with your brand and you", "fit.kaur": "When I saw the post of you saying that your voice was fading and that someone was helping you get to the bottom of it ❤️", "anusreesattaluri": "When I saw you in a birchbox video which now seems like ages ago. Love everything you do and represent ❤️", "ambreen_kashif216": "I found you from your video with Rajakumari and I loved your personality and especially the confidence. 🤗🤗 I've been subcribed ever since.", "hibba86": "After I heard you on a podcast... can’t remember the podcast but have followed you since!", "that_girl_in_new_york": "Birchbox days!!", "thepluckyduck": "Since your time at Birchbox!", "aasthamalhotra": "after Buzzfeed did a listicle on the best desi youtubers back in the day 🤗", "ootkala": "It’s probably been 2-3 years now? I heard from a friend (Veda) that your assistant in NY was her friend! So I had to check out your profile and see what it’s all about. Since then I’ve love relating to you about being telugu, the goofyness of our parents, makeup love, and your business overall! Love every part of what you do ❤️😘", "kiran.kaur28": "Birchbox❤️", "blichtner181": "Birchbox days", "arcook8": "I don’t remember how but it was back in NYC before you moved and the apartment flooded!"}