{"meena\nVerified": "Verified", "deekapadiyaofficial": "True!! And so excited for you!!", "sweetlifeofamal": "Happy for you congrats 🙌🏽", "shamzmakeupartistry": "❤️ @deepica I wishing nothing less than 10000000000% all the best love 😍 can’t wait for the announcement ❤️", "tayyagari": "❤️❤️❤️", "jenmichellebaird": "❤️❤️❤️❤️❤️❤️❤️❤️❤️You are amazing and a blessing! I am so happy for you! I can’t wait! 💖", "itstanyeah_": "♥️ can’t wait", "rachnap123": "🙌🏽", "browngirlglobal": "Omg this is so exciting!! Can’t wait to see what you have in store!! ❤️", "aasheekaa": "Can’t wait for the reveal!!! So proud of you!!! One BIGGG leap for #browngirls everywhere! ❤️", "sincerelysreej": "Omg I was just watching your IG story and it was making ME nervous lol! So excited for you!!", "taarimaa": "Sending you lots of love on your new venture 💗💗", "holichicbymegha": "🙏🏼🙌🏽", "houseofmeenari": "Awesome.. ♥️", "dcliz82": "I literally just watched your YouTube video on your journey and am so inspired by what you have done and are accomplishing! Thank you for making #browngirlmagic and #everygirlmagic for those of us that did not grow up seeing ourselves represented! Can not wait to see what is getting ready to launch! 🤗", "hardeep6778": "Where is this temple", "deepakdugarmd": "congratulations deepica!", "rekhapathak862": "Huge building❤️", "sonaparmar": "I’ve been to this temple once , very beautiful and good vibes 🙏🌿🌼💕", "jenny_p28": "🙌🏽🙌🏽🙌🏽💕💕💕 I CANT WAIT", "sage_ness": "Love that you do this! Love that you shared this! You're rocking it !!! 💜💜💜", "mintu7776": "Am astrologer and good priest if u want know ,and if u any problems can u tell me", "theluxurybelle": "So excited for you. Sending all of the love & positive vibes your way. XOXO", "shreejapotluri": "I woke up at 6 am today just to make sure I didn’t miss anything", "masoomminawala\nVerified": "Verified", "blksbbth13": "as a Hindu growing up, I know exactly what you mean. The temple is a safe place. Keep blossoming in your wonderful brown excellence 💕✊🏽", "franchescablaize": "I’m very much looking forward to your next big project @deepica. You have moved the conversation forward and created such an incredibly welcoming, diverse, positive space in the beauty community with @livetinted. Everything is done with such intentionality, purpose and love. Many blessings to you and your brand’s continued success. I look forward to this week!", "mouni_vishwanath": "Plzz akka whatever ur launching plzz ships to india plzz akka plzzz akka even i want to buy tshirt #myskinisnotatrend", "flikiss": "Congrats! So excited and happy for you! Can’t wait 😁", "deepti_tummala": "Can’t wait !!! All the very best of luck with everything !!!", "anjanachowdiah": "This is so exiting!!! Idc what it is you already have my broke college student money 😤", "pree_theeventplanner": "Amazing. So proud of you! Keep doing the world some good. Everyone needs a little sprinkle of @deepica Stay amazing blessed and healthy. You got this!💕", "riaparikh": "CANNOT WAIT! So much love to you ❤️🔥🙌🏼", "everyday.like.this": "@marioladiaz if this doesn’t ship to Aus. Buy and send from LA 😂😍", "mowbilly": "So excited 💪🏽💛", "miss_nayys": "An official makeup line? wishing you the best of luck!!!", "callangreen": "💕💕💕 excited for you deeps!", "lipthimakb": "So excited for you!! Looking forward to what you are going to announce! 🧡🧡 #livetinted", "lakshsarkar": "Here’s to new beginnings!! I’ve connected with you in 2015 & watched you grow since then . Can’t wait to see what you’ve been working on 😘😘", "jmpatel1121": "💜💛💜Please help me and my team to raise money for the first ever Miles 4 Moms walk/run event to help raise money and awareness for the Women’s Resource Center to End Domestic Violence💜💛💜 Link in bio 🌟  https://www.gofundme.com/d8xqh6-miles-for-moms?member=2139686", "sumitabanerjee": "Incredibly excited for you @deepica ❤️", "reematdesigns_": "Soooooooo proud of you!! To new beginnings!! So excited!!", "mariathattil": "So proud of you for all you’ve achieved - you’ve made waves already, can’t wait to see what’s to come. ❤️", "diipakhosla\nVerified": "Verified", "mykitsch\nVerified": "Verified", "anaghavinayak": "So excited for you!!❤️", "purvislodgestyle": "💛💛💛", "jagruthimaddela": "Hopefully, whatever you're launching ships to India 😍 Telugu fam rooting for you. ❤️", "makeupbypiru": "💖", "mohini_09": "Excited and can’t wait🎉🎉", "sashsinghh": "@hemanshikumar_ love this", "vaishu.k13": "Super excited for you and for the future of tinted! ❤️❤️❤️", "eliselieberth": "👏", "shretamala": "Yay so excited for you! Whatever it is please tell me it ships internationally to New Zealand 😂 ready to purchase!!!", "sry.kota": "I am so excited for what's to come! I'm supporting you all the way! I love you so much, your my inspiration 💗 xoxo a Telugu sister 💞", "shruberry30": "I have been here and it is fantastic'", "hamelpatel_\nVerified": "Verified", "nealrinsta": "Spirituality connects you to your Divine self. Once you connect with your higher self, all obstacles melt away from your path. Good call and good luck on whatever you are announcing! 👍", "ramyasinsta": "I can’t wait for what you’re about to announce! I don’t know what it is, but I am going to fully support you no matter what! 💛", "secretofdd\nVerified": "Verified", "verydeeppoems": "Kinda confused by the whole “I’m not religious but I’m spiritual” thing. Hinduism is a spiritual practice and not considered a religion in theology. Hinduism has been appropriated by the West in terms of the foods, yoga, “transcendental meditation”, etc. And it’s been repackaged as spirituality :/. Anyway, love what you do and can’t wait to see what you announce!! ❤️🙌😍", "whitneyprior": "I’m so proud of you 😭❤️👏🏻", "apintolife": "I’m so excited deeps!!!😍", "littlebrownone09": "@deepica here’s to lots of love, many blessings and lots of happiness in the journey ahead and to the desires of your heart cling to fruition in ways that are better than you imagined #LiveTinted #BrownGirlMagic #GirlPower #LadkhiPower", "arika\nVerified": "Verified", "priyanka03i": "One of my favorite temple to visit in Cali ❤️", "davidlopezzz\nVerified": "Verified", "bhagvat1199": "You should come visit the BAPS Swaminarayan Mandir in Chino Hills, CA. It’s 50 minutes from LA but it’s worth the traffic and drive.", "_pharmartist_": "🧡 Watching your growth has been incredible! Sometimes a mind at peace and calmness is what we seek in such a whirlwind of events😘and we’re all here to support you in whichever paths you take! 🧡", "that_pattikaattu_ponnu": "@deepica All the very best for your new beginnings and I can’t wait to learn what it is, so excited❤️❤️", "utopialife12345": "Sending you positive energy this week. You’re so inspiring!!", "catchingkattu": "Any idea of when we should be expecting the announcement @deepica ?", "rosh_knee_": "Yessss so excited!!", "tigerbean": "SO SO STOKED for this launch, Deepica!!", "stylushcouture": "@bikasan you took me here:) All the best @deepica 😍", "bijpatel": "So excited for you and can’t wait!!! 🙌🏽", "sajanibarot": "Best of luck !! Can’t wait to hear what it is", "dee__mich": "\"It's more so the spirituality of being at any house of worship that I love.\" You worded it so perfectly. That's exactly how I feel.", "therealkamie\nVerified": "Verified", "hangingwithhemali": "Wishing you continued success, and I love that you’re thankful to God. Surrounding yourself in those positive and calming vibrations is going to take you even further ❤️ when the vision seems hard to see! So awesome to see you’re doing this and sharing this with everyone... knowing your life must be insanely busy and demanding! #priorities #faith #blessed This post made me so happy ❤️😊💯", "jdalfeen": "so proud deepidoo cannot wait 😍❤️", "makeupby.karishma": "What a beautiful mandhir😍🙏🙏🙏", "kittyjrawlings": "Don’t even know what Deeps is about to do, but I stayed my a** away from Sephora and Ulta...just in case the announcement gives me a reason to go. So inspired by you, I haven’t the words to express it. Because of your example, there are many of us gaining the courage to launch whatever it is we have in our hearts. You embody Langston Hughes’ words “hold fast to dreams.” Wishing you every blessing in the manifestation of your heart’s deepest prayers, and for your new chapter. 😘😘", "laurengores\nVerified": "Verified", "rabsbeauty": "❤️❤️", "stayreddy": "love you sista!!❤️", "imamandeepnagra": "😍😍", "opallbeauty": "@somya_prakash remember when we got stranded here 😩😂", "justanothermuslimmom": "@deepica I have no idea what it is, but I’ve been following you for years and it’s always been great to see your journey! 🙌🏼🙌🏼🙌🏼🙌🏼", "getjerglowon": "Take my money. It's yours. I want whatever you're launching", "hi5_kemii": "❤️❤️❤️", "padmavathii": "Omg!!! My favorite Influencer is about to do something lit🔥🔥 Can’t wait for it fellow telugu sista ❤️", "shaktinaran": "Wherever your heart and soul has lead you to, I wish you nothing but the best and an abundance of blessings and love!! Cheers to you and new adventures! Can’t wait for your big reveal!♥️♥️", "itsdeeponnu": "I am SO READY for this launch. Already so proud of you ❤️", "rianasingh_": "❤️🙏🏻🙏🏻🙏🏻🙏🏻 congrats to you girl!", "sorahsays": "😱😱😱😱 cannot freakin wait!", "ksavijoshi": "Beautiful ♥️", "roshinancy": "💕💞😍 Cannot wait❣", "mirapatelll": "😍❤️", "shwetavijaynair": "@deepica congrats in advance. It’s going to be epic!", "suchishah26": "Super excited for you! To new beginnings🌟❤️", "nextwithnita\nVerified": "Verified", "skb.ontherun": "🙌🏽 Can’t wait to hear your announcement!", "ceceolisa\nVerified": "Verified", "drbhanusali\nVerified": "Verified", "nurun_alam": "Your smile and zest for life beams energy!! No doubt what you are about to announce will be a huge hit! Keep shining 💎❤️🙌🏼🙏🏼", "leftymasala": "God has your back 🙏🏽", "wanderingdurbangirl": "So much of anticipation, but I think I figured it out hehe. But! No spoilers. You're amazing, the universe not only manifests what we ask for, but what we work for. You're an absolute example of that @deepica! 🧡 🔥 😍", "glambythulasy": "I can’t waitttt!!! Wish you all the success in the world ❤️", "bhoomerang": "🙏🏽😍❤️", "runningonavocados": "Love this and can’t wait to see what are launching 💛💛", "riya.madhyani": "Can’t wait to hear the news!! So excited for you 💛 here’s to new beginnings!", "jayshetty\nVerified": "Verified", "learningwithmsali": "Can’t wait to hear the exciting news!! @deepica 😍", "heygorjess\nVerified": "Verified", "zeetaylor898": "❤️", "sanskarteaching": "To new beginnings, sending you lots of love and courage😍🤗", "vp__realtor": "@iamveenakumar", "kohaar": "K, skipping Sephora rouge sale for whatever it is you launching 😂", "pariejoshi": "I'm so excited for you and for everyone else 💗", "deepanair04": "Can’t wait🙏🏽🙏🏽", "kiranandbaldeep": "Get emmmm deeps! 🙌🏽", "shilpdhar": "So true, I feel calm when I am at a temple 🙏❤", "tulshi19": "Can’t wait I’m so excited 💕", "honeywhatscooking": "Is this Malibu mandir? It’s so nice. Can’t wait to see what your announcement is. My guess is you have your own makeup Line. Just a guess. ☺️", "vishika_03": "That reminds me of hindu temple in Livermore 😍 it looks exactly same", "reetudg": "So proud of you!!! 🙌🏽", "vancitymomma": "Beautiful!", "miri_ramp": "Can’t wait to hear it👍👍👍", "eco_akila": "This reminds me of Meenakshi temple in Houston! I love going there to connect spiritually and reliving some great childhood memories! #tonewbeginnings can't wait!! 😊", "tata.padma": "Hi Depica, is this the Meenakshi temple by any chance? You are a sweet young lady. Keep up the good work!!!.", "gaurikon": "Good luck Deepica! We are all rooting for you 🙌", "diarrhaxo": "😍😍😍😍😍", "zinniabukhari": "To new beginnings! ❤️", "amna_k": "How exciting, can’t wait for the announcement!! 🙌🏼", "nehaassar": "❤️❤️❤️", "masalababynyc\nVerified": "Verified", "deepa.rad": "Love this!!! ❤️❤️❤️❤️", "abir.aouida": "Can't wait ❤️❤️❤️", "nishka_vipul": "AHHH I was literally at the temple the same time!! Wish I could’ve met my inspirational idol! Can’t wait to see what you have in store for us!", "roseyraj": "Wishing you the best!! ❤️👍🏽👍🏽", "luxevagabond": "Temples have that beautiful energy. All the best on your upcoming adventure.", "nilublue13": "To new beginnings! ❤️", "beautybydrkay": "Can’t wait❤️❤️❤️", "annielawless\nVerified": "Verified", "carla.vionette": "❤️❤️👏🏼👏🏼👏🏼👏🏼", "lanapatelxoxo": "Yasssssssss to new beginnings! Love this pic, love this Mandir and love everything that you're doing! You're absolutely incredible! 😍 So Proud of you Deeps! 😍", "christaylor_nyc": "✨✨✨", "reallifelynn": "The only thing you hated about it was the truth within you and having to face that. You’re such an inspiration. I am connecting to my spirituality too and means facing some difficult truths about myself", "christendominique\nVerified": "Verified", "srupii": "Was just about to buy stuff from fashionnova but I’ll save my money for you instead 🤣🤷🏾‍♀️🤷🏾‍♀️", "miz_fabulos": "😍🙏💕", "patel_nilam": "We went there! @mpeeezy1", "lisamishramusic\nVerified": "Verified", "keishabissram": "❤️❤️❤️❤️❤️❤️❤️", "sherryjhawar": "Love this and agree so much about temple! 🙏🏾🙌🏾💪🏾🤞🏾 Its going to be a great week!!🤜🏾💥🤛🏾", "deryachawla": "So proud of you Deeps! Cant wait for your big announcement 😍!", "aadityaayadav06": "Hey Deepica, your youtube videos are so full of positivity n love , You are an inspiration in many ways !! Lots of love !! ❤️❤️", "arteekumar": "So excited for you my friend!!! 👏", "hijabilife": "Can’t wait to hear the news! To new beginnings @deepica", "balletcrazie": "💜💜💜💜", "life_is_vertigo": "I'm glad you had a great experience @deepica This is the temple my family goes to... has for years. While I'm not an actively practicing Hindu, I still find peace and inspiration whenever I go to temple.", "lisaadave": "To new beginnings! Xx from Malaysia ♥️", "kaviladnier1111": "I feel the same way about any house of worship but do love the calm that comes from being at this temple. Congrats in advance!", "rubinamakeup": "So exciting! Can't wait for that brown girl magic! 😉😘❤", "dr_darshini": "I hear you girl 😍 looking forward to your news!", "lizetteludwig_rn": "Can’t wait to hear more!", "lipstickcoffeehustle": "So excited for what's coming up 😍😍 can't wait❤️", "shanitha_s": "What a beautiful temple!!", "mua.waruna": "♥️🙏🏾", "alabamastatter": "💪🏻💪🏻💪🏻💪🏻🙏🏻🙏🏻🙏🏻😘", "madras.ponnu": "@deepica what you are doing for brown girls and girls in general is just amazing!!! BESTEST of wishes to your endeavour. may balaji be with you every step of the way. 😊❤️", "soniabehal_": "Congratulations 🎉🎊 #tonewbeginnings #stayhappyandblessedalways so proud love you 😍 visit Palo Alto!", "vilekharizo": "Beautiful ❤️", "suprabharay": "😀terrific", "sunrayinnyc": "I went to the Hindu temple in Flushing recently and had a similar experience. Bringing my non-Indian BF and explaining what prasad is and his nervous look when he had to take his shoes off made me laugh, but also made me really nostalgic. I loved reconnecting with that part of myself I nearly forgot. ❤️", "dr.rupie": "Excited for you! 🙏🏽", "ohappypriya": "What a beautiful temple!! And the most beautiful girl sitting on those steps 😍. The best is yet to come!!", "shines_withrp": "Ahhh can not wait", "soniapateljain": "Excited for what’s next for you!", "amidesai": "To new beginnings 🙌🏽❤️🤗", "vickytsai\nVerified": "Verified", "vickyvictorious": "🕉🙏🕉", "iam.khyati": "Amazing!🙌🏽💛", "moodsandviews": "🖤🖤🖤", "always_shanamarie": "Are you gonna be a talk show host?? 🤔 Whatever is, cant wait to see ya do more big things!!! 👏", "modernmarigoldbooks": "So exciting! Wishing you all the best and the most success in this next chapter of your life 💗", "shiwaniiip": "I can’t wait 💛 And I Love This picture", "sharonj0seph": "Deepica I love you! ❤️💚+All coloured hearts.", "jjanhavi": "I am going to buy everything that you bring to the market!!! #browngirlmagic #desigirls", "bseema101\nVerified": "Verified", "thechicmamas\nVerified": "Verified", "niharika_katyal": "I really can't wait for this 😍😍", "nabela\nVerified": "Verified", "diviathani": "Sending you good vibes from the motherland ❤️🙏❤️", "nitikachopra": "SO PROUD OF YOU MY LOVE!!!!", "the_mirror_image_sa": "I can’t wait to hear what you’ve been working on 🤗🤗🤗", "anura_desai": "My mother told me to do yoga and meditation, as we were around so many swamis growing up. I got dragged along with my long face to all the functions. Now as an adult, I practice but also teach yoga and meditation—to kids. It’s the only thing (and my family) that feels real in this crazy world. The world needs people like you, who are so real. Keep connecting back to that feeling...then nothing will stop you. You’ve got a purpose bigger than you know. Lots of love and all the best! 💕", "shilpy_sarguru": "💗💗💗", "iamdeepalove": "That’s so true about being in any house of worship. I was also raised Hindu. And with age and also wisdom (debatable on the latter), I find peace and calm in any house of worship. I pray to a higher power and that’s what matters. 🕉🙏🏽🕉", "arshiamoorjani\nVerified": "Verified", "la_vn_rose": "To new beginnings 🙏🏽💫", "drsarmelasunder": "I know exactly what you mean about how being at temple or any house of worship can have a calming effect and give you clarity. Especially love the Malibu Temple. Good luck with your new venture ♥️", "tishaelauren": "We’re so exited to hear it 😍", "rupsidaisy": "I want to go here @ranjanirr it looks so beautiful💓", "vshameni": "God bless you! Wishing all the success in the world!!🙏🙏🙌🙌🙌", "tenipanosian\nVerified": "Verified", "princessmayali": "I can not wait to hear!!! ❤️", "shilparshah\nVerified": "Verified", "ramprasad_gudepu": "Awwww nice.", "sasheechandran": "We’re you there yesterday?! I was too! ✨✨", "kulture_khazana": "🙏🙏🙏 all the love and luck to you. Is this the Malibu temple? My son was in love with this temple when we visited. The positivity and spiritual energy there was amazing", "prahlad6903": "Nice", "beingphani": "All the best for ur new Project👍.", "vsirisha": "I think I know what it is. And don't worry, you'll do amazing. Love and luck to you! 🖤", "andreamarienavarro": "❤️❤️", "nicolemehta": "same!", "bellafawzi_": "💛💛💛💛💛", "sherm_lion": "Sending good vibes your way", "sejly": "your own beauty / makeup line?! 😍", "marianna_hewitt\nVerified": "Verified"}