{"daniellembalsara": "Beautiful!", "trevinofamily_231": "I’m not sure if this was asked..where’d you get that skirt? Orange looks amazing on you 😍", "naagdarna": "Give me one suggestion for me plz", "aliya_z_91": "Stunning 🔥🔥", "itscjfranco\nVerified": "Verified", "rayr9224": "😍😍😍😍😍😍😍😍😍😍", "phenomenalphern39": "🔥🔥🔥🔥🔥", "withsamiraa": "Where is this skirt from", "lanapatelxoxo": "Deeps I'm obsessed with this pic and this look! But question, hmm how did you learn to love yourself after everything you went through growing up in Sugarland being the minority in the south where south Asian beauty and culture weren't celebrated? How do you deal with self doubt?", "liax92": "Outfit details please. ❤️", "_king_classico_": "Amma ye vuru medhi??😂😅", "am_i_into_u": "That's Wat I call An Indian princess to be", "jnsind": "I need job Ma'am. Can you help ?", "agy_deutsch": "Love love this elegant look 🧡🧡🧡🧡🧡🧡", "tjahnavi8": "You are such an inspiration akka - loads and loads of love from india 😘😘😘😘 thanks for being such an inspiration 😍😍😘😘😘😘", "malinisarma": "Love your videos, the are a true inspiration. I use them to motivate myself to keep moving forward with my dream. Keep them coming. Very proud of you and where you are taking live tinted.", "rekhapathak862": "Colour coordination is great", "vasudhaprabhala": "@deepica Where is the skirt from?", "thebrand_beline": "Love this skirt😍😍😍", "chrisjon04007": "damn u are super hot & sxxy", "official_glaza": "That skirt tho 🧡", "_starlit_": "Everything about this picture is gorgeous", "sanju_royal_": "So cute and beautiful", "munali2015": "Skirt gorgeous, where from?", "shailja_sharma05": "Do you deliver to Dubai?", "sunny_nimmagadda": "❤️", "aman_s_w_kaur": "U look like deepika padukone❤️ @deepica", "ramyasinsta": "How do you use the color corrector with powder foundation?", "hannahflinkman": "Should I shave my head tomorrow??", "lakshmissandhya": "What do you think is the most important lesson you learned during huestick product development process?", "moonpiexox": "How is the huestick on the lips in terms of being transfer resistant? I like the colours for lip use but if I have to reapply it every 10 min... :/ :( thank you!", "shrishtea_": "How to reduce dullness and acne?", "tanyaa_1018": "💓💓🔥", "jppandey21": "Lovely. Always smile. Sweet KISS you my lovely friend 🙂👄💋💋", "masheraliraja": "Lovely", "opulence_humanized": "Love your work love your passion love your family love your attitude of stay grounded love your Fack you're a Telugu girl 😉 love the way inspire a young passionate enterprenuers like me on daily basis to believe in what we do and push harder and take it on day at a time 💖 just one question what your futuristic plans for livetinted💞", "iamruby": "🔥🔥🔥🙏🏽", "rajmakanaboina": "When is the Hawai trip planned with The Pandu’s?", "soy_akhila": "Can live tinted come solution with facial hair problems", "ramprasad_gudepu": "@deepica Ammo ni ammaa goppadee. andham pogesi kannadee 🎶 beautiful💕", "imamandeepnagra": "Stunning 🧡🧡🧡", "pizzamonster20": "Fav bollywood song ??? @deepica", "mentalhealthbhavanas": "What’s your go-to self-care activity that you’re consistently using when you’re overwhelmed or stressed? Ps. Congratulations 💕", "thefacebykase": "Wealth", "ash2fly4u": "What drives you and keeps you motivated each and every day? You look beautiful 😍😍", "ahsanactive": "What's your biggest goal in life right now?", "ravbola03": "@deepica how did u start your business?", "rachanakrishna": "Hi congratulations you are doing so well, really would like to purchase your products. Do you ship to Australia?xx", "zoo_zo0": "Will you be my mentor @deepica", "nayali.la": "How do you find collaborations you feel passionate about?", "ankj": "How do you keep yourself motivated?", "courtneydaileyphotography": "Stunning! 😍", "skb.ontherun": "No questions as all of mine have been covered already haha! But you are an absolute superstar and inspiration and I cannot wait to see what comes next 🙌🏽 .... also, I love your skirt 🧡", "shawnpayne4265": "Stunningly beautiful!", "patelshay9": "You are true inspiration. Thanks for creating a great product. Can’t wait to try it!", "mariannahamilton": "What made you strive to get where you are now? @deepica", "drhusnazarakhan": "Total babe 🔥", "jay_jayaraj": "How do you de-stress? 🤗 And, congrats on the launch!", "blessleeeee": "I just started a page @huemancompany that talks about colorism in India which is a very serious and real issue. But it’s just me writing articles and I find trouble getting traffic to the page. Can you guide me through what can be done since you have done it all. Thank you", "sangeetharrr": "Brown girl to brown girl, how do you deal with your parents pressuring you to settle down and get married? I feel like it's never ending 😭", "enhance03": "Love that outfit 😍😍", "paologuatelli": "Wonderful idea... congratulations!", "swabha": "How do you do time management? Does someone help you manage your insta page, and schedule in general? I feel like you’re so good at it, I want some tips! Also, are you an early morning person, does that help??", "jaimekrzos": "Love your outfit!! Best piece of business advice you’ve received? And what do you wish you would have known when starting your business?", "veni.vidi.vici.and.slept": "I would love to know how you practice a positive mental attitude. I understand you're surrounded by great family and friends but what are your rituals/practices/routine on overcoming obstacles in life and focusing on your goals? Do you meditate a fair bit too? You're a great role model btw! ♥️", "singaporegirlinoz": "What’s next after the huestick? What can we expect from live tinted in the future?", "iheart90fashion": "How do you get such clear skin?", "hellomynameiscandyce": "Love that orange skirt!! @lisapotterdixon I found your next summer go to look!!!", "shubhangi_pai": "When will you have a meet up in dc? I am desperate to meet you.", "dianamadison\nVerified": "Verified", "krithikap11": "This isn't a question, but I'm majorly makeup challenged! Would love a makeup for dummies series with very basic ten products to use.'", "vsirisha": "How've you been doing? Mentally and psychically? 💖", "zassida": "When are you going to Milan?", "rachelolach": "How is the hue stick different from nudesticks multi sticks? Or would you compare it to any other products? Love you!! ❤️", "okay_ankita": "this outfit!!!!😻😻", "kshamak_": "What useful advice do you have for future pediatricians", "makeupbypradhita": "where do I start with my beauty channel??", "blksbbth13": "I know you touched on this before, but I’m pre-med and looking into going into skincare, etc. Been a huge supporter since the beginning of your YouTube days, was wondering when Tinted might be hiring and what you guys are hiring for? Would love to work in the beauty industry with fellow girls of the same nationality and inspiration 💕", "jaleesajaikaran": "It’s been a minute I’ve seen you. Would love to catch up & do your makeup! @deepica", "samhinorg": "Hello!! You’ve talked previously about mental health- our question is have you ever witnessed mental health related dialects within South Asian families (away from all the fuss and cameras but just as normal dinner table conversation), and if not how would you propose today’s millennials to start that conversation either with elders or just people with strict South Asian mentality in general? We are a south asian group focused on providing mental health related resources for people in our community ! ♥️", "pmhandor": "I am one of your senior fans and always looking for good foundation/CC cream/ tinted moisturizer for Asian/East Indian complexions, especially foundation. While you have launched the sticks to take care of discoloration, are you planning to compliment this with a foundation/CC cream, etc?", "_jhenya": "Gorgeous 🧡🧡", "riyankakhandelwal": "Hi @deepica really loved how u made makeup for dark circles so easy...when are u launching here in India? I am eagerly wanting ti try ur products😍", "jushme66": "You 100% inspire me to wear vibrant colors!", "madhurya_gajula": "any advice you would have given your 18 y/o self?", "reshamdhaduk": "Congratulations on a great launch of @livetinted btw!", "spiritofbabylon73": "No questions 😊 just wanted to say hi and keep up the good work!", "tessnanak": "Will tint’d ever go into foundations specifically for indian women ? Our skin tones are sooo special lol you can never find the right foundation. Love from 🇿🇦", "nehachokkalingam": "Hi Deepica, U r such a inspiration ! Totally love the way you have come so far with all your efforts ! Congratulations 🎉 and all the very best for your future endeavors 👍🏼😘😘", "ariochoa_": "So gorgeous 😍😍😍🍊🍊", "sharany_saladi": "Hello, how did you deal with bad boyfriends???", "rupalpatelinc": "So beautiful!!", "alifya_b7": "👌🏽 Love the outfit! 😘❤️", "isabelhrx": "How do you do it To always being stylish? Where is that skirt from😍😍😍", "pareesanabi": "How did you overcome the negative comments or actions when pursuing this career??", "karengill1102": "No questions just wanted to your amazing and I love that my daughter will have someone like you as role model, there was a major lack of that when I was growing up!!! Keep doing what your doing!!!!!! 👌🏽💜", "legit_rbs": "Power move w the H belt 🏋🏽‍♀️", "raynashah": "Love the way orange looks on you, beautiful❤️ Would you be interested in doing an interview to share your story and empower younger generation of kids to follow their passions?", "radhika_deshpande19": "@deepica where did u get the skirt from? Loved the color.", "lovely_msbunch": "No question, you look beautiful ❤️", "lilysbeauty.co.uk": "No question just a 'hey girl!' 🤣", "alogossai": "Do you need an in-house attorney? So proud and inspired by all that you are doing and would love to work for/with you as you grow!", "mumbairose": "You are so pretty yet down to earth thank you for that. Why did you not follow the path of your parents and become and Doctor , how did you know you were gonna do so well in Fashion and makeup industry @deepica ! You are amazing", "sheenj04": "When are you guys planning for global shipping for the huestick? Would love this in India", "salohamas": "Hi lovely @deepica I don’t have any questions just want to tell u your an amazing human being and love u much 😍😍😍😍", "seabass106": "How many people believed in your idea in the beginning and how did you cope with rejection?", "rupaljuranmd": "When did you have the inspiration to create a product line? Was it something you were interested in all along, or when your YT channel took off? Did you have a few different business ideas before landing on Huesticks? TIA!!", "kritzmat": "When are the huesticks coming to India..if at all?", "fmonowar": "How was it working for the business side of beauty? And what have you learned from that experience and how are you using that to better your brand?", "frolic.fatima": "Hey let me start off by telling you I am so so so inspired of you, I am also a fellow hyderabadi. I am currently living in china and working as a teacher and I also started an online business on Instagram Called @stud.cn . Seeing you going after what you love and achieving in gives me so much inspiration. I started my page @frolic.fatima talking about how staying positive and working hard can help me get where I am today: I would mean a lot if you could give my page a shoutout as I really want to let people know its ok to make mistakes and grow. Seeing your page and the work you do wants me wanna do better and go after my dreams as I think we can achieve anything we set our heart on. Even if you don’t give me a shout out it’s would be completely alright. I just want to know i look up to you how you Handle work and your personal life . P.s my family lives in Houston and I lived in Houston while in high school and uni. Sending you lots of love and good vibes and lots of success for @livetinted all the way from China ❤️❤️❤️", "anshulchhabs": "You’ve been an inspiration for years and I’m trying to grow a business of my own now! I would love to grab a coffee with you when in LA. Are you up for meeting and mentoring? 😊", "sophiesajnani": "Hi Deepica, Sophie here! I’m 13 and so happy to see a fellow Indian YouTuber! (I’m half North Indian). I have my own fashion company @taschenbags and am going to be in LA the weekend of June 2nd. Would love to meet, you are a huge inspo to me! Xoxo", "shaayal_k": "Hi just wanted to say you’re such an inspiration!! Keep killin the game", "wannabeechef": "You are inspiring! Do you believe you have to work all the time to have a successful business? Like where is the balance?! I feel like I do...and it's such a hamster wheel sometimes.", "_vineelareddy": "What motivates you each day and how do you keep yourself happy?", "shortyawards\nVerified": "Verified", "christendominique\nVerified": "Verified", "teensy2016": "🔥", "reenasekhar": "I am frm andhra ! Hi so proud of u nd i love ur parnts such a cute", "rupleengirn": "In loveeeeeee", "mommyandlittlea": "Lovee that skirt!", "anitas_attire": "Are there any reviews of hues tick by other beauty gurus on YouTube? Would love to see them play around with the product!", "franchescablaize": "Would you ever consider being a mentor to young women who admire your entrepreneurial spirit and passion for diversity & inclusion in the beauty space?", "byelegancejewels": "Any advice for new entrepreneurs? We would really like to send you some of our jewellery 😘💞🌸", "nany.leon": "Que cremas faciales usas? Haha. Saludos desde México.", "prahlad6903": "Nice lovely", "vijji25": "👸All the best dear😍..Keep rocking🥰", "itsgurnaz": "You are so amazing, and congrats about the huesticks! What advice would you give to any young girls who would want to start a brand/business one day? ❤️", "aftab.nizamani13": "So beautiful", "mae.co.in": "Love your energy and how humble you are about your work , I want to share some of my work with you, we make Gunghat hoodies and bombers and some beautiful India inspired clothing, would love for you to check them out! You inspire me !", "kash.raghu": "Hi @deepica 🙋🏽‍♀️ I just want to know how many hours a day/week do you work. How do you balance work and life? This is something I am currently struggling with and hoping you could share some of your entrepreneurial wisdom on 😊", "realtor_rupal": "You’re an amazing role model. My husband and I love you!! I got my hue sticks yesterday!! So exciting and I have to tell you that I have tried every single concealer on earth and nothing has made me happy like your hue stick to battle my under eyes. The lightest color worked on me like a freaking dream!! Thank you!!! And keep up the amazing work!!!", "launeld": "Gorgeous 😍😍", "tried_and__tested": "Will there be worldwide shipping for the hue sticks soon? Can you give us a time estimate ?", "mimibanks": "When are u in nyc???", "annaeverett88": "Do you have remote jobs available? Looking for work, wanting to work from home.", "glambyshivani": "Just wanted to tell you , that you are incredible. I am so proud of you, I am truly loving the huestick great job 👏👏🧡🧡🧡", "sandrinedewolf": "I would love to see a day in the life including meals 😘", "osomao": "Is orange your favorite color? 🧡", "julied38": "What new products do you want to launch next? Foundations? Powders? Blushes?", "jeesaj": "CEO status! Love this picture! You look beautiful!🥰🥰🥰", "aayesha67": "No questions. Just wanted to let you know you are doing amazing. I'm happy we have such amazing representation of our south Asian community. Keep doing you ❤️❤️❤️", "simranshetty": "Absolutely love using Huestick everyday. I think it’s time for you to launch foundations for Brown gals as well 🤗", "_kparmar": "No question, but I know that service is my passion and I’m trying to find a way to use my passion but some how incorporate my Indian culture with in it. Anyways, i can’t wait to buy some Tinted merch. :)", "melodyincorporated": "Please please make a tinted mineral sunscreen for brown peeps! Tired of choosing between potentially dangerous chemical sunscreen or looking like like The Nun all summer long!", "fatimahhussain21": "Lots of love from Canada 🇨🇦. Will you make a trip to Toronto soon?", "archna.bharthepudi": "Totally in ❤️ with his sticks enjoy doing make up now ! Keeping it simple just with them ! U take good care of yourself and enjoy the life #blessings and lots of ❤️", "dr.ravali10": "💖😍❤️u r an inspiration 🤗😄 @deepica", "codeadress": "Just want to say.... you look fabulous", "tiffmcfierce": "I’m coming to la next month. Will I see you? ❤️ Can I do music for ya!?", "iamnatalietoo": "Where is your skirt from?", "theluxurybelle": "Also when will we finally get to meet IRL?!", "jshri": "Have you found your purpose? Your voice - the platform you’ve created - is inspiring. You work hard and have directed your energy to something meaningful. How did you do find that direction??", "aasheekaa": "You are such an inspiration! Did you always know that you wanted to launch a community and a make up brand?", "tanvi.reddy": "Growing up as an Indian American, how did you navigate the cultural barriers and differences of growing up American but still respecting your parents/the values they brought?", "umanaralkar": "Love those pants! 😍", "minakshiapandey": "Loads of love to you ❤️", "naz_r87": "Hi Deepica, do you get people hating on you in this industry and if so how do you deal with it? These days, it seems so easy for people to be mean especially on social media. Thanx!", "surah08": "😍", "nityapat": "What advice would you give your college-self now?", "sanjay__sizzle83": "What makes u so angry and happy ?????", "_mystical_dimples_03": "Please launch @livetinted in India asap. I'm dying 😢😢😢", "theprinceandthep": "You are such a beautiful human. Don't you agree? 😉", "makeupby.karishma": "Hi @deepica !! When are you visitng Chicago so we can talk makeup and eat our hearts out! 🍕💕🌈", "holichicbymegha": "Colors 😍", "nailditapp": "Hi! Am such a big fan, thank you for all your inspiration! What advice would you give to someone trying to get their first big break through or seeking funding? ☺️✨", "thesmilingsweetheart": "Okay, so CONFIRMED orange is so your color omg 😍 My question would be: do you have any financial advice for being an entrepreneur?", "vmedinaphoto": "Beautiful girl 💕 how did you grow your instagram following?", "landofromwakanda": "Not a question, just wanted to say this. you are an absolute ray of sunshine, like deadass my whole mood turns bright when I see you post stuff like this, bless you @deepica 💙", "letsempowher": "Hi Deepica! Thanks so much for doing this! Can we send you a free shirt to wear and another shirt to share in your next giveaway!? 😊✨🖤🙌🏽", "namratha.bujala": "would you do another tutorial in telugu??🤩🤩youre a beautyyy", "suprita_reddy": "Do you have stretch marks, coz i really want to know i ain't the one😑😔", "thurimakeup": "Beautiful 😍", "minal4jim": "Deepica ...... I prefer to wear make up that is light and natural ..... Being indian i find it impossible to find right foundstion colour..... How do u know when the match is right? And any tips....", "miraamber": "Favorite foundation??", "justagirlwithmessybun6": "heyyy love soo much would love try @livetinted products your such an inspiration @deepica 😘😘😘😍", "sindhu_kotha24": "Can I correct very dark acne spots on my face with the huestick? @deepica @livetinted", "thashineee": "Also how long have you been thinking about making the huesticks ?", "dharpooja": "I heart you.", "christaylor_nyc": "🌸🌸🌸", "iamsusieq": "My question is about one of your old YouTube videos where you talked about framing a saree! And I loved it! How or Where did you take it to get it framed? Is it just a shadow box? My mom passed away almost 2 yrs and I would love to frame one!", "itsshaywhite": "No question but this outfit is everything! 🌼", "chanel_beery": "Success is never a simple path. What books, mentors and coaches helped you on your journey? 🌹", "shreejapotluri": "How you feeling boo? I hope your taking care of yourself in this process and congrats on the Huestick!!❤️", "karishmagidwani": "how’d ya get the confidence to start tinted?", "browngirlglobal": "How do I get you to come on the blog and do an interview for @browngirlglobal 😆 seriously, you are so amazing!! #livetinted forever 🧡🧡🧡🧡🧡", "rachanadds": "Just ordered the hue sticks. Can’t wait to try them! Are you launching more make up products in future? Would love to see you launch a skincare line as well. Keep rocking girl!!", "ishan_ee": "So many questions I can't begin....you inspire me so much and I constantly tell people to follow it and tell about @livetinted and make my own live tinted shirt to do that. You are so awesome @deepica lots of love and admiration your way girl 😍❤️", "ruksana.429": "You..actually inspiring everyone...@livetinted is one such amazing beauty brand ...and you deserve...place in our hearts❤️❤️❤️..all the love from India...and please work on shipping your products to India ..lusm deepica", "thefashionablecouple": "Skirt 🔥", "shaikmahmood2015": "Woooooooow..........Awesome dress...............", "deeburman": "You’ve built something amazing so not sure if you’ve had these feelings - but how do you deal with the feeling that you’re not where you need or ought to be by a certain age in terms of career success and financial stability?", "rashmiv11": "Hi! Just got my 3 pack of huesticks, and I'm in love ❤️ I have a beauty question: how do you deal with under eye puffiness? I know a lot of people love jade rollers- do they work?", "thefashionmagician": "I am a South African influencer and would truly cherish your support with a #followback 🤗🤗🤗🤗", "n_kta_": "@deepica 🖤I’m 17 n i dream be an amazing person as you .. lots of love from ur teenage fan 💞", "j_luv1": "Simple slay! You are definitely my motivation! 😍", "fuchz_": "No question. But just love you and so proud of u dips.. 🤗", "shindercheemajohal": "Learning to love my tinted mixed skin more and more everyday. Stumbled on your page a while back and have been loving it all since. So very inspiring to see someone younger doing and succeeding in what he love ... props girl 🙏🏼", "madzster": "What are your go-to activities for de-stressing?", "s.arahkhan": "How do you keep your motivation up? I have so many goals but I get down sometimes. Whenever I see you I get so inspired!! Love you 🧡", "ashwini_sherla": "Your such an inspiration deepica for women nd I love ur Mamma pandu alot nd their encouragement towards ur career is fabulous nd i hope each and every women who are trying to achieve something in their life , need such people to encourage them. Iam eagaerly waiting for ur live tinted huesticks to be launched in INDIA .Please make it possible", "itsaykay_": "My question is where did you get that BOMBBBBBB skirt??? 😍😍🔥🔥🔥", "deeb77": "You’re amazing and I love everything you’re doing for us brown girls", "anumanumz": "Beautiful 😍", "ray.moore.587": "Lovely", "apurvagarimella": "Hey Deepica!! I am your huge fan😍 waiting for you huesticks to be launched soon in Singapore or India ......I m starting my new clothing line in Hyd and Singapore and would love you to wear from my clothing line ... it’s a dream 💖🤗", "sanacha15": "No question, just wanted to say you're amazing! I've followed you since your first tutorial. So happy for you! Keep shining!", "er_haads": "How did u find a manufacturer u liked? Worked with u? Developed with u?", "surprhld": "I would love see you launch a skin care line as well. I see so many brands launching & claiming that the products works wonders. But all their models have different skin than me so makes me wonder did they really try those on my skin tone !?", "priyavnkt": "@deepica I love your spirit. I have loved your spirit from time I randomly stumbled upon your Telugu make up tutorial. Something tells me we're going to meet. I know deep inside the universe is going to conspire for us to meet. And when we do, I'm going to ask all those questions that I can't fit into this comment. Till then, keep slayin' !! ❤️💛💚💙♥️💜 (Tinted love from the Telugu land)", "vava_beauty": "You are such an inspiration! 😍🤩😘Your parents are so sweet in all of your posts! Seems like they’ve been super supportive when you transitioned your career. What would you say to entrepreneurs who don’t have the same support system, where their families and friends don’t believe in the dreams they wish to achieve. Where can they draw strength from? ❤️❤️❤️", "sanghashirley": "What inspires you the most? To get up and make things happen? P.S love the huesticks cant wait to try em!", "hanianis786": "Loved meeting you at C+C, literally one of the highlights of my life 🙃 2 questions - we talked about potentially collating so what’s the best way to reach you/ timing (I know you’re swamped with the launch)? Also, raising capital for your business — what is the best way to go about doing that? Ps any chance you’re hiring for tinted any time soon? 😉", "atlierleenastyle": "love this look@👏👏👏✨✨🌹", "zenai0730": "Such a beautiful look, just stunning. Great color on you♥", "soniyastagram": "Yessss Deepica 😍🔥", "nuhasgram": "Orange is fierce on you ! 👌🏽", "ravi0191": "Big fan of you will watch all your vlogs and mama pandu cooking videos to try my food 😀", "herkhanfessions": "I have so many business ventures related to significant social issues, but don’t know where to start. Any tips?", "thechaimommas": "Hi! How do you make time for wellness everyday?", "rebe_ckah": "First of all...you rock!!! I'm so excited to be in on this amazing work of @livetinted even if it's just as a supportive fan! 🙌🔥👏 Second deets on your outfit please. I want! Third, When do I get to try the remarkable #huesticks? None available in my neck of the woods, so bummed!", "trina.patel13": "You are such a massive inspiration with everything your doing. Such a boss and always looking fabulous. Love this look btw. That orange skirt is fab!!! Did you imagine tinted would be as huge as this?! 😘", "sunniasays": "Babe ❤️", "sueransl": "Wow gorgeous 🧡", "opulentxbeauty": "Absolutely stunning🔥🔥🔥🔥", "p.o.o.j.a._d": "Hi, you are such an inspiration. I'm following you since long, witnessed your journey. It's breathtaking😍. I have a question for you. Would you have the same life, same passion, same support, same success, if you were born in India? Good luck for future dear😘", "kusumwarsi": "Who do you miss the most from your days at UT? Me right? @deepica", "ayeshapi\nVerified": "Verified", "suchetajt": "Do you’ll deliver to Mumbai? I would love love love to buy the hue sticks for my birthday in June", "frahman925": "Outfit deets plz", "khaddijaj": "Not a question but you are my literal inspiration with what you’ve created with #livetinted hope to meet you one day 🧡🧡", "princessmayali": "What keeps you motivated?", "shristi.28": "What other products do live tinted have in the works?! So excited, take all my money Deepica 💜", "siri_yads": "Would you be willing to check out the Dil to Dil insta page? We focus on spreading mental health awareness in the South Asian community", "angeli.hope32": "Loving your skirt. What’s your secret to a successful life ?", "anki_jolyn23": "Ilysm!!♥️♥️♥️ Ive been impacted by u frm the start thx so much for makin me hella more confident in my skin tone!! 🖤♥️", "nithila_kannan": "How did it all begin? How did u choose to go in this path of becoming a makeup artist and now a CEO😁?"}