{"sarinakitty1": "@deepica You look fab! 👍🏻👍🏻👍🏻", "gabby_acost": "😂I can relate.....I get a tan just walking to my mailbox😑🌞", "sabreenadino": "@mizz.michelle", "mrudupasam": "There is also a worry about Sun burning our skin in their words. It's more affection than racism", "gut.skin.nutritionist": "I have eczema so my skin actually looks better tan and evens out all the red patches and looks less noticeable. I’d rather look bronze versus look like a pizza when I’m lighter ya know 💁‍♀️🍕Mom’s need to just let us live 🌞", "alexcr37": "@alexcr37 follow", "call.me_leilani": "Every indian mum is the same🤣🤣🤣", "sassymrsp": "Keep moving! Keeping inspiring! This is a powerful post, you are a courageous woman! ❤️💫🙏🏽❤️", "chaitanya.avinash": "You are going to get dark ... Mama pandu🙌", "sharmilanambiar": "@aparnakendell", "shakira_akbar": "🤣🤣🤣🤣🤣 Says every Indian mum 🤣🤣", "ronitamathias": "@kittikitkat why is this every Indian mom ever", "stayradsummerr": "Hey DEAR! I LOVE your IG we need you on social media team you’re the perfect influencer for @stayradfashion.official just check my bio and DM our main page", "tniquejhair": "Love this!!!! My mom would say the same thing 😂 brown mamas be liiike... 😂", "sherocks_canada": "@wing.it.beauty Live life tinted 💕🙋🏽‍♀️", "amongallofthis": "This is Asian mommas everywhere too! 😂", "mervinamcmurchie": "@nicnathan story of our life🤦‍♀️😂", "archreddy": "OMG!!! Love this 😂 Can 100% relate.", "nsanth": "@rsanji sometimes I watch this when I miss my mom lmao", "deemellowa": "Tint it uppppppppp 😍", "malini_linguini": "@bhumikachicka @neyy93 @khusbupotter @urmilypat story of our lives", "ragnii_rao": "@miztkn_", "natalia_dotcom": "@sneeeeeeeeeee", "aubriefennecken": "💜💜 (Side note, can I ask about your “out of office” bag?", "shakira_syn": "I think this is said in many black and brown households. My family is from South Carolina and my Grandma said this Every Summer. 😩🤦🏾‍♀️ I make sure not to say it or allows others to say it to my kids. I love the way she says your name by the way", "jay_jayaraj": "It’s a hard conversation to have, especially when it involves your family. But it needs to be shared, to hopefully, nib this mindset some days. Thanks for sharing! 🧡", "gauravipg": "Wear a hat!", "evelovely_15": "@gabriela_estela15", "aimee_marisa": "And some people get made fun of for being too pale! We can never win 💗", "anjanee.dietitian": "This caption ❤️", "saro.mnk": "@edwina.etore ma dar", "chelseajeanx": "Please tell me you’re wearing sunscreen! Not because darker skin colour isn’t lovely but every one is susceptible to skin cancer. Take care of yourself.", "shabsaz97": "Unfair and lovely hahahahhahaha!", "dipu0411": "Brown , beautiful and talented!!", "embassyofglam": "Mom are always going to be moms of course she knows and is proud of your Live Tinted but I am sure she has never notitice you skin color all she sees is her baby, i know cuz I am a mom too and never realize the skin color difference betwen my girls till my mom pointed it out 🙄🙄 I am not a doctor and I am behind both with the sun screen cream, therefore I luv it when you share mama pandu mom moments, she makes me realize I am no so off as mom🤦🏻‍♀️😂😂😂", "gatesvsgates": "❤", "kate0284": "😂😂😂♥️💋", "jtramos16": "😍❤️❤️😍", "sf.jelai": "Hi there beautiful! 😚 I love your post! I would like to offer you something! Please DM me for more details! 📥", "lisbeth_pena": "Black is good 😊", "yolandapataki": "Some Latin moms too haha my sister and I laugh at it now too.", "shu_sri": "Your mom is the best ❤️", "supergoop\nVerified": "Verified", "itsdeepaaaa": "@deepica #Indianprobs hahaha my mom gave up hahaha", "lakifern": "I love deepica’s parents and her of course but I’m not going to lie - this made me so upset! To see that after so many years of living in the US for her mum to still have that mindset shows me that there is so much more work to be done! Growing up as a dark skinned Sri Lankan in Sri Lanka I’m thankful my parents celebrated the dark skinned me and were quick to reprimand anyone who told me otherwise. Thanks to them i saw the beauty in myself and others like me. @deepica you have an amazing platform to do amazing things like changing hearts and minds on what beauty means and (unfortunately) that often starts with our own South Asian / Asian community. It would be wonderful to see you push this as part of your wonderful #livetinted agenda and we’d love to support you. ❤️ #darkandstilllovely", "shiner_htx": "Amazingly I heard that from EVERYONE else except my parents. Mom is light skin but dad is regular Indian brown. I was on drill team in HS so of course we had to practice in hot Houston weather. I honestly can’t remember them saying anything about my “tanning”. But everyone else- “Ohhhhhh, you would be so much prettier if you were a little bit lighter.” 😮🤦🏽‍♀️ Now when some Aunty says “Wow, you’ve been in the sun a lot. Maybe should do less.” My reply- “Brown is beautiful, dark is beautiful and it means I’m living life!”", "imamandeepnagra": "🧡🧡🧡", "tarengrewall": "@ggurdeesh", "sherine.abraham": "the sun complements our golden glow so well, why stay out of it? 🙈✨", "kiranpersaud": "Story of my life!!!! I heard this from my mom all the time while growing up and I hated it. I love my mom but she was old school and didn't know that it made me a bit self conscious. I have a daughter now and will never say things like this to her because she is beautiful no matter what shade of brown she is #livetined", "jayamadray": "✨✨✨", "mad_sidss": "Awwww😂😂😂😂", "sraaaaa329": "@sapbag mood", "shy_sandy": "AHHH THE NANA NEAR THE END TELUGU MOMS FTW", "venivjewellery": "#unfairandlovely 😂😂😂 ahahahah", "lizzardprincessface": "You living tinted enjoying the beautiful color you’re gifted when you’re sun kissed is theEeeeeeee most beautiful thing ever !!! I love you ! And that fire tan !!! 🙌🏼🙌🏼🙌🏼", "banupriyamadhusudhan": "💜 I love this", "_christinesen": "@maxviacheslavavic my mum", "bans_xx": "😂😂🙌🏽 The usual brown girl mom thing to say", "theatlantaamado": "All us brown girls grew up hearing that... #MelaninMade", "panpanda_26": "My Mexican mother says that too 😭 whats wrong with being a little tanner than usual xD", "farahe": "Being in the sun too long is also causes ageing", "simmi_prasad_": "Dark skin is beautiful!", "sensi_bubble": "I mean people are risking cancer to get this colour skin and I have it naturally so for that I am grateful and that's what I say to everyone who calls out my skintone😊 love what you're doing with your brand by the way its a step in the right direction🙌🙌🙌🙌", "sharnado": "THIS IS SO RELATEABLE 😂😂😂", "_shah786": "@swetha_90 tinted life 💞😍☺️", "lifexmyra": "Brown and beautiful 💕", "denisepriyanka": "😂😂😂", "honeywhatscooking": "Hilarious. I just bought supergoop and I love it so far.", "jubybenavides": "Latina moms say the same thing 🔥😍", "vaishali_kotian": "This is every Indian mom ever 🤣", "rosh2779": "😂", "justkissa": "Goals!! Love your swimsuit ensemble 😊", "shelinat": "@alinaamt @aliamerch @_azminam", "lholt0328": "Omg! My mom does the exact same except her exact words are \"do u want to be a french fry...get out of that sun!!!\"", "neerabhatia3684": "Lol typical mom!!", "jaynchawla": "Omg Indian parents 😂😂", "jyotsnavagh": "Loving the comments ladies", "ni.cky4283": "😁 mothers!", "artistncrafter": "Hahaha true 😂😂", "smtrangelo": "@garinphae @jayykiyomi Me to Ryah and Jordyn 😂😂", "ninachahl": "Says every Indian mom!", "julietuata": "😂 My mom says the same thing. When we lived in Hawaii (O’ahu), she used to send me with an umbrella to use while walking home from school. 🤦🏾‍♀️", "khatidja100": "And I thought it was only my family 😂 I’m making jokes like my “market value” is decreasing 😂 so no worries this will not be a next generation with this issue about color ☺️", "indianteddybear": "Omg it’s like hearing my mom say the same thing (in Telugu) also saying that I am too fat, but that’s a side topic 😂😂", "claudc_97": "It's great to see you bringing this up.... I remember my grandpa always asking me why I would want to be in the sun and get darker... @deepica 😥", "saffronspicepodcast": "Hi @deepica we did a podcast episode on India’s obsession with fairness, we’d love for you to have a listen https://podcasts.apple.com/us/podcast/saffron-spice-with-isha-shivani/id1462966956", "miz_fabulos": "😂 I just say that to my daughter cause she’s going riding and it’s 90 degree . 😂", "kinnara8": "@heypooj this is our mothers but the Telugu is paired with a menacing glare.", "preetisfeld": "In white people's eye, we are dark 🤣 so...we need to embrace our browness. But yea, in a way this is funny but it is up to us young generation to change those mindset #darkisbeautiful", "ooomers": "😂😂😂😂😂😂👍🏼❤", "try.a.full.life": "Haha there is no way to escape the sun on the westside! Tell mom bathing in sunblock is the only way!", "cbarryaustin": "colorism isn’t something to joke about. i don’t think this is cute or funny. or something to make light of. maybe the goal is to drive an inclusion message but the decision to post this video is tone deaf. sorry.", "miss_gigimama": "You’re on Maui!!! 😍😍", "lil_brwn_grl43000": "Every Indian mom 😭😂😑", "christinesamra": "Your tan is POPPIN’ tho", "mellymelliemel": "#brownbeauty Raise your hand if your Mama said this to you ALL the time! 🙋🏽‍♀️ Raise your hand if you could play outside during summer vacations until the back lawn was fully shaded.🙋🏽‍♀️ Raise your hands if you had Fair and lovely shoved down your throat. 🙋🏽‍♀️", "sarelmac": "I was just there this morning 🙌🏼", "jackiepertab": "I live in Florida so this impossible 😂 plus I love my tan skin color 🥰 and I love that I can be out in the sun enjoying life!", "kingstyles23": "Darker the berry, the sweeter the juice😂😂", "_lexpark": "Reasons why I love your mission! Dark is just as beautiful! 💜", "neenalakhani": "Dark is beautiful too! 💗", "pamehhlalala": "😂 Moms. Mine says all the time too", "ootkala": "Thondarga ra 😂😍", "namratha_nagarjun": "Every Indian mom😂😂😂", "sujitajoshi": "I grew up listening to that all my life lol my mom never let me do anything outdoors", "dshrestha": "Hashtag 👏🏽👏🏽👏🏽", "dreamcatcher7011": "🤣😂", "skapasi13": "Girl wish I was that tan. It’s embarrassing bc I live in Florida and still don’t get in the sun enough!", "divyavenugopal154": "Typical Indian mom.. my mom also says the same thgs.. 🤣🤣🤣🤣🤣", "amelia_mariah": "I love that you are patient with your parents, but still speak your truth. Hopefully one day black and born parents will understand that dark does not = bad/ugly. Until then, keep reminding her that every shade is beautiful.", "jezz_may_joske": "Does your mom mean you will get sun burnt by being in the sun or does she mean being too dark is bad???", "_meem_meem_": "🙌🏽🔥", "purplevette": "I tan so unevenly that I tell myself this. My skin tans in blotches. WTH? And I have an allergic reaction to some ingredients commonly used in sunscreen 🤦🏽‍♀️ - anyone has any suggestions?", "_steph_roop_": "😂😂😂", "docniti": "This is literally every desi mom with their daughters 😂", "productjunkie_confessions": "Love the #unfairandlovely 😂😂", "aleph_r": "😂😂😂 You guys are Owesome ♥️✌🏽🇿🇦", "i1nception": "🔥🔥🔥Bronze 🔥🔥🔥", "pinks7": "😂 to this day I hear that!", "olegbuller": "Get dark darker dark!", "shabi3111": "I am unfair and lovely and proud of it!! Being Indian descent I am haunted by those words! “You’re getting too dark! “", "islandgirl_rosie": "That’s my mom too! #oldskool", "raveenachandra": "Man, all Indian mom's think light skin is beautiful! Mummy's we LOVE our brown skin and have a little sin kissed natural bronzer glow! Let us rock it!!! 😍😍😍 @deepica Your such a beauty!!!", "haanypot": "Omg yesssss!!! 👏🏼👏🏼👏🏼", "tiishan_a": "@s.i.m.r.a.n._55 EXACTEMENT ma mère 🤣🤣", "leennzzzs": "Dying! Get out sis! We too roasted already! 🤣", "apartment_bartender": "Haha moms will be moms", "theefashionlawyer": "😂😂😂😂", "d__o__n__n__a": "😂😂😂", "deepica\nVerified": "Verified", "shantisingh13": "LMAAAAOOOOOOO so v relatable", "amikakamath": "@marielle_kamath I’m crying", "bees_arthive": "What spf spray are you using?", "salglamour": "Lmaopo😂", "addy_mano": "@deepica 😂😂 sounds like all desi moms. Mine used to say if you get too dark no one will marry you 😆🤣😂", "patrice_eleisa": "@deepica Thanks for this! Its amazing how many people have been conditioned to beleive dark is ugly. My aunt used to tell me the same thing as a child...\"get out of the sun before you get too black\"!(Well I AM a black woman🙄)Like you stated my aunt also had an old school mindset.It seems most of the world was conditioned to beleive this....No wonder black folks receive so much hate. No wonder a light skinned child can tell a brown child they dont want to play with them because brown isnt pretty. Then they grow up with these subliminal racial biases. Its sad because what people are really saying is they are insecure with their skin color, and need to be lighter to be accepted into a eurocentric class. Lighter = prettier, wealthier, more intelligent, and better. ITS A WHOLE LIE!! Things like skin cancer, and skin damage should be more of a concern. Thanks for your mission! We see you @deepica.", "mo_adventuretime": "Mama Pandu needs to decolonize her mind. Internalized white supremacy isn’t cute. Hopefully she’ll learn something from your brand.", "nusha2907": "@deepica Live Happily Ever Tinted! 🌸", "nehahipp": "@rishasok 😂", "patricejwill": "Yikes. This is...wow.", "namastayspicy": "Lol 😂 @jyothisushanth", "daboychef": "Your last two posts are incredibly problematic. If we can’t address these backwards mentalities in our own families, how are we deserving of a platform to address them in society?", "radbali91": "@atul.bali", "therealsangeeta": "I understand her Telugu. ❤️ 😄", "diviya2410": "Ha ha 🤣!!", "silajp": "😂 The desi mom mantra!😊", "neerasha07": "😂😂", "lady_jadee": "Indian mommas need to change these negative thoughts on being dark, it’s ridiculous.", "optimisticpavni": "Fair is not lovely. 👏🏾👏🏾👏🏾", "jessica.gulati": "Bahaaaa! Every desi mom!😂", "infinitismon": "Omg her Telugu I can’t 😭❤️ @pooojithaaa", "pratyushac": "Omg hahaha", "sarthellabra": "“Unfair and lovely” I’m weakkkk", "stephsterjovski": "You are beautiful 😘😘", "ambrosial.ami": "😂 that’s right!! This is for Desi mom’s everywhere!! 🙌🏾👸🏾🏆", "msdadabhoy": "Lol, this sounds like my mom telling me and my kids @lailadadaboi @camila_r2d @msid9999 @arshaddadabhoy 😂😂", "achelliahmd": "Love this! And the hashtag!", "fazena_b": "I think every other race that’s not Caucasia parents they always worried about their girl children getting dark from being in the sun not so much the boys though🤔🤣", "loseitsista": "What's wrong with getting dark??? Wow your mom", "prakashamritraj\nVerified": "Verified", "jbeautifymakeup": "I think us brownies can all relate to this 😂😂 still get yelled at by my mom- i respond: the vitamin D is good for you (with tons of spf of course), hehe ☀️😬 @deepica", "rosycheeks101": "Ahaha this so hilarious because this just happened yesterday with my mom. We are brown Mexicans but she prefers to be lighter. All I say I love my skin color and let the skin get tan!", "onekewlmom": "There’s nothing wrong with being dark 😐", "aaron.ludwin": "“Mom, calm down” 😂😂😂😂", "missusatomba": "My (dark skinned) grandmother used to say this all the time when I would be out in the sun all day", "anilango": "@meghailango HAHAH her fam is so relatable", "pujaaaa_g": "If only I had a dollar for every time my mum said that to me 😩😩💰💰", "littlemissmoira": "@officialpoorna definitely had this conversation with my grandma 😂", "footprinttheworld": "Haha conversation between every Indian mom and her daughter ( well quite a few) . I always stressed visiting a beach location before I visited home as I knew I would never hear the end of it :) . I do believe the conversations and the message are in the process of change with our very own daughters .", "takisha04": "Hopefully you will not share this message with your children. Dark skin is beautiful. Change the narrative 💗", "kittyjrawlings": "I was kept inside until close to sunset when at a particular relatives house. Mama Pandu’s voice though, I could listen to her all day. 😘", "megzbhutada": "🤣🤣😂", "judyylemonn": "You tell her! People pay to be our color 😂😬", "critikal.conditionum": "@vandanamacha BAHAHAHA story of my life", "shivone88": "All brown parents say the same thing 😂😂😂", "iamthisbe": "Says every Indian mother always, no matter how old you are!", "meenalaregina": "Hi! My mother used to admonish me in the same manner. Now my skin becomes red and hot in the sun 🙁", "tiny_tinalove": "Whats wrong with dark lol", "whimsyandfun": "🤣🤣🤣", "thesmalltownblogger": "Hahaha. So damn cute.", "rekharocks": "Your Mom is 100% just like my Mom on every topic. You’re not alone. 😆", "kimberlydeflores": "I was there last week! Parked at whalers village to enjoy Kaanapali beach behind the shopping center. Enjoy!", "lanapatelxoxo": "Come through @livetinted gotta love mama Pandu though! 😍", "learningwithmsali": "So so cute!!!", "sherylraj": "Dead 😂", "nuts89": "@bkajalf @monif18", "aliahishmael": "Lmao she sounds like my mom ☀️☀️☀️☀️ @deepica", "bindi108": "Unfair and lovely is one of the best hash tags known to Instagram imo 👏🏼", "may_belline_": "😂😂😂", "my_sparklingstar": "Oh yeah! That’s my mom 😂", "dorababu.maddukuri": "Typical South Indian Aunty lmao 😂 #shesmymom 😂", "mirapatelll": "Haha, yesss!! Don’t stay out of the sun, just get sunscreen and enjoy nature 😍", "dielisse_gonz27": "Lol. My mom says the same thing to me.", "priti333patel": "😝", "kodachrome18": "Every Indian Mum 😂😂", "boomchikapop24": "Lol..resonates so close to home.", "tutifruti2001": "Dark skin. Still plagued with traditional ways. Help Mama with this thinking. That's self hate", "jillvachhani": "It’s like I’m hearing my dad tell me how dark I’ll get if I go to the beach. 🙄 that’s the point, Daddy ☀️❤️", "monica.jhun": "🤣🤣🤣", "petitenpretty\nVerified": "Verified", "anarodriguez19": "Sounds like my mom 😂", "kirtirai15": "The story of every Indian house..😂 @deepica", "shivshapat": "Said EVERY Desi mom ... #legit #truths", "styleandthesagittarius": "✌🏽✌🏽✌🏽✌🏽", "riri_ahquinn": "Nothing wrong with getting dark. Dark skin is beautiful.", "sidrah1590": "Omg! My mom tells my 4 year old that she’s gotten darker whenever we come back from vacay. I tell her everyone is beautiful and cow in different color shapes and sizes. Thanks for being an influencer that is changing the norms and hopefully by the time she grows up the idea of fair is beautiful will be gone.", "radsay01": "$1000 on my mom saying this today 😂", "daniaaslamshaikh": "facts 😍😍😍", "lakshnaarunasalam": "@p_jey_22 🙃", "amrikag": "😂😂😂", "shaynalynn.bobo": "😂😂😂😂😂", "drbhanusali\nVerified": "Verified", "beenybaby18": "Story of my life all summer.. 😩😩", "heytherekhilla": "😂😂😂😂😂😂😂", "lisaadave": "Thonturaga ochiraaa. 😂😂😂Sooooo cute mama panduuu 💗💗💗", "__ramyaraj": "😂😂😂", "delosreyes_j": "Your tote is so cute! Where is it from?", "samgopall": "this is so relatable 🤦🏽‍♀️😂", "ms_waas": "#unfairandlovely ftw!", "laurengores\nVerified": "Verified", "vepimentel197": "My dad would always make his comment to me as a child because he has a light complexion. It would always hurt my feelings. I know he doesn’t do it to hurt my feelings. I never even expressed to him that it does. As an adult now I always tell him that people pay to have my color. I make sure my children love their beautiful dark skin. Spread the love. 💕✌🏽", "sunshineshyla": "So as much as I love you I’m going to have to disagree on this video. Because I come from a Indian family that cares more about who you are and the color of your skin. It’s sad that this is still ingrained in all classes, races and society—and it’s subconscious because of British imperialism and there drive to separate by class as well as color! Mindsets should be changed. The Indian diaspora need open and honest dialogue— so sad", "nishabalsara": "🤣 Why is this so relatable", "reeree_rhea": "THAT HASHTAG !! 🤣🤣🤣😹😹😹❤️❤️❤️❤️ Only an Indian would truly understand !! 😋😋😋😬😬😬", "payalgpatel_": "Lol 😆", "smalik77": "Love this!!", "sorahsays": "🤣🤣", "anithamobap": "🤣🤣🤣🤣🤣🤣🤣🤣", "malvloogs": "😭😭😂😂😂😂", "alka1213": "BEST", "pure_classbeauty": "dark is beautiful let the sun 🌞 kiss 💋 you", "tealfirefly": "The irony!! 😂", "stu.gr.dp": "Omg. Indian moms. I’ve heard this my whole life. First question she asks me when I come back from a holiday «  did u get dark again? »😂😂😂", "julie7385": "Mom calm down!!! Love it! Shes too cute!💕", "lak_shmi": "@gmano12", "rea312": "I love it!!!! 🤣too cute. Poor mama Pandu. We as brown people have been taught to not love our skin and it’s beauty! Get it girl! Live tinted!!! 🙏🏽😍", "prahlad6903": "Nice lovely", "irenyofirene": "That is such a great response. 😂", "pvnambhakta": "Lol, my entire childhood via my aunts!", "thechaimommas": "For real! 💛💛💛💛", "gsheni": "😂😂", "thecurrymommy": "It’s such a typical mom comment🤦🏽‍♀️.", "munigram": "DESI MOMS HAVE NO CHILL", "rammy220": "Caption 🙌🏽💯", "kratika2209": "@deepica Your mom is sooo cute😂😂😍", "janique.la": "😂😂😂😂", "pdids1": "Typical Indian moms!", "seemame": "Yaas! Unfairandlovely! My foundation color gone 2 shades darker since living in California and I love it! Btw you’re in great shape 💪🏼", "shvtas": "Godd.. love it ..big hug to your mommy💕", "drach311": "Unfairandlovely. Love it. 😘😂😘", "thenewyorkmom": "Omg such an Indian mom thing to say! Mine says the same thing!", "irene_lambiri": "😍🤣🤣🤣", "rakshamana": "Caring ❣️Amma", "stayreddy": "lolllllll, oh mama", "thechaichica": "This is every Indian mother! Lol! 🤣Thankfully growing up in MIA my mother gave that up a long time ago! Bring on the tan! 💥💥", "m4n15h4": "Unfair and lovely 😂😂😂", "anaso.of": "@anachaswim", "jenkalindalucas": "What product on you putting on @deepica", "jeniesbloc": "😂😂😂😂", "akta_amin": "😂😂😂😂😂", "tifferonni": "Haha sounds like all of my aunties!", "carriersteele": "there's nothing wrong with dark skin Mama Pandu! there is something wrong with not using sun protection tho so go Deeps!", "triniorigins": "I'm DARKSKINNNNNNNNNNNN!!! #melaninenriched 🇹🇹🇹🇹🇹🇹🇹🇹🇹🇹", "extraordinarychoices": "OMG I grew up with this all the time! Wish I had people like you around me more!", "jenhub": "Yasss bronze goddess 😍🌞🤩", "lince31": "Perfect response!!! 👌🏾", "savnthecity": "😂😂😂😂😂", "munaakhtar": "Sounds like my mom 😂", "ruthalonzo_": "Can’t explain how relatable this is 😅", "fauzikhan": "All south Asian mothers everywhere....", "sudeshna01": "Haha I used to react the same way when my mom used to say that now i do the same to my kids ! Lol it’s an Indian momma thing you wait till you’re r a mom! ❤️", "shrey3shrey": "@shilpadudi @sphurthykota LMAO our moms", "amidesai": "🤣🤣🤣", "minika94": "Haha my grandma is like this", "mixtapemommy": "@joannajohnsnow @ssk912 😂", "lovelaughmirch": "Lol😆😆😆", "dharti_xo": "\"Marriage value is plummeting!\" 😂😂😂😂😂", "sukainafj": "Omg that’s every desi fam.", "meerasanimaltribe": "Lol...how many times did I have to hear that. You look amazing!", "jeminixmandania": "Beautiful 😍 what is product name of the sunscreen from supergoop? ❤️", "intheherennow": "Love your family videos 😃😃😃", "amaniiya._": "how cute’😂❤️", "artipatel1": "Literally my life", "selfie_saadia": "😂😂😂 says every desi mom to their kids😂😂😂", "chughsss": "@ramyakan", "bella_earth_organic": "Desi life😂", "itspronouncedsarath": "I heard my moms voice when she started speaking Telugu 😂. 100% same tone", "aliya_z_91": "Stunning ❤️", "megtorp": "@shradmid i'm screaming this is our lives", "sincerely_osa": "Lol @ mom calm down 🤣💁🏾‍♀️...I just love your family", "swapan.dutta.5": "Beautiful", "thesassysam_": "So gorgeous 😍😍😍", "maitreyiarya": "My grandmother would tell me this all the time when I was little! Now I very happily, live tinted 😎", "dkaze001": "@deebafresh @jkazempoor literally our mom", "murielmartins808": "Brown parents...🤣🤣🤣", "m0ksha": "#everyindianmomever 😂❤️", "helloacm": "Yes to #unfairandlovely Yes to #livetinted 🤗"}