{"impeacelikethat": "I’m coping ok. I teach elementary special education so schools closing affected my work schedule but we are still getting paid. Spending the time decluttering my house", "miisspage": "1. Your picture is so lovely. 2. I am really getting back into cooking. I love to cook, but didn’t have the time due to work. So, I’ve been in here making any and everything.", "sharkgrl279": "Return of the Living Dead is one of my fav cheesy/obv low budget gore fest they're soooo terrible and SO good!", "thebunnybump": "👍👍👍good list .... add Outbreak (1995)😊", "heubert_dantona": "Positive", "leilalewisxx": "masturbating 7 times a day, eating 3 meals, playing with my cat and opening my windows to get fresh air occasionally", "emcearcee": "children of men 😭😭😭 every time", "kingxflavy": "Beautiful creature , i know what you are.", "jeremypaige24": "World war z!!", "ms.garcia____": "😻😻😻😻", "goodmorningmorgen": "I'm trying to just be vulnerable with people via social media while social distancing 😅. The biggest thing for me is I'm a physical love person and I live with 3 roommates who aren't exactly friendly so I'm just in my small room a lot. Trying to share with people that needing physical affection isn't romantic it's just how some of us are. But I've also been smoking weed and arranging my 2 stuffed dragons into poses like they friends. They eat, watch and share tea. Basically living vicariously thru my stuffed animals.", "imanitrishawn\nVerified": "Verified", "senoufo223": "a skinnier jill scott", "birthnameking": "Just trying keep a schedule helps me a lot.", "ant_fontaine": "🔥👌🏾", "dbdamonsta": "You forgot about world war z, the girl with all the gifts, train to bustin", "theshelahmarie": "I really relate to this. 😂", "mohamedashraf5268": "🤤🤤🤤🤤🤤🤤🔥🔥❤️😮", "eburnsprepjerks": "🔥", "meredithmerixo": "I have the same coping mechanism with horror movie. I’m so happy to have found your list. Me and my girlfriend. She’s super scary so the list will last a minute 😂😅", "marshallcomic": "A Quiet Place", "official_ghanaman": "😘😘😘😘😘", "caramel_choco_thai": "Replace those horror movies w/Sci-Fi, I love watching the impossible/fantastic become realized keeps my mind open to outlandish possibilities in real life. Also nature/travel documentaries. It's a reminder there are amazing people, places & animals right here on stressful assEarth that I can make plans to explore. And lots of dope instrumental music. Sometimes I just have to block out ALL voices no matter what's being said.", "la.skeeta": "Don’t forget the movie 2012 😌", "aisha_chey": "I've been writing. But I love to write. Also going on short walks and taking cat naps.", "_alexischanelle": "I’ve been journaling and meditating. Being intentional about taking time in the morning to gather myself before I start the rest of the day.", "xxeternalsunshinexx": "I’m trying to stay off social media so I’m not constantly reading about deaths caused by COVID-19. It’s been triggering my anxiety which leads to chest pain and muscle aches from tensing. And that is also scary because those are some of the symptoms so lol 🙃", "danidannydanknee": "But this picture made me feel so much better babe @raquelsavage ♥️", "kd40one18": "@raquelsavage The Invasion, check it out...", "mzalistworker": "Is it okay to be a virgin if youre a guy at 18?", "anotherfloraldress": "Re-frame. I try to think of this time as a gift and notice the changes I experience. For example, it is a gift I don't have to commute or deal w corporate types in person. And I notice I'm happier, less grumbly. Also, turning focus outwards for what I CAN do. I'm using my online resell boutique to help raise money for a local food bank.", "mbinwonderland_": "I stopped using social media/my phone for two and a half days and took that time to get organized both physically in the space I live in but also in my thoughts and feelings. I’ve also been doing a ton of yoga, meditation, and cooking to keep myself busy.", "c_roc50": "😍😍🔥", "iamactressnik": "add 12 Monkeys 🐒", "aquarius_0613": "I'm in the Caribbean and we are not taking visitors... businesses are closing cause of it....but beyond that my children keeping me on my toes", "the_muscle_whisperermia": "I need to laugh so it's been days of American Dad for me.", "kingparappa_": "Streaming me playing Resident Evil and other games, FaceTiming friends, eating. It’s been fun", "elena.lulu": "Wow... I was never able to really articulate why I watch horror and thrillers when I’m sad or stressed... but that’s exactly it.", "sensual_reality_series": "I've been doing meditation and breathing exercises and gratitude prayer and Stretching each morning then I write erotica and watch shows on Netflix. This upcoming week tho I'm setting a schedule to get structure", "lemony747": "Man oh man 🔥😍❤️💯", "solsys": "I like your list of movies.", "dest.rule": "Journaling every night has really helped me cope with the world lately. Going through the 5 senses of what can I physically feel, what do I smell, what can I see, really makes me focus on the world around me and not my intrusive thoughts and feelings. It’s reminds me to be present and in the moment and not to worry about what I did today or what I plan to do tomorrow.", "llhardimanishardthrob": "🔥🔥", "crazy.coco.mama": "Honestly I am not coping well. It pushed my anxiety into overdrive and I am literally ruining all that is good. But I usually watch murder muster shows. It calms me.", "myrimirmir": "I’m reading a book about being a child to a narcissistic mom. &&&& watching videos gamers on YT. 😆", "alexaxo_": "Thank you for this! World war Z FUCKED me up lol", "anza.bby": "Animal Crossing & Music. ..... & Nightly bating. 👏", "thatssobundy": "I think I do the same thing but with like murder mystery- formulaic shows. Some funny, some more serious. Currently watching: Balthazar (French) Agatha Raisin, Father Brown, why women Kill, death in paradise", "thatssooopink67": "Your so beautiful 💗", "urbanxplayatx": "I’m creating content! Just trying to keep productive during this time since I often make the excuse that I’m too busy!", "astonnicole": "Thanks for this list! I just watched outbreak.. now I’m watching containment!!!😂", "anime_over_friends": "I hear outbreak is also a good movie", "eyecandypersephone": "1) grateful for this movie list 2) I’m planning out what my new normal will look like- pulling out old projects/books. 3) Dividing my time so I’m not bored or my mind isn’t wondering.", "country_roads.7923": "Powerful ❤️❤️❤️", "dubuthickie": "Non-stop baking, cooking, and smoking. I’ve always worked from home so I’ve been handling pretty well especially since I like my roommate 😭 Also forcing everyone to deep clean the apartment and keep up with cleanliness. Been v deep in my feelings but staying busy with things I’ve been pushing off helps manage it. We’ll be fine :~) We’ll come out of this a new bitch", "aryanaalexa": "It’s definitely cathartic. Thanks for list ❤️", "dyllwww": "I stg you are a ray of hope. Thank you! I’m checking these out ASAP.", "paget_ross": "Accepted donations for food for shelters! They closed the cafeterias at the shelters here so they are handing out sandwiches. If able, it’s a good way to give back and feel a sense of community and that we’re all supporting one another. But now it’s time to watch all the horror movie recommendations....", "king_me_4evr_23": "🌹🌹🌹🌹🌹", "chuu.cha": "Thank you queen I needed this 💞💞", "_kreyolmami": "Yoga in the morning and at night and crocheting. I found out some devastating stuff this past month so I’m just making blankets and blankets and it actually calms me.", "pierr.e": "Gorgeous shot!", "misss_sassy_pants": "🙌🏾 Thank you! I’ve def always been a fan of this genre!!❤️", "frobatim": "Take care of yourself!", "liminalsun": "Furn Gully lol literally just watched it!!"}