{"ceciliamcruz": "Favorite strip club(s) of all time?", "dqtheproducer": "Would you check out my music?", "fleekdesigns365": "Check ur dm for info", "cutzbyluv": "Introvert? What's your zodiac?", "adri10.31": "Was your first SW experience more enjoyable than nerve wrecking?", "upherass89": "Why am I addicted to an🍩l 🥴", "x.jozzi": "What's your fav meal", "long_hairs1": "You experience with king nasir?👅👅👅👅", "emmajunior________": "Can I dm you", "bizzybiancaa": "@raquelsavage what did you focus on/specialize in when studying? Do you have your MSW?", "forever_urs_1111": "Hello @raquelsavage I want to know what are available solutions other than going for an operation, if a gal want to have sex with her guy without protection, taking his cum inside but don't want to get pregnant. What she can opt for then not to get pregnant.", "lavish_abundance": "So seductive!🔥🔥", "nguemasalvadoresono": "Fucking", "fiercely_exquisite13": "Any advice for grad students considering the current state of emergency and/or contacting professionals in the field for advice on starting work for sex therapy or sex education? Thanks in advance.", "fahrehl_tz": "@raquelsavage em in luv with ur skin color and sxst body ..hw can i get info to create some sex busness with u?", "gemzibabybe": "How did you start your online business? What tips would you give for starting an online coaching biz?", "play_boy69s": "dm on girls u want 8inch🍌 then dm🔥", "theamericandon": "Sexy ass nicesssssszzzzzzzzz", "mwksh_m": "💓💓", "alialleza": "🔥🔥🔥", "darookiefilmzltd": "😍❤️🔥", "coolbreeze_rome": "If you could make this world better, what would be the top three things you would do?", "ladyoftheisles22": "What if you aren't absorbing anything in school? Is that sign to take a break?", "jazzyclassy08": "You’ve never been satisfied by small dick? And what’s the most number guys you had at once?", "kaylamariej": "Advice for a young black queer kinky woman who is interested in pro-domme work?", "texasmade12th": "How i like it, legs in the air", "cocoaafrodite": "How do you loosen the reins when you have control and anxiety issues that may cause vaginismus?", "scoe1215": "Who’s been your favorite male and female to shoot with? And can we get a video with you ,@realmonedivine and a lucky guy lol", "iam_diplomat": "Would it be cool if I did an XXX art rendering with you my girl and myself?😁😁", "wellmademannn": "just sent u a dm", "soosweetlady": "Do you regret taking a break from being paid for sex? I was following your twitter thread when you first made the decision to (ACTUALLY) stop lol", "ali_zaveri123": "Whts ur fav. Positions in s*x??", "allhailfox": "I remember you mentioned doing FSSW getting almost $1k/hr. What was your process of raising rates? Going from low hundreds to upscale /celebrity clientele...", "perashay": "*possible aspiring s*x worker* how do I start out on OF if I feel like I don’t have the right equipment (camera, editing skills, enough toys etc)?", "howdopeishe": "🔥🔥🔥", "artbyvenusstudio": "Do you know I love you??? Lol 💕💕💕", "jaysosa77": "What's one of the funniest things you've encountered being a sw? And besides money, what's the second favorite thing you get out of being a sw?", "turn5990": "Does size matter??", "ssaerbearr": "what does your friends circle look like, with them knowing that you are a sex worker?", "pallasrising": "You’re one of my favorite people on the internet. That is all ❤️", "jotofantasyremix": "Who would win in a war? The Barbz or the Bardi’s? 🤔", "wellworx80": "What got u into doing therapy, coaching, and sex work? Which did u start doing first? Is it difficult to balance them all?", "justben4now": "Are you into white men at all ? Whatever your answer, why or why not ?", "autumnperri": "CW: narcotics Have you tried any dr*gs? If so, which one? 😭", "pauldcosta_______": "Marry me honey", "stark_famd": "Will you ever put out free content that’s not Patreon or onlyfans", "just_ally1": "Favorite places to buy tops/lingerie/jewelry? Best underwear brand? What's one movie you could watch endlessly? What's your most recent self discovery?", "ladypharaoh14": "Have you watched Philosophy Tube's video Sex Work (on youtube)? Would love to known your thoughts if you're up for it? 💖💖💖", "misssaraedesseg": "Do you ever plan on getting married and having kids or will you be the cool travel Auntie in the future?", "maze360g": "Nice birthmark! 🤩🤩", "massimomoal": "🔥🔥", "joelemaine": "Would you work with Nasir again", "the_muscle_whisperermia": "No question, just appreciation. ❤️", "lordstoney": "😘👣", "martinajpeg": "I really appreciate the work that you do, and what you stand for 🙌🏾💕", "thecollectress": "What are ways to get cis men to be more exploratory and sex+? Maybe I’m just not asking the right questions lol 😂", "remembersmile": "Favorite type of cheese?", "hahriss": "Is there a strategy or more formulaic way if determining if non-monogamy is right for someone?", "piratetravis": "What's the last show you've binged? Your binge and tweeting as you went through Game of Thrones might be one of my favorite twitter threads ever.", "prettyrik": "Do you think the effects of anxiety in regards to sex life for females will improve over time or it is what it is?", "aturner_813": "When can we have back on our ishtalk podcast?", "pechidah_mar": "we all are", "sydneyeva": "How to prepare for head?", "smokedatgreen": "How do you feel about Ari asters first film being there’s something strange about the johnsons?", "cbgxo": "Favorite color?", "quasi_pee": "When are u coming on instagram live?", "therealsixnine": "Who are your three most favorite people living or dead", "mr.franklin_vs_lilben": "Y u not apple Pocast", "trendystepdadd": "favorite place to buy lingerie from ?", "itsnotcindy": "What's a hobby you always wanted to get into, but haven't tried yet?", "le.mack": "If you were filming a scene right now, what would you be doing or want done to you?", "amordemorado": "What advice do you have for people who are looking to find friends or romantic partners who will support their growth into their own sexual identity?", "leedvslydia": "What’s the best advice anyone ever gave you?", "idgt55": "U squirt", "skynetesq": "Tips for deep throating?", "makutilee": "When you next you coming home to DC @raquelsavage", "chris_mmonks": "What is something about yourself people are usually surprised to find out?", "birthnameking": "Just wanted to say that I always think of question for you when your not asking 😭😭 thanks for ur content!", "heyitzsarai": "What made you decide to become a sexual educator? And what advice would you give someone who is looking to pursue the same?", "cryinglaughin__": "Why do u like big d**k if cl*t play is the way to pleasure?", "r__ariel": "How does it feel being such a baddie?", "southern_gentleman225": "Whats your dream city or country to visit", "youngboirod95": "What's your favorite positions", "berdman82": "Teach me!", "mandabrownrigg": "Not a question. Just a femme who really appreciates your insta content ❤️🔥", "lucylu204": "How did you first decide to pursue sw full time?"}