{"bobsneighbor": "@adiakun8893 #MyFriendIsAStar you EXCITE ME and INSPIRE ME to be a better social worker, clinician, and person! I love you so much. Thank you for being apart of my life and being so supportive. You really are a star 💕 and you light up the world for so many families and for me!!", "iamsarian": "#myfriend is a star @jafarence ilysm! u already know", "kalonnoor": "Damn she posted this on my bday too and I’m just not seeing it. Today is the last day 😩🙏🏼 @noehme_ #MyFriendIsAStar", "kristaliize": "#myfriendisastar she shines so so brightly despite the ever present darkness in this world. because she’s my North Star and I can trust her to guide me back home when I’ve gone astray. Because when I see her, I can wish for better days. She’s fierce and red hot, a supernova of vibrancy and beauty. My universe my galaxy my @ayoaegyo no one has pushed me to grow like you have and I’m so so grateful to have you in my life. You bring me joy kindness softness strength and brutal honesty when I need it. They say that we were all born from star dust, atoms collecting from sister stars. Perhaps we were always meant to collide. Maybe we were always destined for each other. 💫", "rodericklayugan": "Love that nice pussy.", "brobinsonsquare": "Beautiful and sexy queen😘😍❤️💍💯", "spicygordita": "this the one @its_adeerbra", "vivalacocoaa": "@ashshalee @african_motion you should do this!", "gabrielwatson9": "🤤🤤🤤🤤🌹😘🤤🤤", "debflo94": "@alexismarieoxo you are everything. From a beautiful majestic intelligent strong woman. An amazing genuine friend that I cherish and adore. A mother and woman that is loved and appreciated. I love you so much. And I hope @raquelsavage picks us to win this cause I want and need this so bad. Lmfao 🤣🤣🤣😭😭😭and I want you to try it. #myfriendisastar", "naturelifepride": "😍sexy", "bernackigerald": "wow baby👅💞", "hoodsta_huff_from_the_hills": "Damn ma!!!!😍😍😍💙💙💙", "jvicentearaujo00": "Boa Boa 👏👏👏👍💋💋💋🔥🔥🔥🔥", "romenil_santana_": "❤️😘", "lastoftherealclothing_co": "Can u demonstrate how it works u kno like a tutorial", "benim.ben5": "🍕🍕🍕🍕🍕👅👅❤️👄", "abo_talb2014": "😘😘💋👅👅👅💋😘😘", "mohamedabdelgany61": "👌👅👅👅🔥👉👌👄", "antonioclub7": "💗🔥", "gaina100": "@channy_crossfire you are such a good person to me always being there for me and being easy to talk to for so many years! So, I hope this sex toy can change your life 😘 #MyFriendIsAStar", "hamidkway": "You love him big come to the inbox 🔥🔥", "jaystr821": "👀👀", "jonnyhernen": "😱😱😙🍔👌👌❤️😙", "wutangu": "#MyFriendIsAStar @kutchha", "anyeaa__": "#MyFriendIsAStar When you talk about being a star, @riyborg has to come up. Lol She is definitely Black woman magic! She is not only an amazing nurse who works hard and takes time to show care and compassion for her patients, but she has helped me realize my voice is needed in this world. I talk to her almost every day about the most random topics, from beauty, to sex and politics, and she never fails to make me laugh and really hear me and show me that what I have to bring to this world is valid! As hard as she works, I definitely think she'll appreciate the womanizer starlet ⭐🌠", "annelees": "@cc._____ #myfriendisastar you've always been There for me and understand me better than anyone. You're an amazing sister, hard worker and my best friend. Hope we win the raffle and enjoy 😁 @womanizerglobal @raquelsavage", "simply_amayesing": "#myfriendisastar because she chooses beauty, strength and resilience in the face of depression, she is one of the most brilliant women I've ever  met. She is kind and funny even when she feels like she has to fight the world for even the smallest sliver of joy. She has taught me so much and encouraged me to stretch my thinking and shaped my outlook and opinions on so many subjects.  When I'm feeling defeated she encourages me.  When I'm feeling nervous or scared she reassures me when I'm doing whats right.  She's been a pillar of truth in my life without the need for \"brutal honesty.\" She is an absolutely phenomenal mother and caretaker for those she loves.  She is brave and recognizes her strength in standing alone but also works beautifully when woven into the fabric of a team.  Last but not least, that ass doe! She deserves countless orgasms whether from man or machine. Love you @jasmine.mcgowan ❤️", "oddviedo": "@jewel_thecandyshop you're honestly my most supportive friend, and I don't think I would be the person I am today or even as comfortable with talking about masturbation if it weren't for you.", "jeannecms": "@olvsmrd you are a star because t'illumines la galaxie, because you are a queer icon, because you always deliver, and you deserve a brand new sextoy since you're going alcohol free #MyFriendsIsAStar", "iamrubyann": "@izzee_rascal #myfriendisastar for bringing softness, self love, acceptance, knowledge, kindness, thoughtfulness into my life when I felt I didn’t deserve it and for you being the mum everyone deserves to Kai and the mum I want to be. I love you eternally and wish you all the orgasms! 🌞👩🏼👩🏾‍🦱💕", "come.clo_ser": "#myfriendisastar because we can tell us everything and urgently need such a womanizer 🔥🔥🔥", "moisturizedmami__": "#myfriendisastar I already know my RoD gonna wanna beat my ass for this but she know how to talk to me and help me reason, we the same person but have our own quirks. When I need her she’s there @___dxpe._", "the.holistic.goddess": "#myfriendisastar because she’s always been there for me when I truly needed her. Her confidence and attitude have been such a positive influence on myself, her strength gives me strength @shadybaby123_", "hannanas_12": "@evi_granditsch you're a star because you manage to stay positiv no matter what and whenever someone near you is feeling down you always cheer him/her up! #myfriendisastar", "skayleemanfish": "#MyFriendIsAStar Hey look it a contest made just for you. @itsharleyvana you are resilient, kind, and extremely educated about your profession. Your determination to make sex work a more widely accepted and understood profession through publicly education via social media is so admirable. Also, that booty.", "livspoken": "@vivalacocoaa do this with me?", "goddessarmor": "@gillian_leigh8 - pretty sure you'd love to win this just as much as me!! 😂🤗", "boujiebluntsnbitvhes": "@kiharrah.j you’re a star!! ❤️", "m.e.h13": "@kortnee_kreider #myfriendisastar you're a star for surviving nursing school and so am I. We deserve this shit 😂", "fhelype075": "Eita porra", "bbygrlshayx": "#myfriendisastar @_babyitsantoo_ I love you ! She is so smart , kind and sweet , such a beautiful girl girl who deserves it all!", "kenyatherapy": "@glowingupinnuevayork #MyFriendIsAStar 😘😘😘", "devinkates": "@butimjade #MyFriendIsAStar because she’s always there to hype me up and understands me to the depth of my soul. My cancer queen, and favorite day drinking buddy, who’s a mentor, sorority sister and wants to help the youth by becoming a teacher. If this doesn’t get you to start diddling I don’t know what the FUCK will but I LOVE YOU SO MUCH ❤️❤️❤️❤️❤️", "notoriousnichie": "@americassweetheart #myfriendisastar You are a star because you are one of the most selfless woman I know... you have always went above and beyond for me... from helping me migrate my depression to being there everyday after my brother passed in front you.. you have been more than a friend to me.. honestly blood couldn’t bring us anymore closer... I’m forever indebt to you.. I love you more than words can ever express...", "talioop": "@juliehoneybee because she is my ride or die. She makes me kimchi, knows how to calm me down when I’m having a terrible day and sends me my horoscope on the regular- always keeping me in check!!!! She is one of the most powerful, most beautiful women I know ever. She is an absolute icon. #myfriendisastar", "sin_the_a": "#myfriendisastar @_kneeka You are a star to me because you have help me get through my anxiety, you have always been the big sister I’ve always wanted. I’m getting teary-eyed just thinking about. I am so proud of you and your growth in life, you accomplish all the goals you set for yourself. I love you!! 🌻🌻😍😍 Also i do hope we get these lol", "sunimisali": "@luna.minxx @gabi_sachs @chloemusijx #myfriendisastar 🤤", "alysamonique": "@curlycalla._ @ahdehzeh @jadorekevondior ❤️❤️❤️❤️❤️", "meganromella": "#myfriendisastar @briellynni 😝😝😝", "theiyalode": "#myfriendisastar she is one of the most amazing people I know and I am beyond grateful to have had this chance to know you and love her. She is ambitious and so kind. Funny and so intelligent. Protective and so caring of all that concerns me. I’ve nvr known love like this till now and I can’t imagine life without it. I love you @doloreswoods.psd ✨✨✨ Shine bright baby lol ✨✨✨✨", "whoiscypress": "#MyFriendIsAStar because she is a feeler. We work at a reproductive healthcare clinic and she is consistently so compassionate towards our patients. She’s also a star because of how she connects with the people around her. @kathrinlewis basically stans reproductive justice and doesn’t hesitate to let others know how to get involved and make a change in the community.", "alinab1404": "@jssckstnr #myfriendisastar because she is the jenny Person u know. 🥰❤", "cryingisfine": "#myfriendisastar because they are supportive, kind, strong and give their life to the pursuit of making the world a better place for marginalized people. Even though we are long distance they have my back all the time (financially too even though they also struggle) and I could not be more grateful to have them in my life. A generous and loving person like them is hard to find and I feel their love for me often even from across the country @teeeeenah", "_michaelanormand": "#myfriendisastar because she always is there for me, no matter how ridiculous our lives got and despite the fact that we haven’t seen each other in a while doesnt matter bc ik i can always reach out to her and she can reach out to me. she proves that time and time again, especially with my franticness from everything that happened last fall 💕 i love her so much and want to give the world to her 💐 @kylie_swenson", "mu5ici5life": "@mrskendallmonet_ I bet you would like this.", "shoutouts_gymhub": "🆈🅾🆄🆁 🅿🆁🅾🅵🅸🅻🅴 🅸🆂 🆂🅾 🅰🅿🅿🅴🅰🅻🅸🅽🅶 🆈🅾🆄 🆆🅰🅽🆃 🆃🅾 🅿🆄🅱🅻🅸🆂🅷 🅾🅽 🅼🆈 🅿🅰🅶🅴🆂 🅸 🅷🅰🆅🅴 🅶🅾🅾🅳 🅾🅵🅵🅴🆁 🅵🅾🆁 🆈🅾🆄 🅲🅷🅴🅲🅺 🆈🅾🆄🆁 📩📩📩", "la.rosaaaaa__": "@paty.patrona", "_emily__xx_": "#myfriendisastar @animalsofwonderland My friend and my big ‘sister’, she’s been with me through the hardest of times struggling with my mental illness. She’s the most authentic person I know, always striving to be the best version of herself and encouraging me to do the same, she inspires me to be a better person(for myself). She is a strong woman who has enough love for herself and those around her, I’m proud to be able to call her my sister❤️", "siu_the_oracle": "@gwynpow #myfriendisastar for my ride or die 💪 this girl? My whole world. She knows my seasons as if they were her own. Bonded for life and she deserves every good thing I can give 💛", "anexceptionalgemini": "#MyFriendIsAStar @amblizzy you've been the best friend I could ask for. Not perfect, but always constant and always such a positive force and the best support I can ask for. You're honestly the love of my life and you've taught me so much about myself and my relationship with others. I'm beyond grateful to have had you in my life for so long and I got your back with whatever from forever to infinity! That's why you deserve this nut girl lololol plus how cute would matching vibrators be @amblizzy", "joanxfal": "@jjanu_v #myfriendisastar because she’s artistic, intelligent, ambitious and has a heart of gold. We have the greatest of bonds and she pushes forward even in the face of adversity. She has inspired me to explore my passions and is my biggest hype man. I couldn’t ask for a better friend 💞", "chelsea_tm": "@laura387 omg I wanntttt", "naijastallion27": "#myfriendisastar @delia_quailey she’s extremely smart and although she faces a lot of challenges in life she continues to be sweet and kind and a wonderful friend and sister❤️❤️❤️❤️❤️❤️❤️", "publichumanist": "#MyFriendIsAStar 🌟 @mmariecarroll our femme rage is unstoppable", "notxredxvelvet": "@_gabbyguz", "nae.yellow": "#MyFriendIsAStar @bshelita because she is resilient ! She accomplished everything that she puts her mind to, before the age of 30 she has established a career, bought a home, manifested the love that she deserves, continuously supports and uplifts the people around her, is an amazing godmother to our babygirl and literally has a heart of gold. She is super genuine, always positive, gives the best advice and is overall super supportive ! I love her and I’m blessed to have her as a friend and a sister.", "durbsey": "🔥🔥🔥🔥 @harrietjane27 sounds dreamy! #myfriendisastar 🎉🎉💦", "tilturheadbackandcloseureyes": "@thecreativityfactory YOU ARE A STAR IN EVERY WAY MY LOVE⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️#myfriendisastar", "sturdyambz": "#MyFriendIsAStar @2_nandz my bff, my soul sister, you are a star for so many reasons: you’re constantly looking out for everyone in your life and even though I wish you would be more selfish, it is a character trait that I can’t help but admire. I don’t know how I would’ve survived college without you and I know many others who need your presence in their life. You’re a gift and I love you. No one can make me cackle and holler the way you do and there’s no one else who brings me nearly as much joy. I cannot wait to embark on a lifelong journey with you bc fuck a man and fuck dem kids if I can’t have you by my side! As we start our new chapter in Spain, I look forward to growing and flourish alongside my best friend and hopefully with an amazing ass sex toy lmao. You deserve an ear ringing orgasm!! and shiiiiitttt, SO DO I!! 😂 love you sis 💓💓💓", "lind.x.say": "@imjustthamie #MyFriendIsAStar because she’s my friend for many many many years. I’m really glad and honoured to have her as my friend and see her evolution. She’s a wonderful woman and I saw her evolved in so many ways. She been through a lot but she was able to come back stronger than ever. Thamie is amazing , caring , loving and really supportive 💕💕💕💕💕", "nanasgottaman": "@mahorawaenga_ Bruh I brought one of these and oml 🔥🔥", "mamajadestone": "#myfriendisastar @gelica_francine you are the strongest, most resilient, most innovative woman I know. We have been besties for what seems like forever and I know that I can always count on you. Whether that be for a shoulder to cry on or just an all around support system. You’ve seen me at my worst and you are striving for me to be my best. As I am for you. You can flip a bad situation into a come up faster than I can even finish typing this sentence. You are so smart it’s almost scary sometimes because I think you don’t know your full potential. Anyone is lucky to have you but I’m definitely very lucky because I get to call you my best friend. Never change boo! You are a light in my life. Love you! ❤️❤️❤️❤️❤️❤️❤️", "synthentacle": "#myfriendisastar @itzrobyns bce omg look at her but also she always lets me crash at her place and always treats me 💖 tell her happy bday 🎂😘", "thecreativityfactory": "@birdbrainn YOU ARE A SHINNING STAR NO MATTER WHO YA AREEEEEEW", "kay_kay_941": "@izzy941_ you’re a BAD BITCH, you’re love for the people you care about is unconditional. You’re never afraid to tell it how it is and I’m comfortable coming to you with everything. You wanna do amazing things with your life, and you’re going to get to do them. You practice what you preach 100% and I admire that about you. Most of all you’ve been my best friend for 10+ years and I wouldn’t have asked for anyone else #MyFriendIsAStar", "cayleejune_": "@2wilder4u #myfriendisastar", "dreamersxloversx": "@adreana.jayne", "kriztastical": "#myfriendisastar @kendallwillett we’ve been through hell and back and always come out on top. I can tell you anything and I know you won’t judge me. Ily", "_queendee_09": "#myfriendisastar because life told her NO at every angle yet she still has made a way. She’s graduated with a dual degree, got a job at a major financial firm, and is living on her own at 22. Making a way and proving that with hard work, great things can happen. She’s a great example to her niece. I’m so proud to call @robynhood_ my best. Keep folks around you that make you wanna be better, go farther and make meaningful change! Love you hunny! You deserve a soul snatching from this toy! Lol", "itscherrydarling": "#MyFriendIsAStar because she encourages me to live my best heaux life (re: that time that as best friends we fucked a pair of best friends that we just met at the beach) but she also came all the way across the country to save me from an abusive relationship at the drop of a hat. Get you a best friend who encourages you to be the best heaux you can be but also the best person you can be. And also because she introduced me to Raquel savage and it literally doesn’t get better than that. @kayliekennedy 😘", "gay.falafel": "#myfriendisastar @domeni__ca you're always so amazing and supportive and always have my back and let me fuck around with your hair!! 😂😍💜✨", "dulcededesiree": "@laurenalexanderp #MyFriendIsAStar because they have slowly grown into their truth- even when it was painful, even when it was lonely, even when it was scary. We boost each other up and we have each other’s backs. Love you boo, I see you living your truth", "allimatfresh": "@allicatpresh", "honeysanca": "#MyFriendIsAStar @viakeisy my friend Keisy is a Libra Queen. She is THAT bitch. A fashionable scholar. a meme connoisseur. An Ivy League thot. A supportive slut! A fierce feminist. Supportive, hardworking, thoughtful, The list goes on hunny. She deserves this !", "ch_ch_ch_dria": "#myfriendisastar you a star simoly because you’re related to me ⭐️ 😁@intuitive_vibrations", "0kthanksbye": "i might have to make my account public for this 😭😭😭😭😭", "shyplant": "#myfriendisaSTAR you’re a star because you’re a fantastic bass player, our pussies be trappin these dudes, you’re my aries moon queen, and your make up is impeccable @coneja111", "thereallukeb": "@lost_duck ❤️❤️❤️", "forager_l": "#myfriendisastar because she’s intelligent, hilarious, beautiful and best of all weird like me. She’s a star because she’s always got my back, she’s honest and brave and assertive and still manages to be unbelievably kind in ways I haven’t figured out how to achieve yet ❤️ @mar.mun.rod", "savannahrelyn": "#MyFriendIsAStar @ashgooods is a muhf*ckin star because she is one of the hardest working women I know and I am so proud to see her do all she can to get what she wants. I fucking love you man. We both deserve this! Lmao 💕", "theafrocentrichippie": "@kasadea0728", "sixthstreetsocial": "#myfriendisastar because she is a masterclass in being a powerful sensual and all around amazing person. I couldn’t be who I am without her and on top of that she is such a fucking amazing Mom and friend. She deserves a mind blowing life and toys! 😂😘 @ari.michele", "leticiaisnothere": "@samanthasaysbye because you love sex toys.", "everythinggbagels": "#myfriendisastar @_lunarvelvet_ bc both our birthday is less than 5 days and we deserve this lmfao", "em.renae.1218": "@alexis.mollohan You are such a goddamn light in my life. We were friends for so long (You liked me as a person even in middle school??? WHAT?!!!?) and despite having a bit of a breakup, we came back together in the most wonderfully uplifting way. I love that we can count on each other for advice on absolutely ANYTHING. I genuinely hope that I always have you in my life in some way or another. Love you, pal. 💙", "beauvaim": "@squat_rack_shenanigans my bestie is a boss in literally every aspect of her life: passionate high school teacher, fierce dog momma, mind-blowingly insane powerlifter and bodybuilder, loving wifey. Girl does it all. I dunno how she does it.", "j.camille33": "#MyFriendIsAStar 🌟 For almost 15 years @lauren_l_small has been my biggest cheerleader. She’s been there for me during the best of times and the worst of times. She pushes me to be a better woman, while also loving me for who I am at this current moment. She’s undoubtedly my soulmate! 👯‍♀️", "larry.mcduffie.9": "How does it work????", "ralnnn": "@tiarahbissonette", "whoiscierra": "@keepitinthesneaker you are beautiful, funny, strong, and most of all, da baaaaaaaddest!! I know I can always count on you when life sucks and I am beyond thankful for having you in my life! #MyFriendIsAStar", "allysun_wonderland": "@yourinnerminx #myfriendisastar she’s my mama! And she’s a sex and life coach who is always there to help me process and talk through any of my relationship or sexuality questions. So grateful to grow up with a mom so open and honest in talking about sex. 💕🤗Love you maaaa", "mango.pole": "#MyFriendIsAStar @suzy_schaffer and I became best friends about 5 minutes after meeting each other. She’s a strong, smart, and beautiful woman with a heart of pure gold. She’s been through hell and back, but she’s still kicking ass in the world. Over the years we’ve seen it all and pushed through everything to make our dreams come true, and now we’re 4 years away from becoming doctors in our fields. She’s a PhD student in clinical psychology and is already making a difference in the lives of people every day. She’s going to change the world, and I’m so proud to have someone like her as my best friend. We’ll change lives, one animal and one mind at a time. I love you Suzy 💕", "softcoremija": "@steph._.anieej my sister ....#myfriendisastar I CAN SIT HERE AND TELL U endless great things she’s done. She is a selfless Taurus who deserves an orgasm. Tbh might be her first !!!👀She’s a mother who works for her family and deserves some ME time at the end of a hard day. I couldn’t imagine anyone else who would need a big fat nut like she does lol. With money going towards survival for her and her little one there is no budget for sex toys. She needs her first and what better than a @won anizerglobal😍 BUT SERIOUSLY PICK HER SHE DESERVES TO EAT HER CAKE✨👑👑👑👑👑👑", "livlovelivliv": "#Mybestfriendisastar because she in the most supportive and encouraging friend one could have. Her heart is pure gold and I’m not sure what I would do without her. She encourages me to follow my dream and remember who I am. She was my inspiration for making that final step in applying for midwifery school and following my dream. She brings me back to my power when I feel the weakest. She was there for me in every transition in my life. The last 10 years would be nothing without her. We intuitively know each other so well that the universe seems to connect us anytime one of us is feeling uneasy or struggling. I love you Ashley, thank you for being a light in my life❤️ @iamashleyjordan", "queengigi__": "#MyFriendIsAStar @kulture_dej she is not even a friend she is like my sister. We have been through the good times and bad times we have both grown into mature women. We inspire each other to future our careers mine is makeup and hers is hair....... We will always have each other’s back that’s why I think we should try it because fuck these Nigga let’s fuck ourselves PERIODDDT 🤣🤣🤣 @raquelsavage", "keepitinthesneaker": "@trap_moneypenny6 #myfriendisastar Bc she the REALEST n I can ALWAYS count on this witch to cheer me up and hex people!!!!!!! See u soon babyboo", "heavenshoneyypot": "#myfriendisastar @angelenarose_", "_uhhhmmlyssagauna_": "#MyFriendIsAStar @_lllie strong independent woman who don’t need to man to pay her bills , loving cat mom, doesn’t let men walk all over her and treat her like shit , doesn’t take shit from anyone. Also needs a good orgasm since lots of these men out here don’t know how to please .", "_barbellsandbrews": "@kpwlck always there for me when I need her! #myfriendisastar", "ifiwereyourgirl": "@kemiolamorris #MyFriendIsAStar because she is one of the most selfless, caring, gorgeous and fun women I know. You inspire me to be myself and chose happiness ❤️", "septemberkuush_": "#myfriendisastar because we have literally been through everything together! From being in the game to squaring up lol. My ride or die my partner in crime. Through the weak ass niggas and the fakest bitches. It’s always been us ❤️ from turn ups to just being there for one another in our lowest of times. And my first born son’s God Mom ❤️ love you bitchhhh @duh_thats_t", "manalidatar__": "@majella.davis #myfriendisastar who faces hardship head on and is passionate about making herself and the world a better place. and baby girl needs to get her jush 😉🍆💦", "teclea": "@cleovictory", "blahgirlmagic": "@kaylenolivia", "otterlytof": "@jessicafocht this is the one I was talking abooouuuutttt", "hippiechickjade": "#MyFriendIsAStar... because she might be the only reason I became whole again after the HARDEST year of my life. Because of a “man”, I was stripped of all confidence and self worth, but @ladybsuga reminded me that I am worthy. Our first experience with toys we bought matching little pink vibrators that we still have/use today 🌸🌸🌸", "katiemargareta": "@sugarhunyicetea is a star because she is a ride or die friend. She always motivates me, holds me down AND lifts me up. She’ll be at my side if I ever need something. She’s a hustler, an entrepreneur and an all around BOSS. #myfriendisastar ⭐️", "gabmilby94": "#MyFriendIsAStar because she has been through so much since childhood becoming the strong woman she is today. I admire her so much for her tenacity and drive. She is so much bigger than Atlanta, she wants to see the whole world AND currently has a job helping people from other countries. She sees what she wants and doesn’t stop until she gets it. She has the biggest heart and is always positive. She has also been there for me during some dark moments in my life, always with a smile. She lights up every room like the true star is is! ⭐️ @kandyroc_41", "vivalabec": "@samygeex3", "nobra._.noproblem": "#MyFriendIsAStar bc she gives everyone her heart entirely, whether they deserve it or not 😥 I love you @getdripp3d ty for always being there for me ❤️", "duckieeeeee_": "#MyFriendIsAStar @yeahitsmari something new and fun!!!!", "ceejgoode": "@_natalie18 #MyFriendIsAStar and deserves to get her clit sucked 🤪", "po_slim_": "😍Very pretty girl", "dorothyatkinson": "@whitneysymone", "jordanrenee": "#myfriendisastar @innyvinny", "nessalynn14": "#myfriendisastar @chelseainthesky you're a boss ass bitch for doing your PhD!!!! And being there for me always!!! And being supes knowledgeable about sexy toys 😂 I think you're a star for that!", "ashalucinda": "#myfriendisastar @imanakilah your one of a kind personality is sure to have a impact on everyone in the room", "kuntessa": "@hannatonic let’s win thisssss ‼️💦💦💦💦☔️", "haileycobbb": "@ninabronfy #myfriendisastar 💫 because you are my forever friend💓 you’ve helped me learn how to put myself and my mental health first even during some tough times this past year. You’re someone I look up to and can be 100% honest with and I didn’t know I needed a friend like that until we reconnected!😭 You inspire me to give love and feel comfortable receiving it too! You also inspired me to buy my first sex toy so oooh look how the tables have turned😂", "jelenyy_": "@cydphysticated", "nabuma_r": "@yellowest_days", "mommyrn815": "#myfriendisastar @just_plain_nita look i was just telling you bout this last night. My friend is a star cuz shes a new mom working full time and holding it down yet always there when I need her to drink with me 😭😭😭😭", "ellythv": "@melodyjvckson #myfriendisastar here’s to my og best friend, the better side of me, the baddest bitch. my twin flame. her stability and her strength is an inspiration. she somehow remain calm in all situations and is always the bigger person. has the kindest soul (along w heavy sarcasm and “i told you so”s). she deserves the world and more but maybe a nice sex toy to get her through a recent heartache (cause men are trash and can’t be trusted)", "scorpio_crybaby": "You’re a star you headass lil bitch @leahst.shady", "kimmiemunster": "@blanquitayaneth #myfriendisastar because she’s going back to school (for the third time!) to become a therapist and give back to women of color like her. Also one of the most sex positive and boss ass bitch that I know and love 💕 and also loves to call men out on their shit because they deserve it", "kateemley": "@kayleevvilliams #myfriendisaSTAR Kaylee is one of the best people I’ve ever known!! She is literally always there when I need her and makes me laugh so fucking hard even when I’m sure I won’t even be able to smile. I haven’t felt soul mates with many people, but I know that she is one of mine because of the ways she can understand me even when most people cannot. Love you bb let’s jack off together lmao!!!", "yin.essence": "@laphoeenix GURLL😻💓", "theisogaway": "@taffy.fh #myfriendisastar because she is opening her own freakin' restaurant like a the boss ass human being that she is 😍", "kuiet1storm": "@misssjonesss you are such a fucking ⭐️. We laugh we cry and we take on the crazy shit in this world. Love you girl #MyFriendisAStar", "jhalenaaliyah": "#myfriendisastar @_cheresehunter - you’re a beautiful star ✨", "sheis_royaltee": "@_ashley.monique #MyFriendIsAStar because she is selfless, loving, and learning herself beyond heartbreak and generational trauma. She is and has been one of my best friends literally from the first day of high school. She is always there to lend a shoulder, a helping hand, is an amazingggg godmother to my daughter, and an amazing educator to her students. We can talk about anything from life goals to sex to who actually sniffs nail glue lmaoo. We are both navigating young womenhood and deserve great toys to destress from life’s woes 😅😏", "dyllwww": "Bih this shit keeps my ears ringing.", "suzy_schaffer": "#MyFriendIsAStar @nikimturner has been my best friend since we were 14 years old. Ive gotten to see you grow so much over the last 9 years and everything you do makes me so proud. Not only are you a star athlete, but you're also so incredibly smart and beautiful. A full package! And I'm so incredibly lucky to have someone as outstanding as you as my best friend. We've seen each others heartbreaks, happiness, and everything in between. You're going to be such an amazing veterinarian. 4 more years until we both get to call ourselves Dr. And see all of our hard work come.to fruition. I luv u 5eva bbz💖", "mrdc2u": "Your nails 🔥", "carmelroyale": "To bad I have no BFF 😔 but I wanna try this one!", "alysssawatkins": "#myfriendisastar @suckmytoezzzzzz123 you’ve been wanting one of these 👀 also you’re so smart and successful and im so proud of you for pursuing the things that make YOU happy rather than the things that you think you should. You’re so strong, caring, funny and strong. Im really grateful and honored to have been able to have been in your life for the last 6 years and see you grow into the amazing person you are today because you’re kicking ass and making life your bitch.", "_yungnesh": "your pussy deserves to be treated like the princess she is and so does mine...were unstoppable when we’re well pleased. Periodt. Two bad bitches make these niggas go brazy ... let’s do this hoe @cocainekeira #MyFriendIsAStar", "wealthycartel": "#MyFriendIsAStar @kianahl you're a star because you always manage to bring happiness and joy to those around. And you also have an amazing ability to remain kind and true to yourself no matter the situation. Love u sis", "lanelllovely1": "#myfriendisastar my friend is my sister. I know I can reach out to her and tell her anything and she will give me her whole truth and not sugar coat anything. She helped me and my son during the lowest time of my life and stuck by me always. Even though we met through marriage as in-laws she is my sister for life. I’m no longer in the family and some people don’t like that we are still close and it doesn’t stop her from being my sis/friend. But I love my sis to the moon and back always. She is a true star to me because she shines her light when I don’t have the strength sometimes to shine my own. @qui_qui79", "shada__said__it": "#myfriendisastar because no matter WHAT she finds a way to come out on top while staying true to her convictions and being her authentic self! Even in a new city my bih shines bright! Congrats again on your new job sis! Fuck them kids then fuck yourself after we win these vibrators lmaooooo. @sur_sur", "feelslikeasaturday": "@5luckydogsetc here ya go 🍀", "tambruh": "#MyFriendIsAStar @lili_17 because you black girl magic personified!! Your resiliency and drive is unmatched!! Let’s catch this nut together! 😂", "mmariecarroll": "#MyFriendIsAStar @msfrizzle_is_me Sisters are friends you are related to ❤️ JoJo I’m so proud of the strong, entrepreneurial woman you’ve become", "_cierraaaaaaaa": "#myfriendisaSTAR when I saw this post I immediately thought of @rachel_montano_writes we came into each other lives virtually February 3, 2019 all because of a post about coconut oil as lube and baaaaby if that wasn’t one of the perfect ways for my sexually explicit self to meet a true friend. I love you so much. I love how we unconditionally support each other every single day. It feels like you’re always right here with me. I know I can honestly depend on your love, support, jokes, and the occasional Aries coming through to fuck some shit off on my behalf and the feeling is 100000% mutual. I love you so much @rachel_montano_writes my bad ass star of a friend that I can’t and won’t live without.", "xoxo.tinale": "MY BEST FRIEND AND RIDE OR DIE. @thecolorscarlette we have been best friends for over 10 years meeting in second grade! WE ARE FAMILY. I would do anything for this amazing girl who has been so supportive. I love you forever and always. 😘😻", "lovely29210": "@msnicety420", "maloney_09": "Brahhhh I've had my womanizer for 2 years now and it is game changing!!!!!!!!!!!! 🔥🔥", "arwaabbass_": "@a_zakareya 😂", "judy420_": "#MyFriendIsAStar @julietteshippmusic are u kidding me?! The star power shines right through you the second you enter a room! Your talent, dedication, and work ethic have always mesmerized me. I look up to you like my older sister, you truly are an amazing woman and friend. You deserve all the PLEASURE 🍭💦 and SUCCESS 💥 in this world. Keep shining!!", "kin_zey": "#myfriendisastar⭐️ @marisa.dare28 @zach_galifisnackass illlllyyyy boiiiiissssss", "alittlejazzy": "#myfriendisastar @sturdyambz you’re a star because you’re just that bitch period and you can literally do anything you put your mind to💜", "omi.o.my": "@dude.haley @suns.flowers since we were discussing this less than 24 hours ago 😄🤘🏻", "notoriousmel": "@shmam06 you are a 🌟 for helping me through the hardest time in my life, for being the hottest bitch I know, YOUR LEGS 💫💫, saving lives, and for being my first friend to talk about masturbation. ⚡️ #MyFriendIsAStar", "classick_aed": "@mightashwell", "eroticdrawstudios": "I see you love missionary 😘😘😘", "lluuvviiaaa_": "#MyFriendIsAStar @daydream1nnumb3rs you have had such a beautiful and powerful effect on my life, mi amiga 💗✨ i appreciate you so much and the guidance that you have shown me as a fellow empath and psychic. hoping we both get a chance to celebrate our bodies and that healing sexual energy with this giveaway 😂", "gloriaanicole": "#MyFriendIsAStar @paolajgonzalezz ✨✨✨✨😍💕 You’re the perfect Virgo friend to my Scorpio ☀️ self & I love our “never judgey/always open” friendship♥️ Love you 😘", "adriennedewitt": "#myfriendisastar @kerasatsokas is the most hardworking, dedicated student and journalist and my number one supporter. she really been thru it with me, all the toxic men, bad relationships, mediocre dick 😂 the universe truly blessed me with a beautiful soulmate and i love her shoooo much 💕✨", "heauxnyi": "@felicia_jayyy you are a star. We came up slanging dildos, inviting sex positivity into people's lives and now you are making a difference with transitional age youth advocating for them on so many aspects of their lives. You are such a strong person and a hard worker. I love you so much❤️ #myfriendisastar", "bigreg71": "Dammit Raquel.... you sending me", "kay.tee_dee": "#myfriendisastar @__familyjules girl you know I need this and I love you lol", "summer.maurie": "#myfriendisastar @prettyfamous___ my homegirl really the funniest, nicest, most compassionate friend 🥺 she balances working nights and going to school gracefully. She does my hair when I’m being lazy and buys me food & cook for me😭 I have a different relationship with her because we have a different understanding of each other. Love you friend.", "sasstronomer": "@janecsinger for going after ur passions ❤️❤️❤️❤️❤️", "tatiana.raenell": "all my bitches is stars @eyesclosedtight @bmills_ @ilyasahmonet #MyFriendIsAStar", "tiffylips": "#MyFriendIsAStar @chevygyrl_neesh Rodneesha you are a star because you are a WOMAN, AN INDEPENDENT HARD WORKING MOTHER OF FOUR INCLUDING A SET OF TWINS. THEIR FATHER IS INVOLVED BUT HIS JOB REQUIRES HIM TO BE ON THE ROAD MOST OF THE TIME which leaves you on your own BUT THAT DON’T STOP YOU! YOU GET UP FOR THEM KIDS WHEN YOU BEEN UP ALL NIGHT CLEANING OR JUST WORKING AN OVERNIGHT SHIFT! YOU GO WITHOUT BECAUSE YOU PUT EVERYONE ELSE BEFORE YOU AND FOR THAT I HONOR YOU! YOU MY STAR BITCH!!!! And since papa not around I know you need this toy shit I NEED THIS TOY😬🗣", "yeahthatone_": "@drafropat You is kind. You is smart. You is important. Now go follow those people so we can get this clit work. #MyFriendIsAStar", "bratpack02": "#myfriendisastar best friend @acostawhitley first thing first. Do you know what today is? It's our anniversary! Happy 10th Anniversary best friend! We've have gone through highs and lows, happy and sad days. Not once has our friendship faltered. I mean it when I say you complete me. You are the Leo to my Ram and I don't know what I'll do without you. You'll forever have my whole heart. I love you! 🥰😘❤️ #myfriendisastar", "whiteautonomic": "@wasshanninn_ #myfriendisastar shes constantly working in to improve her self and rise to her life's purpose ❤️", "jujubangu": "@deathdabforcutie ur a star bb", "not_nzingha": "@asante_campbell !!", "bikedyke_": "@paperdoll91 #myfriendisastar because she’s always been there for me through and through. From highschool, to college, to adulting, and bad relationships. She’s my ride or die and sister and we deserve some pleasure in our lives lmao 💖", "distinguisheddragon": "@indigogiantess #MyFriendIsAStar because in the 10+ years we've been friends, we have grown together and she has taught to me to love myself, and helped me see myself through the eyes of those who care about me. She is candid, bold, unapologetic, compassionate and a force to be reckoned with. I love her so much and would not have grown emotionally as I have today with out her. ❤️", "spahgat": "#myfriendisastar @adelaidov you have always been one of the most important people in my life from the moment we became friends. i really don’t know where i would be without you! you keep me balanced and get me through the day! you call me whenever i need it or you come and see me and that truly means the world. we have these plans to move in together after college and i can’t wait. i love you so much and i can’t wait to see you next!", "caityl1n": "@storytimewithloves I’m tagging you bc you are supportive, loving and generous even when you are going through a shitty time. Love you forever. #myfriendisastar", "bakedpotatochan": "@bernardin.e #myfriendisastar because she supports me in my endeavors and shenanigans so leskeetit", "a.walla_": "#myfriendisastar because she's making so many big life changes to design the life *she* wants. She works so hard and handles adversity with grace and cares so deeply about all those around her. She calms me down and brings me back to earth when I feel like I'm all alone or stuck in my head. I couldn't live without her 😭💗✨ and she deserves amazing orgasms 👏🏻👏🏻 @_mwood 😘", "xxrachieloveexx": "@newbigtoni #myfriendisastar because through the 7 years we've been friends she has also helped me through anything and everything! Through depression and anxiety, break ups and make ups, she has always been by my side and easily dependable. From starting college together to moving into our first apartment together we've never come close to being separated. ❣️💕 She is truly amazing ❤️", "maddie.6669": "@skrongsuck #myfriendisastar ;)", "hollyisher": "#myfriendisastar @brontepalmer", "jackalack.23": "#MyFriendIsAStar @eures_truly she has helped me through everything, very tough times and very good times. she is beautiful and smart and kind and loving and most of all, radiant.", "sandythegeorge_": "#MyFriendIsAStar @margee227", "kemiolamorris": "#Myfriendisastar @ifiwereyourgirl you’re a star cause you’re kind, beautiful and funny asf.", "thehoochiedawtah": "#myfriendisastar @nacho_neish", "0charlie": "@ameliayarrow #MyFriendIsAStar because you give me unreal sex so I believe you need to catch a break and let this beast pick up some work 🤝", "miss.melanated.goddess": "@soothingstorm because she’s beautiful, inspires me to be more aware of my surroundings, to be more free and not held back with my worries. Also because a clit orgasm is very necessary and the best orgasms are the ones u get and don’t have to care about anyone else’s 😂 hope we get this so we could be clit sisters lmfao!", "nitaondavine": "@hughjass28 you’re an awesome friend to have and a great confidant. One of the few people I trust to truly talk about my sexuality with and get great advice from. Love and grateful to know you.", "itsgeorgie22": "@naudinala", "missslilyyg": "@cgpetunia03 @rockylizg #MyFriendIsAStar 🙌🏼🙌🏼🙌🏼🔥🔥🔥 hardworking women who are my sisters doing the damn thing.", "ashley.josefina": "#MyFriendIsAStar @angieverse um ur a star bc ur not weird about talking about things that are uncomfortable lmaoooo", "locdonvee": "@spicygordita #myfriendisastar because she is forever persisting in moving forward. She’s king, loving, & always willing to listen to me. She’s remained a constant source of brightness for me & in my life.", "adribbby": "#myfriendisastar @eddie_uzumaki she survived a toxic ass relationship and is still a dopeass baddie 💘 you deserve all the orgasms 😉", "bbbbbianx": "@amatistaaa", "madeleinealive": "#myfriendisastar @sasstronomer 🎉💃🏼 you are a doctor badass QUEEEEEN", "deezyxo": "@amfmeal #MyFriendIsAStar and she is more than just a friend, she is my sister. We’ve known each other since we were three. I love this girl to death. She’s strong, resilient, smart, talented, funny and so much more. We have been through so much together and I wouldn’t trade any of those moments for anything in the world. I will always be in her corner because she is always in mine. My biggest cheerleader right next to my mother. I love you best friend!!!! 😁😍🙌🏾 @amfmeal #RealHotGirlShit #MyFriendIsAStar 🌟", "vikkisturdy": "#MyFriendIsAStar @bayleegrams you’re an amazing best friend, cat mom, human being and hoeing buddy. I couldn’t imagine doing life without you 💕 my cinnamon apple", "kissmaiaass": "@hot_dona_ is a star because she is the most motivated, hard working, fun, loving, wild bitch i know, she’ll party all night and get her degree the next day, she always has people she cares about backs and deserves an orgasm more than anyone i know!! #myfriendisastar", "munson14_": "Uhhhhh @esmecrillion you are a star because you won’t think it’s weird I tagged you in a sex you contest #myfriendisastar", "gracejuice": "@natasha_ionova #MyFriendIsAStar because she is one of the reasons i am able to survive in the toxic environment i am in!! i don’t know what i would do without her support, and she is so beautiful and genuine and unique, that it inspires me to be my genuine self unapologetically! my only wish is that she would realize how amazing she is! this woman is more than a friend, she is family to me 💘 she also is so open about self love! we loveeee talking about and promoting masturbation and health sex lives! she truly is the whole package", "imperatrixt": "@soondrum you are resourceful, kind, generous, a good listener and you fiercely fight for both principles and people you care for. Ily 💜 also i wanna get off with this 💜 #MyFriendIsAStar", "alanaisbest": "#MyFriendIsAStar @caseymariemoser 💞💞 this girl is FIERCE, she is ambitious and dedicated to whatever she sets her mind to! one of the most caring and thoughtful people I know! one step ahead of the game at all times! fun-loving and a true gem in every aspect, there’s a reason she’s been my best friend since we met❣️ whether we’re eating copious amounts of food, high out of our minds, revelling at the beauty that nature has to offer, tearing it up on the dance floor, or spending money we don’t have; there’s nobody i’d rather have as a partner in crime ❤️❤️❤️❤️ I LOVE YOU!!!!!!", "_hartsofeden_": "#myfriendisstar @kendalldior because she built herself from the ground UP! She is self made and fucking beautiful! Multi talented, intelligent, beautiful", "txzemer": "#myfriendisastar @yunicorn13 is an amazing person! She is one of the strongest people I know. She makes the impossible seem possible. And when I feel like the world is against me, she's right there reminding me that life is beautiful. She's real and beautiful like the color of the sun-kissed dirt where our ancestors' blood, sweat, and tears still remain. So very fortunate to have you in my life!!💖💖", "alohafaith": "#myfriendisastar @y.z.h.a.a hook sum sistas up, men are trash", "tranyewest": "@yootilicious Moet je mee?", "7ello3anteezi": "#myfriendisastar @moondancesun let's get some new vibes so we can stop crying about our dating lives", "crystalfairyyy": "@dontcopynpaste @wandababe", "leilaellisnelsonpsyd": "C’mon my good bitch @kylemneely #MyFriendIsAStar", "mightymightyafrodite": "#MyFriendIsAStar @dulcedelayci has always been my sensuality/body posi inspo! Ever sense we met, I’ve admired her unapologetic way of making the fact that her pleasure is important known and if you don’t like it, fuck off! She’s taught me soooo much about self pleasure and how to love my body. She even invited me to do a sensual selfie challenge last year that I NEVER would of done if it wasn’t her who asked. Thank you for being a self loving rockstar and for showing me the way 😘 @dulcedelayci", "whatthechel_": "#myfriendisastar @jadamychelle_ is one of the best people I have ever met. She can walk into a room and shine! She’s not afraid to be herself. Ever. She is the definition of being her true self unapologetically. Whenever I need her, she’s there. We aren’t sisters by blood, but definitely by choice. I love you sis ❤️ @jadamychelle_", "kykyivette": "#MyFriendIsAStar @natteeefreshh because she always had my back! She’s thoughtful, understanding and the best person to drink some wine ❤️. 😘", "primeromuerxa": "#myfriendisastar⭐️ @vickydinoo my friend is a star because she’s always had my back no matter what and has supported me and our friendship along the way i really wouldn’t know what i’ll do without her she really is like my sister i’d do anything for her i feel like i’ve known her my whole life and she will be in my life forever vicky when you see this you’d want this too hehe 🥺🙊", "vgsavage": "#myfriendisastar @savvy_____sav is a star because she decided to put herself first and prioritize herself in her relationships to ensure her needs are respected and met. She’s also a star because she maintained her selflessness through her career choice and her pursuit of a graduate degree in school psychology. Everyday she wakes up and does her best to make the world a better place, and I couldn’t be prouder of her ❤️", "martha.fire": "#myfriendisastar @brightmamastran to the brightest star in my sky! For always encouraging and laughing at my adventures- you the best. You deserve all the pleasurable things in life, including your clit, vulva, vagina, and everything exciting. 🥰💜 love you cuz", "dowovique": "AHEM @shayla19xx is my best fucking friend period. I met this girl online back in 2014 and she had been such a blessing to my life. I live in New York and she lives in Oklahoma. I finally got to meet her in 2016 and i got to go to Oklahoma to visit her in 2017 i love this stupid bitch and I’m planning on moving to Oklahoma soon to be closer to her 😭 she’s been a better friend to me than i could have ever imagined i don’t deserve her she is such a good person and she deserves to have a good nut 😂", "mzcarter13": "Aight so boom. Imma just take a moment to boast because me & @hoe.rampaige and I both out here on FULL scholarships at some bomb ass universities (even though we are wayyyy too far from each other) really taking advantage of each moment of it, and we have both been really humble about it. My friend is about to spend a whole semester abroad (!!) while I have the job & internship of my dreams & am going to school full time in nyc. Heres to a smooth transition from hot girl summer to 4.0 szn for all us. #MyFriendIsAStar", "mykeyy_d": "#myfriendisastar because she was my main supporter to help me get through AIT, I love her dearly and even though we are 1000s of miles apart she still continues to show her love and support for me. She is a dedicated and hardworking young woman fresh into the army like me. My Girl is a light that shines like no other. 🥰 @iyonce_00", "sleowdance": "@natasha__j ✨ #myfriendisastar hi it’s time for matching vibrators again!!! you’re a star because you’re funny and clever and encouraging and inclusive. you support me to the ends of the earth and for that there are no words!! doing long distance now (😭) and tbh couldn’t do it without ur support and advice. love u till i’m dead and gone and then some. 💗", "wienerdawgy": "Definitely @couturekult We are both new moms #MyFriendIsAStar because she has her own handmade clothing line and is always doing big creative things even with a new baby! I don’t know how she does it all I can barely get dressed in the morning 😂😭", "adrie_elle": "@thuggishruggishbonnie i need it", "charliefbaby_": "@lex.pa.brex my best friend and sister is a STAR. we’re both young professionals but she’s on her way to getting her doctorate and just recently graduated SUMMA CUM LAUDE! We’re both writers and artists. She’s incredibly intelligent, strong and beautiful. We’ve both been through so much and we’ve overcome those things together. Idk where I’d be without her. #MyFriendIsAStar", "misskelly_baby": "@ashcash____ you are the caring, hard working & determined individual that I have ever met. The word “no” is & never have been in your vocabulary. You push every standard there is & knock down every wall that faces you. I love you w/ my every being & I am so blessed to have you in my life; let alone call you my friend!💕 #MyFriendIsAStar", "sydneyalj": "#myfriendisastar cause we’ve both helped each other leave abusive men! 💪 @thatcrazylindseychick", "whittlesjh": "@cmwestbrook, my heart sister. I couldn't ask for a better friend. over the years I have been honored to watch you grow into your skin. the reclaim dark we're in this together, navigated the bumpy road of gender together. We've seen each other through so much pain and growth and joy and mishap. I trust you with my life. You will always be my #cuntfam", "y.z.h.a.a": "@alohafaith", "myrimirmir": "This is some words of wisdom that greatly uplifted me and I hope it’s uplifting to you too. ❤️ “Don’t let guilt or “because I should” be a reason for anything you choose. You have nothing to prove. Forgive yourself and accept the person you are, not the person you one day might be.” - The Pattern", "domosapien_": "#MyFriendIsAStar @carter_geenah Other folks have friends that love them and listen to them and blah blah blah. We get it, that’s cool. But this girl... THIS GIRL RIGHT HERE?! When my 🐈 was having issues... like real issues lol.. she helped me through it and got me all these black female owned products (soaps, oils, bath bombs) and helped my 🐈 go from 😾 ❗️to 😻💕. TMI? MAYBE SO🤷🏽‍♀️ but if thats not a best mf friend I don’t know what is. From the bottom of my 🐈 to yours, love you sis. I hope we win lol.", "lishaataylaa": "Just when you think the world and everyone in has given up on you just know I’ll be here. You areb the most amazingly beautiful mother, daughter, sister, and cousinnnnnn lol I’ve ever encountered. You have risen above so many setbacks and I promise your comeback will be the biggest of them all and you will most definitely make the news! You are so selfless and caring but ALWAYS blunt and i would never change anything about our sisterhood of a friendship. Keep being you! 🗣🗣🗣🗣Yalllllll listen #MyFriendIsAstar @yauni._ ❤️🧡💛💚💙💜", "badaz_precious": "@s_jbosss @love_noa @_whoaanelly @josselyn_tello if one of yall hoes don't come up with something deep so my shelved pussy can get some release....#MyBestFriendIsAStar", "adriperolike": "@tfresh27 My best friend, my sister, my life partner Tina and I grew up in Puerto Rico together. I was an immigrant from Venezuela, we were in middle school and were about to become ourselves. I am lucky lucky LUCKY to have found this HOT RED STAR of a human being and to have gone through puberty and adolescence together. Tina is such a flirt with the world - in the sense that she SEES and she LISTENS and she smirks and she squinty eyes at anything that is beautiful, that is fierce, that is deserving of love and admiration. I LOVE this about her. When I think of her I’m reminded of the ways I can be kinder, be more attentive, more loving, touch more. To more FLIRTING. To more TINA #MyFriendIsAStar", "stephyouuu": "#MyFriendIsAStar @lauramb_ my love ☺️ you help those around you always, always sharing your food with me cause I’m still hungry 🤧, always remembering to include folks that can get left out because you want us to be friends and get along ♥️ a job, grad student, and top in your program? A role model to us all 👏🏽 I love you!", "myhiroshima": "@thuggishruggishbonnie #myfriendisastar she is a strong, truthful, and beautiful person inside and out. She always is there for me and I am blessed to call her my friend.💕", "_chocolisa_": "@itsjadad is a star like no other! A woman of her word and a woman that wants to help other women success and do better!! She’s been a light to everyone around her and those afar as well! 🗣She even started @theauntieroundtable so black women could come together in a comfortable setting to talk unfiltered! She deserves it all so let’s start with this! ☺️ ps:maybe it can reverse my ear ringing 🤣", "thecolorscarlette": "@xoxo.tinale omg we were just talking about getting one, the brightest star of a friend bc she’s alwayS there for me when I need her and always will drop everything to ride for and with me!!! She deserves this cause her man just 👎🏻👎🏻👎🏻 #myfriendisastar", "_stephaniehooker_": "@misscuccicuccicucci", "gilliganpierce": "#myfriendisastar @shannahammons think of how much fun we could have with these 💥🤤💥🤤💥", "cocomoejoe810": "Magnificent 🔥🔥🔥🔥🔥💙💙💙💙💙💙💙", "trvp_hon3y": "@racqueliana", "darnthatspud": "@izzy_wizzy97 you’re a gem. you’ve been growing for so many years and i’m so proud of you. i know you’ve been doing everything to care for your family + friends so if we win i truly hope you take more time for yourself 🥰 #MyFriendIsAStar", "lenafrances_writes": "#myfriendisastar @therealbbmcneil 🔥🔥", "fuck_niko": "#MyFriendIsAStar @abjectension my theoretical monarchy 🤤❤️", "taraaaaaa.c": "#MyFriendIsAStar @wtfshan_ You have been that person to teach me what friendship really is. I’ve never been afraid to talk to you, give you advice and take some about everything no matter how long it’s been since we’ve last spoke. I will always always have your back about anything because you are my sister soulmate and I love u and I care about u catching ur nut too ❤️😛", "royalti_rich": "@wautee_melon #myfriendisastar bc she helped me find myself even when sis was going thru it. Our friendship has crossed INTERNATIONAL waters and crazy time zones and she’s literally the only person I’d answer a ft for unannounced while butt naked.", "in_dig_e_nous": "#MyFriendIsAStar @novahcaine When I saw this challenge I immediately thought of you. I’ve never met such a full package in a woman. A amazing mom, wife, DJ, artist, and full stack engineer. Please never stop being humble, kind and cool. I hope you win this vibrator bc then you can add that to your accomplishments lmaoo. Love you friend💕 “FRIEEEEEEEND!”", "makeupmagx": "@mlge223 you inspire me daily with how you advocated for yourself through your very complicated divorce. The way you go through this world looking for joy when it has handed you a lot of heartbreak is so motivating to me. I love that you’re raising such a beautiful daughter to live unapologetically and fiercely by example. I appreciate all the work you’re putting into yourself and others around you so you can be the most present, wise, and fun person. You’re looking to heal your trauma so those who come after us can have an easier go- myself and your daughter included. So this is for you you amazing friend! I hope we both win amazing sex toys! #womanizerSTARLET", "brocklightnin": "🔥🔥🔥🔥 I zoomed in", "jadamychelle_": "#Myfriendisastar @whatthechel_ you are my favorite shining star 😂 GROWL POWER!! Stay amazing and keep doing it boo", "tkups_up": "#MyFriendIsAStar because she has ALWAYS allowed me to be who I am and a safe place to continue to find that out. She’s kind, loving, loyal & always there for me and has loved me in some of the toughest points in our lives together. Since 3rd grade to adulting post undergrad, we have been walking this crazy life and The UNIVERSE clowned when she blessed me with a sister like @_jamieria 💜 She deserves this gift because she gives to everyone in her life daily and she DESERVES to get a Lil sum sum in return! She’s my rock, my everything, my most favorite human, my person always 💜💙😘 @_jamieria", "asilv.x": "@sisibreezy you are a STAR ⭐️ because you are great with words, your musical intelligence is outstanding, your fashion sense is impeccable and your ability to make someone feel loved and appreciated is beyond words. #MyFriendIsAStar 😘⭐️🤤", "woww_ash": "#MyFriendIsAStar @notmelmartinez for being such a strong, open minded, open armed and warm friend. For being so uplifting in my hardest times and for bringing out my truest self. Thank you for being my best friend and I’m going to miss you when you move 😭😭💕", "fullof_sunshine": "@whitgrits, She is absolute star, she has been one of my best friends since college. We have laughed, cried , and even been mad at each other before, but we still love each other the same way. She has been my light when I have been down and depressed. She speaks positive affirmations into my life daily and expects nothing in return. She has even surprised me driving across the country for my birthday weekend just to be with me to celebrate. She is getting married soon and I can’t wait to be a bridesmaid ( I feel like it’s our wedding 😂). I can’t wait to see what amazing journey life takes her from here. She is truly one of the most sweetest people I have ever met. I admire your heart more than she will ever know. She is so forgiving and hardest person to anger. I am so fortunate to have her in my life. She is truly a STAR and deserves more than the best. #MyFriendIsAStar ⭐️", "notwiseabell": "#myfriendisastar @devilsbokchoi and don’t you forget it bb!!!!!!", "mariiacx": "@wiiwi_z #myfriendisastar beacause she is the most funny person i know !!! And u are always supporting me! ALLL LOVE, we have to win😂🙌🏽💁🏽‍♀️", "itsashleywagner": "@rachelthedolphin is the brightest star of a friend, because she has the most gentle and kindest soul of ANYONE I have ever met! Ever since we came into each other's life there has just been this different sisterhood level bond. She has the intuition of a queen, is amazingly beautiful, is an incredible photographer and has an amazing eye for detail. And will do whatever she can to help someone (or animals) in need. I think I have grown so much with our friendship and I feel an overwhelming sense of empowerment when we are together, because of her. It might have been only about 6 months ago we met, but lord I have no clue what I would do without her and it feels like we have been friends for YEARS! With a bestie like her my by side, nothing is impossible!! That's why my #MyFriendIsAStar", "courtney.smellink": "@kaitlynhw", "craigasaurousrex": "@breedebauchery", "niamh_arthur": "@codenamecap_ #MyFriendIsAStar because she’s a boss who is moulding young minds. She has been supportive of my mental and physical health journey over the last couple of years which has been wild. Always supportive of my sexcapades and sexy buying habits 😏🙌🏻 a true angel", "barriandboujee": "#MyFriendisaStar @_clumsygurl_ 😍🥰🥰🥰", "haaybaay": "@lillyrene_ lmaooo", "heycanipetthatdog": "Paige @turn__the__paige__ , #MyFriendIsAStar, deserves this for being literally the best friend I've ever known and the best friend to everyone she's ever met. I've never been so unconditionally supported by someone, my whole damn life. You make me.better knowing you! Love youuuuuu", "sayanorton": "@kitzimmerr #myfriendisastar Girl you’ve been with me through it all. The crazy lows, the amazing highs. You’re my best friend, my bbo, and I’m really tryna get these toys for us ya hear😂😂 I wouldn’t be here without you and I love you to the moon and back. No matter how far we drift from each other, we always come back. I love you lots, you’re a star❤️❤️", "decolonizingtherapy": "#Myfriendisastar @ms.villatoro Beee! I appreciate your ass girl. You’ve pushed through and out and up. You’re dope, loving and loyal- in your own Scorpio (HahHa). You work so hard to serve the folxs who ate survivors of domestic violence. And are now embarking on your MA @ NYU. You are also a dope roomie! If anyone deserves a free vibrator it’s you! I hope we win it. We will be a HAWWTTT HOUSE. hahaha 🔥✊🏽💜⚡️. May we continue to dismantle this system of oppression together hermana.", "chicago.guera": "@defnotbecky u r A STAR & MY BFFL BC U LET ME USE UR TOOTHBRUSH WITHOUT HESITATION & DAS LOVE", "madams785": "@tamtortuga @tru_asz_thoroughbred", "kactus.kutie": "@fruitgoddess246 #MyFriendIsAStar because you’ve taught me so much about intimacy, mental & physical health, and been the dearest friend to me & others 💕", "coochieflow": "#MyFriendIsAStar @lochnessnudes because i’ve eaten ur ass and i love u", "marceladontpanic": "#MyFriendIsAStar @jesg666 WHERE DO I START. You've been a wonderful light in my life since I met you, you radiate positivity and love. I'm so blessed to not only have you as a friend but I have seen you blossom and continue to grow into this BOSS ASS BITCH. You're radiantly beautiful inside and out and am so excited for our future as boss ass bitches fucking shit up. Keep doing you and maybe we'll get some sex toys out of it. 😂😂😘😘", "queenangeliquee": "#MyFriendIsAStar cuz she’s over come so much that the world throws at her and continues to grow and enlighten others! @fl0wergoddess", "altheaalovee": "#MyFriendIsAStar because she is such a selfless, caring, sweet person. She helps me when I’m down, she’s always there to make me laugh, also, we have the same sense of humour which means every meme we send to each other is always a good one. I am so lucky to have met such an amazing person like you. We have become so close in such a small amount of time, it was meant to be. I’m closer to you than anyone right now. I’m always here for you and I always appreciate your honesty. You’re beautiful, you deserve to shine as bright as a star and you’ll go so far in life. Don’t give up baaybee. Only the best for youuuu!! You got this. We got this. Foreverrrr 💛✨ @mmnle", "happy71255": "😍😍😍", "preeoccupied_": "@spaceageshawty 🙌🏾", "spritelyj": "#myfriendisastar @aethoraa Jess and I have been besties since the 3rd grade - for those counting, that's nearly 20 years! I was always the odd one out - awkward, shy, autistic, and joyfully weird, but that never bothered her. She was charismatic and funny, and she was the first person to love me for my weird instead of loving me in spite of it. Our friendship has survived heartbreak, college, depression, time, and now an ocean's worth of separation. You can't keep a fabulous Sagittarius down, and her wandering nature has taken her from Ontario all the way to England! I couldn't be prouder of her for following her dreams. I love you, Jess, and you deserve the very, very best! <3", "squat_rack_shenanigans": "@beauvaim you're a superstar vet tech and the best auntie💖", "_tima_is_my_name": "@kareema69", "gabs_zei": "@atallant4 I really have never seen someone work so hard as you! Maintaining above a 4.0, working, and everything else that we do! Really my best friend, and I think we deserve some sex toys ♥️😂 #MyFriendIsAStar", "friesgurl": "@epic_izzy_tacos @vajenjen OOOOFFFF YALL READY FOR BEST NUTS EVER BC YALL DESERVE IT", "majpointoh": "@miaimarshall #MyFriendIsAStar I know you’re going to hate me for tagging you (but you’ll love me if we win) 😂 I don’t miss and opportunity to tell you how amazing you are! You follow your dreams regardless of what limitations people set for you and you are wise enough to rid your personal space of people who are toxic to your growth. Even in times when I can’t see the goal, I can trust in your faith and your vision because your positive outlook always lands you on top. I’m so proud of you, what you’ve done and what you have yet to do! I’ll always be in support of your dreams. Love you girl! 😘 #womanizerstarlet ☺️", "maddfrossty": "@madsun806 you never fail to amaze me with your courage, strength, and perseverance in the face of countless doctors telling you your disease wasn’t real or it was all in your head. Now that they know it IS, you are still fighting for the medical care that you very much deserve. ❤️ you’re a boss ass bitch, you work so hard, and you’re a great friend. 😘❤️", "jam_rochelle": "#MyFriendIsAStar because she's supportive of me and my dreams. She prays for me and gives me great advice, and she always has my back. She's been by my side since third grade, and she has never betrayed me. She deserves a gift for putting up with my foolishness, and this would definitely be the gift that keeps on giving! She's authentic, kind, beautiful, and such an amazing person. ❤ @tkups_up", "kharree": "I was really considering buying this for someone. Does it work as well as advertised?", "javaydabae": "#myfriendisastar @shyann0n has basically taken care of me for the past two months while I got on my feet and got situated to go to grad school to get my Masters in Sex Education. She truly is a star and the light of my life!!!!!", "theladykristen": "#MyFriendIsAStar I know you’re not even going to be mad I tagged you. You’re amazing to me Drea. You’re the PhD student I look up to. Got your work being read in classes, you’re being asked to give talks that you actually get paid for, and when you found dance you stuck with it. You’re amazing because you show me everyday that this journey I am on is achievable. And on top of school you’re working in the service industry which is definitely not easy. I love you!", "sydneybenjamin": "@eeefly", "octoguts_": "#myfriendisastar @carleyyyyq thank you for being the greatest friend anyone could ever have. whether it’s laughing over margaritas or crying on each other’s shoulders or crawling into the other’s bed for comfort. you’re kind, funny, vibrant, beautiful, talented, intelligent, and a person that ANYONE would be lucky to call a friend 😘 wifey material 💕", "flejling": "@itsmemimili #myfriendisastar bc you are a caring feminist/activist who shares my weird humor and encourages my Hoe adventures!!! 👀😂😊❤️", "_ninalong": "@_missksw #MyFriendIsAStar because she maintains the fact that SHE is her priority and does so with persistence and dedication. She’s a star because she’s doesn’t let nonsense throw her off her game and even if she gets knocked off her track, it’s always temporary. She is my reminder to take no shit and to live your best life! I love my friend ❤️", "angiegonzalez250": "@amberbasso5 #MyFriendIsAStar the hottest, baddest most loving bitch I know. I wish you the world of happiness and strength at college but I know you’re fucking killing it and out of all my friends you deserve this cute ass toy the most, now let’s get these orgasms bitchhhh 😜😍😘😘", "thegaydiscoteca": "@jewishwriter #myfriendisastar you inspire me to have the sloppiest, most unapologetic sex and to wear my bush as a badge of pride as a sexually liberated woman", "theplantslayer_": "@hailtothequeen94 bitch you’re a STAR fr. From the badass way you do air guitar, the mother you are, that fat ass, the talented sexter you are 🤣, the fact that I can ALWAYS count on you to bring me out of my slump or even just being there and slumpin with me. You never fail to amaze me, I love you hoe 💕", "josielindam": "@courtneysarah94 #MyFriendIsAStar because you’re an absolute legend who cheers me on everyday and I am braver with you around 💕⭐️", "morganriddle_": "#myfriendisastar @colormereckless_beauty", "tieri__": "@sunflowershan we haven’t known each other for that long but quickly became good friends. My other mommy friend that GETS IT. Young moms working hard & taking care of our kids, we forget to take care of ourselves sometimes. Girl we both need this damn relief. ASAP @sunflowershan", "ladyblovebytes": "@insatiable_cris your heart is one of the biggest. For over 20 years, you’ve been the kind of big sister from another mister that has been so impactful that now I get to be the big sister in our relationship. You’re an incredible mother and watching you battle against and beat all odds to get the degree you worked so hard for and even now watching you kick down doors professionally has been inspiring and I’m so excited to see the ways you continue to elevate yourself AND change the world going forward. I love you always, all ways. #MyFriendIsAStar", "bigbaddiebitch": "@highsidityyrealprettyy #MyFriendIsAStar my bitch is literally living her best life in college and is gonna be a nurse. She has been through so much unnecessary shit but has handled it with grace uncompared 😭😭 she need some stress relief for real", "b34n13b": "@theonlyhaesolo #myfriendisastar because she is the most selfless person I’ve ever met. She gives her all to everyone and everything, all while being an entrepreneur and top tier swer. She doesn’t care about the perceptions people have of her (which is why she’s always making goofy ass faces 🤣) and she shines while doing it. Also kicking cancers ass", "susanzholmstrom": "#myfriendisastar @kimberloft you are the most organized, put together person I know and you never fail to offer support when it’s needed!", "michellefzapata": "@cyndaqueer ik you’re not femme buuuuuut you should use this with Shawna. ily bitch. Living your fucking truth with zero apologies. I will kill for you. I dare someone to trannybash you. I will be there with brass knuckles. #MyFriendIsAStar Bc they’re a shining example to all that it’s never too late to seize the day and be yourself. Your true authentic self. Even if your parents don’t bother to understand. You are soo strong and you don’t give yourself enough credit. I’m always gonna be here to remind you tho. Love you hoe 🥰", "jordansheaa": "#MyFriendIsAStar @nutterness for being my most open hearted, open minded, open armed friend. Through my dark times, through my brightest of times, to exploring this thing called life together. You’ve been there for me in ways I didn’t know was possible and I’m forever thankful for my best friend, my sis-star, my confidant and one of the best humans I know 😍😭❤️✨", "martinlutherlean17": "Too gorgeous", "kay.indd": "Never met someone that deserves this as much as you!!!! @sabjiv my ride or die! If anyone deserves a sex toy via Instagram giveaway it’s you #MyFriendIsAStar", "hereisbritt": "@kristen_10", "tabascos_mummy": "@ohdaaammn_gina #myfriendisastar we happen to be nextdoor neighbors and dog moms both with full time jobs. I come home on my lunch break to take both our dogs out and she comes home after work and takes both dogs. It’s a coincidence we moved in next door to each other but it’s fate that we’ve become best friends 😍"}