{"laurenbridie": "Little warning; don’t use makeup sponges because they might get stuck! I’ve seen a few removed with forceps in the emergency department, also if left in too long it can increase the risk of TSS", "_morgancheyenne_": "🙌 My only serious relationship was with a dude who wouldn't even consider it and I didn't realize how dirty that made me feel until last year. I had sex with two different men who gave 0 fcks about me being on my period and it was eye-opening. They both literally said \"I don't care\" at some point during the action and my mind was blown.", "chanemalik": "🤤🤤🤤🤤🤤", "beckhahxo": "Free bleeding is my fucking jam no pun intended", "gabriellaindigo_": "@stickycoyote FYI", "jozarto": "😴", "ruinedomelette": "More power to you 👑", "lasseemilk": "@ibenkathrine", "jazamor13": "Shoot period Don't stop nothing but a sentence 🤷🏾‍♀️ only time I actually don't do anything is when I'm actually working", "sistahpunk": "Good ol' makeup sponge👌🏾", "rawpecans": "wow omg i got mine on national period day im so iconic", "aquarianqueensupreme": "If my flow is heavy but I'm horny I like to take what I fondly refer to as a \"nut bath\" aka blast my clit with the bath faucet. For involving my partner just throw down a towel and BOOM we good", "odelldixon47": "That picture is Savage", "therealkenyaaa": "Sex & oral sex on a period is gross", "_dwiseguy": "period poverty?", "kwamhutley": "🍑💯🍑💯🔥😍😘❤️", "michelletrotter7": "Damn.", "blank.page.hoe": "I low-key wanna throw up 💀🤢🤢🤮 is y'all niggas serious? Jesus", "dulanjaleishodara518": "did she mess around her period caz that's OMG🙄🙄", "isac_newton12345678910": "Ew", "victorhernandez7415": "Mamasota estas buenisima y hermosa kiero 😍😍😍😍🌊🌊💧🔥🔥🔥🔥👅👅👅👅👅🍆", "kingfreshbeetle98": "I like you raquel you is sexy body and big ass thick 🔥🔥🔥😍", "justraycarson1": "😉😉😉", "gemini.venus": "I’ve heard great things about period panties, especially at night and if you don’t like to wear pads to bed. I’ve heard it’s nice to free bleed, and the period panties don’t have you sitting in wet underwear. The absorption I hear is pretty good!", "prettypaidkayy": "@1plugbaby", "memahlade": "mood as hell... didn’t even know I was being festive yesterday ❤️", "chelspinky": "Obsessed with this page! Keep coming with the info please!!!", "krys.kilz": "yes yes yes!! thank you for all of this!!", "sequinedtrainwreck": "Love this!!!! I’ve read that using makeup sponges is not advised because it increases the risk of TSS, so be careful! Menstrual discs like Flex are awesome though!!! We also need to start putting menstrual products in men’s bathrooms in people’s work places and public restrooms. 💞", "domine2.0": "This is SO DOPE!!!!!!", "pepperwitakickmotley": "Learn something new everyday thanks Raquel.", "alwaysgotitonme": "Hmmmm interesting!", "shaairamor": "I used to love period sex but my cervix gets so low and so sensitive I had to stop. I'm more of a outer sexer person now. Which is a little cuddles, nipple play, and maybe cuntiligus if I'm wearing my cup/disk.", "gabrielwatson9": "🌚🌚🌚🖤🖤🌹🌹😘😘", "toyax": "My baby 😘", "hattiesmart1": "@plantpoweredjasmine follow this lady", "fem_botx": "@badbitchshewolf 💦💦💦🙌🏽", "carolyntoney": "None of my partners care when I have my period. The sex is just as fantastic, so they’re all for it!", "dodurtty": "😂😂😂😂", "xxkadijaxx": "periods don’t stop nothing but a sentence 🔴", "missperchay": "See the way my stomach is set up, I can’t have sex during that time. I’ll throw up, blood is a no go for me.", "dontashme4shyt": "I love this!!! Also your diet has major impacts on your period. A period should not be painful and filled with cramps so eating healthier and cleaner and the occasional hinge will decrease those symptoms for some. I know it has for me. And improving the quality of feminine products is so important! Thank you for rocking this shoot and bringing awareness!", "seejosiesmile": "🖤🖤🖤 fierce as hell! 🔥🔥", "tilturheadbackandcloseureyes": "And BOOM my period is on just like that 😂", "_smilebeautiful": "Yassssssss 🔥", "xonayimaxo": "❤️", "kremedelakitty": "This is my kink", "queenelizabethdenise": "This is lovely. I'm glad I don't get periods anymore", "joceirania": "You are a legend!", "happy71255": "😁😁😁", "gaiagraphy101": "👏🏽👏🏽👏🏽", "313yogi": "@my.yoniverse this is awesome 🙌🏾", "pashun_4me": "Interesting! ❤️", "mallefuguet": "WTH??? 🙌", "baldheadshawtee": "Period sex is literally the best sex.", "iamshaunna_williams": "@fatherwolf77", "_dcarrie": "I’ll never forget how quickly I was turned off by my last partner at his shock that I masturbated during my period. My guy. The fuck? This pussy STILL works.", "_blackaspitch": "🙌🙌🙌", "ldr101": "I love that you spoke on this! I personally don’t like period sex but it’s more because I don’t like blood and the thought of it being involved is a huge turn off for me🙈 but saying that.. I seem to get hornier (is that even a word? 😂) when I’m on 🤷‍♀️💕", "instabattey": "Fuck yes! Thank you for being so unabashedly badass and for normalizing this topic!", "morticia_godiva": ".bloody brilliant 🔴", "frobatim": "😍"}