{"quell87": "💎👑Goddess", "mafem58": "🤤", "anitalove23": "Your amazing 💯🙏🏽", "omi.o.my": "Even just being a newbie at it, I have learned so much about my own desires and boundaries and intentions and tuning into others and playing to their wants while still getting what I want out of it 💕🤘🏻", "king_bando__": "This video about to be a Bangor on god", "bruteimpact_cutiest": "\"Buuuurn insta sissy! 🔥🔥 Wanna collab? DM our main account ❣️\"\"pinkpineapple.love, tell them we sent you over. 💯😊\"", "diparker": "I love this. I wanna see more people being fully comfortable with who they are 😩", "nalij_kelly": "I got caught in your block chain 😭. I’ve been following for years please unblock me @Blackb3autiii 😔", "lesego_afrikan80": "You so beautiful too 😍", "seejosiesmile": "🖤🖤🖤", "salutekev": "I love to see it 🔥🦅🌹", "0kthanksbye": "this is beautiful.", "superbootyworld__": "Its says Miami how you put NYC lom", "lenafrances_writes": "Is it weird that I follow your posts to stalk your nails? 🤗 They’re always so cute! Keep being amazing!", "getmoneystayup": "Dm me back", "thebeautyshow_": "Wow", "j_brasi_": "How do I sign up please. I want to learn the business and the right way", "jaytsylot": "What is your definition of a sex worker", "nathanyoung1514": "I like this prostitute", "computerblue1984": "I wonder if those guys got head? haha! Lucky I wish I was getting some from her too! xxx", "f._courtney": "@tifnymc", "datyellowhair": "Thanks, this post REALLY inspired me🙏🏿🙏🏿🙏🏿", "bottom4blacktop323": "Hot dudes🔥🔥🔥🔥😍", "jesusmpeguerop": "Como puedo ver la escenas de ustedes", "madamelf420": "Absolutely love this post! 🔥✨", "browngirlrelax": "I’m proud that I can uplift black femmes in my community on and offline. That were building a platform based on safety, education and empowerment for ourselves without compromise. ✊🏽", "kingswish15_": "This the chick that sucked a dick with shit on it??? 🤢", "yemojaoshun": "I’m proud to be trusted to guide people in experiencing BDSM and kinks. SW pride to me is loving what you do unapologetically in a society that is not progressive enough to accept it as a positive thing that serves many amazing purposes such as pleasure, building connection, keeping relationships together, healing and transformation.", "rosewayyoga": "Wow this is incredibly powerful.💎💎💎", "sacmochadb": "Wait! You have a boyfriend? Damn I'm so shattered now. 😜😜😜", "seeking.metanoia": "a financial dominatrix? im in absolute awe💕 this is such a beautiful post these comments are lightening my soul", "josjane6996": "@raquelsavage Sex work healed me from the sexual trauma I experienced as a teen. It has given me freedom to express my sexuality & make lifelong friendships & relationships. I’m also so proud when fans tell me I’ve taught them something abt themselves💯", "asia_noel_": "🙌🏽🙌🏽 ❤️❤️❤️", "gotdamn_ambbam": "Check your dm’s", "mind_over_meg": "@littlredd idk if u follow her but she’s amazing & inspiring💞", "theminimystic": "I’m proud Ive inspired others to be more open with their sexuality & find new ways to experience pleasure. I used to think I couldn’t be a sex worker because I didn’t have a fat ass but here I am 🥰 my self confidence comes from a place of pure love and I’m happy to have the means to support my friends and create a platform to educate and allow others to share themselves erotically", "puffnbear": "This pic and these posts are amazing. I’m so glad you’re out here. 💕", "ohhhhnnnnoooo": "Those guys are 🤯🤤", "bad.mamma.jama": "🙌🏽🙌🏽🙌🏽", "sanhopeless": "I’m proud of my reviews (even though I lost 10 with theeroticreview going down) and also how much my rates have gone up over the years lol", "_womanifesting_": "❤️", "lalasantolla": "🗣🗣🗣Say it louder girl for the ppl in the back!! 🔥😍🔥🙌🏻🌟✨💕 Yess Queen!!", "sincerely_.cass": "Yesssssss for the empowerment🙌🏾❤️ but can we get a link to the woman that's a financial dominatrix.", "sorrowfulveganheifer": "Sw pride to me means having been able to stay afloat without anybody's help. Helped me become more independent and reliant on myself. Grow more confidence in my own values and saying no when I want.", "leigh.ad": "@mslevin33", "b_boy_stance": "Powerful", "brocklightningmusic": "@raquelsavage 🔥🔥🔥🔥❤️❤️", "kaylaa.robinson": "I’m proud of all the unpacking (of my internalized whorephobia) I’ve done so far that has allowed me to explore my creativity and craft the sex work I do"}