{"vsaint": "Black people are so shocked when I tell them I don't hit my kids and try to convince me otherwise. TF?", "lindseyclairesd": "Thank you for using your platform to speak out on this issue.", "chenaidavid": "Bullseye 🎯 !!!", "laurenmitt": "Thank you. 🙌🙌", "gaiagraphy101": "✊🏽 This is a word", "jjones07065": "Amen", "buhreena": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "crazy.coco.mama": "This really spoke to me! I am on a continuous journey to gentle parenting . It is hard! The hardest part for me has been unpacking WHY the things they do make me upset. Especially in pursuing my degree I know better and a lot of things we find “disrespectful “ are age appropriate behavior. Even the teenagers! I realized a lot of my triggers were based off the fact that I was jealous of my kids. I had a horrible child hood and my kids had things and circumstances I only dreamt about. How dare they be ungrateful. I’m still a work in progress. I don’t hit them at all but i still hell 😔. I’ve been told a lot that I’m too soft and my kids won’t respect me, especially as a mom of three boys. I dismiss all that though. Thank you for this post.", "ohh.livya": "Yes.🙌🏼", "the_best_boob_ever": "you speak complete truth. i dont have enough spoons for a proper comment, but if you wouldnt hit an adult if they fucked up (which is called assault if you did), why the fuck would you hit a kid???!!!!", "nicol_ivanov_": "👍", "thebuhungiro": "Thank you so much for this. ❤️ I’m trying to do the work to identify my triggers and to heal so that I don’t damage my kids when I eventually have them. The journey is difficult and painful too, but very rewarding especially knowing that my children will never have reason to fear me and they will be complete human beings. I am committed to that. Thank you 🙏🏾", "natajack": "Exactly this, so many adults walking around with their own trauma not addressing it m. Either unable to due to the financial cost, or because they refuse to do their own work. It’s bloody hard being the first one in several generations trying to break this cycle but it is so worth doing it. 👏🏼", "theladylatte": "This needs to be a constant conversation", "488.sosa": "This that real talk the world needs", "theblacklotus2805": "So Jealous of Him, but Dame He's Lucky", "mrjollydawg216": "im also curious why is there a sexual pic in the beginning but the post is about abuse? Did i miss something here??? is it about demonic molestation by so called adults too on children? because that's what i thought at first, just don't understand the connection of the pic and beating of kids", "dr.vlucy": "@propel_virtual_solutions this speaks volumes", "femitoys": "❤️", "sim91simma": "Parenting From The Inside Out, is a great resource on this topic.", "apo_adhm40": "😍😍🌹🔥🔥🔥🔥", "secretangel222": "caption 👏🏻", "__goodjuju_": "This caption 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "allure_and_soul_": "👏🏾👏🏾👏🏾👏🏾", "lobavaga": "👏🏽✨👏🏽✨👏🏽✨👏🏽", "thefuriousnubian": "I remember when I last spanked my daughter; she was 9. She told a boy she liked him or something other and egged on by my family, I spanked her. After I spanked her, I remember her looking at me with such fear in her eyes (she had the biggest prettiest brown eyes; I used to call them cow eyes) and it just broke my heart. Right in that moment, I vowed to never spank her again. And I never did. I didn’t want the one I loved the most and who loved me the most to ever fear me. Respect me, yes, but fear me - no. It wasn’t always easy going against the norm, especially with those on the outside telling me I was spoiling her by: letting her speak her mind, giving her the benefit of the doubt and allowing her to be her own person without beating her brains out. I figured out other ways to discipline her- like making her write essays when she messed up about what she did, why I was upset and how she would, moving forward, do better - oh, how she hated those essays. I remember her telling me to just spank her one time.😂 I stood my ground no matter what anybody said cuz I knew in my heart that there was another way and just because my father beat the dog shit out me didn’t mean I had to do my own the same way and it paid off. Me and my daughter - she’s 25 now - are as close as best friends and I wouldn’t change that for the world.🙌🏾", "plushbuxom": "Thank you. ❤️"}