{"bambambuckmangles": "🤩🤩🤩🤩", "tokyosblacksunflower": "I heard you talking about it on your podcast and then experienced it👀👀👀👀👀 new stuff NEW STUFF", "jinxyoure.it": "I just feel like my nipples really aren’t sensitive in general 🤷🏻‍♀️ at least when I do it to myself lol", "bahauls_dheeep": "You said men should try this too? Well I'm trying it as we speak and it just feels weird to do it to myself lol...😒", "rayraesunshine": "Im EXTREMELY sensitive. Espcially if its being done right. Im literally drippinh soaking wet. Before you even go anywhere near my pussy. Just play with my nipples ... once you reach down..... seriously. Almost embarrassing how wet i get lollllll", "lenoreblack_": "Omg I wish. Whenever someone touches my nipples I want to punch them hahah. But I have had a few clients that have been able to do this!", "mzbillionaire1": "ME! Literally my primary way of cumming 🥴🤓", "blaquesapphire": "I've been soooo close recently but I haven't been able to get there yet. There's still hope lol", "sydney.proctor": "I hate to be a creep but this post is straight up sensual. Don’t stop doin you girl.", "ankitgamara.ak47": "Very sexy😍", "izzee_rascal": "Yesssss 😍😍", "pacolipse": "I really enjoy sucking breast and plus my hands are big so I can do both at the same time which girl women crazy and extra wet and horny. Even having sex and sucking or gently rubbing the nipples helps a woman extra moist with ever stroke which might help cum harder or if women do it to a man makes his dick harder. It works! The problem is most men dont really know how to suck women's breast in a sexual manner for her to get that sensation.", "darrentotman": "My gf is addicted when i eat his nipples and achieve orgasms. 🔥🔥🔥", "caitsx__": "Nipple stimulation is the way to my heart", "mouthnastycult": "🤤💯", "huntergathererriley": "Yes! I love it", "crazy.coco.mama": "I thought I was crazy lol", "jellyjellz": "I love getting my nipples licked and sucked on", "meganswiatek": "@juliajbaptiste", "huncho9681": "Nice", "michaelmcquarleysphotography": "Pretty feet", "j.andresjimenez24": "My nipples are as sensitive as a woman’s nipples, so I don’t have a problem feeling satisfaction from touch😇😇", "falkwittkowski": "😊😊", "inkkkandjets": "Do you have a foot page??", "laithdaniels": "Hey i love my nipples played with! Hell why else do men have nipples if not for sexual situation. That shit gets me hard as hell but can also make me cum fast LOL!", "feeloctober": "@spacelyjj", "luis_lucy_1122": "Your education is gonna lead to me having the best sex of my life, and me being the best sexual partner I can be. No amount of words can thank you enough!❤️❤️❤️❤️❤️", "jjones07065": "Best sensation that I ever felt during sex", "halleyshauntedcomet": "Baywatch Baybeeee", "weirdocity": "👀👀🥴🥴😽💦💦💦💦 my experience", "nailedbykamani": "Going to try this tonight.", "dato9746": "🔥", "anxiousbutpretty": "hoping that since mine are more sensitive after being pierced i can do this!", "xxeternalsunshinexx": "The (gently) needed to be said lol 😂😭", "reeducatehumanity": "Yes it’s a gift for sure!", "lbholder": "💯💯💯👏🏾👏🏾👏🏾", "yungdebthornberry": "Nah breastfeeding has killed the sensitivity in my nipples", "montyshaw23": "You have Goat tendencies like MJ, Kobe and Tom Brady. 🙌", "badgurlbeauty": "10th grade bf helped discover this", "pronounced_gozay": "I have had that experience before. It blew my mind.", "bobby_axelrod116": "Yes, I am aware but thanks for the re-enlightenment...😍", "bettie_hustle": "Yes ma’am quickest way to get my nut lol", "hippie_hottie": "I love nipple orgasms. Having 2 guys sucking on them is a moment I will never forget", "bigreg71": "Sexy", "tahinah_": "Only when I'm high lol", "medusaanunnaki": "👅💦💦", "alhunt142": "🔥🔥🔥", "steph.aguayo": "Do piercings prevent this? 🧐", "halfrican_hippie": "Highly true.... and piercings have taken the stimulation to a ho nuva leva🔥🔥🔥", "fulltimeangel_": "So grateful for u 💘", "cybergirlonline87": "That’s my happy place and orgasm of choice.", "vi_storm__": "Yes I have plenty of times", "thankyounicky": "Ugh I have tried this and no I don’t think I have enough sensitivity anymore 😒", "diego_doesit": "🔥🔥🔥", "antonioottat": "Savage nips 😍", "autumnperri": "I knew because I’m one of DemPeople™️ 🔥", "jayykwanza": "Why are you so damn fineee?", "dnteventri8": "@mikequeenz", "mikey4wf": "I have tried so many fucking times for so long and I never get aroused from nipple stimulation", "bholcomb76": "This is true n my experience", "blackaveli_thadon": "😍😍😍😍😍😍", "nnefaye": "👍", "xonayimaxo": "💥💥💥💥❤️❤️❤️❤️", "sexyspiritualgangster": "The best orgasm if youre patient enough!!", "kamtyler202": "❤️❤️❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥yes baby, you are correct", "itserinvoss": "ITS TRUE 💥", "macho_man_sourbill": "My lady luv nipple play 🥰🥰", "geniedez": "Giiiiiiirl. TRUTH. I feel for those who can’t seem to get off on it (be it no sensitivity or maybe they just haven’t fully explored that yet!) cuz it really hits different. 🤤🤤", "mrdc2u": "Cold", "pce_sincere": "🏆🏆🏆", "nicolemu3": "Allllll facts 💯💯💯💯", "thehumblehelper_": "❤️🧎🏾‍♂️"}