{"smokingshadow": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "laithdaniels": "❤️❤️❤️❤️", "mf_joshua": "😍", "1stborndread": "Raquel you are thirst quenching!", "danirosexoxo": "😍😍😍", "savvyvisionsclothing": "🌶🌶🌶🌶", "thegoddesskenzo": "😍😍😍😍", "plusluvafred": "🔥", "goddessofyummmy": "Boss babe", "michelleekwoge": "Your way with words 🔥🔥🔥 thanks for presenting me with this moment to get lost in my own thoughts.", "steno69": "Beautiful😍", "lb_ent2387": "❤❤❤❤❤❤❤❤🔥🔥🔥🔥🔥❤❤❤❤❤❤❤", "bhuva8034": "Are you hot", "mohanedch59.fr": "Why do not you want to talk to me", "smitty7853": "Very sexy", "tastytrixie": "💙💙💙💙💙", "texasmade12th": "Thickness", "mercury.j971": "😍😍", "iamthewildtruth": "😍😍😍😍😍", "2ks1m87": "Damn Smh What I Would Do To You😢😂😩", "huneeybih": "You, your writing prompts and page are so helpful. I was seeing a therapist over the years who gave me a journal to start writing in. When I moved away and couldn’t see them anymore, my journal felt like it just became a diary of sorts to process my own emotions rather than something to progress my healing (if that makes sense). I’ve really been missing the writing prompts and during quarantine I decided to actually write down my responses to your prompts. I am so so grateful to be writing in a healing way again and can really only thank you so much. Your pages (twitter !!! , cat page, patreon) bring me so much joy and information that I’ve never been able to find anywhere else. You’ve really been getting me through quarantine (and tbh all of my other rough patches) and just wanted to send you some love back! thank you thank you thank you 💛💛", "laceykitten": "The most eye opening posts Tysm for your wisdom!😍", "driftlxrd": "🏆🏆🏆 Gxddess in Action", "c__gaza_": "🔥", "johhhanna_": "OKAYYY 😻", "yellowcake28": "😍😍😍😍", "lovelayo": "BABY!!!! YOU SO FINE❤️💕", "luvlystarfarah": "🔥🔥🔥🔥🔥🔥", "clara_chan81": "😻🔥", "fatdaddy816": "Yes Lordt❤️❤️", "t_r_i_l_l___": "😍😍", "xxeternalsunshinexx": "😍😍😍", "pandppod": "Beautifully written🔥I can see the sunlight, girl🙌🏾🍕", "turn5990": "Hell yeah!!!!", "based_facts": "Old twitter bae", "hkozak93": "My god you should really write a book, or several", "xonayimaxo": "YAS ma’am ✨❤️😍", "ms.garcia____": "😻😻😻", "not_tha_average1": "❤️", "blazux": "🔥damn hot 🔥", "nguemasalvadoresono": "Nice", "bostonskid": "😍😍😍😍", "jeifrater": "Wow!! 😍", "gdod808": "Toes so pretty👣😍👣😍", "gmanereal": "Wow 🤩", "lizb3th_xo": "🔥🔥🔥🔥🔥", "queenafronam": "You got some writing skills girl.", "nickfury187": "@brimmypicasso 😍😍", "oneal_blackboy999": "I already know the whole story😂😂", "lifeaccordingtokeeks": "My ex and I were reminiscing about how we met and I distinctly remember how we met and how he grabbed my hand/wrist and how I gave him this look like “n*gga if you don’t back the f*ck up” 😂. But when I saw who it was, this beautiful dark skinned man with strong hands, his veins throbbing going from the forearm to his biceps and I smelled the musky cologne in the hot July weather as I peer into his mouth and smile of beautiful teeth asking me to have some of my funnel cake- his first words in his heavy Jamaican accent. I’ve been with many a man before and since but meeting him was nothing short of destiny.", "midnightemf3": "🤤🤤🤤", "alexander_soe_gr8": "🗣BAE", "wednesday_o": "Queen", "lifethruglasses": "😍😍😍😍😍😍😍😍😍😍"}