{"lcrs_robotisthefuture": "That sunlight hittin🌞✨ @raquelsavage", "grigorijpotjomin": "you're beautiful😍😍😍😍😍😍😍", "patriceudeh": "@nique_writes", "whostoleserendib": "@cataleya_sayuri_ but girl. ALSO BOOM", "jessica.marchella": "Your account is effing amazing, thank you for taking the time to share your life with us! 💛💛💛", "hannahhusband": "❤️", "southern_gentleman225": "Looking fantastic & Congratulations @raquelsavage", "xoxalyssamarie": "Same thing for me two new years ago exactly, went celibate for a year+ then tried to date again this year, but this time following that amazing, sometimes annoying and confusing, inner guidance system.. Be well and blessed be <3 !", "katttiewilliams": "@lucywilliamsss", "keepingsunshine": "This is touching!", "jevonneri": "😘", "kellyblaus": "I LIVE for your thought provoking thirst traps. You are so intelligent and incredible and inspiring. Thank you for always sharing your thoughts with us! Also, your skin is absolutely GLOWING. Wishing you a happy new year, angel. ❤️❤️❤️", "_petaltothametal_": "🙌🏻👌🏻💕", "stephcheycooke": "Wow ❤️", "mimzy817": "I love your TPTTs that I’m subscribed to you on Patreon but I can’t find this post 😕", "andreamatellian": "Amazing advice 👏🏼 also you are so beautiful damn 🔥", "rooster314_peterbilt": "Beautiful🔥🔥🔥YULPYULP", "__tinybutfierce__": "I follow you on twitter and I don’t know why it took me so damn long to look you up on Instagram but I’m so glad😭😍", "socialjustice2020": "Definitely here for one holding themselves accountable 🙌🏾", "clemenciadeleon.co": "You are beautiful from within!!!! Your story hits a lot of people, including myself. Love it", "krushnaa.458": "Cock is there then y toy baby", "satega_williams": "💯💯💯", "jaybape": "U early it’s still December", "thenoelove": "Girl your skin! And your hair! You are a damn goddess! 😍", "miawrightross": "😍🙌🏾🙌🏾🙌🏾", "mrprettytony19": "Smh!!", "celesexuall": "I remember when you started this and I hope I can do the same next year", "alhunt142": "🔥🔥", "bye2hair": "★★★", "stella.rae": "love u sooo much, a true inspo✨😫", "theafrolegalise": "🎊🎊🎊🎉🎉🎉 Issa celebration", "nathaliberdade": "Don’t blame a clown for acting like a clown. Ask yourself why you keel going to the circus 🎪", "apeculiarone": "I feel this, went on a similar journey this year. It’s been invigorating", "fitcoachki": "I simply love hearing about the transition in mindset/decision that you've made to put yourself first. It's extremely great for all parties involved (even if they don't agree) because you need to be the best you that you can be if you're going to make it in this world. Sometimes for that to happen you have shift your focus back on to yourself, and I see that you've already embraced that line of thinking. Good for you!", "verasica": "I just wanna let you know that you have inspired me so much. Because of you I am a better person. One day I will buy you something from your wish list. Until then, just know I appreciate everything you do for women.", "remembersmile": "HOE DOES SHE DO IT??", "gutta_reloaded": "Sexy lady😍💯", "nellek1981": "I can definitely dig it!", "mistressmckenn": "Needed to hear this message", "yaz_indira": "You’re such a goddess😍", "b_kivero": "This some damn good stuff. On this journey too 💕❤️", "emmmajaaane": "Here for this positivity and growth", "cummanifesto": "This!!!❤️", "revere.reis": "Glowing 😍", "choc_mousse": "I can totally relate the the ignoring my intuition part. And when I stopped that shit, I saw a shift in my life. Trusting myself more has improved my confidence. It’s been a dope revelation. Here’s to many more!! 🎉", "simply_ambermarie": "I just love you 😘", "zharlem": "I finally have gotten this right and stopped giving the \"benefit of a doubt\" which action doesn't make sense. I love me some me!", "femmmeow": "I resonate so much with this, Raquel. You inspire me so much 💕", "jazzyledeuce": "❤️", "fierefillenoire": "You. Look. Beautiful 😭 one of the best things I did this year was follow you!"}