{"talkma_talk": "I deleted my Twitter and spent my weeknights watching bad comedies on Netflix and then watching episodes of Chopped til I’d fall asleep. I also watch more natural hair tutorials on YouTube for product ideas and tips. Im thinking about going back to the gym to be more productive on the weekends and after work. I also have schoolwork to keep me occupied.", "venus_yama": "Girl first of all I LOVE this post and I appreciate so so much your explanation of how trauma can come in cycles for a reason. Recently I got really into yoga cause there's a free studio on my way home from work and doing yoga 3-5 weeks feels insanely good. I breathe way better, I have less back pain, less PTSD flashbacks, I'm calm and relaxed to where even my coworker noticed a difference. I never thought id be a yoga person since I always lifted but it has made such a huge difference in my mental health! 🙏", "jjasmints": "these conversations always bring my own assault to the front of my mind. i’m getting better at acknowledging the thoughts and feelings i have about it and not dwelling on it or trying to suppress it. knowing when to keep replying and when to simply hit the mute button and step away from social media. the most stressful thing for me is seeing ppl defending r kelly and wanting to correct them. i have to remind myself, some ppl are content in their ignorance and it’s not my job to fix it, as much as i want to. surrounding myself with ppl who AREN’T ignorant. also, moving! getting my ass back to pole dance class and did yoga in a bar for the first time this week. (side note: you loving cabin in the woods makes me like you even more!)", "bbsmith___": "a friend who is a survivor of sexual abuse deactivated. It’s been really heavy. I even apologized to my friends for posting anything relating to this issue as I am sure it stirred up emotions, PTSD and the like. I also encouraged a lot of self care. It’s been rough.", "meredithbellpb": "i wasn’t able to watch the doc at all. there’s no way i’d be able to get through it. just hearing about it has triggered my depression. so. honestly, being in this musical and being with my husband have been the only two things worth looking forward to.", "seacgo": "It has been a real struggle since November. The loss of my mother as well as other things have left me feeling broken. Some days are better than others. Some days I am functioning while others I can barely pick myself out of the darkness and fund myself uncontrollably weeping. For a while I felt weak for this. I have since decided to allow myself the love and space to feel all the things and reminders that it’s ok and it will eventually pass. I am allowing myself the time and space to fall apart when needed. Today is one of those days. @raquelsavage", "princessemilyle": "I love u Raquel, u r appreciated by 1000000000", "maya_thee_bee": "I could be managing better, but I'm hanging in there. I had to delete my social media for a bit because after I spoke up about my abuser, he felt the need to \"reach out\" to me in my DMs 🙄 writing has been my healthiest outlet so far", "bribold1": "Hanging out with my Mom always helps. Whether we play video games together, or paint, or watch BirdBox 🦅📦, it always does the trick. It’s nice to be around someone with good energy who cares for me and let’s know I’m good enough.", "95yera": "Ive bee cooking some new foods and taking my mom out to dinner tonight. Thank you for this dialogue 💛", "mss_sassy": "Muted every variation and spelling and spelling error of the series and protagonist. Spending less time on social media and more time on Netflix. Also, shopping. Lots of shopping.", "hernameisrocio": "Running, burpees and more HIIT training shit, gotta let shit out @raquelsavage ✊💕", "_kreyolmami": "well the people that know about (my immediate family) as been checking up on me which is nice to see because just last month I told them about it. I started working and going to school again so my minds been on that and I’ve been avoiding starting it with people online that opinions where just disgusting. I just unfriend/unfollow block and report because me arguing with them isn’t going to change their mind. Plus I’m taking a mental note whose supporting this man in anyway because I don’t need them in my life. I’m trying to find trauma counseling near me but it’s hard cuz I don’t have insurance anymore (thanks Medicaid).", "vivalacarla": "this week was SO hard. and that docuseries not only gave me nightmares but i had a whole emotional breakdown from just carrying so much emotional weight. definitely doing a social media fast. but currently watching netflix and keeping warm. but i’ll be doing a bunch of face masks and going to the gym.", "pathetically.spiritual": "I need access to services that'll help me process my trauma in a safe place pls.", "luis_lucy_1122": "Honestly, I think I've let myself go mentally. I'm still carrying guilt from some bad choices from like 6 years ago, and I've isolated myself. So I've consistently been going home and not going out with friends.", "incognegro_tu": "Great thoughts!! I think a lot of people needed to hear this for their own sanity. The world is becoming so convoluted that we need to make sure we stop and check in on ourselves before we get lost on the shuffle.", "nox_solyn": "Reiki to ground myself and get my mind connected to my core cos I have a tendency to be in my head too much. I watch stuff that makes me laugh - will sometimes just binge fail army type stuff cos movies etc can still be problematic and can end up worsening how I feel/make me think of other things that are wrong with humanity lolol. Cuddling with my pets, eating unhealthy snacks for comfort, and sometimes watching stuff with bad ass female characters kicking ass weirdly enough. It's comforting to fantasise being able to do that, to be THAT strong and look that fabulous. Getting outside/being with people outside my home also helps me create distance in my mind - so I don't hyper focus on that shit. :)", "sailorlouvre": "Im trying to stay away from social media, especially twitter, I won't watch the documentary. I read a post recently that brought up new trauma I didn't realise I had, im trying to cope with this new realization and im trying to find a way to protect and heal the traumatized part of me.", "blackdatassup": "That docu-series literally kept me up the night I watched it. I literally felt scared to death and I’d never been through anything of the sort. Luckily, I’m feeling better but I honestly feel a little guilty enjoying my freedom while there are Black girls and women in that man’s clasp that can’t be free. I knew the world was fucked for Black girls and women but it was really disheartening to see that show and realizing that there are sooo many other people there just like R.K***y. Now it’s imperative for me to look for different ways to help Black women and girls in anyway I can", "crystalofthelight": "I just found your page and I’m SO GLAD I DID🙌🏽", "hereisbritt": "I found out a couple days ago that my now ex boyfriend has been cheating on me for 7 months (more than half of our relationship) & it came out of thin air. I’ve realized that all i want to do is be alone on the beach listening to the waves and watching sunsets/ sunrises. I don’t know how to process & i haven’t cried yet so sunsets and loud music in my car is kind of my only outlet.", "crazy.coco.mama": "I could be doing a better job at managing. I tend to isolate myself when the weight of everything feels too much. I can't really do that though because I'm a mom. What I have been doing lately though is unplugging. I don't HAVE to be caught up on current events as they are happening. I don't have to engage in conversations that are too deep for me. I also am a self taught Baker, so trying new things I haven't baked works ad we", "laurenalexanderp": "I wish I had thought about self-care prior to watching the documentary. Luckily I have a good support system and am therefore able to be supportive in return. I’m really encouraging people to talk with others if they can. Honestly posts like this are helping me cope - makes me feel less alone and gives me tools to help others (which is my happy place) 💖", "thelady__artemis": "I started watching Criminal Minds oddly enough. It’s been such a good distraction for me. I did watch Surviving R Kelly but only the first 3 episodes because I genuinely couldn’t keep going. I felt so angry and sad and hopeless. Thankfully I have some friends I can vent about that too and thats been helpful. I guess just finding space away from the craziness and allowing myself to see the joy in small things has helped.", "zillahand": "I’ve been careful about who I’m around and not forcing myself to do anything that doesn’t feel aligned with what’s best for me. Also, when I’m able, I find making direct financial contributions to women/femmes who have been harmed or are generally targeted in conventional society is very healing.", "sugarknuckles": "Meditating every day is the key for me right now, even if just for 5 minutes. IDK why but it’s the only thing that gets my nervous system to chill out. It’s be a serious game changer.", "vm.turner": "I was only able to watch the first two episodes of the docuseries and ... that was enough. Overall I was initially feeling very vulnerable and helpless because of the lack of concern from men (BM specifically) that I was seeing online. I’ve been very intentional about only discussing this series in depth with Black Women. I’ve also been blocking and muting (on Twitter) as I see the need to, which has actually been pretty helpful. I have a separate account where I don’t follow any cishet men and it’s a totally different world. Outside of social media, I have been working through my feelings by writing them down so that I can give them a name and identify the “why” behind them. I also had my first therapy session of the year today! My happy place in the warmer weather is usually by the water here. Right now it’s definitely in the privacy of my room where I can write, draw, listen to music, organize, etc. to manage my anxiety.", "catreesss": "I’m managing ok. Instead of New Years resolutions I made a list of promises to myself, to treat myself kindly this year, and to let myself have fun as long as it’s not to subconsciously hurt myself. I’m letting myself let go this year, and letting myself be ok in the moment, whether or not I’m ok on a general level, because that will work itself out. I get so bogged down in the tiny stuff so I’m just riding the waves. Just bodyboarding not scuba diving 😭 I’ve been self reflecting a lot a lot as well recently, and just allowing myself to evaluate my issues and the potential reasons for my behaviour casually without making it a big deal. My happy place is cooking and I intend on doing that a lot more this year. Thank you for this space Raquel 💘💘💘", "b34n13b": "Watching the doc, I didn’t think it would cause me to bring up my own personal SA trauma, but it did. I oddly sank lower than I did when my assault happened. My self care regime never lasts because I get bored of it. I haven’t really found something that interests me enough to stick with it. But in the moment, I go back to kickboxing, watch my favorite funny shows to lift my spirit, and I have videos saved of my favorite people spewing positivity to nudge me into the right mentality.", "chefbuttercup__": "I logged off of fb and Twitter because those are the sites I know thats where the most dialogue was going to happen. I asked for everyone to respect my boundaries. Really just stayed to myself the weekend it aired until today. I like to watch anime to cheer myself up. Honestly I still feel I guess triggered that I even have to do any of this. I want this to not bother me. I used to be okay with what happened but when #metoo started to be in the headlines every day or week. Everyone wanted to talk about it and I started thinking too much about it. I can't change the past but I hope to be able to find my okay again", "mistressmckenn": "This year I started a gratitude journal where I write three things I am thankful for everyday. So far it’s been a struggle to switch my mindset to being positive/thankful from my usual negative, spiraling mindset. Sometimes I sit there trying to think of something for a while and end up writing something basic like my cat lol", "earthtonesss": "Thanks for making me not feel alone. 💕", "perfect_quincy": "I love you so much ✨", "madelynstarkss": "Right now, I’m thinking about a social media fast and doing a fast only doing juices. I am so emotionally and physically drained, I need a reset.", "cbgxo": "Stretching and reciting affirmations always helps me. Also forcing myself to go outside and walk for atleast 1-2 hours and get some sun"}