{"king_numero_uno": "Chick came over, started giving me head, she then started to ride me. 2min in I fell asleep. I woke up the next morning she was gone, I looked at my phone and she sends me a pic of myself naked passed out. Morrall of the story, Hennessy is a hell of a drink.🙈", "camjgg": "@raquelsavage check your dm’s 😂", "ny_made231": "I was having sex with this girl at her moms house her mom didn’t know I was there so we in her room I’m busting crazy so I’m bout to nut so I pull out aiming for her face and her mom opens the door and sees her precious little angel on her knees and me butt ass naked nutting all over her daughter face 😂😂😂 needles to say I was never welcomed back 😂", "djblackcard": "I was having sex with my ex in her room after a date & I hear the garage come up & she’s so loud they heard us from the garage. We tried to put our clothes on & play it off but her mom knew. I didn’t come back over for a while, but her mom didn’t trip she just told us be careful. #dodgedabullet #savageconfessions @raquelsavage 💪🏾😂", "purehunee": "@msbreenicole", "scorpion_kitty": "My guy and I were in my room(I was living with my mom) having sex the music to was loud from the other room. My sister (who didn't live there) and her boyfriend walked in and saw him eating me in the middle of the floor.. She was so dirty she drove all the way to My moms job and told her what she saw.", "officiallakyn": "On my 21st birthday while I was out and already drunk, I ran into this guy I had been trying to get at for MONTHS. Finally got him in my room, and....thats all I actually remember. Ran into him months later, turns out I fell asleep while sitting on his face.", "sexyspiritualgangster": "I was on a girls trip on a cruise and i thought we were under a girl code and brought a dude back to our cabin...the next morning me & my new lover friend😩😂 woke up to my friends cousin cursing me out for being a disrespectful azz hoe 🙈🤷🏽‍♀️", "gemcookies_": "Not my story but once upon a time everyone is home my mom my aunt me and my sister and my moms guy friend right, so he goes and he gives us each 10$ me and my sister being pot heads go to the store for weed and roll up, when we come back my sister opens the door to our room and is like ew wtf and I’m like what happened, I see my mother on my bunk bed with her legs in the air getting fucked by her “friend” !! We just went to the hallway and smoked didn’t come back inside til he left and til this day my mom says my sister was lying 🤥 that didn’t happen , I guess we both got fucked up eye vision", "fithelotus": "Pussy farting for the first time. I know it’s natural, but I was intoxicated and high as fuck while we were fucking and it startled my dumb ass so I jumped and my gf kept stroking and I farted again. I was blushing and she kept making me fart, then starts laughing at me. 😒  Like this whole cycle of her making me pussy fart, my drunk ass blushing yelling “noo” * in my Kevin Hart voice *, and her evil laughter just continues. I was so fake mad and real life embarrassed 😂", "nlbdrjj": "😳😳😳😳😳🤤🤤🤤🤤🤤🤥🤥🤥🤥🤥", "ayjaybee1227": "one time my wig came off 😂🙈", "musicheadnmoney": "One time while in school I was fw this guy in his room while his roommate was asleep. I was riding him and I caught a Charlie horse and just as I caught the Charlie horse his roommate happened to roll over and I froze like a deer caught in headlights and then he turned back over. I got up and just went to sleep after lol 😂", "carlettaiam": "Was having sex with a dude and the shit was so good I forgot his name. F Ed up part was his nickname was the the first two letters of the alphabet.", "shopuntamedflowers": "Getting caught by the cops while sucking dick. I’ll never forget that, almost went to jail", "itscherrydarling": "I was hooking up with someone from Tinder and my nose piercing got ripped out in his pubes. Blood. Was. Everywhere. He had white sheets 😂 Neither of us could get it back in (it’s one of the ones that’s shaped almost like a question mark), and I had to get it repierced. That was fun to explain to the piercer.", "fsurles": "#SavageConfessions #RaauelSavage me and a girlfriend was having car sex and we went at it for about 20 minutes. Fogged the windows and all. Oral both ways. Switching positions and all. I got out of the car so that I could hit it from the back. When I started nutting, I heard someone say \"whoo hoo! Y'all put on a show.\" It was a cop that had watched us the entire time. We tried lying about it, but of course he told us what we did and how we did it before the windows fogged. Then told me how I got out of the car and continued to have sex with my girl. He let us off with a warning and said he enjoyed the show. Damn perv 🤦🏾‍♂️", "plantsandtacos": "This pic just murdered my soul and then the story took the corpse @hollaatyacurl", "tony_vassell": "Omg you are sexy as hell😘😘😘😘😘", "shaemarietheartist": "This picccccccc🔥😩🙌🏾", "aleksandar_bronzani": "Heart😵", "nicki_expo": "You’re so beautiful omg 😮 😍", "wheelchairbobby": "I was having sex with a girl in the shower . She was pinned up against the wall and i was in a squat /split position because she was mad short. We were going and i slipped broke/ cut open my pinky toe and pulled a hamstring... now i dont even beat off in the shower #traumatized4lyfe", "arionie": "His mom saw me naked at 2am and proceeded to have conversation while I was still naked 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "egggirl_": "Really similar story, my long distance boyfriend at the time and I were having sex in my dorm room, when my roommate walks in, doesn’t EVEN BAT AN EYE and just sits on her bed and proceeds to unpack her stuff and get comfortable. We were in shock but eventually I was like “could you give us a minute?” And she left. That was the first time she met him 😂", "criticalchemicals": "I have another one, it's not about sex but I was 18 and exploring with my boyfriend. He'd downloaded this positions app, and to kill time I opened it up while we were waiting to get his hair cut. Hes up checking in and I'm scrolling down the list, when he gets back I show him one that's a bit quirky/but still doable. So I click on it and he immediately freaks out and I don't know why. So we drop the phone on the ground in the middle of the family hair salon and it just start freaking out with moaning and bed squeaks. Apparently the app had a gif to show how to do the position and his volume was up. So like there we are in the middle of all these moms scrambling to turn the sound off. The funniest part is nobody even looked at us directly, they all sort of half turned their heads and that made it 30x worse, so after about 30 seconds of this we figure it out. He still got his haircut though 😂", "amaomikami": "I was having sex with my ex in his truck. I was riding him in the drivers side and ended slamming my ass on the horn. He turned soft right after 💀💀", "quitjoshnmee": "My girlfriend and I at the time in college was in my dorm room getting it in. Meanwhile security in our building looking (someone stuff was stolen) we wasn’t paying any attention cuz shit was hot n heavy, she on top cow girl position and I hear keys fumbling and all I hear is “damn, y’all getting it in” not from security but the crew of ratchet folk following security. It was embarrassing, but we laugh about it to this day @raquelsavage", "andreb4stacks": "In my undergrad years I was sleeping with a good friend. We had been having sex on and off for a couple of weeks. In the middle of sex this time we are really going at it and she started to shake tremendously.....she had a stroke because she was epileptic. I was so confused and afraid. I sat there with my clothes on until she woke up about an hour later.", "lifethruglasses": "we were switching positions & he irritatedly said “aye, nigga. watch those elbows.” i was like (;_____;)", "don_neeyoo": "😂 😂", "jrealtalk17": "I sent you a DM on mine. It ends with a broken nose....", "laithdaniels": "One time a girl I was seeing wanted to sit on my face. I like eating puSsy so I was down. We were getting into it and she says,OMG I'M BOUT TO CUM REALLY HART! Next thing I know a powerful steam of liquid shot in my mouth! I quickly pushed her form on top on me and sat up in anger. I look at her and said,\" Bitch did you just piss in my fucking face\"? She looked at me and started laughing hysterically. I'm still looking at her in disbelief like,this ain't funny! I was down to let you sit on my face and than your gonna piss on me......dafuck! Still laughing hysterically she looks at me and says,\" boy you ain't never seen a girl squirt before\"? Well now you have.😎", "chelstarc": "One time in college I was hooking up with this guy in the garage of my friends’ house. We were having a real good time. Trying to be mostly private about it. I’ve always been very vocal while f***king... and well basically then entire house heard me. I got quite the reputation after that ☺️🤷🏻‍♀️ it was embarrassing but I truly didn’t give a damn cuz it was a damn good lay.", "beingtiffany": "Lmaooo yo 😭", "kenny_koolaid": "My wife and I going at it in a motel room and didnt hear housekeeping knock. Next thing we know an older Mexican lady is screaming and cussing in Spanish as my wife squirts across the king size and splashes the carpet. My wife couldn't move, I was trying to cover up, and this housekeeper left and come back with a stack of towels and throws em at us.", "stephh_c": "😍", "igog_1": "This is amazing!!!", "sarahbarils": "My ex pouring candle wax on me at 2am, set off the fire alarm and woke up his entire family who knew I was staying over", "seeyalatersimulator": "I had the 👮‍♂️ personally knock on the car window when i was 17 and getting my first blowjob with the windows all steamed out...so...theres that.", "fearless_eni": "I was wearing a long wig with bangs and feeling myself! While he was on top, I realized I couldn’t move my head because the palm of his hands were on the hair. I then felt my wig beginning to shift. He’s not even noticing so cover my eyes while hanging on to my bangs! I had to act like I was shy while I was silently praying the whole time that my wig wouldn’t betray me.", "wildflower_dreamer": "More funny to me than embarrassing. But during the summer I was hanging out with my partner and I had a cold. He wanted to have sex and I was fine with it but told him I had a cold and he was like it's all good so I'm like cool. Background, I have this fear of embarrassing myself by either sneezing or coughing in my partner's face during coitus. So I'm riding him and we both cum and it's all good. I'm still on top and as I was about to say \"wow I got through all that without-\" and then suddenly have a huge coughing fit that causes my vagina to basically shoot his penis out of me with a little cartoonish pop sound. He's like \"that felt so weird\" and I, still coughing, say \"how the fuck do you think I feel???\" 😅", "tlovvvve": "I’m surprised the “i accidentally ate meat when reuniting w my military bf” isn’t number one Raquel 😭", "klassikfresco": "Once upon a time I was dating this girl . She made it clear she was with it and she wanted it NOW. So I decided to go by my friend house . He had his own apartment downstairs from his mother. My friend let’s us know he’s going out and won’t be back for a few hours.  Me and shorty smoke weed, sip some henny and get crazy in this pull out bed. She’s making all the noise in the universe. She’s thick so even her ass clapping sounds thunderous . I hear at the door “Matthew ? Are you there?” (Matt is not my name)  I hear the door open and I don’t stop. This girl is obviously in tranced by the sex she’s obviously to what’s about to happen I look up and Matt’s mom (she’s this older woman. Super strict. 7th day Adventist) is standing over us in horror .  She makes the most high pitched loud shriek and goes “WHAT IS WRONG WITH YOU TWO?”. The girl unrolls her eyes out of her head, turns her neck real slowly to make eye contact with Matt’s mom and drool is dripping down her mouth. She looked like something out of the exorcist. I swore that woman was gonna pour holy water on us that day.", "comeatmebreaux": "I was on top one time and got really into it. We ended up basically nose to nose when I (very loudly 😬) climaxed. He went to the bathroom afterwards and when he came back was super embarrassed that his face was ashy the whole time. I immediately realized he was “ashy” because my makeup had transferred to his face when I was riding. My white ass was MORTIFIED. #savageconfessions", "wet_heat": "I farted *really loudly* in my ex's face while busting a nut and cackled \"this is the best day of my life\" for some fucking reason", "journalofajohn": "I would have asked to join in, that's just me..", "nellek1981": "Lol. So one time I was going down on my lady and she passed gas. She let out a very sensual \"oooohhhhh excuse me\" and I didn't miss a beat. Kept right on going.", "urban_lov3": "Sooo I fingered my gf and of course her juices were all over my hands than I scooped some cool whip out the container (we all know it’s in a little bucket) and put it on her chest. Which I did a couple times and I put it back in her refrigerator. And the next morning we wake up and her mom make banana pudding with that same pussy juice contaminated cool whip. Her whole family was eating it that day exclaimed how good it was and all I could think about is they were all tasting her pussy lmao 😂", "drinksonant_": "My wife (then gf) and I was having drunk sex and we were in doggy. She’s drunk so she’s talking sex talk and I’m drunk so I’m getting hyped, she goes “fuck the shit outta me” so I start getting really into it and I slipped out and thrusted right into the area between her vagina and butt... it was dark and thought I broke my dick, she thought I broke her vagina... we took a moment to both writhe in pain but we got back to it. Sumn wasn’t quite right tho cause things were just a little too liquidy so I’m like “hold up” and I turn the light on and there’s blood everywhere. We had to summon her friend in the other room to help. She ended up being fine but now they call me vlad the impaler. 🤦🏾‍♂️", "impeacelikethat": "The time in undergrad. I farted while getting head. She kept going."}