{"giorgossparos": "😘❤️❤️❤️🌹🌹🌹🙏🙏", "kolsey": "🔥🔥🔥", "foolea": "well said!!!!", "joynicoleco": "Whew!! Jealousy and I have had to sit down QUITE a few times recently. It’s a journey", "femmmeow": "Thank you for being so vulnerable and sharing, love. I, like you, acted like I was above jealousy for such a long time. But I’ve found the times I have sat in that feeling or jealousy, let it happen, and then examine the sources of it and how I can address it in myself, have been the most productive and beneficial experiences of my life.", "byrdiieb_": "😍😍😍😍😍😍", "kadon_sterling": "Dope pic", "__purplereign92": "Jealousy is a sneaky one. I can think I'm so evolved and above it and then it hits me HARD. Over weird stuff I don't expect. It's an awful feeling and tough to really look into because we immediately want to shun it and pretend it's not there. But it's there... 👀😣", "southern_gentleman225": "Simply fantastic😘😘", "spiney.bonespines": "Do you still do your podcast? Recently discovered it and need more", "leonoratheexplorer": "🙏🏻❤️", "the_muscle_whisperermia": "I felt this in my spirit! Your willingness to share your vulnerability is appreciated. ❤️", "king_chronicforever": "😋😋", "sinceresallyscout.aliyah": "Hey Raquel, ❤️ We should collab together! DM @sinceresallyboutique and let them know we sent you 😍🔥", "youngreezy2real": "I miss our conversations. Real talk this exceprt just really spoke to me about something im going thru right now!! I need to go and join your site. Actually hell i need you as my therapist bc swear my life is in wtf mode! You always right on time! Do you give advice through email Raquel?! @raquelsavage", "aisha_chey": "Oh I need to read this....", "beautybuddy.biz": "Download the beauty buddy app✨ Link in bio 💙", "u.s.s.butterscotch": "Felt this in my chest. Really need to disconnect more often", "djjeff_forty7": "😍😍😍😍😍", "keepingupwithchidi": "Hey Raquel. I'm soo sorry. So random. But I'm an aspiring sex worker with a market already available to me. I just want to ask you to share some self-defence as well as precautionary tips for sex workers against things getting of hand while in the act (e.g rape). Could be a thread on Twitter. Cause I'm sure others are also wondering the same.", "seasoned_vet_eran": "🌡️🎯👏💘😍😘👅", "stereobrownsound": "👌🏻💯👌🏻", "delency_": "You might be the one witcho fine ass", "pelayowalker": "@kaguama_papi aya sale la nicte", "xonayimaxo": "😍😍😍😍😍😍😍😍😍😍😍😍", "___keesha___": "I needed this❤️", "norfcyde": "❤️❤️", "vm.turner": "All of this!", "alexisdiana17": "Wow you are flawless"}