{"chrissybillionss": "“You are enough” “You can do this”.....sometimes I am so anxious about my shortcomings that I forget how much I DO have. Also I’ve had daddy issues and still working through the left over dust.", "alexisdiana17": "Hi", "cryingisfine": "I remind myself often that I am strong and have gotten through a lot and that I am so lucky to have a support system. I just finished an apprenticeship and started tattooing full time earlier this year and I’m really struggling financially as I build clientele and it’s been a really rough slow season, when I start to feel suffocated I think about how I have still made it work each month (w help from friends and my mom)", "cbgxo": "\"I am proud of you\" or usually something surrounding being proud and grateful for my hard work. Like you, mine stems from childhood where because being \"good\" was expected, it wasn't really praised, and being \"bad\" or making any minor mistake was usually met with verbal insults and attacks at my personality. So now any minor thing I accomplish, even if it's just getting into the shower I say thank you and tell myself how proud I am. It really improves my mood.", "megamcsara": "I love your example! Mine is “fuck shoulds”. It reminds me that there are no “shoulds” and anyone who tries to define me or what I do (or tell me how I should be instead) is deluding themselves. It also reminds me that if there are no shoulds, how can I not be enough? 💛", "pepperwitakickmotley": "Affirmation...... WOW, well ever since my depression I've been thinking about positive things and sayings to keep me afloat and with also my kids they always come up with positive thoughts and I'm very grateful.", "joelemaine": "It will work itself out. Because in the end. Through my experience it always does", "mentallyrealmami": "Black women are typically and wrongly deemed as aggressive or defiant when that same behavior would be embraced as inquisitiveness if displayed by a white person. I'm thankful for and not surprised by that Black female professor finally recognizing (and encouraging!) your intellectual curiosity. I love your captions. They are all thought-provoking and challenge norms. 🔥❤️", "influenza_muskk": "“it is ok to feel...” because i often feel as though my emotions or feelings aren’t valid due to people invalidating them. so self validation has been a huge part of my self care experience and trying to like help myself", "sheshanti": "Lately, I have been feeling like my existence doesn't or shouldn't matter so I've been telling myself that 'I am worthy of every good thing that exists & happens in my life. And if there are \"bad\" things that happen/exist, it's because life is just like that sometimes. It ain't always roses but it also ain't always shitty.' Thanks for this. It's always a good reminder to be kind to myself. @adookie - check this post", "bigheadbigheartfoster": "💓✨💓", "steffnmejia": "I am doing my best, my best is enough, enough is everything", "thewellnessbae1": "My affirmation: I am more than my mistakes, a work in progress, and doing better than I was yesterday ✨", "konji_sen": "I have all I need to survive and find happiness", "sequinedtrainwreck": "That whatever I do is my best and my best is the most i can do. Telling someone to do their best can be a lot of pressure, especially those who suffer from debilitating mental health issues! Oftentimes when people say “do your best” it really means “do what I think seems like an acceptable amount to consider your best”. Sometimes when I feel like I haven’t done “my best” I realize that my best can change from day to day and sometimes it will mean just getting up and taking my medicine. Some days I will do more than that. It’s still my best and it’s still worth celebrating.", "leedvslydia": "“If it was easy then everybody would be doing it.” This is why you are different, this is why you stand apart.”", "officialbrownx_": "A lot of good girls here. Issues like this which you’re often granted while you’re Very young and developing never really go Away. Most of you can say you changed or worked them out but you’re either inflicting the same things that were done to you on others or fueling them one way or another. E.g seeking them out by going to or wanting to be around people who make you feel that way and seeking the affirmation from them. The OP suggested it was cuz she told she wasn’t smart enough and that she wasn’t brilliant. It was her best affirmation she still seeks this not by people who appreciate her brilliance but people who don’t and actually go out of they’re way to do the opposite, she then after that seeks it out by “standing out” so they validate that brilliance. It wouldn’t matter if it was someone who d affirm it but the opposite at first said that to her. The way you seek these things out can differ how ever the OP’s way seems to physical brilliance, due to her body type (plus one) it’s challenging to western society to hold beauty standards as such and it isn’t easy but she goes ahead and looks as sexy or “attractive” as possible then these people then affirm the brilliance. Not from people who already think she’s brilliant. Her statement “after I challenged my professor” is line to those who aren’t familiar with this. This applies to most comments too. As psychologist who graduated with highest honors we refer this to as the “good girl or good boy reflex”. This all isn’t bad sometimes people of such make life little worth it. They’re the best, good sweet little girls.", "verymuchso_erica": "\" you dont have to be everything to everybody, just be enough for yourself \"", "skipped_beltloop": "\"I matter to no one and to everyone\". It just reminds me that I live my life just for me, but my goals are also big enough to effect everyone.", "elcajunny": "Check your DMs :) it’s important! Pls 💜💜", "babysugartrap": "😍😍😍", "colinreese": "You look fine as fuck in this one", "damodricharp": "😍😍😍😍😍", "justraycarson1": "😉", "sduck1227": "U are phenomenal", "hereisbritt": "Being told I’m beautiful or pretty or gorgeous etc.. growing up I was surrounded by people who constantly made me feel less than because I was darker than them & because my hair wasn’t stick straight bc “curly hair is ugly” & because I’ve always been the “big girl” & although I’ve come a long way to unlearn a lot of these things, being validated by strangers in the things I’m still trying to unlearn is my favorite way to be affirmed.", "vilmasisko": "Mine is \"I am enough\"/\"I am mine\", I sometimes read it out loud as a daily reminder. Simple, yet important.", "xonayimaxo": "😍😍😍😍😍", "alainabcyr": "nothing I do is a big deal. I know to some people this sounds helpless/hopeless, but for me it's really about letting go of my anxiety around making mistakes. Its giving myself freedom.", "theonly__b": "I am radiant and powerful!", "crazy.coco.mama": "That I can do it. I'm often very hard on myself. My anxiety constantly tells me that I CAN'T do it. But then I look at what I accomplish, or someone tells me that I inspire them, I realize, not only am I accomplishing things, I'm doing them well and pushing others to do well without even knowing it.", "niki_angelou": "Gifted 🙏🏽", "maggiethebadger": "“I am stronger than you think I am.” All my life, I’ve faced people who have had a vested interest in making me feel less than myself, or them - from my ex-husband to my parents to girls at school. They told me I was weak, unstable, dependent, incompetent, the list goes on and on until I was afraid to move. Now in my 40s, when I find myself feeling like someone is trying to make me less than, I repeat this over and over under my breath. I know it’s true because I’m fucking HERE. You are stronger than they think you are.", "skyzthelimit27": "Nice smile", "jessmessrainbow7": "Mine is you are worthy", "foxc_fine9": "Bro you make it hard to hate you."}