{"bornrxbel": "Support for me. Is asking me how my day is without me having to ask you, plan things, reciprocity is so important. Support for me is listening to me & sympathizing with me when I'm not in my greatest mental state. The little things like telling me you miss me, telling me how much I mean to you. Also I love hugs ❤️", "richmondsr.david": "❤️❤️❤️❤️", "k.morris00": "You look like an Amazon ✨💪🏽😍", "queenafronam": "It depends on who and the situation for me. The one general support trait I need tho is listening and understanding. I need you to listen to me not to say I was wrong or state your opinion but to just listen. Understanding because you need to know why I say and make the decisions I make.", "tallasianchick": "Legit. One of my partners gave me soup, sex, and napped yesterday. Twas good.", "cp76pimpin": "Just beautiful", "embrek": "Omg you are SERVING", "hereisbritt": "Support for me is just affirmation that the decision I’m making is a sound one & being seen as an adult. It’s being told (by someone I love) how proud they are of me & that they acknowledge that I know what I’m doing. It’s also being heard & not being offered a solution, just listening to how I feel and reassuring me I’m not crazy.", "mello_timothy": "A queen 🙌❤️", "pepperwitakickmotley": "Well support to me is that I get that listening eye contact, because whatever I have to say will reflect on the both of us and I want him to know that this is what it is. Knowing that I have that support means alot to me because is every he ask me for whatever it is I'm there to support him. ♥️", "fivefootfinee": "Support is showing a genuine interest in me and what I’m doing", "omi.o.my": "I’m that person who goes above and beyond just to push my needs down, so this is hugely important! I think support for me is meeting me on my level and being accepting and supportive of my ventures. There’s a big difference between voicing concerns about possible outcomes (which must be paired with affirmations), and just shutting a person down with fear tactics.", "shaairamor": "What if your partner doesn’t know how they are best supported? How do you move on past that?", "xoxolaneybunny": "Net pay lol", "nox_solyn": "Support for me personally is being listened to and not judged. When my BPD is fuckin up and I'm feeling suicidal etc, or even if I'm just having an off day, getting hugs is amazing. This is a huge deal for me because I loathe being touched by people generally speaking, I'm only ok with it in a \"romantic\" setting. So friends and family don't touch me cos it makes my skin crawl. But I have a fwb partner now, and so being touched by him feels nice, so for the first time in my life, when I feel like shit I can now get hugs from him and it feels NICE, instead of it feeling horrible, which is what happens when friends/fam do it. So that has been amazing for me. :)", "capribaby___": "I'm late but support to me means trusting that I'm capable enough to control my own life and respecting that rather than arguing everything I do or say because *you* don't understand. I'm tired of affirming myself and having to argue every decision I've made to prove its worth and subsequently mine.", "miamimagicspa": "❤️💆🔥", "arwaabbass_": "I feel like we only talk about showing support at hard times... But what if I'm really good? I still need support. For instance when I get something good going on at work I want a congratulations. I want a cake with congratulations written on it. I want flower with a card that says congratulations. Please congratulations me man", "sumanthsinghteja2018": "Perfect 🔥❤️", "maikalbertsphotography": "Awesome😍👍", "po_slim_": "❤️😘😘😘😘😘😘😘😘😘😘", "btravis71": "🔥🔥👌🏾", "on.mommas": "4 me its checking in on how i feel. Active participation in communicating needs, desires, boundaries. Open to fluid navigation thru different aspects of my life.", "marci_romi_": "Thanks for sharing what supports looks like to you. I’ve been struggling with this all my life but this past year it has been even worse. I’m starting to realize that my support isn’t reciprocated and I’m backing away from friendships. I know I have to start speaking up and saying what support looks like to me but what I struggle with is how do I bring that up and state what I need support in if the relationship is so old and we’ve been a certain way for so long?", "kramenitsugua": "For me it’s listening 👂 to my rants after I have taken some time to myself to shout at the moon and/or ocean 🌊. Allowing me to be free to come back with a better mindset!", "melissanathalia_": "Support for me looks like a partner being gentle with me when he is angry. I’ve heard people say that that is too much to ask, but then I remind myself that if I can be gentle and patient with my anger, perhaps another person can too ;) After ten years of receiving mostly the opposite of this, support for me also means trusting my judgment and opinions on things - therefore, meeting most of my statements with curiosity versus instant skepticism and doubt. After all, if a man ridicules something I love or believe in, what does that say about how he feels about my judgment and decision-making process? Some guys would say that I can’t expect a man to always agree with me, and I totally agree - but for me to feel supported I need a man who says “hey, I may not have reached the same conclusion on this topic, but I can totally see how and why you did”.", "msblackawareness": "Ooh, yes—that validation IS so important! For me, I admittedly struggle with accepting my own viewpoint because I was so socialized to think that maybe I’m overthinking something, or gaslit to believe that I wasn’t giving other people’s perspectives consideration—two positions I know are furthest from the truth about me. So for me, having people who, even if they don’t agree with me, can genuinely say “You know, I get how you might think/feel that” is EVERYTHING, because it shores up the self-affirming work I try to do with myself.", "marcela_szw": "Same 👆it’s hard to ask for support. My friends and I are creating relationships where we regularly check in with each other. Another form of support I appreciate is when my friends make me be physically active with them! Going to yoga or the gym with people I love makes it a communal activity, and the endorphins help me get out of my head.", "absterglo": "Listening and asking how I feel for reall", "prorambles": "Not figuring it out for me or anything, just holding my hand to let me know I have someone to lean on, listening to me talk or distracting me for a few hours so I can breathe.", "miakcalvo": "Support for me is someone close knowing enough about me to know when I’m NOT ok. Knowing when to ask “Are you ok?” “Do you need a break” “Talk to me”.... support is letting me just talk and let it all out no matter how mad, sad, embarrassed I may be about what’s going on. Support is NOT judging or telling me “everyone goes through this”. #mentalhealth #support @raquelsavage", "_petaltothametal_": "I appreciate this 👌🏻💕", "tweetybyrd11": "To be perfectly honest with you I don't know. That word got tossed out after my father died and my mother had a stroke 3 years ago", "this_guy_rel": "Come to Houston", "steno69": "Beautiful👍", "daves370z": "Absolutely stunning 🔥🔥", "quell87": "😍👑Goddess", "ssaerbearr": "aw i’m sorry you’ve felt gaslighted. could def relate. it makes me so sad, you’ve come such a far way and i look up to you. i wish i had the attitude like you and to be able to overcome the things you have. anyways i wholeheartedly agree with this entire post. thank you for making me self reflect ❤️", "odbw55": "😲😘😍", "alanainwanderland": "Miami is such a special place in my heart!! 💕"}