{"ajamarih": "Man, and here I am thinking something was wrong with me....thank you for this", "elizwent": "You are the best 🔥❤️", "whybird911": "@raquelsavage ok sooooo questions....what is mac & cheese pussy and what is a cishet man??? Educate me sis!!!", "unapologeticallydeee": "Thank you for creating a safe space to discuss topics like this. Literally God sent.... @raquelsavage", "askpamm": "Enjoying your whole caption! The dry pussy resonated me fully, lube is always key 🔥🔥🔥", "kimber1104": "I’ve been following you for ages, you are my daily laugh and you’ve seen started to change my perception of my body and how I look at sex and helped my confidence. I don’t have time to stan anyone but you were worth the time. But you’ve blocked me on two things now and I’ve never said anything bad about you to you or otherwise, so I’m gonna stop following now but it’s cool ✌🏻 I wish you all the best 🙂", "anansis.daughter": "You’re so pretty damn😳", "angelo_s69": "😛😛😛😛", "_tcxpm": "@dianaatanesyan that’s how I’m tryna roll up to the beach this summer", "carrrlote": "Always love your posts:)", "kurlykween": "@sensual.honey girl I thought this you for like 2 seconds 😭😭😭", "princepesa28": "@ekbmelton", "sarahbarils": "@brittanyamirelez", "resetrefocus": "I’m a broke college student bb queer rn but one day when I save up my $ I will be a client 🤩🙏", "heritagekulu": "Goddess Goddess Goddess", "badgurlbeauty": "I learned this lesson 2 weeks ago. I experienced some vaginal tearing from a big penis. Ugh", "adriano.cordeiro.397": "Topsensual", "patpayteon": "🔥🔥🔥🔥🔥🔥", "gabriella_blackcinderella": "What lubes do you recommend? @raquelsavage Anything organic/vegan😓?", "hewhotheyspeakof": "🔥", "idgt55": "U got some pretty toes", "ifeanyiyung": "Hi", "diego_doesit": "White toes 🤤", "elleako": "ily 💛 great post !", "cafuxi_ii": "@nicanela", "babiesareparasites": "also is spit considered a lubricant cuz i kno that shit aint it 💀💀💀🦶🏽🦶🏽🦶🏽", "tatasthebodacious": ":::googles mac and cheese pussy::::;", "reynadegatos": "best brands for lube have to be wicked or JO (water-based) and for silicone: has to be uberlube, wicked, & JO as well", "inclemency": "Omg get me a lube syringe STAT", "that_half_a_smile": "Is it bad that I use coconut oil? ..like I literally use it for everything.. my body, hair, to cook with and as lube 😂 (disclaimer: not the same jar) ...my puss seems to be really sensitive to lube and they are expensive. I have tried some in the past and it's never gone well, which has put me off. I read that coconut oil is safe to use because it's natural but is that true? I've not had a problem so far but I dunno lol am I playing with fire 😂 @raquelsavage xx", "dcheese79": "Beautiful💞💞💞", "bionicla": "Look at you💦", "livelearnloveletgod": "💯", "breedoubleyou": "!!!!", "whereispeyton": "honestly thank you for being amazing enough to have an open dialogue about this.", "royalhighness": "🌅🌅🌅🌅🌅🌅🌅🌅🌅🌅", "luauizzy": "RAQUEL you out of control 🤩🔥", "mzbronzenlovely": "Sexy Goddess", "fagansjonas": "🔥🔥🔥🔥😍😍😍😍", "riz_eq": "😍🔥", "ivanelements": "🤩🔝🔥♨️", "mercury.j971": "🤯😍😍😍😍👅🍑👅💦💦🔥", "cocoaafrodite": "How do you feel about organic coconut oil? I've heard people say it's safe, but I wonder if you've tried it.", "biancamoon": "@sustain lube is amazing !", "skyyroyal": "🔥", "el13isa": "@birthinreverse", "themakeupgangster": "Raquel Goddess from the House Of Gold ✨", "quell87": "😍👑Goddess", "nat.pack": "RAQUEL YOUR FOOT IS BLOCKING MY AIR WAY", "deadlyraquel": "This made my dry pussy feel somewhat validated.", "ras_vitamix": "Had an old friend whose equivalent phrase for “Go for it/get after it/let’s do this/it’s on/giv’er/etc” was “Lube it up, mate!” Been saying that regularly for 20+ years now.", "mychaela_elise": "Is an aloe based one ok with toys ?", "foxc_fine9": "Thank you for this", "odbw55": "😲😋😍", "phoneman623": "Thanks, I learned something new today", "the_sammoth": "GOD THANK YOU FOR THIS. I've had so many dudes complain about me needing lube and my response has always been, \"Well did you want me to enjoy it?\" Oofta.", "birdie_87_": "You're literally doing Gods work when you write about things like this. I'm not religious but I'm pretty sure this was something he wanted taught.", "chammm.hamm": "Coochie fat, ass thick, titties sit. You look sickening sis😍😍", "melissanathalia_": "Thank you for all that you share. Lord knows how many people’s sex lives you’ve both healed and helped. ❤️", "sinsangel": "Such a good picture of you! That color looks good on you and yes, lube is the tits!", "shejuicey": "I love you", "__shalili": "I always knew you couldn’t mix silicone with your silicone toys, but what’s the reason? Does it break it down and it melts or rips all over the place? 🤔 Just curious, but not enough to experiment and ruin my ish lmao", "jadeonagoodday": "Hit that like button on general principle.", "seasoned_vet_eran": "🌡️👏🎯💘😍😘👅💦", "justlyssten": "First of all you look stunning! Please take me. Secondly, thank you for always talking about lube. It’s an important part of my sex life and hopefully you’ve introduced some others to try lube thanks to this post.", "miisspage": "THC lube is also a very interesting experience lol", "rasan_rock_jacobs": "Sexxy 👏🏼👏🏼👏🏼👏🏼👏🏼", "tammyscumbag": "Even if you're someone who creates lots of lubrication, lube can still be helpful (esp. with vulva related conditions)!", "cp76pimpin": "Sexy ass", "oziebee": "You soooo fine omg ✨", "egeezy__": "😍", "kingneezy": "Lawdd🔥🔥🔥👀", "1halfbakedbitch": "I stan 💕"}