{"chillusions": "Yea, my therapist is very empathetic which I appreciate but she also can overuse self disclosure during sessions, which takes away from time! She's also overworked so she sometimes can be inattentive and unfocused :/ but other than that I feel like she's just a good therapist for me, even tho she's a WW!", "babesclothing.usa": "Hey Babe! Can we send you and your friends some Babes Clothing USA item’s? If you’re interested please dm us to get you started! 💝💋✨", "pure_insanity": "Thank you so much for this. I’ve been wanting to go see a therapist but wasn’t sure on how to go about it.", "sssandraaa__c": "Super helpful. Thank you 🙌🏼", "getcoral": "Thank you for sharing this! 🙌", "andreapnw": "This is so helpful. Thank you! Just starting my journey with therapy and finding someone that works for me.", "bruja_baby": "I thought this was a skincare ad because your face looks 🔥🔥🔥. Your words are appreciated!", "_petaltothametal_": "I finally LOVE the therapist I have! So thankful for that! 👌🏻", "dawyandherdogs": "I’ve been thinking about this a lot, thank you for the advice!", "sextherapistjen": "Well said 🙌", "nikkiyousofine": "❤️ Appreciate you", "haruharuu26": "👏", "indisbeauty": "Thank you", "mercury.j971": "😍😍😍🔥🔥😘😘", "softanklefat": "I’ve had that issue. Everyone that I’ve seen is goal & solution oriented without wanting to hear the details. I had my recent therapist (after 6months) switch me to someone else that was “better suited” for me the day I had an apt with her after I finally opened up 🙃. Can feel like you’re wasting your time, it’s hard.", "ricky.alvarez.9480": "Your very pretty", "cdanni1992": "@lipstickkjunkee @asura_kun21", "evaarreguin": "Needed this today! Thank you 💖", "theonly__b": "@jazzlikejupiter the girl I was tellin u about!", "katinboots": "@__beatnik", "po_slim_": "❤️", "italian_boo_": "🎯⚘", "tat2dchick67": "I was terrified in starting therapy. Bi/queer mom in a polyamorous relationship with two partners living at home, and a secondary. I was terrified of being denied care based on that, and I ended up with someone who not only cares about those issues but reports clinicians who are discriminate. It felt like such a goddamn relief I almost cried tears of joy walking out of that first appt.", "aleksandar_bronzani": "💋My heart💪💚💪", "domine2.0": "Thank you SO much for these tips!", "too__rae": "This is so important especially asking about their advocacy work. I’m in a social work program and the clinical students have a hard time even fathoming advocacy work outside of “paperwork”. My jaw dropped. And it was a white man.", "paget_ross": "🙏🏼🙏🏼🙏🏼", "jessmessrainbow7": "I dip quick on a rude motherfucker"}