{"memegirlclub": "💖💖💖💖💖", "earthllling": "Im deeply saddened but not shocked. Would love to hear more of your story.", "julieheins": "Thank you for providing this space and sharing your experiences. I feel really overwhelmed and helpless, this will hurt so many in need 💔💔💔", "selena.rivera1": "i dont know how to feel. im angry. im so upset. i feel like i don’t have rights over my body anymore in certain places. im worried that this could outlaw abortion across the nation and kick roe v wade to the curb. i feel so helpless for vagina owners that live in those states. i feel disrespected and like im property. a cis man could get someone pregnant in georgia and they would be forced to give birth to their spawn or else face prison and the death penalty. that’s so, i don’t even know what to call that. why is this even happening? why are vagina owners hated so much that cis men want to force birth and pregnancy on them or else death and prison? what the fuck is the point of that? i’m so confused and disgusted. every single person on this planet is here because of a vagina owner and yet they are disrespected by outlawing choices with their wombs?", "its_yuey": "I’m upset that women are still second class citizens, I’m upset white supremacism and patriarchy can continue to fuel legislation like this.", "scottydear": "I had an abortion a few years ago and told no one. Barely my friends. Definitely not my family. I’m scared to tell my mom now because I don’t want her to feel guilty about it. As I was going through it (I took the pills at home) I just wanted to call for help and support and I just couldn’t. I don’t quite understand why but I really wish I had.", "__marie23": "I’m happy I also had the support from my mom❤️ don’t know what I would had done without it. I was 16. I watch the news and feel so disappointed as well. Thank you for sharing", "sammymojito": "Thanks for telling your story @raquelsavage. I’m sure this could have some empowering effects on some who share similar stories to make a stand against such dumb laws going in affect to challenge women’s Right such as freedom of your own bodies and to be able to make choices for you and said bodies. Crazy times we are living in, for sure.", "catreesss": "I’m so so so grateful to my mum for constantly making sure that my understanding of sex and babies and pregnancy is so wound up in discussions of contraception and “safe sex” that I can’t actually remember her talking about them separately. Although she’s not technically “pro abortion” I know wholeheartedly that she would take me for one if I got pregnant now or wanted one in the future, and she is fully aware because she doesn’t like the idea of them that she HAS to be completely on the side of contraception. She’s my absolute hero and I’m so grateful to her for educating me from the youngest age possible. She’s the best xx", "birthnameking": "So, I’m canadian and this shit got me all the way fucked up becuase how can I impact change when I don’t even vote in the country. Even people who do have votes still don’t appear to have any control. I wish I could say this shit is unfathomable but given that I’m aware of North American history, and haven’t blinded myself to recent injustices north and south of the border, I’m not surprised, or shocked. I’m just disgusted. When will people treat women the way they deserve to be treated? This is an attack and we don’t deserve it. 💜😢👿", "lexyl3x": "Things are just getting very real very fast and even tho I know the hand maids take is a fictional story it seems not so far from our reach! These little steps and quick law changes are just the beginning of this scary snowball being created! I’m terrified", "pure_insanity": "Also thanks for being vulnerable with us and sharing your story❤️. It’s inspiring. I don’t ever talk (til now) about my abortion with others not because I regret it but because I feel some kind of shame for aborting. And it’s because of the psychological manipulation those against abortion try to infiltrate, “oh you’re a murder” “you’re selfish”. And there’s many complex and non complicated reasons as to why we abort and none of those reasons should be of the concern of anyone else but me", "you_think_im_arab": "The fact that lawmakers AKA Ols ass white dudes control whether or not a woman a can have an abortion is just one of the MANY reasons this country will not progress beyond it's dark and controversial past!!! It's sad that in this day and age women's rights are being stripped away daily it seems!!! Smh... It disgusts me beyond measure!! A felony... FELONY!!! That puts it on par with Murder, Larceny, Arsony, etc... That's fucking INSANE!!!! Now don't get it twisted, I understand that once you engage in an act of sexual nature you should be responsible enough to use some sort of contraception, or face the consequences. However, those consequences shouldn't include a possible jail time bc of a decision to not keep the baby!!! Idk... What to say", "ohdirtydi": "I was 22 when I had my first abortion. I was dating someone who had a fetish for getting girls pregnant. While the decision was painful, I was incredibly relieved that I had a choice. I wasn’t ready to be a mother and this guy wasn’t fit to be my partner or supportive towards my pregnancy. He was so irresponsible. I even paid for the abortion in cash when it was him who persistently kept forcing me to get pregnant. My life would have changed forever if I carried that pregnancy on to full term. Women should have a choice. It’s our bodies.", "iamlaurengill": "I’m just here to say ladies and all vagina owners period, if you are thinking of or need to switch your birth control, do it now! If you have the capacity, do it NOW. A lot of these places are restricting access to contraceptives too. I wouldn’t put it pass those raggedy racist, misogynistic motherfckers to overturn Roe v. Wade and outlaw this thing nationwide. We all we got", "honey_jollof.esq": "Terrified. For all of us (people who can get pregnant).", "agjxcv": "💗💗", "sweetdaniellla": "I am scared for women. I am scared for black women. I am scared for IMMIGRANTS. I am scared for the poor. I’m fucking scared and terrified.", "reenbean": "As a Canadian I'm so thankful to not (currently) have this issue. My abortion was traumatic enough because of my own guilt that I can't imagine the added pressure of finding one in secret and potentially in unsanitary conditions. My heart breaks for women, and all my trans and gnc babies who already have a harder time getting the proper care", "birtheolivia": "THANK YOU FOR YOUR STORY!", "hotgirlcori": "before i had my abortion i never cared much for it or spoke on the topic until that option became my reality. its so scary to see that future generations won’t be able to make that decision for themselves.", "aurora_aesthetik": "I am so scared. I have more resources than most, but I keep thinking about if I get an unwanted pregnancy now that I wouldn’t have the resources to end it. I can’t do most forms of birth control for medical reasons so sex with penis owners seems like such a risk now. I’m so scared when this eventually goes to court. I’m so scared that functionally the GA owns my body. I’m so angry that a collection of cells matters more than my body and my choice to do with it. I’m just so empty.", "sugaringwaxcenter": "Visit us at north miami & fort lauderdale 🙋‍♀️😘😘❤️", "ahuofedua_": "This gonna force people to take other drastic measure and unsafe practices to have once. It’s in-fucking-sane that women can’t decide what to do with their bodies anymore.", "bka_katiewoods": "Thank you for being so transparent and eloquent in your sharing with us. My abortion saved my life, i wouldn’t be where i am today without it.", "flex.mami\nVerified": "Verified", "queencybarb": "💕💕💕💕💕💕", "yramsay_": "I love this post & have been following you for a while now & so much of what you talk about continues to influence what i want to achieve when working with vagina owners as a nurse. During this time I feel very helpless because it’s scary to think not just how this affects me as a vagina owner but also how having no access to abortions is going to affect many patients in this country and I’m just overall tired of the different ways that other try to control our bodies.", "basicemplants": "As someone who doesn’t want kids but wants sex, I’m so fucking scared about not having this as a medical option. Yes, birth control methods are available BUT are not 100% effective no matter how safe you are. Im so fucking sorry to them women in the recent states effected by HEAVY regulations of your uterus and your autonomy.", "desiniquee": "This entire thing nationally has spiked my anxiety but I'm also just pissed. Knowing the maternal mortality rate for black women is increasing, birth control access is decreasing, and reproductive Rights are continuously being restricted has me regularly spinning through all the ways my life could literally end if I became pregnant. Whether I wanted to keep the baby or not. I'm simultaneously pissed at how irrational and abusive the supporters of these laws are being.", "the_indigo_oracle": "Thank you for standing in your truth and sharing!", "_jmbee": "I have been wanting to get my IUD removed for the past few months for a myriad of reasons.....and now I feel as if I need to keep it in for the simple fact that I am terrified of getting pregnant. I have made the choice that at this point in my life that I do not desire having children. Yes you should always practice safe sex, and sure, celibacy is an option. But lets keep it a fucking buck....shit happens man. And what if shit happens?? I dont even get a fucking choice??? Ugh so fucking fed up and frustrated. And can we also emphasize that these asinine bans dont actually ban abortions, they just ban safe ones, which EVERY WOMAN IS FUCKING ENTITLED TO. So then what are we gonna do when we start reverting back to the 60's and women start doing these procedures to themselves again?? And arent foster homes crowded enough?? FUCK MAN I am angry. And confused. I hate this but from this day forward I will never ever remain stagnant when it comes to fiercely fighting for and protecting the lives of women and 'vagina-owners'. But even through the sorrow...this will not silence us. And I wont be shutting the fuck about this any time soon.", "ermareich": "Just before I turned 19 I found out I was pregnant. The man who impregnated me was 32 and a complete piece of shit. We had the talk about abortion when we started dating and said he was down with it no matter what. When I told him I was pregnant he completely ignored me, told me to never call him again and that I was being childish. My wonderful father took me to all of my appointments and told me to do only what I was comfortable with and him and my mother would support any choice I made. After my initial appointment with PP my dad and my mother both shared their experiences and it helped me to understand that this procedure is so normal. I am 27 now and I have had 3 abortions. I know I made the right choices and fuuck I hope I can still make those choices for myself in the future", "michaelduslar": "Sexy", "morgannnnc": "Thank you for sharing with us. I have learned so much from following you and appreciate you. Much love❤", "princessemilyle": "thank you for talking about this ❤️", "sashas_empire": "Women like you start revolutions simply by existing. I love your presence. Thank you for your service to the world ❤🙏🏻", "softestlips": "❤️❤️❤️", "_ninalong": "Appreciate you using your platform to honest a discussion on this. Just like you, I haven’t mad much to say besides I fear for the vagina-owners this effects. I fear for myself. It is sad to say I don’t have faith in this system to actually do good (I don’t think so)? No religious belief should be the standard for all (bc that’s what most pro-lifers are basing this on). These laws are bullshit and absolutely disgrace for this already shitty country.", "jrealtalk17": "This has been on my daughters mind lately. She is 16 and out of the blue the other day she said to me, \"If I came to you and said I needed an abortion, would you take me?\" I am so glad she feels she can have those kinds of talks with me. I told her that of course I would. If she gets pregnant and doesnt want to be, I will support her 100%. I would do anything in my power to make sure she is taken care of.", "etmafrance": "Thanks for sharing Raquel it makes a huge difference 💕", "hybriddivine": "The woman’s right to choose gives men the power to dictate our bodies and what we feel is right as to how we live our lives. Women are a powerful force what other way can they stop or control us. We are the creators.", "lassaad_ben_mtir": "Beautiful 😍", "jevonneri": "😘", "joydherie": "I'm a US citizen that has immigrated to Canada. It always seemed to me Canada was the progressive younger sibbling, but it is no different up here. I don't care what side of the line someone falls on, if you have a penis you should not be the ones making choices for, as you put it, vagina owners.", "forevermoredierdra": "Honestly I’m scared. I never thought of not being able to have one. I know if I get pregnant due to unwanted circumstances I would like to have one, but now that is looking very unlikely", "msnissa": "I am living in Northern California and can offer a safe, warm, and loving place if you need access to care. ..........………… I am terrified and hurt and worried what my past (I have had an abortion) will cost me in the future now. I was 32 when it happened and it was the right decision for me and my now husband. I would have been stuck in a terrible (& VERY unsafe) job commuting a long time (what time would I have had to raise my baby?) but now I am going to start a much safer job way closer to home because I can. Abortion is health care. #saveroe", "chopptv": "I think you are awesome and a beautiful creature xoxo", "_lilcrim": "Thank you so much for this. The hardest part about my abortion was how alone I felt. I didn't feel like I could trust anyone with what was happening because I was afraid of what they would say and do and how they would treat me because of it. Being able to find friends I could talk to about it, that changed things. Feeling alone is terrifying. And it's the feeling I'm beginning to have again. I think a lot about how I went through it alone. I remember missing my bus there and walking two miles in the rain to make my appointment. I am not shamed of my decision and I never will be. This sense of community is so important. Thank you for this.", "_cierraaaaaaaa": "I feel powerless.  I was violently assaulted and I remember the weeks after the attack when my period was late and I was paranoid that I was pregnant. The panic, depression, and anxiety that completely engulfed me even bigger then the trauma of being post assault was the idea of bringing a child into this world that was not only NOT created out of love but also 50% of the man that I viewed as a monster. It kills me to think of all the women in those states who now may have to suffer with either bringing a rapist child into this world or sitting in prison because they made a decision that should have been their own choice from jump!", "lala6548": "@raquelsavage I had my first at 14....not many ppl know. Idk anyone that follows u so I feel I can say that here. The whole situation was unwanted (how I got pregnant). I still remember the date... 1/11/2001...", "big.meaty.quads": "what do we do to fight this patriarchal bs", "choclatesunshyne": "Thank you for always being so open and willing to share your personal stories. Even when you make the personal choice to have an abortion it's not always easy, to live with that decision. Sometimes we do what we have to do in that moment. Sending love and hug, to anyone who has made the choice to abort, for whatever reason you saw necessary.😘", "millerlightwood": "I know I'm not the only one to thank you for this post, but I need to all the same. You share a lot of yourself online and so much of it is to help other women look at the world from a broader perspective and respect other people and their decisions. This is no different, and no less important. I adore you, respect you, and always wish you well. Sending so much love your way. ❤️❤️❤️", "speaksingplay": "The fact that these cases will probably go to the supreme court and provide an opportunity to overturn roe v wade makes me feel hollow inside.", "moorelove333": "Sending healing energy ✨⚡️🙏🏿⚡️✨.", "latiiifahhh": "Thank you 😭😭😭😭❤️❤️❤️", "dayabee": "I’ve had two abortions. I also have two living children. I can’t imagine what life would be like for the children I kept and aborted if I would have carried to term. My Husband and I both agreed on both abortions. My pregnancy with my youngest daughter almost killed me. The last pregnancy I aborted would have for sure killed me. I made the decision to choose Me and be here for the children I have. I don’t like the discussion and decisions being made by White Men who have money. At the end of it all, there will be concessions made for those who can afford it. Something we all. But I can’t help to feel like I don’t have control over MY body. I cry for the women who will die or permanently suffer due to back alley abortions. Even though I never want to hear the sounds of the machine in the room... I will always protect the right for Women to make that decision themselves.  And for the Abortion Protestor who told me I was going to hell and slit my tires as I was waiting post-op, fuck you!", "xxolou": "Thank you 🙏🏼", "oreganobby": "💗", "impeacelikethat": "Because I cannot carry a baby, I feel we as men have no say so in the matter. Blows my mind that we believe otherwise. I will forever and always say y’all are the strongest beings on the planet. Your body and your choice! Stay strong y’all!", "madisson_nora": "I live in Missouri where the heartbeat bill is being considered, and it just feels really hopeless, we know how it’s gonna turn out. I’m scared for myself, I just got a tubal but I’m still at risk for ectopic pregnancy and the fact that women will be imprisoned for miscarriages is a whole other level of crazy to me, we have no control whether a pregnancy takes or not? And I’m mad that women will likely serve more time for getting their abortion than any rapist ever has, more time than the cops who have killed fully formed innocent people have ever served. That literal children are being forced to have children. I feel failed by the system, how any legislation on this topic can be decided without backing of any science is twisted. I’m worried for the women practicing medicine who I know will be risking their careers and jail time to help other women. And I was thinking about how if they make abortion a felony, and felons can’t vote, is that just a bonus to their agenda? I’ve just been sick all day. I’ve sat with so many friends for this procedure and the fact that that option is being taken off the table completely just means suffering, for the parents and the children born from this. And women shouldn’t be forced into getting IUDs out of fear, that birth control method isn’t for everyone and a lot of women are going to get sick from that too. This is all over the place and I hope I expressed it all correctly because I’m full of rage", "tank_girl": "💕💕💕", "kcoultrip": "After just having a procedure done about a month ago, it breaks my heart and terrifies me for every future girl out there who won’t have the choice. Who will be forced to be afraid and feel like outsiders IN THEIR OWN BODIES. I never thought I would become a one issue voter, but the horrifying direction this country is heading in, I may have recently become one. Us women have to fucking fight like hell until we’re heard and stop letting the government walk all over our bodies ❤️❤️", "ms.hearddddd": "Honestly, I’m in disbelief that in this day and age, women aren’t “allowed” to make choices about life altering decisions. Men are allowed to make this decision for us when there’s a 50/50 chance that the mother will raise the child alone. I understand that there are plenty of options to prevent the pregnancy (BC, contraceptives) and also options after you give birth (adoption, foster care) But shit happens. If someone has been raped, they don’t have the option to terminate the pregnancy?! I’m just not understanding and will never understand. This has just set women’s right back 50 years. 🤦🏾‍♀️", "literally_salt": "These new laws contribute to making it hard to be a woman. To know that every part of our physical, mental, emotional being is constantly being contested and determined by others is exhausting and each time these things happen it’s discouraging.", "summerrleanne": "I live in GA and the current bill just passed outrages me. I had a miscarriage 4 years ago and thought of someone interrogating me to see if I had a hand it, I just can’t imagine. I also had a D&C(considered an abortion) to safety remove the dead fetus from my body. I support all women’s rights. It’s your body and nobody should have a say in what we do with our body. I saw a post that said “If men could get pregnant, you could get an abortion at an ATM. “", "saintelliot_": "I was 18 and I have met people who didn’t know until the conversation came up and I either got a look that they may have offended me or I got the look of disgust. When I hear people refer to us as baby murders and some of these people don’t know I’ve had one I’ll feel like well tell me how you really feel. I hate having to argue women needing these rights with other women. That conversation always makes me feel sick because I can never understand defending rights for women with other women.", "amphetaminecommunist": "Thank you, Raquel. You make me feel safe. I appreciate and honour your labour. And for anyone who needs to hear this, you made the right decision.", "verasica": "I’m reading all these comments and it’s terrifying. Never had to get an abortion but I’ve popped plan b pills like skittles. I simply just wanna say thank you for being you, Raquel. I absolutely love you and what you’re doing for all of us.", "vivalacarla": "it’s scary. and i’m scared. i can’t stop thinking about who this is going to effect more. i feel helpless", "lifeaccordingtokeeks": "I’m hurt for so many people who live in these states(and counting). I am even MORE frustrated because since 2016 that Black women BEEN doing this work of doing the hard job when it comes to voting and encouraging folks to vote and it’s a double slap in the face. Maybe this is me and my privilege talking but I feel like, let this country burn to ashes. We can’t keep being mules to everyone and we keep getting the short end of the stick. I am not mad at any Black person(specifically femme or non men) who are ready to tackle this issue now but after years of this crap, I’m personally done. As I said the day after the election, this is the country we deserve. Bc we did our job. Let them try to clean it up. Thank you for your education, your transparency and your commitment to proper sexual education.", "curls_n_tumbao": "#ShoutYourAbortion 💕", "blvkqueen91": "I am honestly terrified and deeply hurt by the efforts of white cis men who believe they can interject with someone else's body. I have never felt so much hurt and fury towards a political issue. These recent anti abortion laws are designed for a clear purpose: to control women's bodies and maintain white supremacy. I've never had an abortion but to have the option taken away is just infuriating. Having access to abortion has always given me a peace of mind which is now starting to slip away. I feel like we live in a third world country where religion doctrine is law. Hopelessness is how I've been feeling all day today.", "aliciaaatejada": "I feel sad. I don’t know how to deal with my pro life brother even after I and so many people tried to point out reasons why womxn have abortions and yet he still says that “we shouldn’t open our legs then”. I feel helpless to think that one day he may have a daughter and she’ll have to hear this from her own father. I can’t wrap my head around the fact that he would only support me having an abortion if i get raped and yet doesn’t know that I’ve been sexually assaulted before. I don’t know how to cope with this especially coming from someone i thought i could trust...", "ninakayy1": "I feel bad because I don’t feel bad. If that makes sense. I literally don’t have any sort of mental issues from my abortion and barely ever think about it.", "ojasminea": "I have a daughter and I’m so scared for her future. This is heartbreaking. And it’s almost as if there’s nothing you can do about it. You’re amazing for sharing this and opening the platform for discussion and offering a safe space.", "tessaxellex": "I’m SO glad your mom was there for you when you needed her most. I wish my mother didn’t make me feel so damn bad for wanting to get an abortion. I know my life would be SO different if I didn’t have my son.", "xonayimaxo": "I love you ❤️", "spinningincirclesschh": "Thank you for your words ❤️", "caminosdelavida_": "We need to normalize talking about abortion. It’s not a shameful action and women do it for a variety of reasons. All which are legitimate. I’m not ashamed that I’ve had 2 abortions because it was an event that made me become more responsible with my body.", "rae_osunshine": "Appreciate you and this space 🙏🏼🙏🏼🙏🏼", "starshond": "@raquelsavage This hit home...I remember being 15 years of age and my mother telling me if I had a baby I would miss out. My supposedly high school sweetheart was more concerned about getting a car and felt it was the best thing to do. While not wanting to do abort , I did what everyone else wanted. The residue of that decision left me depressed and suicidal. I became bitter at my mother and couldn't forgive myself. As time passed, I had to let go, forgive myself and walk in my own truth. Thank you for sharing this.", "naomi.im.brilliant": "I love the build up and revelation in this story. Even though I've never been pregnant, I myself have judge others on the decisions they have chosen to make with their bodies and I realize it was out of my own shame and fear that I projected onto them. I at times turned my back on ppl who may have needed me most. Thank God for growth. Thank you for sharing and for your story inspiring and supporting others. I really feel blessed to have met you and to follow you. 🙏🏽", "summer.maurie": "The very 3rd time I had sex (I was 16) I got pregnant. I knew I couldn’t go to my family about it. I had no money, I was in between houses, he had no money. For weeks I kept taking test and hoping for a solution. Then one day a huge blood mass came out of me. I had miscarried. And although it’s not the same as an abortion- I understand the need for them. My family still doesn’t know (I’m 20).", "thecradleofn1n": "I’m not in a place where I can share my story emotionally, but I’m sitting here crying right now because I just can’t...I hate this country so much sometimes because they make it so hard to be me, when it doesn’t have to be.", "bellacorea": "This is so frightening. The fact that they are also trying to criminalize birth control as well is so scary for me, I’ve been taking birth control since I was 16 to manage my pcos symptoms. Knowing that they’re trying to take that away from vagina owners is beyond frightening. How the hell are we supposed to protect ourselves, and manage our conditions this fucking sucks.", "echoingemotions": "Thank you, your coming forward on this brought tears to my eyes. It's truly a terrifying time right now. I'm not from the US, I'm Brazilian. And seeing how backwards the US is going, only makes me more afraid here, because the (very white, retired-at-33 64 year old) president shows more loyalty to the US (even though Trump doesn't give a shit because we're Latin America, he wants us to rot in hell). I want to show support, but I'm frozen in horror right now.", "nitaondavine": "Thank you. Love your posts.", "destinispaeth": "People with reach and influence, like you, sharing their abortion stories is one way to normalize this conversation and topic. I’m a red state, abortion fund board member and every day I feel like we take an elbow to the gut. Bills are passed and it can get defeating. I have to remind myself to recoup and recover before diving back into the discourse. Everyone’s abortion stories are different but everyone’s reasons for having one are valid. #shoutyourabortion #youknowme", "angela_ate_your_hotdog": "I live in Ohio right now. So many of my friends have gotten abortions and it really truly was the right choice. They were not mentally, physically or emotionally ready for a child. And even if they were but just didn’t want to be a mother, they should be able to access abortion! I’m so tired of children being wielded as punishment for a woman’s actions. That alone shows this is not about caring for children because why would you wish that on a child? This is about controlling women’s sexuality, and bodies and if abortion is criminalized, our right to vote, too. Also, this just makes birth even more unsafe, when we already have a crazy maternal death rate.  It’s an incredible power to be able to create human life. I feel men (and women brainwashed by the patriarchy) will stop at nothing to take it from us and use it against us. I’m scared for women’s safety and well-being and most of all, I’m pissed the fuck off.", "_annyma": "I send love and support to everybody who has had an abortion and absolutely support the right to have one safely. our bodies belong to us 💕", "mackiesaunders": "What breaks my heart is knowing that there are going to be so many innocent lives born that are going to grow up within this trauma. So many that babies will be forced live a life feeling unloved and resented and feeling like they are the ones who were at fault. We’re forced to watch more and more generational trauma develop because a few stupid men think they know more than us and it’s devastating.", "hoelivia_newtonjohn": "I had two abortions and I sometimes feel sad but I am also very happy I was able to make the choice and had the resources to do so. I’m so scared and terrified for those who may not/have not . Womxn who choose already face so much disrespect and stigma (esp. black womxn) I’m just so anxious and angry that this is happening. Everyone who tried to convince me to give birth the 2 times I was pregnant were ppl I loved trusted no one truly understood or respected my decision. Womxn who choose are not baby killers. We aren’t whores (in the negative context). We aren’t criminals. We aren’t irresponsible. WE ARE STRONG SMART AND DECISIVE AND RESPONSIBLE AND WE LOVE OURSELVES. Amen.", "sunnispeaks": "This is beautiful and perfect thank u", "bde.veaux": "It’s honestly just another shot in my back. I’m already Black in Amerika, on top of that I’m a female who loves women; taking abortions away is just another thing to oppress us and silence us as people and human beings. I’m lucky that I got birth control, but for the 11 year old rape victim dealing with a pregnancy, I can’t fathom what her and her family are goin through. It just further creates hostility and hatred in our country, which in turn promotes division and anger 🤦🏾‍♀️ this is the last straw for me, I don’t know how to BE in this country anymore.", "lorena_thrive4": "I feel desensitized but mostly hopeless and scared for the future.", "kfriasrn": "Thank you for sharing. We need more voices and more open hearts for those who don’t have it in them to speak on it! 💕", "aiisatat": "I feel helpless. Everything feels hopeless. I mean...what can we do realistically? Nothing it seems. I'm tired of living in a world that hates me for simply existing.", "chefbuttercup__": "I'm honestly frustrated! Annoyed with the constant policing of my body! And anyone else who owns a vagina. I've been raped. Just recently I had two partners who 'threatened to impregnate me and the other stealthed. Like I dont want kids. If an accident happened I want to be able to get an abortion. Especially since that could've been me in the last six months. And I live in a state trying to push a ban. It makes me not want to have sex tbh and I thoroughly enjoy it lol. Like. Why do I have to be denied because someone's belief? If I get pregnant I'm fucked and all the pressure is on me and not the cishet men.", "sav.holder": "I’m honestly so scared right now. I didn’t find out until I was 8 weeks along, and I’m getting the procedure next week. Luckily I live in Alaska where it’s legal... but not everyone will be so lucky. I haven’t openly talked about it yet bc I’m scared but I want to talk about it because this is so important!! 😭 thank you for having this platform for me to at least get this off my chest 💕", "liagutierrrez": "Thank you for sharing your story and holding this space. I always think about how the only thing traumatizing about my abortion was the misogyny and abuse that I received from my primary care provider and partner.", "princesscake420": "I fear for so many people's lives. It is terrifying to have less and less control over our bodies.", "cocoa21__": "Thank you so much for this post.", "adrenefw": "I love how honest, open and authentic your posts are 💛 thank you for making a space like this available to those who need it ❣️", "evaarreguin": "You’re the best ❤️", "jessamc_": "2 fast easy procedures both while my hand was held by a loving @plannedparenthood worker 💜Several years apart and for different reasons, mostly just needed them and had them done. I feel lucky to have had the support and access, didn’t have to travel far, didn’t pay a dime for them (thank you CA). In being transparent with my close family members/friends they shared with me there stories, one hovered near death having to have one illegally and unable to go to the hospital after complications. 1 in 4 women, we all know someone. I’m not hiding it anymore 🗣", "thenoelove": "Thank you for giving a space for those of us to speak about this. Thank you. Thank you for sharing.", "hannah.corinne": "Last year I had an ectopic pregnancy that ended in an emergency tubectomy. I was 5 weeks pregnant and I had no idea. I had an IUD and everything. In my case I didn’t have the choice but to end the pregnancy or I would have bled to death and it baffles me that women in my situation could be punished for that, as though it’s not already hard enough to go through. And outside of medically necessary terminations of pregnancy it breaks my fucking heart that this choice is being stripped from the owners of the bodies who’s choice it should be to make. It’s absurd and frightening. I’m heartbroken.", "bornrxbel": "I am outraged that abortion is becoming illegal. This should be a crime in itself. As a Black woman....life just gets harder & harder.", "blissfulxbohemian": "I’m so happy there’s someone like you to open up the conversation like this on your platform❤️😌", "nailsandnetflix": "I’m so goddamn fucking scared. I’ve never wanted children and love so many aspects of my life, the thought of becoming pregnant without the option to terminate makes me suicidal sometimes. I’d rather be dead then forced to incubate and deliver a kid #safespacewithraquel", "_sour_patchkid": "💙", "sosa.813": "Absolutely terrified. Although I’ve never had an abortion, I’ve been raped and I’ve been in foster care. A lot of people are only OK with abortion in cases of rape (when the rapist is found guilty) and that makes my blood boil. I’m pressing charges against my rapist and it has been over 9 months and trial still hasn’t started- even though he got caught in the act and all the evidence is there. If my case- where there is all types of evidence ready to convict him- has taken over 9 months, how can they expect a someone to have an abortion AFTER their rapist is found guilty? If I would have gotten pregnant, I’d already be holding a baby in my arms long before I would have been approved for a legal abortion. Also, while I was in foster care, can you believe I didn’t meet ONE single child who was adopted? I lived with 20 at first, met another like 30, and lived with another 6 in a group home and NONE of those children were ever adopted. Our conditions were not the best, I had to take the city bus for almost 6 hours every day to get to school and back because there was no one to drive me and I couldn’t switch to a school closer to me. I wore the same clothes and underwear for 2 weeks straight before anyone noticed. I was alone, frustrated, unwanted, and stuck in the foster care system. Is this what people who don’t want abortions want for their kid?", "mariellevz_95": "It’s enraging to see this unfold. I also haven’t commented a lot about it bc at first it’s like no this is insane, we’re in fucking 2019 and we’re getting the right to choose taken away from? It’s also the mentality of “it’s not happening in my state,” but what if it could? What if it did? I have never been put in the position where I’ve had to go through with an abortion, but I do take birth control, i have taken the day after pill a couple of times, and they’re also trynna criminalize those alternatives? I am MAD, but at the same time idk what to do. It’s a lot of different emotions. Especially because MEN who don’t know shit about what being a women in this society means are the ones deciding. Fucking ludicrous... fuck everyone who had something to do with criminalizing abortion. I wish your mom had aborted you. End of vent. Thanks for coming to my ted talk.", "iramseven": "It scares me how much these men want to be in control of making sure we deal with their made up consequences. I feel like they just want to put a fucking halt to any kind of progression. No one can convince me this is out of anything but hating ppl with vaginas.", "__brightside": "@raquelsavage thank you for creating a safe space to discuss something real ❤️", "anxiousbutpretty": "even though i haven't ever had an abortion its so terrifying to know that if something goes wrong when im sexually active there might not be a way out. it would be even harder considering the lack of support i would have from family. im in a position where i want to explore sexually but im so afraid of pregnancy and know i never want children"}