{"slowjamkings": "So fine & extremely yummy 😋", "southern_gentleman225": "💛👑", "krys.kilz": "thank you for posting this. it is exactly what i needed to hear today and i am grateful you’re speaking up about something so many conversations leave out. i feel seen and i thank you for that 💛", "victor8524": "🤤😛💦🇵🇷", "norfcyde": "❤️❤️", "__kirstycameron": "@siobhanwatt exactly what we were talking about, just put more eloquently.", "seanmull66": "Naturally beautiful, the way a woman should be 😍", "grimeminister": "😘😘😘😘", "awaking_nation": "@brenda0012_", "laudsama": "👏🏿👏🏿👏🏿👏🏿 well said", "rodrigo.barboza.564": "Maravilhosa", "kle.ferdinandk": "😍🍑", "jonnyhernen": "😱😱😙👌👍🍔😙👌👍", "rocket.man713": "Lil bae bae ✌🏿", "brooklynbornandraised69": "Damn you are Sexy as fuck 😍😍😍😍😍.", "ralphportwood": "Thick-n-juicy !!!💦💦💦💦💦💦💦", "arnoldson_potomac": "Come back to LA!", "mccaster2099": "@raquelsavage ❤️❤️❤️❤️❤️🙏🙏🙏🙏🙏", "bootyqueens.bq5": "😍😍😍😍😍😍😍😍😍 @lusting_for_beauty_4", "ryanrudd30": "Gorgeous 😘😘😘😘😘😘", "abo_talb2014": "😘😘💛👅👅👅💛😘😘", "btravis71": "Naturally gorgeous and sexy 🔥🔥💯👌🏾😋😋😍", "dwaynep.carter": "🤓👌🏾💛", "socialcfx1": "I like yellow", "tutumarion": "I just am so grateful for you.💙", "mercury.j971": "😍😍❤❤👅👅🍑🍑🔥🔥", "imhungryy_": "Hey love! Can you also do a lil segment on 🐱 lightening, shaving/wax tips? Basically keeping a pretty kitty 🐱? @raquelsavage idk if you’ve done one before, I’m new 🙈", "edgy.vegan.mom": "Wow... I love this. I was JUST talking about this a few days ago. Like saying \"no\" but not in an aggressive manner and when they dont stop, you just go with it. I had a few people tell me that was not \"rape\" because the woman didn't fight. Really? The word \"no\" really isnt enough? We REALLY HAVE to get physical? We really have to fight for our lives to be taken seriously? Really? Then what? Get beaten the shit out of and get raped anyaway? God I'm glad I found your page.", "thelizlee": "Your caption is fire like always", "bakerlarry81": "😍😍", "chelstarc": "Damn! I am struggling so hard with some real dirt bag in the scene. He’s harmed myself and several friends. And now has the audacity to walk around accusing everyone of retracting consent and essentially saying that he’s not to blame since things were agreed to and later we decided that we were indeed not okay with what happened. The asshat has zero understanding of his harm he caused and is taking no accountability. Anyway, I just appreciate you so so much. The wisdom you share makes me feel so not alone and genuinely loved. You are such an important voice. Imma go over to your patreon today and get my learnin on 💜💜💜", "base.the.pharaoh": "@iiinky420 😍😍", "frank_brown85": "🔥🔥🔥🔥", "djjeff_forty7": "Awesome", "sol_7mag": "Beautiful ebony ❤️❤️❤️❤️❤️❤️🔥🔥", "missmindyloo": "Omgomgomgomgomg we're breathing the same smoggy LA air! Welcome to Los Angeles 😍", "wellworx80": "and welcome to The West. How u like it out here?", "jensenthaman": "Just gorgeous 😍😍😍😍", "ajajohnsonart": "YAS, thank you for talking about this 👏👏", "jevonneri": "😘😘😘", "agemofrancis": "👍💪", "p_fine_": "u looking good in that 💛⚡🙂", "d.anthony1": "Sexy!", "larossell": "💜💜💜", "guigoteeshirts": "😱😱😱😱😍😍😍😍", "natajack": "So sad, that it’s so true and relatable for so many womxn. 😞", "boardgamingblues": "Ah, you're in LA! Welcome! hope you managed to avoid the heat!", "bigga_dondada": "😍💯💪🏾 Definitely an eye opener. But my question is when is the right time so u don’t come off as bein aggressive? I think guys also are stuck n that place where if they don’t make a move on a woman she may think he’s a “nice guy” n get friend zoned I can’t speak for all men of course but I think some women like it when A man knows what he wants n let’s it be known with out cummin off as thirsty. I’d love your insight cuz is on point. I just think there’s no one sure fire book written on these interactions. I find myself playin it by ear 💯", "xxeternalsunshinexx": "I think about this often. Always wondering if my anger is valid. Still find myself making excuses for him.", "_quitefeline": "😢😢", "fernandojosejimenezmartinez": "K rico panochon🤗🤗", "kevinwillianson": "❤️🔥", "andersonmiller68": "What a juicy. Pictorial loves", "pepperwitakickmotley": "So true", "lillyldiamond": "Thank goodness we have women like you to articulate this. It is something I still struggle with regarding forgiveness and healing.", "kinkyroots": "Wow this hit home 💕", "newamericantony_official": "💪", "a.d.7___": "Damn!", "arifit_ari": "SO FUCKING TRUE. SO WELL SAID. I HONOR YOU", "herbnhood": "💓Thank you for speaking on this 💓 I don't know a femme who hasn't felt this", "recklessblackgirl": "My life story most of my sexual experiences were me giving in because I didn’t wanna ruin the moment of make them angry I recently just learned how to say no and stop glad I overcame that fear", "brocklightnin": "I zoomed in", "mr.ayodelie32": "DAYUM🔥🔥🔥", "cp76pimpin": "👍👅👍", "loversstores": "🤩💛Love this picture. and love your thoughts and message. Thank you for sharing your voice.", "igog_1": "Welcome to LA!!!", "lay.bizzle": "‼️‼️‼️"}