{"zoejan16": "Your butt op was done well😍", "theemmajean": "The Baltimore riots of 2015 for me. Prior to that, I was ultra centrist. The riots woke me up. I realized people don't behave that way for no reason. People riot when something is seriously fucking wrong and no one is listening. So I started listening, and that's changed everything.", "taytatyy": "Unblock me on twitter 😂", "igog_1": "I really wouldn’t call it defining, as I believe I am ever-changing, but this was the point where I said that enough was enough, it’s time to speak up; something similar to your experience. I was hospitalized two years ago, as soon as the Weinstein brothers were getting their ass handed from the “Me Too Movement.” Like you, I was watching TV in bed rest, and I felt helpless. I, too, am a victim of assault, that watching those White women say that those men were really trash gave me the comfort to come forth with my experiences and further strengthening my space to be a safe space for others, before it was a passive place where I’d just keep peoples’ secrets and nothing more, where as I now, ask them what they need, and provide them funding if I can.", "crazy.coco.mama": "I think I am in it right now? I am leaving my husband. And I haven’t been this happy in a long time. I feel like I can breathe.", "cutlikedat2020": "Why aren't u a xxx star yet", "kennphilrose": "Nails!!! 💕", "msmurphyslaw": "I’ll never forget my first few sociology classes, and every one since when myself of someone else process that “the system isn’t broken...” it’s functioning exactly as designed, and that you need to decide to see past the “Noble Lie” of not only capitalism, but the systematic stratification that is built into every fiber of our society", "noritabergita": "Reading certain books really did something to me and I'm so grateful for it 🙏🏾➡️ a language older than words - Derrick Jensen, black against empire - Joshua bloom, pilgrimages/peregrinajes: theorizing coalition against multiple oppressions - lugones, modernity disavowed - Sibylle Fischer 🙃🙃🙃 shout out to radical history and philosophy professors who denounce objectivity 😩 changing my understanding and view of oppressive forces changed everything 🤷🏾‍♀️ down to my thought processes in any and every situation I come across. That was 2-3 yrs ago, it was and still is a process, more than worth it. Also when I decided to focus on creating healthy, productive habits, also still a process 😂 a HABIT of mindfulness in every action!!! Game changer. Reeeaaal calming. Meditative. Forming the habit of making to-do lists as well 👌🏾 habits, habits, habits 👏🏾", "tuturamlady": "When i realized all of my boundaries were torn to shreds.", "dcccxix": "The 2016 election was a defining moment for me. I decided to make sure that I was more politically active within my community and state. I realized if I wanted to make change I had to make change in my community", "sports_junkie_1": "Watching trayvon's trial. I truly was never the same aftet that. I grew up in a diverse place but tugs case opened my eyes up to America", "chantalifornia": "I think I’m currently in mine. Just graduated university and have no clue where to even begin. Just auditioning for anything I can get my hands on. It’s odd when people ask what my next step is bc for the first time, I don’t have an answer.", "sexuallyempowered.mama": "Watching the women's March in 2017 over the news and feeling the internal shift to start living with truth. I felt feminine vibrations worldwide, I couldn't be a bystander anymore.", "fee_licious": "The execution of Troy Davis. I sat up all night crying and praying that it would be stayed. That was the first, real, gut punching, heart wrenching moment that I realized that the government doesn't give a shit about black men", "billie_the_qis": "Yes, ma'am! I'm in the middle of a reckoning right now; I'll let you know ASAP. Lol.", "kilouttabroward": "Cuteeeeeeee", "jeremiah.english": "👅💦", "dreamstrapwatchesandapparel": "You are beeaauutiiful 💯", "btravis71": "🔥🔥👌🏾", "yungrosequartz": "Trayvon Martin was my defining moment. Not only did the way in which he was vilified and demonized awaken my eyes but also the manner in which, George Zimmerman was catered to due to his approximation to whiteness.", "quell87": "😍👑Goddess", "theluxegf": "Interesting turn and perspective here. I think for me it was Trayvon (first) because it hit so close to home. Then, Sandra Bland. I was pulled over on the anniversary of her death 2016 in the same county Trayvon was murdered in. It had to be one of the most introspective moments for me in realizing what kind of world we live in. That opened me up spiritually and since then I look at things so differently. On another note, I may be taking a similar journey to Miami like you pretty soon lol my glow up IS my self care.", "whitestoneyogastore": "DM us! We would love to get you a Yoga Bracelet and collaborate", "embrek": "Trayvon martin did for me", "se7enthepoet": "Simply Beautiful Al Green google it", "raquelsavage": "Lmao these answers don’t have to be about Black people being killed skjijKkKaiakka 😭", "maybeitsyaya": "When Solange, Rihanna and Bey dropped ASAT, Anti and Lemonade in the same year 😭. Those three albums got me through some THANGS, whew.", "lalimarie340": "I moved back to the Caribbean in December last year on the brink of a nervous breakdown. I was hospitalized in March of this year with suicidal intentions and learned just how bad mental health patients are treated in the Caribbean healthcare system. While I was under heavy supervision another darker skinned woman was under security. She couldn't even go to the bathroom without a security guard. The guards obviously triggered her and she would get louder and act out more. From then I started asking if she needed to go the restroom or showers when I went and I would wait for food until she got fed. From then I decided my life work would be advocating for better mental health care and hopefully become a practitioner myself one day. I go back for my masters soon", "catreesss": "Most recent traumatic experience was markedly different - on my birthday celebrations recently I put myself in a very vulnerable position (everything was fine) but I ended up getting myself physically hurt and I realised then how much I was hurting myself, physically and emotionally, by not putting myself first. I wasn’t respecting how much care I require and how much I deserve and as a result I was fucking myself over. I decided never again and I’m officially back in therapy :)", "mayaalexandra08": "I am in my most defining moment right now. The Wednesday before my first day of law school I decided to leave a toxic relationship that I had convince myself I needed. Took 4 garbage bags of clothes and have not turned back. My whole first summer class I have experienced homelessness but on the 5th I get my home. So I would say the day I left my was my defining moment stating I need more and I need my happiness first", "t.h.o.t.crimes": "Honestly twitter 2014 helped me define my ideologies, and I was able to develop more questions and concerns about my activism and ideals.", "reddoublecup": "Def when my parents divorced my senior year of high school, I rebelled against all the Christian things I had been taught and I opened myself up to reality lol", "julieeemichelle": "I think a defining moment for me was the summer of 2016, I had become very ill and ended up in the hospital. Everything that could possibly go wrong with my body was happening all at the same time! It felt very scary. I had made some poor decisions that led up to that moment and ultimately had myself at fault for not being in charge of my health. I was being reckless. It was during that stay in the hospital where I realized something had to give. Was I going to let my trauma and self destructive habits eat me whole? I decided then to take control of my health. The fall of that year was full of doctors appointments and a lot of stress but it was also the first time everything fell into place. My job performance was amazing. My school work was good. In the time since then I’ve graduated community college, got a better paying job, and I’m on the road to finally finishing my bachelors. It isn’t easy. But right now I have a clear vision of who I want to be and I have an amazing therapist who is guiding me on this journey. Ultimately I want to be an educator but in order to guide and heal our youth, I must heal myself.", "prishpresh": "when I saw black women my size killing the game and not giving af. looking good, feeling good, and loving it. Queen Latifah (once I was old enough to watch and listen to her stuff lol) was literally such a fucking icon to me, and made me realize that I too can be everything and more, and that my size was only a defining factor for ME. Once I started behaving like I was THAT BITCH, everyone treated me accordingly, jiggles and all lmao", "cayliesi": "Trayvon Martin was my defining moment of introspection into my whiteness and how I navigate the world. Trayvon Martin changed my life.", "apex_of_your_world": "Hearing Eric Gardner scream I can’t breath while he was being murdered in broad daylight surrounded by people who refused to help him . That changed me. Made me pay attention. Made me realize what cops really are.", "manifest_isaiah": "Multiple traumatic experiences of physical and psychological abuse with police including my friend being tracked by feds and kidnapped by ICE on the very day that their DACA expired. They were then incarcerated for a month, interrogated by the FBI and deported and I haven’t seen them since. August 3, 2018. Going to show just how far the reach of the empire is and just how ruthless and merciless they are. They’re name is Sergio Salazar and The Intercept has a story written on them."}