{"lav.j": "Wait I love this", "the_muscle_whisperermia": "Kitty toe beans are the best! 😍", "badmommi": "Thank you so much for this!!!❤️", "rachelhitchens": "I love kitty breath too 😩", "goodmorningmorgen": "Kitty toe beans. 😍😭😆 so cute so funny", "ophilia.xo": "“Kitty toe beans” lmaooo you’re adorable", "geminhiiigh": "you’re amazing 🥺 thank you so much for this!", "dravendarkwyr": "Clair de Lune is always a fav", "dyedandwenttohelen": "ugh beat me to it !! you down the street thoo", "rachel_higs": "Wow, my two go-to things for comforting myself are remembering how water feels gliding across my scalp & through my hair when I swim and playing the Clair de Lune in my head! 💖", "kati11_": "kitty toe beans😭😭😭😭", "elizabeth.nlopez": "smell! the smell of my diffuser and lavender oil while i stretch in the morning. ahhhh!", "jewelbeastie": "I love lighting a good clean smelling candle. Lavendar is my go to scent. I love holding my rose quartz crystal. It makes me smile. I light candles when I shower to show myself that I am worthy of nice smells and a nice relaxing atmosphere. Thanks for this post!", "stephcheycooke": "Very cool. I must use in sessions with anxious clients!", "__simplysydney": "I'm so glad I found this! 😭 I'm teaching at a summer camp and all of the staff have to create a creative class for the week. I'm doing self-care, and I think this will be an excellent activity for the smaller babies. Thank you! ♥️", "cotton.ball.x": "Kitty toe beans", "ssaerbearr": "lmaooooo you traced your stiletto GAWK GAWK nails 😩😩", "bigronjunior": "Will try this on stressful days. Hope my 🦃 hand has improved", "mercury.j971": "🔥🔥", "dream_koalie": "Clair de Lune, Hennessy and kitty eerthang #queenaftermyownheart #neededtoseethisposttoday 🙌🏾", "alifecycle": "Clair de Lune is the shit. Calgoon, take me away. 😜😍", "__goodjuju_": "Hey I got blocked on twitter and I’m not sure why. I literally subscribe to your patreon and support your work", "lacabronabella": "Kitty toe beans 😂😂😂", "steno69": "Beautiful😍"}